{
    "article_0": {
        "title": "Results: 60% want Apple to thicken the next iPhone to improve battery life.What do you think?",
        "body": "A recent poll of over 3,100 9to5Mac readers indicates that most are not satisfied with current-generation iPhone battery life. Over 90% of respondents said that they want to see Apple improve iPhone battery life, versus less than 7% saying that “iPhone battery life and battery cases are good enough as-is.”\nThe split in responses interestingly suggests that Apple can safely stop prioritizing thinness over superior battery performance. A solid majority of over 60% of respondents said that Apple should thicken the next iPhone to improve its battery life, which is especially noteworthy given that there were other poll options. Over 31% said that Apple should achieve whatever battery improvements it can by improving the iPhone’s chips, while just under 2% said that Apple should instead focus on improving battery cases.\nWhile not scientific, our poll results corroborate the views of The Wall Street Journal’s Christopher Mims, whose article Our One Wish: Longer Battery Life suggested that making iPhones “thinner and lighter is a trend that has outlived its usefulness,” since further reductions are becoming counterproductive to the functionality users need.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.14424967346712947
    },
    "article_1": {
        "title": "Apple’s iOS 9 to have ‘huge’ stability and optimization focus after years of feature additions",
        "body": "Following the success of OS X Snow Leopard for Macs in 2009, one of iOS 9’s standout ‘features’ will be a directed focus on stabilizing and optimizing the operating system. While stability is normally an expected component in Apple software rather than a marquee feature, the rapid pace of iOS releases and feature introductions has taken a toll on the operating system’s overall performance, recently leading to numerous complaints from long-time Apple users and regular customers alike…\nApple has delivered a major new release of the iPhone, iPad, and iPod touch operating system each year since 2007, generally marketing major iOS changes as a reason to buy new devices. In 2013, Apple completely overhauled the iOS user interface at the same time as it added new features such as Touch ID and Control Center. iOS 8 in 2014 refined the UI design, added Health and Apple Pay, while laying the groundwork for the Apple Watch.\nFor 2015, iOS 9, which is codenamed Monarch, is going to include a collection of under-the-hood improvements. Sources tell us that iOS 9 engineers are putting a “huge” focus on fixing bugs, maintaining stability, and boosting performance for the new operating system, rather than solely focusing on delivering major new feature additions. Apple will also continue to make efforts to keep the size of the OS and updates manageable, especially for the many millions of iOS device owners with 16GB devices.\nIt’s unclear whether this might be accomplished by limiting iOS 9 support to relatively recent devices. If the iPhone 5c, original iPad mini, and fifth-generation iPod touch are discontinued by the end of 2015, all of Apple’s “currently available” iOS devices would be using 64-bit A7, A8, and A9 processors. This could simplify iOS development for both Apple and third-party app developers.\nLike Snow Leopard, iOS 9 will be pitched with stability as a tentpole component, but under-the-hood enhancements will not be the only feature. Over the past few years, Apple has been working on several new iOS features, such as Transit and Indoor mapping modes, so we are still expecting exciting additions to be showcased on the WWDC 2015 stage as well.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.43335832143202424
    },
    "article_2": {
        "title": "Apple is finally killing iPhoto - and this is the replacement",
        "body": "Photos for OS X, the modern photo library that Apple built from the ground up for Mac computers, is making its debut. A developer seed version of Photos is being distributed to developers today, the company said. It will be followed by a public Photos beta, with the final Photos product delivered to Mac users as part of a free software update this spring. (Check out our complete hands-on report here.)\nApple announced last year that it would end development on its consumer photo library, iPhoto, and its professional photo editing suite, Aperture. In their place, the company said it would develop an all new product, tied closely to the cloud. The resulting product will likely feel like an improvement for most iPhoto users, though users of Aperture’s more powerful editing and organizational features are likely to find it wanting.\nAn improvement for most iPhoto users\nWhat can you expect from Photos? A clean, reasonably intuitive library for your pictures combined with simple cloud backup solution and useful editing tools. The app has the same flat look of the Photos app from iOS and should be easy to navigate for anyone who has spent time with an iPhone. Migrating your photo libraries to the new app is as simple as opening Photos; you can keep both iPhoto and Aperture on your system if you like.\nThe app has four main tabs. Photos contains all of your pictures in chronological order. Shared contains pictures from your shared photo streams, along with an activity feed for likes and comments in those streams. Albums contains albums that you’ve created yourself. And aside from storing slideshows, Projects is essentially a storefront for Apple’s printed photo products: cards, books, calendars, and so on. (You can now print your panoramic photos there, too.)\nPhotos for OS X uses some other neat organizational tricks. The Albums view automatically highlights photos from your last import and your favorites, along with buckets for different kinds of images: panoramas, slo-mo videos, and time lapses, for example. On the whole it’s a much easier system to navigate. And since the software is completely brand new, it’s super fast, even with a large library of photos — at least, it was on the new MacBook Pro we tested it on.\nPhotos is tied closely to iCloud Photo Library, Apple’s photo backup product, which is also in beta. iCloud Photo Library stores your first 5GB of pictures for free; after that, you’ll need to pay. Prices start at $0.99 a month for 20GB of storage and go up to $19.99 a month for 1TB. My Photo Stream, Apple’s sometimes-confusing free service for storing and synchronizing your last 1,000 photos, will continue to exist independently of Photos. (Check out our big explainer on Apple's new photo software and services here.\nPhotos are still siloed\nFor all it does right, it’s worth noting that Apple’s photo products are still siloed off from the rest of the world. You might have photos of yourself on Facebook that you’ve never bothered to download, or some old collections on Flickr, or some cherished memories on Instagram. Unlike some third-party solutions, including the recently acquired Picturelife, Photos won’t go out and grab those pictures for you.\nFor the photos it does manage, though, the app offers powerful synchronization between devices. Take a photo on an iCloud-connected iPhone, and it pops up on Photos less than 30 seconds later. Edits you make on your Mac synchronize all but instantly on your phone. If you revert your changes, they’ll revert back on your phone, too. And there’s a nice search feature, too: you can look for photos by file name, when you took it, where you took it, or which people are in it.",
        "sentiment": 0.11246238802285756
    },
    "article_3": {
        "title": "Tim Cook: Apple to build $850 million solar farm",
        "body": "Tim Cook's big day: Apple hits $700 billion\nShow Caption Hide Caption Apple's Tim Cook is first CEO of a $700B company Apple CEO Tim Cook fielded questions from Goldman COO Gary Cohn as Apple market value reached a record $700 billion. The company will be investing $850 million in a new solar farm and doubling its Chinese Apple stores. Chris Kievman, Marco Della Cava for USA TODAY\nSAN FRANCISCO — By any measure, it was an epic day for Tim Cook.\nOn Tuesday he was sitting on stage being interviewed by Goldman Sachs President Gary Cohn when Apple became the first U.S. company to close at more than $700 billion in market value.\n\"You will always remember exactly where you were,\" Cohn said to Cook.\nThe milestone caught the attention of the financial world, some of whom had flocked to the Goldman Sachs Technology and Internet Conference in San Francisco to hear Cook speak on a wide range of subjects, from the growth possibilities in China to the upcoming Apple Watch.\nEars perked up when Cook said Apple (TICKER: AAPL) would announce distribution plans on its quarterly earnings call in April. Apple has been pressured by activist Carl Icahn to return more of its nearly $180 billion cash-and-investments stockpile to shareholders.\nBut Cook also made headlines with what he called Apple's \"biggest and boldest project ever.\"\nApple has formed a partnership with First Solar (TICKER: FSLR) to build an $848 million, 1,300-acre solar farm in Monterey County, Calif., to power its headquarters, data center in Newark, Calif., all Apple offices and 52 Apple stores in California.\nThe solar farm will result in significant energy cost savings for Apple, Cook said.\n\"We know at Apple that climate change is real. Our view is that the time for talk is past, and the time for action is now,\" Cook said.\nThe solar project is part of the California Flats project on Hearst's 73,000-acre Jack Ranch in Monterey County and may be one of the largest ever built for a commercial user. It will add 130 megawatts of new solar power to California, enough to power about 50,000 California homes.\nThe move comes as Cook more firmly than ever puts his imprint on the company famous for being founded and run by the late Steve Jobs.\nThe socially conscious Cook has set himself apart from Jobs by focusing on making smart business decisions that are also good for the environment and for the advancement of society.\nWhile on stage, Cook noted the lack of women in the audience at the financial conference.\n\"I see too many men in this audience,\" Cook said. \"There needs to be a lot more women and diversity.\"\nBut Cook also paid homage to the thinking of Jobs, who pushed Apple to make only the best products.\n\"We're not focused on the numbers. We're focused on the things that produce the numbers,\" Cook said.\nThat includes the Apple Watch, which Cook said he wears every day and showed off on stage. Cook predicted people will be surprised by \"the breadth of what it can do.\"\nThe numbers outshone the products on Tuesday as Apple stock rose, closing up 1.9% to $122.02.\nApple is coming off a record-breaking last quarter, fueled by stunning demand for the first larger-display iPhones.\nEven as Apple's success thrusts Cook into an even brighter spotlight, the question remains: Can Apple keep up the growth?\nCook said yes.\n\"We don't believe in laws like the law of large numbers,\" Cook said. \"Steve ingrained in us that putting limits on your thinking is never good.\"",
        "sentiment": 0.2937348547645591
    },
    "article_4": {
        "title": "App Store doubles max app size to a whopping 4GB",
        "body": "Since the App Store’s debut in 2008, apps have never been able to be larger than 2GB. Today that changes.\nApple has notified third-party developers that they can now submit apps that are a max of 4GB in size. The change reflects the needs certain apps, namely games, have for larger file sizes as iOS becomes a more mature platform.\nDevelopers can now include “more media in your submission and provide a more complete, rich user experience,” according to Apple. The 100MB cellular download cap is still in place. But over WiFi, apps can now be delivered at double the size.\nDevice storage is still at a premium for most iPhone owners, but Apple has higher-tier 128GB models of both the iPad and iPhone now. And with the larger screen on the 6 Plus and the possibility of a 12-inch iPad Pro in the near future, it only makes sense for apps to keep getting bigger.\nSource: Apple",
        "sentiment": 0.2079472058556146
    },
    "article_5": {
        "title": "Apple spending $2 billion on two European data centers running on 100 percent renewable energy",
        "body": "Apple has announced plans worth €1.7 billion ($1.93 billion) to construct two new data centers in Europe. Each facility will be run using 100 percent renewable energy and will provide online services such as iTunes, iMessages, and Siri for Apple customers in Europe. The data centers are being built in Athenry in western Ireland and in Viborg in central Denmark, with both sites expected to be operational by 2017.\n\"this is Apple's biggest project in Europe to date.\"\n\"We are grateful for Apple’s continued success in Europe and proud that our investment supports communities across the continent,\" said Apple CEO Tim Cook. \"This significant new investment represents Apple’s biggest project in Europe to date. We’re thrilled to be expanding our operations, creating hundreds of local jobs and introducing some of our most advanced green building designs yet.\"\nBuilding data centers in Europe not only allows Apple to get rid of some of its foreign cash while creating local good will — it also put the company in a better position for defending users' data privacy. In the last couple of years there has been a surge in European data centers being built by US firms, with companies reacting to concerns that data stored on American soil will simply be hoovered by the NSA. Paul Nemitz, a director in the European Commission’s Justice Unit, described the uptick in new sites as \"proof\" that Europe was \"becoming a trust center for data.\"\nA rendering of the facility at Athenry. (Apple)\nEach new center will measure 166,000 square meters, with Apple promising to deliver benefits to the local community. The facility in Ireland will include outdoor education space and walking trails for local schools as well as schemes to replant native trees in the surrounding area. In Viborg meanwhile, excess heat produced by the servers will be used to warm local homes.\n\"We know at Apple that climate change is real.\"\nThe commitment to using renewable energy in both centers underscores Apple's green credentials. Earlier this month it announced it was investing $850 million in building a giant solar farm to power its new global headquarters, with Cook saying: \"We know at Apple that climate change is real. The time for talk has passed and the time for action is now.\"",
        "sentiment": 0.2860894248717361
    },
    "article_6": {
        "title": "Tim Cook: Apple Watch will be showerproof, Apple Pay goal for Europe is “end of the year”",
        "body": "French site iGen is reporting that Tim Cook told an employee in the Kurfürstendamm Apple Store in Berlin that he wears his Apple Watch all the time–”even in the shower.” While Apple has previously mentioned water-resistance, and stated that the S1 innards are “completely encapsulated in resin,” this is the first time we’ve had a specific indication on what that means in practice.\nIn line with expectations that the watch will only have one day of battery-life, Cook confirmed that he removes it every night to charge …\nLess happy news is that Apple doesn’t appear to be in a hurry to launch Apple Pay in Europe. Despite Visa stating that tokenization will be supported by April, and UK banks suggesting Apple Pay would reach the UK in the first half of the year, Cook said that the company’s goal is nothing more specific than “before the end of the year.” Apple is planning, however, to expand its mobile payments system into Canada as soon as March.\nThe Apple Watch of course isn’t the first shower-proof wearable …\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.01064978273851531
    },
    "article_7": {
        "title": "WSJ: Tim Cook approved Apple electric car project a year ago, hundreds of employees working on it",
        "body": "Following a report today that Apple was hiring experts from the automotive industry for a new research lab, The Wall Street Journal adds to the story claiming Apple has several hundred employees working on an Apple-branded electric car:\nApple has several hundred employees working secretly toward creating an Apple-branded electric vehicle, according to people familiar with the matter. They said the project, code-named “Titan,” has an initial design of a vehicle that resembles a minivan, one of these people said.\nThe report adds that CEO Tim Cook approved the project close to a year ago with product design Vice President Steve Zadesky, a former Ford executive, leading the group. The news lines up with rumors that Apple is working on something that will “give Tesla a run for its money.”\nMirroring other recent reports that Apple was poaching experts from the automotive industry, WSJ notes that Zadesky “was given permission to create a 1,000-person team and poach employees from different parts of the company.” Earlier today the Financial Times reported that Apple has hired president and CEO of Mercedes-Benz Research & Development Johann Jungwirth, along with other auto industry execs, to work at a new, secretive automotive research lab. Apple has also been locked in a poaching war with Tesla, attempting to lure away that company’s employees with big bonuses.\nAdding to that, the report from the WSJ says the location of the lab is just a few miles from Apple’s HQ in Cupertino and currently includes employees working on “robotics, metals and materials consistent with automobile manufacturing.”\nIn addition to the new hires and research lab, the report claims Apple has met with contract manufacturers that produce high-end vehicles. Several minivans leased to Apple with camera arrays and other equipment have also been spotted in some major cities over the past few months.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.12335078329003106
    },
    "article_8": {
        "title": "iPhone thefts are plummeting thanks to 'kill switches'",
        "body": "George Frey/Stringer/Getty Images\nSACRAMENTO, Calif. (Reuters) - Thefts involving smartphones have declined dramatically in three major cities since manufacturers began implementing \"kill switches\" that allow the phones to be turned off remotely if they are stolen, authorities said on Tuesday.\nThe number of stolen iPhones dropped by 40 percent in San Francisco and 25 percent in New York in the 12 months after Apple Inc added a kill switch to its devices in September 2013. In London, smartphone theft dropped by half, according to an announcement by officials in the three cities.\n\"We have made real progress in tackling the smartphone theft epidemic that was affecting many major cities just two years ago,\" said London Mayor Boris Johnson.\nJohnson, San Francisco District Attorney George Gascon and New York state Attorney General Eric Schneiderman were among numerous officials arguing for new laws mandating the kill switches.\nIn California, where a law mandating kill switches has yet to go into effect, smartphone theft is dropping because some manufacturers have already started installing the software-based switches on the devices they sell, Gascon said.\n“The wireless industry continues to roll out sophisticated new features, but preventing their own customers from being the target of a violent crime is the coolest technology they can bring to market,” Gascon said.\nCalifornia's law, one of the nation's strongest, received wide support from California prosecutors and law enforcement agencies that hoped it could help reduce smartphone thefts.\nAccording to the National Consumers League, handheld devices were stolen from 1.6 million Americans in 2012. In California, smartphone theft accounts for more than half of all crimes in San Francisco, Oakland and other cities.\nOther states experiencing a rash of smartphone thefts have considered similar measures, and Minnesota passed a theft-prevention law last year.\nSo far, Apple, Samsung and Google have implemented kill switches on their smartphones, and Microsoft is expected to release an operating system for its Windows phones that has one this year, the three officials said in their news release.\nBut some of the smartphone systems require consumers to opt in, meaning not all will be protected when their phones are operating in the default mode.\nGascon, Johnson and Schneiderman called on all manufacturers to make the technology active as a default position, as Apple has done with its iPhones.\n(Reporting by Sharon Bernstein; Editing by Peter Cooney)",
        "sentiment": -0.2799032544096311
    },
    "article_9": {
        "title": "Tim Cook says Apple Watch will replace electronic car keys, confirms Apple Store revamp",
        "body": "Cook shakes hands with employees at the Covent Garden Apple Store. | Via The Telegraph\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple is already attempting to eliminate the need for consumers to carry a wallet and may soon extend its assault to the second pat of the venerable three-pat technique, as Apple chief executive Tim Cook said this week that the company designed its forthcoming Apple Watch to replace electronic car keys and fobs.\nCook's automotive revelation came during an interview with the Telegraph in London, where the Apple chief stopped en route back to Cupertino. He had been in Germany and Israel, inaugurating the company's new research and development center in Herzliya.\nIt is unclear whether Apple intends to deploy technology that duplicates the functionality of current-generation keyless entry systems, or if it will seek to convince automakers to integrate Apple Watch compatibility in future vehicles. Some have speculated that the current spate of rumors surrounding the development of an Apple Car actually point to an expansion of CarPlay, with a new mandate to completely replace existing in-vehicle infotainment and telematics systems.\nIn addition, Apple will \"tweak\" its retail strategy to fit the Apple Watch, Cook confirmed to employees during a visit to the iconic Covent Garden Apple Store. Previous reports have suggested that design czar Jony Ive and retail chief Angela Ahrendts are working side-by-side on a revamp designed to make the stores appeal to potential Apple Watch buyers more accustomed to shopping in boutiques.\n\"The new spaces will surely become a more natural setting for vitrines filled with gold (and perhaps less welcoming, at least in some corners, to tourists and truants),\" The New Yorker's Ian Parker said of the changes last week.\nCook also let slip a few new Apple Watch tidbits, noting that the device's battery will last all day, and will require less charging time than an iPhone. The charger is said to use a \"special magnet technology.\"",
        "sentiment": -0.4020850104279816
    },
    "article_10": {
        "title": "Apple will fight iOS bugs with first-ever iOS Public Betas: 8.3 in March and 9 in the summer.",
        "body": "In an effort to eliminate bugs from upcoming iOS versions ahead of their general releases, Apple plans to launch the first-ever public beta program for the iOS operating system, according to multiple people briefed on the plans. Following the successful launch of the OS X Public Beta program with OS X Yosemite last year, Apple intends to release the upcoming iOS 8.3 as a public beta via the company’s existing AppleSeed program in mid-March, according to the sources. This release will match the third iOS 8.3 beta for developers, which is planned for release the same week. Apple then expects to debut iOS 9 at its June Worldwide Developer Conference, with a public beta release during the summer, and final release in the fall…\nAhead of the October 2014 launch of OS X Yosemite, Apple released the new Mac OS as a beta to the first one million people who registered with interest. Apple has said that it will soon provide these users with early looks at OS X updates such as the upcoming 10.10.3 with the new iCloud-based Photos application. In order to maintain a higher level of exclusivity, the public beta program for iOS will apparently be limited to 100,000 people, the sources say. Apple began seeding a select group of retail employees with iOS betas for minor releases in January. In the hands of developers since last year, iOS 8.2 will not enter public beta.\nCodenamed Stowe, iOS 8.3 was first seeded to developers in early February with several enhancements. The updated software includes support for Wireless CarPlay, an upgraded Emoji keyboard, an enhanced voice for Siri, and simpler login for Google services. A second 8.3 beta is expected next week. iOS 9, codenamed Monarch, will include fixes and performance enhancements as headline features. Apple is also working on iOS 8.4, codenamed Copper, that bundles Apple’s all new streaming music service. Like the early iOS 8 developers builds, the public betas will include a dedicated app that allows users to report bugs to Apple.\nThe main goal of the iOS beta program will be a more reliable and widely tested operating system by the time of the wider consumer launch, as Apple has come under fire for lack of quality control in iOS 8. Launching public beta versions of iOS will also reduce the demand for unauthorized sales of beta downloads from developer accounts, which enabled some consumers to test-drive future iOS features. Apple Vice President of iPhone and iOS Marketing Greg Joswiak publicly shared his concern regarding these blackmarket businesses, saying that Apple planned to fight those in the future.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.19021495823797427
    },
    "article_11": {
        "title": "Apple’s iPhone Overtakes Android In US Sales For The First Time Since 2012",
        "body": "Apple, in its flush of new, bigger iPhone 6 handsets, has been selling record numbers of its older and newer model smartphones in the last few months, and now it’s passed another significant milestone: it has managed to overtake sales of Android devices in the key market of the U.S. for the first time in three years.\nAccording to figures from Kantar Worldpanel ComTech, the market research division of WPP, in the key holiday sales quarter of Q4 2014, Apple sold more iPhones than all of the various Android OEMs put together, the first time that it has managed to do this since Q4 2012. But if you don’t want to buy into any Apple hype, you might consider there’s likely some margin for error here — iOS devices accounted for 47.7% of sales, while Android devices accounted for 47.6%.\nThe more interesting question is whether this was a seasonal bump or the start of a bigger trend. On that front, Kantar is bullish on Apple’s overall lineup that includes older models, especially in comparison to the selection of Android devices available.\n“In the US, Apple iOS overtook Android for the first time since this time in 2012, albeit by the slimmest 0.1% margin,” writes Carolina Milanesi, chief of research at Kantar Worldpanel ComTech. “While the success of the iPhone 6 and 6Plus is unprecedented, this quarter’s performance also points to Apple having its strongest portfolio ever. With a range of devices available at different price points in both contract and pre-pay, Apple was able to take advantage of a weaker Android offering at the premium end of the market.” Worth also pointing out that Kantar was able to track Apple’s momentum several months ago from initial iPhone 6 sales, and saw it developing in subsequent weeks.\nRounding out sales, Microsoft’s Windows Phone is facing a difficult time breaking into anything beyond a negligible place in the market. Across the “big five” markets of Germany, UK, France, Italy and Spain, which was seen as the focus of great hope for the brand considering its Nokia legacy, Windows Phone declined one percentage point and took just under 9% of sales.\n“Windows Phone, soon to be Windows 10, had seen some success across Europe in 2013 but continued to struggle in the latest period, recording minimal growth only in France and Germany,” Kantar writes. That was repeated elsewhere. In the U.S., dropped by half a percentage point to 3.8% of all sales. In China it is now at 0.7% of all sales.\nConsidering that it wasn’t too long ago that Symbian was China’s biggest smartphone platform, and before that the world’s, and that Windows Phone was supposed to be the heir apparent to Symbian, it’s a remarkable failure to hold on to market position.\nBut in that push of consolidation around two platforms, it’s not the only one to fall away. BlackBerry isn’t even broken out by Kantar anymore.\nWithin Android’s sales, Samsung continued its pole position, with its Galaxy S5 as the second-most popular smartphone after the iPhone.\nBut overall Android saw declines in other big markets. In the big five EU markets, Android’s overall share was down by 3.8 percentage points, the same decline as in the U.S. Notably, in the UK, Apple saw its strongest gain against Android, picking up 13.1 percentage points while Android dropped 7.5 percentage points, with iPhone 6 becoming the best-selling smartphone in Britain with 20% of all smartphones sales (the Galaxy S5 came at a distant second with 8%).\nNevertheless, across Europe Android still accounted for just over 66% of all sales through carriers and retail channels.\nIn another key market, China, Apple’s iOS was actually the only platform that saw annual gains for the company. (And indeed, Apple also made a lot of noise in its quarterly earnings about how strong China is for it at the moment, with $16 billion in sales in the market.) It accounted for 21.5% of sales in the quarter to Android’s 77%, fuelled by brands like Xiaomi.\n“In Urban China, Apple iOS grew share year-on-year at the expense of Android,” writes Tamsin Timpson, strategic insight director at Kantar Worldpanel ComTech Asia. “While Xiaomi remained the bestselling brand in the latest period, Apple was able to close the gap slightly, growing its share to 21.5% from 19% last year.” China, it should be noted, is still a market with room to grow, unlike the very saturated European and U.S. markets. Kantar notes that one-quarter of Chinese consumers who bought an iPhone in the past three months were acquiring their first smartphone, compared to 16.5% for the same period in 2013.\nIndeed, in the U.S. Kantar says that smartphone penetration is now 59% and in Europe it is 67%. In contrast , Brazil’s penetration is only 35% and Mexico’s is 37%. This is where brand loyalty continues to be an open game.\n“As the opportunity to attract first-time smartphone buyers in developed economies diminishes, retaining loyal customers is becoming as important as winning them over from competing platforms,” says Milanesi. She notes that Apple’s average customer loyalty in the U.S. and Europe is currently a “promising” 87%, while Samsung continues to hold on to the strongest Android brand.",
        "sentiment": -0.0588738501400632
    },
    "article_12": {
        "title": "Apple is taking 93% of the profits in the smartphone industry now; Samsung gets 9%. Everyone else is losing money.",
        "body": "Apple is basically the only company making money from smartphones anymore.\nEvery quarter, Canaccord Genuity analyst Michael Walkley takes a look at the state of the profits of smartphone companies. This quarter, Walkley found Apple had a record breaking 93% of the industry's profits.\nApple is always the leader, but for a short while, it looked like Samsung was going to catch Apple. Those days are long gone. Apple has blasted away from the pack.\nSamsung's share of the industry's profits is down to 9%, its lowest point since 2008 as its profits crater. Samsung is under attack from Apple at the high end with the iPhone 6 and 6 Plus, which both have big screens.\nIt's also under attack at the low-end from cheap Chinese phone makers like Xiaomi. Walkley doesn't have Chinese phone maker Xiaomi in his table, saying, \"since Xiaomi is a private company, we are unable to get their sales and profit metrics. If I could get their profit metrics, then I would certainly include.\"\nApple sold 74.5 million iPhones last quarter, generating roughly $12.6-$13.5 billion in profits.\nBI Intelligence\nIf you're more into pie charts, here it as a pie chart for Q4.\nBusiness Insider",
        "sentiment": -0.5308790229834043
    },
    "article_13": {
        "title": "Apple patent filing moves Touch ID to the iPhone or iPad touchscreen",
        "body": "Fingerprint Sensor in an Electronic Device\ntransparent conductive material such as indium tin oxide,\nA patent filing made by Apple called \",\" shows how Touch ID might be placed directly inside the touchscreen of an iPhone or iPad instead of under the home button. The patent would allow users to have their fingerprint scanned by pressing on a specific location on the screen of the handset or tablet.Security could be enhanced on the iPad by requesting that the user verify his identity by matching the fingerprints on all five fingers on one hand. A palm print could also be employed.Previous attempts to embed a fingerprint scanner inside a touchscreen have resulted in the placement of additional layers on top of the display which harmed the quality of images seen on the screen. Additionally, touch inputs sometimes would not register on a touchscreen outfitted with the additional material. Apple plans on getting around this by using an integrated circuit that would be placed on the bottom of a cover sheet or on the top of the display. Using a \"\" Apple would be able to prevent a drop in the quality and clarity of the images seen on the touchscreen.The patent filing is partly credited to Dale Setlak, co-founder of AuthenTec. The biometrics company was purchased by Apple in 2012 to help it produce the current Touch ID fingerprint scanner.source: FPO via AppleInsider",
        "sentiment": -0.3370430752635002
    },
    "article_14": {
        "title": "Jonathan Ive and the Future of Apple",
        "body": "I. Launch Day\n“So much of our manufactured environment testifies to carelessness,” Ive says. Things are “developed to be different, not better.” Photograph by Pari Dukovic\nIn recent months, Sir Jonathan Ive, the forty-seven-year-old senior vice-president of design at Apple—who used to play rugby in secondary school, and still has a bench-pressing bulk that he carries a little sheepishly, as if it belonged to someone else—has described himself as both “deeply, deeply tired” and “always anxious.” When he sits down, on an aluminum stool in Apple’s design studio, or in the cream leather back seat of his Bentley Mulsanne, a car for a head of state, he is likely to emit a soft, half-ironic groan. His manner suggests the burden of being fully appreciated. There were times, during the past two decades, when he considered leaving Apple, but he stayed, becoming an intimate friend of Steve Jobs and establishing the build and the finish of the iMac, the MacBook, the iPod, the iPhone, and the iPad. He is now one of the two most powerful people in the world’s most valuable company. He sometimes listens to CNBC Radio on his hour-long commute from San Francisco to Apple’s offices, in Silicon Valley, but he’s uncomfortable knowing that a hundred thousand Apple employees rely on his decision-making—his taste—and that a sudden announcement of his retirement would ambush Apple shareholders. (To take a number: a ten-percent drop in Apple’s valuation represents seventy-one billion dollars.) According to Laurene Powell Jobs, Steve Jobs’s widow, who is close to Ive and his family, “Jony’s an artist with an artist’s temperament, and he’d be the first to tell you artists aren’t supposed to be responsible for this kind of thing.”\nOne morning in September, Ive was talking with a few friends, including Chris Martin, of Coldplay, and Stephen Fry, the British actor and writer, in a courtyard beside a community-college hall, a few miles from Apple’s headquarters, in Cupertino. He wore pale, wide pants, cut as if for a chef, and tan suède Clarks shoes, and his hair was cropped. He was maintaining a look captured in a Playmobil figure of him, which his design colleagues made as a Christmas present a few years ago. The seven-inch Ive had on sunglasses and carried an off-white Valextra briefcase. A photograph of the gift is the lock-screen image on Ive’s iPhone.\nIve was brushing his hand across the top of his head, and talking quietly. He is impeccably solicitous, with frowns of attention and apologies for lateness or workplace untidiness, and he seems to extend this tone to everyone—including, presumably, to the crew of his twenty-seat Gulfstream GV, which he bought from Powell Jobs after her husband’s death, in 2011. He communicates with his friend Paul Smith, the British fashion designer, largely through postcards that, as Smith recently recalled, contain “words like ‘lovely,’ ‘special,’ ‘so nice’—a language that is particular to his gentleness.”\nLater that morning, Apple was announcing new products and services, at the kind of event that the company, like a fashion house, stages a few times a year. Of a thousand attendees expected, a few dozen had been invited to the backstage courtyard. Among the guests were Rupert Murdoch; Kevin Durant, of the Oklahoma City Thunder; Marissa Mayer, of Yahoo; Jimmy Iovine, the C.E.O. of Beats; and the rapper and entrepreneur Sean Combs. (Fry later referred, fondly, to “Snoop Seany Sean,” who was gracious when Fry nearly soaked him with a spilled drink.) That day, a hundred assembly lines in Zhengzhou, China, were turning out still secret new iPhones at a reported rate of seventy-five hundred an hour, and rumors about new Apple products, including a watch, were being posted online at nearly the same pace. Tim Cook, Apple’s C.E.O., was somewhere nearby, preparing to speak to a hall full of enthusiasts and reporters, and to millions online. But Ive’s role was limited largely to drinking coffee in misty sunshine. Jobs excused Ive from most public-speaking duties, and he has held on to the dispensation.\n“I’m shy,” Ive said. His London accent is intact after more than twenty years away. “I’m always focussed on the actual work, and I think that’s a much more succinct way to describe what you care about than any speech I could ever make.” He sounded calm, but he was fidgeting with his hands, as if trying to flick gum from his fingertips.\nBehind Ive, at a distance that suggested self-exile, was Steve Wozniak, who, in 1976, co-founded Apple with Jobs, and who was wearing a black steam-punk watch the size of an ashtray. (“What is that?” Ive later asked, rhetorically, in mock affront at its design.) A colleague told Ive that, overnight, people had formed lines outside Apple stores, wrongly assuming that new devices would become available that day. Ive recalled the first time he encountered a long queue: his parents took him to the Tutankhamun exhibition at the British Museum when he was five.\nThe day’s event included a ten-minute film. Ive’s reluctance to speak onstage has been offset by a willingness to appear in scripted videos. These productions—Ive speaking in earnest cadences, his head cocked forward like Pixar’s Anglepoise lamp—have become so well known that ikea recently parodied them, in an ad for its catalogue (“a device so simple and intuitive, using it feels almost familiar”). Such videos used to punctuate Jobs’s onstage message. In the absence of Jobs, they carry the message. Apple’s current leaders aren’t without public-speaking skills, but they can’t match Jobs’s charisma, which was fortified by a hint of menace, and their performances can evoke the awkward informality—the dancing in lanyards—of a corporate retreat. By contrast, the virtual Ive seems to emerge from the same orderly, decontaminated place as an Apple product. He appears “rational” and “inevitable,” to use the typical language. On Apple’s Web page of executive biographies, fourteen men and women give welcoming smiles; Ive, the in-house outsider, faces the camera with album-cover gravity.\nThe new film did not show Ive’s face, but he had narrated it, and largely directed and edited it. This work was done in Apple’s design studio, which has a core team of nineteen industrial designers whose public recognition—even as their work has become unavoidable—has rarely extended beyond mentions in patent filings and affidavits. In a company with inexhaustible marketing resources, Ive’s authorship of the film suggested fastidiousness about the seductive display of his work. But it was also an assertion of ownership that Jobs himself might have appreciated. Apple’s designers have long had an influence in the company which is barely imaginable to most designers elsewhere. This power “was anointed to them by Steve, and enforced by Steve, and has become embedded culturally,” in the description of Robert Brunner, who gave Ive his first job at Apple, and ran Apple’s design group in the first half of the nineteen-nineties, before this culture took hold. Jeremy Kuempel, an engineer who interned at the company a few years ago, and has since launched a coffee-machine startup, told me that when a designer joined a meeting at Apple it was “like being in church when the priest walks in.” Now, Brunner believes, “Jony has assumed the creative soul of the company.”\nJ. J. Abrams, the filmmaker and showrunner, is a friend of Ive’s, but he could not attend the September launch, because he was shooting “Star Wars: The Force Awakens,” in London. He later told me that Ive had shared some of the company’s news in advance, and that they had discussed “the fact that we were both working on things that had a level of expectation and anticipation that was preposterous.” If Ive has learned to cope with pre-launch media fuss—snatched photographs of components, mockups of imagined goods—Abrams seems to relish it. As the event in California unfolded, he posted an image to Twitter using the hashtag #AppleWatch: a handwritten card (“Why do I suddenly have this desperate need to own a watch? Damn you, Apple!!!”) lying on a polished surface that seemed to offer the first glimpse of the interior of a new Death Star.\nAt my first meeting with Ive, a few weeks earlier, he had worn a Jaeger-LeCoultre watch that he and an old friend, Marc Newson, the Australian-born designer, had customized for an auction benefitting Project Red, the charitable organization co-founded by Bono; they made three watches and kept one each; the third sold for three hundred and sixty thousand dollars. But now, in the courtyard of multimillionaires, Ive had a bare wrist, and it would remain so for a few more hours. He spoke of soon arriving at “this rarest of times—when we’re done, and we get to talk about it.” He added, “It’s pretty strange. Where we’re standing, right now, we haven’t talked about it, and we can stand here in a couple of hours, and millions and millions of people will know.” He went on, “You go from something that you feel very protective of, and you feel great ownership of, and suddenly it’s not yours anymore, and it’s everybody else’s. And it’s a very—I think the word ‘traumatic’ is probably overstated, but it’s a really significant point in time.” He smiled. “These are very poignant points in time. It’s so digital. It’s so binary.”\nNewson had come to the gathering, and for a while Ive whispered affectionately with him and Powell Jobs. Before going indoors, Ive greeted Powell Jobs’s twenty-three-year-old son, Reed, whose collar-length hair underscored his resemblance to his father at the same age. Ive held him in a hug, and exhaled: “Ahh!”\n“We can do this the easy way or we can do this the cute way.” Share Share Shop Shop\nInside the hall, Ive took a front-row seat, with Marc Newson on his left and Chris Martin on his right. Tim Cook came onstage. The audience applauded two redesigned iPhones and a new touchless payment system, which was introduced with a film that—like infomercials showing people in catastrophic interactions with Tupperware or garden hoses—may have overplayed the difficulty of taking a credit card from one’s pocket. Then Cook borrowed a phrase of his predecessor’s: “One more thing.” Before long, jewelry was tumbling through white space, and Ive was talking about “beautiful objects that are as simple and pure as they are functional.”\nII. The Studio\nOne morning at Apple’s headquarters, a few weeks earlier, Ive recalled how, in 1997, the company seemed to be dying around him. “Every story you’d read, every morning before coming to work, started with the phrase ‘The beleaguered computer maker, Apple,’ ” he said. Ive was then thirty; after five years at the company, he had become its head of industrial design. “There was a Wired cover that had a big Apple logo with a crown of barbed wire, as thorns, and underneath it just said, ‘PRAY.’ I remember this because of how upsetting it was. Basically saying: either it’s going to just go out of business or be bought.”\nThe Wired article appeared that June. The next month, Jobs, who had left Apple twelve years earlier, and gone on to launch Pixar and NeXT, returned as Apple’s C.E.O., supplanting Gilbert Amelio. Jobs and Ive had an intense first meeting. Ive said, “I can’t really remember that happening really ever before, meeting somebody when it’s just like that”—he snapped his fingers. “It was the most bizarre thing, where we were both perhaps a little—a little bit odd. We weren’t used to clicking.”\nAssuming the worst, Ive had a resignation letter in his pocket. Indeed, Jobs’s initial instinct had been to hire a new designer. He had approached Richard Sapper, who designed I.B.M.’s ThinkPad—a black cigar box. (Sapper was tempted, he told me, a little ruefully, but didn’t want to abandon his I.B.M. contract for a “tiny, tiny company.”) Jobs had also met with Hartmut Esslinger, who, as a consultant, was Apple’s industrial designer in the eighties. Esslinger, in an e-mail, recalled telling Jobs that Apple’s existing team, including Ive, “was very talented and competent if given the right leadership.” Esslinger, who has more design-guru swagger than Ive, also takes some credit for what happened next: he said that he encouraged Jobs to refocus the company on “evolving digital-consumer trends.”",
        "sentiment": -0.030830936525017023
    },
    "article_15": {
        "title": "Apple Promotes Games Without In-App Purchases in App Store",
        "body": "Apple today made one of its weekly updates to the App Store, adding a new featured category that highlights \"Pay Once & Play\" games in the App Store. As noted by MacStories, the section includes a list of popular game titles that do not include in-app purchases. The new feature has appeared in European App Stores already and should be making its way to other countries as the weekly update propagates.\n\"Pay Once & Play\" offers a range of titles that are organized into the following categories: Recent Releases, Blockbuster Games, and App Store Originals. Some of the featured titles include Thomas Was Alone, Minecraft - Pocket Edition, Hero Emblems, Threes, Blek, and Goblin Sword.\nGames and apps with in-app purchases have gotten Apple into trouble on multiple occasions over the past few years, leading to a 2011 lawsuit and a $32 million settlement with the FTC after children racked up hundreds of dollars in purchases without parental knowledge.\nApple has made several changes to the App Store since the original lawsuit was filed. Apps with in-app purchases are clearly labeled, Apple obtains express permission for an in-app purchase in the form of a pop up, and it notifies users that making an in-app purchase authorizes additional in-app purchases for 15 minutes.\nMost recently, Apple changed the \"Free\" wording on purchase buttons to \"Get\" to make it clear that apps with in-app purchases are not truly free.\nUpdate 1:37 PM: The new feature has hit the U.S. App Store and includes a slightly different set of apps. A few titles such as Threes! and Thomas Was Alone that are featured in Europe are not on the U.S. version, while U.S. users will see other titles such as Dark Echo and Grand Theft Auto: San Andreas.",
        "sentiment": -0.055112226866185665
    },
    "article_16": {
        "title": "Apple shot its Oscars ad with the iPad Air 2",
        "body": "Apple just debuted its Oscars ad and unsurprisingly, it's centered around making movies. The commercial features several groups of high school students as they shoot different projects using the iPad as their camera, overlaid by an inspirational voiceover from Martin Scorsese, who extolls the virtues of hard work and experimentation as the keys to creative success. And while the piece has the kind of delicate score and evocative images that one would expect from an Apple ad, the spot was actually shot on the iPad Air 2 itself.\nReal student filmmakers\nFor the commercial, Apple partnered with the LA County High School for the Arts, a performing and visual arts school located in Los Angeles. Student filmmakers were provided with iPads and shot their projects over a weekend, during which their efforts were documented — also using an iPad Air 2. That behind-the-scenes footage is what makes up the ad.\nIt's a similar strategy to what Apple pursued with its Grammys ad earlier this month. In that case, director So Me created a short film focused around a collaboration between Swedish recording artist Elliphant, DJ The Gaslamp Killer, and English producer Riton. The apps used by the artists were then highlighted on Apple's own website; the work of the student filmmakers is getting the same treatment.",
        "sentiment": 0.5480972317357858
    },
    "article_17": {
        "title": "Candy Crush Saga Players Spent Over $1.3 Billion on In-App Purchases in 2014",
        "body": "Candy Crush Saga may have reached peak popularity, with quarterly spending declining over the past eighteen months, but that hasn't stopped the sweet-swapping puzzle game from raking in the cash. Candy Crush Saga players still spent over $1.3 billion on the game in 2014 alone, according to The Guardian, with dollars being used towards in-app purchases such as extra lives, extra moves, color bombs, lollipop hammers and gold bars.\nCandy Crush Saga continues to be the third-highest grossing app in the United States, closely trailed by Candy Crush Soda Saga at sixth overall. The game has gained a cult-like following since launching on the App Store in June 2013, following in the footsteps of other smash-hit games such as Infinity Blade and Angry Birds. The game was most lucrative when it pulled in $551 million during the third quarter of 2013.\nThe latest financial numbers from King, the developer of the game, reveal that Candy Crush Saga represented 45% of spending on the company's games during the final quarter of 2014, the first quarter in a long time that the iconic title did not make up the majority of its revenue. King has been working to diversify its gaming portfolio so that it relies less on Candy Crush Saga to remain profitable. The company had 356 million monthly unique users playing its games last quarter.\nEarlier this week, Apple introduced a new category on the App Store to promote games without in-app purchases. The \"Pay Once & Play\" section offers a range of titles that are organized into the following categories: Recent Releases, Blockbuster Games, and App Store Originals. Some of the featured titles include Thomas Was Alone, Minecraft - Pocket Edition, Hero Emblems, Threes, Blek, and Goblin Sword.",
        "sentiment": 0.03651626120236787
    },
    "article_18": {
        "title": "Apple announces media event for March 9",
        "body": "Apple on Thursday sent out invites for a special event to be held on March 9, 2015. The event will be held in San Francisco at the Yerba Buena Center for the Arts, a venue that Apple has used many times before for special events.\nIt is widely expected that Apple will use the event to give more details about the Apple Watch, which was introduced last September.\nThere are still many details about the Apple Watch that we don’t know, including pricing of the various configurations that we could find out in March.",
        "sentiment": -0.04447357100434601
    },
    "article_19": {
        "title": "Apple's Newest Store Boasts 50-Foot Glass Walls and a Free-Floating Second Floor",
        "body": "At first blush, Foster + Partners' new Apple store in Hangzhou, China, looks a lot like its others. The British architecture firm headed by Norman Foster started designing for Apple in 2009, when Steve Jobs tapped them to design the new Cupertino headquarters. That massive, circular building aside, in the year or so since, Foster's buildings have all been some sort of spin on the enormous glass box. The style makes perfect sense for Apple: It’s suggestive of the products sold within, and is sleek and consistent with Apple’s product packaging---which is just as key to the company’s design ethos as anything else it does.\nIf the new Hangzhou store is any indication, Foster + Partners are looking for ways to make its already pared down Apple stores even more minimalist. But in doing so, they're pushing the limits of what can be done with modern structural engineering. Take a closer look: The Hangzhou store’s ceilings are almost 50 feet high, with no columns to be found. The façade of glass panels reaches from floor to ceiling without interruption, meaning Foster + Partners had to push well beyond their previous feats in glass manufacturing to get 11 seamless panes. (By contrast, the glass cube that leads to Apple's heavily trafficked subterranean Fifth Avenue store in New York is 32 feet tall, and the curved glass entrance to the store's Shanghai store is 40 feet in height. The Cupertino campus itself will use enormous glass panels that are curved.)\nFoster + Partners\nThe airy interior is broken apart by only a thin cantilevered second floor---just 10 centimeters at its thinnest. It floats over the first floor with no suspension or support in sight, creating a glowing ceiling over the trademarked retail space on the ground floor. Tuned-mass dampers were installed at the floor's anchor points, to keep footsteps from causing the floor to sway. That's not a new technique---after all, skyscrapers in Japan use those massive, suspended counterweights to keep skyscrapers from moving during earthquakes. (Foster + Partners actually retrofitted their Millennium Bridge with dampers, after it started swaying from side to side.) But such technology has little precedent in a mere retail space. The architects call it “a new living room for the city.\" But it's a really, really nice living room. Even the bolts used for the staircase are precisely embedded within the glass steps, creating the illusion of a glass staircase that's hovering off to the side.\nPlenty of Apple stores have glass façades, and all of them are an exercise in minimal design. But with each new store in China, Apple is investing in increasingly out-there manufacturing techniques. This is the next evolutionary step for Apple's store design: It’s like the Hangzhou store--one of five opening in China---has been especially feng shui’d, or Kondo’d. “Every aspect of the store has been optimized, minimized, and de-cluttered,” say the architects. It takes a lot of work to look that simple.",
        "sentiment": -0.0232795844009767
    },
    "article_20": {
        "title": "iPhone 6 Plus Owners Use Twice as Much Data as iPhone 6 Owners",
        "body": "There's a new mobile analytics report out from Citrix [PDF] and it's filled with interesting data on mobile usage, including a tidbit that suggests iPhone 6 Plus owners use far more data than other iPhone owners.\nPeople who own the 5.5-inch iPhone 6 Plus consume twice as much data as people who own the smaller 4.7-inch iPhone 6, and iPhone 6 Plus data usage is 10 times higher than data usage on the 3.5-inch iPhone 3GS. That last statistic isn't surprising -- along with a small screen, the iPhone 3GS is much slower with hardware that's almost six years old.\nCitrix suggests that the higher iPhone 6 Plus data usage is due to its users treating it like a tablet, consuming more media like streaming movies on the device.\niPhone 6 Plus subscribers generate the most data volume, double that of an iPhone 6. This increase impacts subscribers when choosing a new device -- be careful to select a data plan that matches your super-sized screen. Clearly the phablet sized iPhone 6 Plus shows data usage patterns more akin to tablet usage. For mobile operators, this increase provides an opportunity to shift subscriber Wi-Fi usage towards mobile networks.\nOther details covering all smartphone usage (not just iOS) suggest that interest in mobile health apps is on the rise, with 78 percent of mobile health app users using fitness apps. Sports video watching on mobile devices is up from 21% in Q3 2014 to 50% in Q1 2015.\nThe report also has an enterprise section, which confirms that iOS is still the dominant mobile platform. iOS devices are responsible for 64 percent of devices managed in the enterprise, compared to 27 percent for Android and 9 percent for Windows Mobile.",
        "sentiment": -0.044399552047252655
    },
    "article_21": {
        "title": "VLC for iOS is out",
        "body": "Nicole Cozma/CNET\nVLC's latest release marks the popular video-playing software's global return to Apple's App Store. It's the first time that VideoLAN, the player's non-profit developer, has released a version that spans Android, iOS, desktop, WinRT and Windows Phone.\nThe iOS VLC app had originally been pulled from the App Store due to licensing issues, though an older version was released quietly in Apple's New Zealand store earlier this month, but in no other country.\nThe app's Android version has emerged from beta and will also support Android TV, while the Windows Phone app will be the first time it is being released as an open beta (previous versions were closed betas, limited to select users).\nVersion 2.2.0 of the desktop version, codenamed Weatherwax, is out now. It plays almost every video format and comes packing new features such as the ability to automatically rotate vertical videos, support for resume playback on desktop, as well as improved support for Ultra HD codecs.\nSubtitles can also be downloaded via an extension, though support for Google's popular Chromecast smart stick is still missing -- it's slated for the upcoming 3.0 release that's slated for later this year.\n\"I'm very happy about those releases. Moving VLC to the mobile world was difficult, but the difficult is done,\" Jean-Baptiste Kempf, VideoLAN's president and lead developer, said in a statement. \"VLC runs everywhere, plays everything. We're working on many new features for VLC 3.0.0 to finish what we've started here.\"\nYou can download the app for iOS and Android from those links. Desktop users can head straight to VideoLAN's website for the download, while the Windows Phone app will be launched at a later date.",
        "sentiment": 0.2004684309164683
    },
    "article_22": {
        "title": "Apple's Jony Ive and Tesla's Elon Musk 'inseparable' in conversation at Oscars afterparty",
        "body": "Elon Musk and Jony Ive in attendance at the 2015 Vanity Fair Oscar afterparty\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nOne of the top designers in the world and the leader in electric car technology were spotted engrossed in private conversation this past Sunday at an exclusive Academy Awards afterparty, amidst a flurry of rumors surrounding Apple's rumored plans to build its own electric, autonomous car.\nA source tells AppleInsider that both Jony Ive, Apple's famed designer, and Tesla CEO Elon Musk were among the attendees at Madonna's A-list Oscar afterparty on Sunday — an extremely exclusive event where all press and photography are strictly prohibited. Ive and Musk were observed speaking \"really close\" and \"basically inseparable\" from each other for a period that seemed to stretch on for roughly 30 minutes, this person said.\nThe source said that Ive was walking around with a few people at the party before he was approached by Musk and their conversation began. The two were said to have exited the party together at around 5 a.m.\nOf course, it's unknown exactly what the two icons may have shared with each other. But with recent reports suggesting Apple is working on some form of electric car — and Tesla serving as the current leader in electric car advancement — the alleged meeting and future interactions are sure to fuel the already rampant speculation on the matter.\nGiven the tight security and no-press-allowed rules of the event, there are no photos of Ive and Musk in conversation. But both men, along with Steve Jobs's widow Laurene Powell, were spotted in attendance earlier in the day at the Vanity Fair Oscar party.\nJony Ive and his wife Heather Pegg at the 2015 Vanity Fair Oscar afterparty\nMadonna's Oscar party in Coldwater Canyon is commonly known in Hollywood circles as the afterparty of the popular Vanity Fair Oscar party, where both Ive and Musk were confirmed in attendance. Celebrities have been particularly drawn to the strict no press, no photographers policy of Madonna's gathering. This year's event was sponsored by Gucci, which provided attendees with an exclusive Gucci passport wallet as a party favor on their way out.\nGucci passport wallets were provided to guests of Madonna's exclusive Oscar afterparty.\nThe meeting between Ive and Musk also comes after Musk himself revealed that Apple has been offering $250,000 bonuses and 60 percent raises in an effort to recruit some of his top Tesla engineers. According to Musk, while Apple has tried \"very hard\" to recruit Tesla employees, \"very few people\" have actually jumped ship.\nIt was also reported a year ago that high ranking officials from Apple and Tesla have also met privately. Musk himself later confirmed the talks, but called a sale of his company to Apple \"very unlikely.\"\nAt the time it was suggested that the two companies could be collaborating on battery technology. In particular, Tesla is at work on a so-called \"gigafactory\" for the manufacturing of lithium-ion batteries — components crucial not only to Tesla's vehicles, but also to Apple's portable devices.",
        "sentiment": -0.4305070066138318
    },
    "article_23": {
        "title": "Neil Young's $400 Pono hi-def music player loses to Apple's iPhone in blind audio test",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nThough it has the backing of legendary rocker Neil Young, the new Pono music player for audiophiles doesn't actually sound much better, or better at all, than high-quality MP3s played from an Apple iPhone.\nFunded through a high-profile Kickstarter effort a year ago, the PonoPlayer is now shipping to some early backers. For everyone else, the uniquely shaped triangle device carries a retail price of $399, and it comes in colors of yellow or black.\nYoung originally said in 2012 that he had been working with late Apple co-founder Steve Jobs on a new music format that would improve audio quality. Those plans apparently fell through, however, which helped lead Young to publicly support the PonoPlayer, which supports high-fidelity audio up to 192kHz/24-bit resolution.\nThe hardware includes two 3.5mm audio jacks that can be used in a so-called \"balanced mode,\" separating left and right channel outputs across both jacks for use with high-impedance headphones, high-end home stereo systems, or professional equipment The PonoPlayer also supports more traditional manners of listening with regular headphones.\nBut tests conducted by Yahoo Tech's David Pogue, who used to be a professional musician, found that there was essentially no difference between the sound quality of the PonoPlayer and Apple's iPhone. Not only could Pogue not tell the difference, but the journalist also found that tests with others did not bode well for the high-end portable media player.\nIn a blind trial using identical songs on identical headphones, Pogue found that listeners actually preferred the iPhone playback with high-quality MP3s. The iPhone won out over the PonoPlayer when using both earbuds and headphones.\n\"Pono's statement that 'Everyone who's ever heard PonoMusic will tell you that the difference is surprising and dramatic' is baloney,\" Pogue wrote. \"When conducting the test with today's modern music files, I couldn't find even one person who heard a dramatic difference.\"\nAnother review at ArsTechnica had a slightly less negative spin on the PonoPlayer, but even there reviewer Sam Machkovech had to admit that 192kHz/24-bit FLAC audio files played on the Pono did not sound noticeably better than high-quality MP3 files.\nSwitching to Pono also requires users to re-purchase their music library, at a cost of $2.50 per song. The device also has a sluggish touchscreen, an awkward triangular design, and offers eight hours of battery life, performing worse than Apple's discontinued iPod classic.\nStill, given that the iPod classic is no more, there are likely many on the market who would like a high-capacity, high-quality dedicated portable media player. And with 128 gigabytes of storage expandable to 196 gigabytes, the $399 PonoPlayer might fit that bill for some.\nAnd some audiophiles, like Young, may swear by the PonoPlayer, including a Pono owner who was part of Pogue's blind test. That person actually preferred the sound of the iPhone when comparing the two side by side, but later argued that the iPhone could not deliver the \"emotion\" of the sound from the Pono.",
        "sentiment": -0.2673620034009218
    },
    "article_24": {
        "title": "After iPad initiative failure, school supe says LA can’t buy computers for all",
        "body": "Speaking to a group of reporters on Friday, the Los Angeles Unified School District (LAUSD) superintendent Ramon C. Cortines said that the city can't afford to buy a computer for every student. The statement comes after intense controversy over a $1.3 billion initiative launched by Cortines' predecessor, former superintendent John Deasy, in which every student was supposed to be given an iPad loaded with content from educational publisher Pearson.\nFurther Reading Students gleefully teach admins that mobile device management is hard\n\"I don’t believe we can afford a device for every student,” Cortines told the Los Angeles Times, “Education shouldn’t become the gimmick of the year.” Cortines added that LAUSD had never made a definitive plan for how teachers would have used the iPads during instruction, nor had it planned how it was going to pay for the tablets over time.\nIn the fall of 2013, schools began receiving iPads that would go to each of the 640,000 students in LAUSD. But the students quickly learned how to work around the ActiveSync profile restrictions on the tablets so that they could use them for (probably) non-educational purposes. That debacle was only the first point of turmoil, however. By the beginning of the next school year, the Los Angeles Times reported that there were improprieties in the bidding process, including hints that the Deputy Superintendent, Jaime Aquino, who was also a former Pearson executive, was helping his former company get the bid. The billion-dollar plan was put on hold at that point.\nIn October, Superintendent Deasy resigned his post although he maintained that he had engaged in no wrongdoing. Until December 2014, the school district was prepared to continue its million-dollar spending track with Apple, but when the FBI seized 20 boxes of documents from the LAUSD in an investigation, superintendent Cortines officially shelved the program.\n”Deasy and other officials have denied any wrongdoing and the former superintendent insisted it was a civil rights and educational imperative to make technology available to all students,” the Los Angeles Times wrote today.",
        "sentiment": -0.21781430641810098
    }
}