{
    "article_0": {
        "title": "Apple’s biggest fan has died \"Allen, a retired EMS dispatcher, traveled around the world — obsessively and expensively — to be among the first in line at the company’s new stores. He attended 140 openings, collecting all sorts of trivia. He could even tell you where Apple store tables are made\"",
        "body": "Dressed in their standard blue T-shirts, about a dozen employees clapped and hollered as he walked past iPads and iPhones to the center of the store. Allen beamed, then addressed the staff, who listened with rapt attention as he told them about his trips to Apple stores around the world. On behalf of other obsessive Apple fans, Allen said, “We appreciate all the hard work that we see and don’t see.”\nAs the employees dispersed to start their day, one came out of the back with a piece of cake for him. Another introduced him to an employee who has been there since Day One. Allen couldn’t stop smiling.\n“I had not dreamed that I would be standing here and speaking to the staff in the number one store,” he said. “Amazing.”",
        "sentiment": 0.7450807918794453
    },
    "article_1": {
        "title": "Facebook drains battery in background even though background refresh turned off by using auto-play to keep the app active without you knowing.",
        "body": "Many iOS users report that the Facebook app uses an extraordinary amount of resources when it’s in the background. Apparently, the drain is even more pronounced when Background App Refresh is switched ‘off’ for the Facebook app. This is because Facebook is actively creating channels to continue refreshing their app in the background when the user has explicitly stated that they do not want it to.\nAs Federico Viticci from MacStories puts it into words, “The fact that a company the size of Facebook can’t optimize energy consumption of their iOS app is simply ridiculous. If they can but don’t want to, well, that’s even worse”. He even recommends iOS users not to install the Facebook app, and instead access Facebook from Safari. And by the help of iOS 9’s improved energy consumption stats, he seems to have figured out one of the various tricks Facebook is employing to stay active in the background and drain battery.\n“On my girlfriend’s iPhone, for instance, iOS 9 reports 5 hours of on-screen usage for the last 7 days, and another 11 hours of background audio usage with Background App Refresh turned off. My guess is that Facebook is hijacking audio sessions on iOS by keeping silent audio in the background whenever a video plays in the app. And because, by default, videos on Facebook auto-play on both Wi-Fi and Cellular and few people ever bother to turn it off, that means there’s a high chance the Facebook app will always find a way to play a video, keep audio in the background, and consume energy to perform background tasks”.\nShouldn’t Apple consider additional battery controls to take action against shady practices like invisible background audio used by Facebook for iOS?",
        "sentiment": -0.39474143722856586
    },
    "article_2": {
        "title": "Apple has $206,000,000,000 in the bank. Enough to give every American $646 each. Nearly the cost of a new iPhone :D.",
        "body": "Apple's cash stash? Oh, only $206,000,000,000\nShow Caption Hide Caption Apple - 48 million iPhones sold Apple sold nearly 50 million iPhones in the fiscal 4th quarter, reports Jefferson Graham on #TalkingTech. By Jefferson Graham\nApple has a good problem. It can't get rid of its cash fast enough.\nThe digital gadget maker's cash and investments during the quarter jumped to $206 billion — a staggering 33% increase from the same period a year ago. The swelling pile of cash underscores why selling $650 phones in this day and age continues to be an enviable business model.\nApple would have enough cash to give every American $646 apiece - which is remarkably close to the retail price of an iPhone.\nThanks to strong sales of the iPhone, the company reported a quarterly adjusted profit of $1.96 a share, beating estimates calling for a profit of $1.87 a share. Apple's numbers even topped the unofficial hopes of investors polled by Estimize, looking for a profit of $1.92 a share.\nApple's cash continues to mount - even though it keeps trying to get rid of it. The company returned $17 billion to investors during the quarter in the form of stock buybacks and dividends. Apple has now paid out $143 billion of the $200 billion it said it would give to investors.\nThe iPhone might be tech's version of an ATM machine, but several newer Apple products aren't pulling their weight. The iPad continues to plummet - with unit sales in the quarter dropping 20%. Apple Pay adoption remains low and the watch doesn't appear to be even a rounding error in the company's revenue.\nBut Apple's cash just keeps piling up as consumers seem willing to keep opening their wallets for phones.\nMatt Krantz on Twitter: @mattkrantz.",
        "sentiment": -0.21224302798509598
    },
    "article_3": {
        "title": "PSA: The new iMac 1TB Fusion Drive only has 24GB of flash storage, down from 128GB",
        "body": "Storage\nSolid-state drive (SSD) storage is the amount of space your iMac has for your documents, photos, music, videos, and other files.\nIt delivers significant performance and speed that you’ll notice when you start up your iMac, launch an app, or browse your photos.",
        "sentiment": 0.3622133135795593
    },
    "article_4": {
        "title": "Porsche chooses Apple CarPlay because Google reportedly asks for too much data",
        "body": "Both Apple's CarPlay and Google's Android Auto can turn regular vehicles into connected cars, but according to Porsche, one has a distinct advantage over the other. Motor Trend reports that the German car manufacturer went with Apple's infotainment system over Google's in its new 911 Carrera and 911 Carrera S because the Android Auto agreement demanded too much data be sent to the search giant.\nCarPlay only checks if the vehicle is moving\nThe publication says that Android Auto tracks variables including vehicle speed, throttle position, fluid temperatures, and engine revs, information that is collated and then sent back to Google. Apple's CarPlay, on the other hand, only checks with the car's powertrain control module to ensure that the vehicle is moving. Porsche was apparently unwilling to enter a deal that would send reams of information back to Google — partly, Motor Trend says, because the manufacturer thinks those details make its high-end autos special, and partly because Google itself is in the midst of building its own car.\nIt's not clear whether the agreement Motor Trend cites is standard for all carmakers or was offered specifically to Porsche, but it will raise questions about the amount of information sent back by vehicles that do use Android Auto, and what exactly Google is doing with that data. Porsche's decision is certainly restrictive for Android owners, but let's be honest — if you're planning to buy a brand new Porsche 911 Carrera S, you're probably in a position to be able to afford an iPhone in addition to your existing handset.\nUpdate, 3:19 p.m.: Google has denied the substance of the Motor Trend report.",
        "sentiment": -0.5182094173505902
    },
    "article_5": {
        "title": "Apple Store employee, Ruben Profit, allegedly steals $1 million worth of iTunes gift cards and sells them for 1/10th their value.",
        "body": "If you steal from Apple, watch out. And if you steal a million bucks from Apple while working as an Apple Store employee? Prepare to go to jail.\nAs a result of an internal investigation, an Apple Store employee in New York is being charged with grand larceny for purchasing $997,000 worth of gift cards using fake debit and credit cards.\nHe’d then sell them to a third-party at much reduced rates, in the hopes of raking in a profit. (As an aside, that’s ironic, since the alleged criminal mastermind’s name is Ruben Profit. No joke.)\nNot that he made much of one: he apparently sold them for about 1/10th of what they were worth. In other words, he stole a million dollars from Apple to rake in about a hundred grand. Not bad, but not worth going to prison for.\nAccording to a report from NBC, Profit has been working for Apple since December 2013, and conducted his scam out of Apple’s Queens Center Mall location.\nIf convicted, Profit could go to prison for up to 15 years, getting out just in time for the debut of the iPhone 14.\nSource: NBC\nVia: Apple Insider",
        "sentiment": -0.6388786004390568
    },
    "article_6": {
        "title": "Microsoft Surface Book claimed to be twice as fast as MacBook Pro",
        "body": "Microsoft has just announced its first ever laptop, and it’s called the Surface Book.\nUnveiled at the company’s product launch event today, the Surface Book was described as “the ultimate laptop” by Panos Panay, Microsoft’s Surface and Lumia VP.\nThe notebook has a 13.5-inch PixelSense screen – that’s the same display technology featured on the new Microsoft Surface Pro 4 – with a 3,000 x 2,000 pixel resolution, a 3:2 aspect ratio, and 10-point multi-touch.\nThe display has an impressive pixel density of 267-pixels-per-inch, which works out at about 6 million pixels.\nIn terms of performance, you’re looking at serious graphical potential courtesy of an optional dedicated Nvidia GeForce GPU, as well as integrated Intel HD 520 graphics. It’s also got 1GB of dedicated high-speed GDDR5 RAM and new Skylake i5/i7 processor options.\nMemory options available are 8GB or 16GB, while SSD storage is offered in 128GB, 256GB, 512GB, and 1TB variants.\nPanay also claimed that the processor and dedicated GPU ‘fundamentally\nmakes Surface Book two times faster than the MacBook Pro’ .\nWith any portable device, battery life is a concern. Fortunately, it sounds respectable enough, with Panay claiming a solid 12-hour charge cycle with video playback – we’ll have to wait for a review unit to verify this.\nThe trackpad is built from glass and offers five points of multi-touch. The keys are backlit, and have a neglible 1.6mm travel distance. Oh, and the keyboard is detachable – not bad for a powerhouse notebook.\nThat last bit is where it all gets interesting, because the Nvidia GPU is actually built into the dock. So you won’t get high-grade graphics performance unless the keyboard is attached.\nRelated: Five things things that will make you want a Surface Book\nDevice dimensions of the laptop are 232.1 x 312.3 x 13.0-22.8mm, while tablet dimensions are 220.2 x 312.3 x 7.7mm.\nThe laptop sans the Nvidia GPU weighs 1.515kg, rising to 1.579kg with the GPU. As a tablet only, the Surface Book weighs 726g.\nOn the camera front, you’re looking at an 8-megapixel rear-facing sensor, and a 5-megapixel front-facing selfie snapper.\nThere are dual microphones – front- and rear-facing – as well as frong-facing stereo speakers equipped with Dolby audio.\nThe Surface Book also works with Microsoft’s new Surface Pen, which comes in five colour options and offers up a range of interchangeable tips for varying use-cases.\nIn terms of connectivity, there are two full-size USB 3.0 ports, an SD card reader, Surface Connect for power and docking, a 3.5mm audio jack, a Mini DisplayPort, Bluetooth 4.0, and 802.11ac 2×2 MIMO Wi-FI support.\nRelated: Windows 10 features guide\nThe Surface Book starts at a price of $1,499, and is available to pre-order starting October 7. It’s available to buy outright on October 26.\nWhat do you think of the Microsoft Surface Book? Let us know in the comments.\nRelated: Microsoft Surface Pro 4 review\nCheck out our smartphone buyer’s video guide below:",
        "sentiment": 0.29816998770603764
    },
    "article_7": {
        "title": "New 21.5-inch Apple iMac announced with 4K display for $1,499 + photos of new Keyboard and Trackpad",
        "body": "The processors upgrades mean that the higher-end iMac models also include Iris Pro graphics, which should be particularly useful for pushing around the 4K machine's extra pixels. RAM has also been improved across the board from 8GB of 1600MHz LPDDR3 to 8GB of 1867GHz LPDDR3, upgradeable to 16GB. This update also adds Thunderbolt 2 and a larger storage option.\nThe design hasn't changed, but 4K makes it much nicer to look at\nWhile Apple has changed basically all of the key features on the inside, the iMac's external hardware is the same as it has been. It's still impressively slim and stylish. The black bezels around the display are starting to feel large when compared to, say, the MacBook, but they aren't really something you notice when there's a large 4K screen taking up most of your vision.\nThat said, there will be a few visual differences around the new iMac: Apple is updating its standalone keyboard, trackpad, and mouse, with the former two getting design overhauls. The keyboard and mouse come with the iMac by default, and you'll be able to opt for the (much more expensive) new trackpad.\nJust like Apple only brought 5K to its top-of-the-line 27-inch iMac last year, the company is only offering 4K as an option on its most expensive 21.5-inch machine. It'll start at $1,499, while 1080p models will continue to start at $1,099. It's a big jump, but there's also a big power and quality difference between the two tiers. In a brief test of the 4K model, the actual performance seemed like nothing to write home about — the display, however, should be enough to distract you during any unexpected load times. All models are shipping today.\nPhotography by Sean O'Kane.",
        "sentiment": 0.30971819375242504
    },
    "article_8": {
        "title": "Judge declines to order Apple to disable security on device seized by U.S.",
        "body": "A federal magistrate in Brooklyn is temporarily refusing to order Apple to disable security on a device seized by the government, citing Congress' failure to act on the hot-button issue of encryption despite urging from law enforcement officials.\n\"Congress has done nothing that would remotely suggest an intent to force Apple, in the circumstances of this case, to provide the assistance the government now requests,\" U.S. Magistrate James Orenstein said in his ruling, posted on the court's website Thursday afternoon. \"Several of its members have introduced legislation to prohibit exactly what the government now asks the court to compel.\"\nOrenstein described it as the first written opinion withholding authority, and said he wanted to hear from Apple by Thursday and then would hold an oral argument on Oct. 22 if the government and Apple requested one before making a final ruling on the request.\nHe provided few details on the government's Thursday application asking him to order Apple to help, saying only that the government had a warrant to seize the device but couldn't unlock it, and leaving out details that might compromise the investigation.\nIn the absence of clear legislation, Orenstein said, he had to consider how burdensome an order would be on Apple, and noted that forcing the company to unlock phones could affect carefully considered commercial decisions on the balance between public safety and privacy.\nGet the Breaking News newsletter! Get the latest breaking news as it happens. By clicking Sign up, you agree to our privacy policy.\nOrenstein said the government claimed that in \"other cases\" Apple was ordered to assist law enforcement and had complied, but he said he found only one published court opinion on the issue, in which an unnamed manufacturer was ordered last year to assist the government.\nA spokesman for Apple, which has opposed legislation requiring a \"back door\" in devices to allow law enforcement access, declined to comment on the case.\nAndrew Crocker, a lawyer with the Electronic Frontier Foundation, said he believed that Orenstein was the first judge to question the government's legal authority under the so-called All Writs Act to compel Apple to unlock a phone.\nBut he also said the issue may be moot if the device in question is of recent vintage, because Apple itself is unable to de-encrypt its new operating systems and will probably tell the court so.",
        "sentiment": -0.2778353595307895
    },
    "article_9": {
        "title": "Apple removing hundreds of App Store apps as advertising SDK found to collect sensitive user data via private APIs",
        "body": "Code analytics platform SourceDNA has found hundreds of apps on the App Store that used private APIs to collect private user data, like email addresses and device identifiers, slipping under Apple’s radar in the approval process. The code got into these apps through the inclusion of a mischievous third-party advertising SDK, which secretly stored this data and sent it off to its own servers.\nApple has now verified the SourceDNA report and is removing all of the apps that included the advertising SDK from the store, as using private API calls is a breach of App Review Guidelines. Apple has also patched its approval processes to prevent any more apps that use this technique to make it onto the App Store.\nThe SDK under examination comes from a Chinese advertising company, Youmi. SourceDNA used its own binary search tools to find 256 apps that included the unscrupulous SDK, which have received over a million downloads in total.\nThe SDK used a variety of techniques and APIs to collect identifying personal information it shouldn’t normally be able to. This includes serial numbers, peripheral serial numbers, lists of installed apps and obtaining the user’s Apple ID email. The analytics company speculates Youmi became more confident with its methods over time, slowly adding more and more data collection code over a two-year span.\nIn this instance, almost all of the offending apps were targeted at the Chinese market. However, given that evasion of Apple’s app review process has been going on for many months, SourceDNA is concerned that there may be other cases of similar bad behavior already on the App Store, as yet undetected.\nThis is Apple’s full statement on the matter.\n“We’ve identified a group of apps that are using a third-party advertising SDK, developed by Youmi, a mobile advertising provider, that uses private APIs to gather private information, such as user email addresses and device identifiers, and route data to its company server. This is a violation of our security and privacy guidelines. The apps using Youmi’s SDK have been removed from the App Store and any new apps submitted to the App Store using this SDK will be rejected. We are working closely with developers to help them get updated versions of their apps that are safe for customers and in compliance with our guidelines back in the App Store quickly.”\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.29859548967538607
    },
    "article_10": {
        "title": "I whipped up a free OS X utility to simplify making a bootable OS X installer. Really useful for making a clean install of OS X. What do you think, reddit?",
        "body": "Make a Bootable USB macOS Installer Download the update for Big Sur compatibility\nWhat’s needed for a clean install on a Mac\nA backup of the disk before it’s erased. Two options are to use Duplicate (a free utility which can copy and paste an entire bootable volume), or Mac Backup Guru (a paid, fully featured backup utility with unique incremental backups capability) for that. Here is a detailed guide for the process. A Mac operating system installer. MacOS Big Sur can be downloaded by clicking here.\nMac Free Uninstallation: All of the apps on MacDaddy are fully self contained and easy to uninstall. Just drag and drop the application to the trash in the Finder.\nIf you need to recover deleted files take a look at Mac Data Recovery Guru on our sister-site dedicated to data recovery.\nFollow @BenedictSlaney\nPaypal / credit card donations: click here\nBitcoin donations: 1MbwUFSbQvMrd826DTpup7PpTTNrrJjaJ8\nTotal downloads: 1,678,418\nTotal donated: $33.99",
        "sentiment": 0.17918609199114144
    },
    "article_11": {
        "title": "Microsoft programmer explains why it took an OS X update to fix the issues with Office 2016 and El Capitan",
        "body": "[url=http://arstechnica.com/civis/viewtopic.php?p=29906425#p29906425:2f0150sb said: [url=http://arstechnica.com/civis/viewtopic.php?p=29897877#p29897877:2f0150sb said: [url=http://arstechnica.com/civis/viewtopic.php?p=29876101#p29876101:2f0150sb said: [url=http://arstechnica.com/civis/viewtopic.php?p=29874747#p29874747:2f0150sb said: [url=http://arstechnica.com/civis/viewtopic.php?p=29860345#p29860345:2f0150sb said: wickerbill[/url]\":2f0150sb]Outlook 2011 is having some major issues with El Capitan too. Earlier it would just hang with a beach ball so I closed it and then when I reopened it a few hours later it is working for now. Microsoft has a KB article where they recommend either not updating from Yosemite or to upgrade Outlook to 2016. The problem with that last option is they arbitrarily removed support for Exchange 2007 from Outlook 2016 so that's not an option. Click to expand... I can confirm the issue, too. It beach balls when it tries to sync. No one at Microsoft testing 2011 on Mac OS 10.11? WTH?!\nMicrosoft for the Big Loss on Outlook and Mac OS 10.11.\nHere's the link: gtwood[/url]\":2f0150sb]I can confirm the issue, too. It beach balls when it tries to sync. No one at Microsoft testing 2011 on Mac OS 10.11? WTH?!Microsoft for the Big Loss on Outlook and Mac OS 10.11.Here's the link: https://support.microsoft.com/en-us/kb/3098396 Click to expand... We're well aware of the hang problem in Office 2011 and are working on a fix. The root cause took quite a long time to diagnose, and we worked very closely with Apple to track it down. The problem is over 8 years old and is actually a bug in the headers in the 10.5 SDK released with Xcode 3.2.x. Since Apple doesn't support that toolchain anymore (but the Office 2011 build process is frozen in time) we've had to be creative in working around the problem. Schwieb[/url]\":2f0150sb]We're well aware of the hang problem in Office 2011 and are working on a fix. The root cause took quite a long time to diagnose, and we worked very closely with Apple to track it down. The problem is over 8 years old and is actually a bug in the headers in the 10.5 SDK released with Xcode 3.2.x. Since Apple doesn't support that toolchain anymore (but the Office 2011 build process is frozen in time) we've had to be creative in working around the problem. Click to expand... We've released an update to Office 2011 that fixes the hang on El Capitan. See\nSchwieb Schwieb[/url]\":2f0150sb]We've released an update to Office 2011 that fixes the hang on El Capitan. See https://support.microsoft.com/en-us/kb/3098229 for the download link (and I imagine it should show up in AutoUpdate soon). We're still working with Apple on the boot-time hang in Office 2016 on El Capitan. So far it looks like an issue in sqlite itself.Schwieb Click to expand...\nNew bug.\nThe button allowing you to see account settings when logged in or to log into your office365 account in Word/Excel/Powerpoint start screen doesn't work if you aren't currently logged in, blocking your ability to log in. I was able to work around it by launching OneNote, which has a more traditional login screen.\nIt stumped the support tech. I asked him to escalate the case to a software engineer before figuring out the OneNote workaround. It is repeatable and I can demonstrate it. To replicate, sign out of your Office account, then try signing back in via Word/Excel/PowerPoint.\nFor troubleshooting, I both restarted the computer, and reinstalled Office.\nI'm running El Capitan Exordium01[/url]\":2f0150sb]New bug.The button allowing you to see account settings when logged in or to log into your office365 account in Word/Excel/Powerpoint start screen doesn't work if you aren't currently logged in, blocking your ability to log in. I was able to work around it by launching OneNote, which has a more traditional login screen.It stumped the support tech. I asked him to escalate the case to a software engineer before figuring out the OneNote workaround. It is repeatable and I can demonstrate it. To replicate, sign out of your Office account, then try signing back in via Word/Excel/PowerPoint.For troubleshooting, I both restarted the computer, and reinstalled Office.I'm running El Capitan Click to expand...\nFixed!For some reason, Office installs preferences in ~/Library and /Library. The license/registration file in /Library/Preferences was corrupted, which, for some reason, breaks the sign-in UI.From talking to the support staff, this is apparently a widespread issue, and for some reason, their accepted solution is to make a new user account which is sorta overkill considering it's a single file causing the issue.Schwieb, is there a way you could forward these instructions to the support staff? Deleting the problematic file is a much simpler, more palatable solution. I'll frowny face these instructions as well.Edit: The file in question is the Office 2011 license file. Deleting it fixes 2016 licensing, but 2011 gives a warning \"The Office for Mac installation did not complete successfully because there was a problem with the installer.\" I'm guessing there is a line of code somewhere in Office 2016 that points to the old license file location (the new license file location is /Library/LaunchDaemons).I would like to reiterate how unreasonable being told to create a new user account is, regardless of whether or not it makes the problem go away, especially when it's a bug in the product. The proper response to being told to create a new user account is \"no, fuck you!\"",
        "sentiment": -0.27831073157804115
    },
    "article_12": {
        "title": "All seven Harry Potter books now available to buy in iBooks, featuring exclusive interactive animations and author notes",
        "body": "A notable omission from the iBooks library has been Harry Potter, the most successful literary book series. JK Rowling, the author of Harry Potter, has kept eBook rights exclusive to her own website until today. This morning, Apple announced that all seven of the books are finally available to buy in the iBooks app to be read on iPhone, iPad and Mac.\nThe books include more than just the text of the story. The ‘enhanced editions’ feature brand new interactive elements, animations, ‘elaborate’ artwork, notes from the author and exclusive covers.\nHere’s links to all of the books:\nIn a press release, Apple CEO Tim Cook said the company is thrilled to offer them exclusively on the iBooks Store.\n“I’m thrilled to see the Harry Potter books so beautifully realised on iBooks for the digital world; the artwork and animations in these enhanced editions bring the stories alive in a delightful new way,” said J.K. Rowling. “Harry Potter fans are going to love how their favorite stories come to life,” said Tim Cook, Apple’s CEO. “J.K. Rowling’s legendary series is perfect for enjoying on your iPad or iPhone and we’re thrilled to offer them exclusively on the iBooks Store.” Until now, the Harry Potter digital books have only been available for readers to purchase through the Pottermore Shop. Starting today, iBooks® users can experience the books with all new exclusive custom covers for each title, and typography including the custom Harry Potter typefaces and new section headers and drop caps.\nThe exclusive-content ebooks are priced at $9.99 each and are availably today in the United States, the United Kingdom and 30 more countries. iBooks will be bringing Harry Potter to more languages in November. Preorders for French and Spanish versions start today.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.24545850744470954
    },
    "article_13": {
        "title": "Apple TV Aerials Screen Saver for Mac",
        "body": "Aerial - Apple TV Aerial Views Screen Saver\nAerial is a Mac screensaver (macOS 10.12 or later) based on the new Apple TV screensaver that displays the Aerial movies Apple shot over New York, San Francisco, Hawaii, China, etc. Starting with version 2.0.0, it also includes videos shared by Joshua Michaels & Hal Bergman!\nAerial is completely open source, so feel free to contribute to its development.\nThis repository is used solely for development.\nStarting with version 2.3.0, Aerial can now display current weather information and forecasts to your location, thanks to OpenWeather.\nWe thank OpenWeather for their support of Open Source projects.\nFor downloads and instructions, please go to our new website, hosted on GitHub Page: https://aerialscreensaver.github.io\nWindows user? Try OrangeJedi/Aerial\nLinux user? Try graysky2/xscreensaver-aerial\nAbout Aerial\nAerial was started in 2015 by John Coates (Twitter, Email)\nStarting with version 1.4, Aerial is maintained by Guillaume Louel (Twitter). If you are looking to support the development of Aerial, feel free to donate using the following button :\nCompatibility\nmacOS Sierra (10.12) and above, natively compiled for Apple Silicon\nCommunity\nFound a bug? Make sure you are running the latest version and please check our FAQ and troubleshooting page and our issues, as someone may already have reported it (a beta may be available with the fix you need). Feel free to open an issue, try to be as specific as possible.\nMake sure you are running the latest version and please check our FAQ and troubleshooting page and our issues, as someone may already have reported it (a beta may be available with the fix you need). Feel free to open an issue, try to be as specific as possible. Have you fixed a bug? Or want to implement a feature? Check instructions on how to compile Aerial and more on contributing here.\nOr want to implement a feature? Check instructions on how to compile Aerial and more on contributing here. Can you translate videos names and their descriptions? Awesome! Read here for details on how to help us.\nAwesome! Read here for details on how to help us. Have a feature request? Open an issue. Tell us why it would be useful, and why you and others would want it.\nOpen an issue. Tell us why it would be useful, and why you and others would want it. Join our Community Discord server for technical support, feature requests, and a fun time!\nMultilingual Support\nAerial features overlay descriptions of the main geographical features displayed in the videos.\nVideo descriptions are available in many languages (Spanish, French, Polish… check the complete list here) and that is only possible thanks to the collaboration and interested work of many volunteers. To best serve the international community we've defined a translation workflow that allows any person, even with no technical background to help translate the descriptions.\nIf you want to collaborate, please read the details here.\nLicense\nMIT License",
        "sentiment": 0.04395762367828472
    },
    "article_14": {
        "title": "Writer Mark Twain excitedly bought a state-of-the-art typewriter in 1904 for $125, which, adjusted for inflation, is the cost of a top iMac today, $2600. Interesting how top personal tech stayed at this price level.",
        "body": "From the still-excellent Letters of Note, a scan of Mark Twain’s first correspondence typed on the Remington typewriter he bought in 1874. The note, written to his brother, expressed Twain’s hope that the machine would allow him to write more quickly in the near future.\nI love that the first line is just a bunch of gibberish — “BJUYT KIOP N LKJHGFDSA:QWERTYUIOP:_-98VX5432QW RT”. Twain (or his two-year-old daughter Susie) likely was just testing out the keys and instead of wasting the paper, started his correspondence below.\nIn a dictation taken in 1904, Twain recalled seeing and then buying the typewriter.\nNasby and I saw the machine through a window, and went in to look at it. The salesman explained it to us, showed us samples of its work, and said it could do fifty-seven words a minute — a statement which we frankly confessed that we did not believe. So he put his type-girl to work, and we timed her by the watch. She actually did the fifty-seven in sixty seconds. We were partly convinced, but said it probably couldn’t happen again. But it did. We timed the girl over and over again — with the same result always: she won out. She did her work on narrow slips of paper, and we pocketed them as fast as she turned them out, to show as curiosities. The price of the machine was $125. I bought one, and we went away very much excited. At the hotel we got out our slips and were a little disappointed to find that they all contained the same words. The girl had economized time and labor by using a formula which she knew by heart. However, we argued — safely enough — that the first type-girl must naturally take rank with the first billiard-player: neither of them could be expected to get out of the game any more than a third or a half of what was in it. If the machine survived — if it survived — experts would come to the front, by-and-by, who would double this girl’s output without a doubt. They would do a hundred words a minute — my talking-speed on the platform. That score has long ago been beaten.\nUpdate: In the letter, Twain states he paid $125 for the typewriter, which, according to this inflation calculator, is about $2600 in 2014 dollars, or a couple hundred dollars more than the starting price of the 27-inch 5K iMac. I would love to see the first letter written by Twain on one of those. (via @spsheridan)",
        "sentiment": -0.08158599228962608
    },
    "article_15": {
        "title": "Apple calls 2015 'most successful year ever' after making reported $234bn",
        "body": "Apple has more than $205bn of cash in the bank, the company revealed on Tuesday as its chief executive Tim Cook said the firm had made more than $234bn in 2015, making it its “most successful year ever”.\nThe California company now has more money in the bank than the Czech Republic, Peru and New Zealand make in gross domestic product (GDP) a year, according to World Bank statistics. Apple’s cash balances increased by $2.8bn in the last three months alone.\nApple sold 48m iPhones worth $33.2bn in its latest quarter – an increase of 36% on the same period last year and more than the total sales achieved by both Microsoft and Facebook over the same period.\nIts quarterly profit came in at $11.1bn, 31% more than in the fourth quarter of 2014. Sales were up 22% in the three months to 28 September to $51.5bn.\n“Today we’re reporting a very strong finish to a record-breaking year, ” Cook said. “We are heading into the holidays with our strongest product lineup yet.”\nApple, which is already the world’s most valuable company, worth $657bn, said predicted sales would increase further to between $75.5 and $77.5bn in its current quarter as only the first weekend of new iPhone 6S sales were captured in the previous three months.\n“We think we can grow iPhone (sales) during the December quarter,” chief financial officer Luca Maestri said. The average iPhone now sells for $670, an increase of $67 on the previous quarter.\nSales in China doubled compared to the same period last year, to $12.5bn, and some analysts predict that China could overtake the US to become Apple’s biggest market.\nWhile the iPhone continues to soar, iPad sales dropped for the seventh consecutive quarter and were down 20% compared to the 2014 fourth quarter. The company did not state how many Apple Watches it has sold.\nApple’s shares, which have fallen by about 15% from a peak of $133 in July, increased by 0.6% to $114.5o in after-hours trading in New York on Tuesday.",
        "sentiment": 0.10406881682574749
    },
    "article_16": {
        "title": "Apple Reiterates Inability to Unlock iOS Devices Running iOS 8 or Higher in New Court Filing",
        "body": "Apple this week informed a federal magistrate judge in Brooklyn, New York that it \"would be impossible\" for the company to access data on a locked iPhone running iOS 8 or later, reports Reuters. Apple was responding to a request from the judge, James Orenstein, to help him decide whether to fulfill a U.S. Justice Department request that would have forced Apple to help authorities gain access to a seized iPhone.\nApple's response is not a surprise, as it is the same thing the company has said several times in the past. Since iOS 8, Apple has stopped storing encryption keys for devices, making it impossible for the company to unlock iPhones and iPads under police request. Without an encryption key, Apple cannot bypass a passcode to gain access to an iOS device.\nIn a brief filed with the court, Apple said 90 percent of its devices are running iOS 8 or higher and are thus inaccessible. Apple is able to access the 10 percent of devices that continue to use iOS 7 or below, but the company told the judge that being forced to comply with the Justice Department's request could tarnish its brand.\n\"Forcing Apple to extract data in this case, absent clear legal authority to do so, could threaten the trust between Apple and its customers and substantially tarnish the Apple brand,\" Apple's lawyers wrote.\nApple's encryption changes, implemented in 2014 with iOS 8, have been unpopular with some law enforcement officials. FBI Director James Comey has expressed concern that encryption implemented by companies like Google and Apple lets people \"place themselves above the law.\"\nJust yesterday, Apple CEO Tim Cook told an interviewer encryption is a necessity and that software backdoors are unacceptable, reiterating Apple's long-standing opinion on the subject.",
        "sentiment": -0.5231964630498127
    },
    "article_17": {
        "title": "Over a million people have installed the app that moves you from Android to iOS",
        "body": "When Apple CEO Tim Cook repeatedly says that the iPhone 6 and then iPhone 6s are converting more Android users to iOS, many would wonder what that means and whether Apple is embellishing the numbers. “\n“We recorded the highest rate on record for Android switchers last quarter at 30 percent,” Cook said earlier this week after Apple had announced it sold more than 48 million iPhones during the period.\nBut it turns out there’s actually one way to measure whether there’s real interest in switching to iPhone and we need to look no further than the Google Play Store for proof.\nDON’T MISS: MIT scientists can see through walls and identify people with new wireless device\nBecause of the way the Google Play Store is built – or better said, because Google made it that way, to highlight the performance of apps – each app has an estimated number of app downloads. That’s something you don’t see in the App Store for any app.\nThanks to this feature, we’ve learned that popular mobile apps including Gmail and Facebook have passed 1 billion downloads on Android devices. Assuming that each download is unique, that means there are more than 1 billion Android devices in use, something Google confirmed a bunch of times. In fact, that number is now at 1.4 billon according to Google’s most recent estimate.\nEnter Move to iOS, Apple’s first Android app. The app was launched right around the iPhone 6s’ release and hardcore Android fans made sure to bomb it with crippling 1-star reviews. However, that doesn’t mean the app is not useful and that Android users don’t use it to move their data to iPhone.\nThe app’s specific purpose is to save your pictures, messages, contacts, bookmarks and Google data and then move it to the iPhone you just purchased. You won’t use it more than once on the same Android device. After all, you’re switching to iPhone. So that means that, no matter what reviews say, some of the savvy Android switchers will use it to move their data to iOS – unless they use their data backup systems.\nThat said, on October 29th, Google’s stats indicate that the Move to iOS app has been downloaded between 1 million and 5 million times (image above). As I just explained, these are likely unique installs for a one-time kind of usage. Now, I’ll note that on Wednesday afternoon the number was at between 500,000 and 1 million installs. That means, since yesterday, the number of installs moved past the 1 million mark.\nObviously, not all Android users who switch to iPhone install the app and not everyone who installs the app actually switches to the iPhone. But this is still a clear indication that plenty of people are interested in the new iPhones, and some of the ones that ditch Android for iPhone grab their data on the way out using Apple’s tool.\nSo yes, it appears that the iPhone is definitely stealing plenty of Android users, and Google can’t hide it.",
        "sentiment": -0.042374732099812136
    },
    "article_18": {
        "title": "Reactions to the original iPod announcement, 14 years ago today. Love it!",
        "body": "not that dissapointing\nThe reason why everyone's dissapointed is because we had our hopes up for this incredible device that would do everything you could possibly use the word \"digital\" in and most of the things you can't. The truth is that is really is revolutionary. 5 gigs? Where do you see 5 gigs in an Mp3 player?\nIf Apple had gone with something completely and utterly new, it would probably go down the hole that the cube and the newton went down... they were ahead of their time, and suffered because of it. Apple can't have another disaster like the Cube, so they decided to stay just a bit ahead of the game. As long as apple markets it effectively, I think it's gonna do really well.\nThe product really looks great, give it a chance guys!",
        "sentiment": -0.05390484677627683
    },
    "article_19": {
        "title": "Overcast 2.0 is out - Everything's free.",
        "body": "After a year of work, Overcast 2 is now available as a free update for everyone. It’s mostly a major under-the-hood improvement, with relatively few user-facing changes. But they’re pretty good, I think.\nAnd now, all features are free, and I’m trying a new business model.\nStreaming ☁️\nThe headlining feature of Overcast 2 is streaming. You can still download all episodes as you did before — I fixed some bugs there, too — but now, you have two more capabilities:\nStart playing any episode immediately and let it stream in, rather than waiting for it to completely download.\nOptionally set new episodes to stream instead of download, saving storage space.\nAnd with the new storage manager, you can see how much space your downloads are consuming for each show, and optionally delete the downloads and stream the episodes on demand.\nOvercast’s streaming engine is completely custom-written and designed for modern devices, the modern mobile internet, and the expectations of today’s customers, tightly integrated with Overcast’s custom audio engine to be as fast and efficient as possible.\nAnd, of course, Smart Speed and Voice Boost are always available, even when streaming. I wouldn’t have it any other way.\nAudio improvements\nEven if you don’t plan to use streaming, you’ll reap its benefits: converting the audio engine to a streaming architecture has made all playback faster to start, easier on battery life, more compatible, and more reliable. (And everyone wants to play an undownloaded episode right now sometimes.)\nSmart Speed and Voice Boost have also been quietly enhanced:\nSmart Speed is more efficient and now adapts dynamically to quieter voices.\nis more efficient and now adapts dynamically to quieter voices. Voice Boost tone has been subtly enhanced as I’ve gotten better at audio production techniques.\nQuite simply, it sounds a bit nicer.\nChapters 🇩🇪\nI was wrong. (Not for the first time.) Turns out that chapters are pretty nice. Don’t doubt the Germans.\nSocial directory\nOvercast’s podcast directory has always had a good search if you knew what you were looking for, but browsing was limited to very narrow editorial picks that I edited manually, badly, and infrequently. Since I sucked at that job, I fired myself and replaced me with someone far better: everyone else.\nNow, the directory categories are powered by recent recommendations by Overcast users. This is already surfacing far more diverse podcasts, and updating far more frequently, than I could ever offer as one person who mostly listens to tech shows.\nEverything else\nI’ve made lots of other changes and fixed a lot more bugs. Some of the highlights:\n3D Touch launch shortcuts (more 3D Touch coming soon)\n(more 3D Touch coming soon) Swipe actions on episode cells\non episode cells Icon badge option\noption Play Next By Priority option for playlist behavior\noption for playlist behavior A complete overhaul of the show-artwork architecture\nFaster, more reliable communication with the Apple Watch app (watchOS 2 port coming later)\nMoved to a new database layer that fixed tons of bugs, including some remaining sync bugs and the infamous playlist-reordering bug (sorry!)\nPlus too many smaller improvements to list here.\nMy crazy new business model\nOvercast has always been free up front to bring the best app to the most people. But I’m just one person, running this business the old-fashioned way, so it has to make money somehow.\nOvercast 1.0 locked the best features behind an in-app purchase, which about 20% of customers bought. This made enough money, but it had a huge downside:\n80% of my customers were using an inferior app. The limited, locked version of Overcast without the purchase sure wasn’t the version I used, it wasn’t a great experience, and it wasn’t my best work.\nWith Overcast 2.0, I’ve changed that by unlocking everything, for everyone, for free. I’d rather have you using Overcast for free than not using it at all, and I want everyone to be using the good version of Overcast.\nIf you can pay, I’m trying to make up the revenue difference by offering a simple $1 monthly patronage. It’s completely optional, it doesn’t get you any additional features, and it doesn’t even auto-renew — it’s just a direct way to support Overcast’s ongoing development and hosting without having to make the app terrible for 80% of its users.\nIf only 5% of customers become monthly patrons, Overcast will match its previous revenue.\nPatrons may get special features in the future if I can’t afford to offer something to everyone (due to hosting costs, etc.), but today, patronage is simply that: supporting Overcast directly, because you want to. And if you’d rather not, no hard feelings.\nThanks, and I hope you enjoy Overcast 2.",
        "sentiment": 0.049420326948165894
    },
    "article_20": {
        "title": "Apple Says Battery Performance Of New iPhone’s A9 Chips Vary Only 2-3%",
        "body": "Apple has addressed the spate of chatter about differences in performance between A9 chips used in its new iPhone 6s and 6s Plus. We’ve known for a while that some A9 chips were produced by TSMC and others by Samsung, a longtime Apple silicon partner.\nRecently, people have been pushing and prodding at devices using both chips, coming up with numbers that point to theoretical 50-minute differences in battery life.\nIn a statement to TechCrunch, Apple said that its own testing and data gathered from its customers after a few weeks with the device show that the actual battery life of both devices varies just 2-3%. That’s far, far too low to be noticeable in real-world usage.\nWith the Apple-designed A9 chip in your iPhone 6s or iPhone 6s Plus, you are getting the most advanced smartphone chip in the world. Every chip we ship meets Apple’s highest standards for providing incredible performance and deliver great battery life, regardless of iPhone 6s capacity, color, or model. Certain manufactured lab tests which run the processors with a continuous heavy workload until the battery depletes are not representative of real-world usage, since they spend an unrealistic amount of time at the highest CPU performance state. It’s a misleading way to measure real-world battery life. Our testing and customer data show the actual battery life of the iPhone 6s and iPhone 6s Plus, even taking into account variable component differences, vary within just 2-3% of each other.\nThough there have been a bunch of articles and videos about how much power one chip or the other uses, the tests have largely been what Apple calls ‘manufactured’. Basically, they are unrealistic machine-driven tests that do not and can not reflect real-world usage.\nThis is one reason why I only lightly rely on benchmarks in my reviews and try not to use unrealistic ‘pristine’ iOS installs in my own testing.\nYou know that opt-in dialog that asks if you’d like to share diagnostic info with Apple that you see when you install iOS? This real-world (anonymized) data comes from those customers. They’re seeing exactly how people are actually using their iPhones with their own apps — not how benchmarks power-drain them by running the CPUs at peak for sustained periods; something that is unlikely to happen in real-world situations.\nThe 2-3% difference Apple is saying it sees between the battery life of the two processors is well within its manufacturing tolerances for any device, even two iPhones with the same exact processor. In other words, your iPhone and someone else’s iPhone with the same guts likely vary as much as 3%, regardless of who made them.\nBasically, if you can tell the difference in real-world usage between the two processors, you should take a Voigt-Kampff test.\nWhether you, personally, are offended that your device is on the higher end of that tolerance is not for me to say. Doesn’t bother me, but it could bother you — but I would probably advise you not to let it.\nApple would not comment on why there were two different manufacturers for the A9 chips, but I can probably hazard a guess. For a start, couple the fact that the iPhone 6s and 6s Plus sold record numbers, but still remain in stock (in some sizes) in many stores with the fact that China was a day-one rollout this year. This points to higher production volumes than ever before, and likely a shortage of foundry/chip manufacturing facilities from a single vendor.\nTimothy Arcuri of Cowen and Company put out a report on the different A9 manufacturers, noting that it puts Apple in a position of strength going into the A10.\nIn this case, we believe that AAPL had planned to use Samsung for the initial wave of A9 builds, but also developed the TSMC solution as insurance against yield and allocation issues as it is the first [Apple] processor on FinFET. Given a host of issues including big differences in yields, AAPL was prepared to come to TSMC for more capacity allocation, if needed. … For AAPL, once yield issues are worked out, it will be in a great position to exert maximum pressure on each foundry in future capacity contracting. Barring the foundries pushing back (e.g., Samsung maybe bows out on A10?), this seems likely to continue going forward – especially since [Intel] desperately wants the [Apple] foundry business. This could open a window. With 10nm not available in time for the A10 launch, [Intel’s] 14nm offers a meaningful improvement in performance and power consumption over the TSMC and Samsung 16nm/14nm nodes as it uses a next-generation FinFET.\nSplitting its orders between two vendors likely makes sense for Apple for other reasons as well. It could, for instance, be dipping its extremities further into the TSMC waters when it comes to producing chips . If the TSMC chips are performing at about the same level as the Samsung chips (or even a bit better in some metrics), that’s a good thing for Apple because it reduces their reliance on Samsung, a (parent) company with which it competes when it comes to the end product that the Samsung silicon powers.\nThe big takeaway here shouldn’t be that there are a couple of percentage points of difference between the two bits of silicon, but that Apple has kept up with demand for the first time in forever — and that it is setting the stage for what could allow it more control over its chip design with less conflict.\nArticle updated to add context from analyst note.",
        "sentiment": -0.20504971500486135
    },
    "article_21": {
        "title": "DOJ: Apple owns your iPhone's software, so it should have a backdoor",
        "body": "The Department of Justice is trying to get Apple to unlock a defendant's iPhone. While Apple has stated that it can technically bypass the phone's passcode security, it has so far refused to do so for various reasons. So the DOJ has come up with a new strategy, force Apple to comply because it licenses the software on the phone. Because of that, the DOJ contends that the iPhone maker actually has a relationship with the phone that's currently evidence in a case. In a reply to Apple's response to the court order to unlock the phone, the government states, \"Apple cannot reap the legal benefits of licensing its software in this manner and then later disclaim any ownership or obligation to assist law enforcement when that same software plays a critical role in thwarting execution of a search warrant.\" In other words, it's your software Apple, not the defendant's, unlock it.\nThe government's strategy is a reaction to Apple's refusal to comply with a court order to unlock an iPhone 5s. In its response to the order Apple lawyers stated, \"forcing Apple to extract data in this case, absent clear legal authority to do so, could threaten the trust between Apple and its customers and substantially tarnish the Apple brand.\" It also noted that unlocking the phone would eat up resources and might not even yield any information. Plus, just for good measure, it would be impossible to circumvent the passcode of any iPhone running iOS 8 and later. The phone in question is running iOS 7.\nAs expected, the government isn't too happy about not having access to the phones of defendants. Apple CEO Tim Cook has been on a privacy crusade recently. He recently said that people have a, \"fundamental right to privacy.\" Cook has also insisted that the government does not have a backdoor into Apple's servers.\nTurn on browser notifications to receive breaking news alerts from Engadget You can disable notifications at any time in your settings menu. Not now Turned on Turn on\nAs Boing Boing points out, if the government succeeds with this argument, it opens up a terrifying precedent. Nearly every piece of technology has software that is licensed and not sold to the end user. All of those companies could be compelled to unlock, decrypt and allow the authorities access to these devices because it doesn't belong to the defendant, it belongs to the person that owns the software.",
        "sentiment": -0.5249246964721304
    },
    "article_22": {
        "title": "Tim Cook: \"Apple TV orders will kick off on Monday, October 26 with shipments beginning by the end of the week.\"",
        "body": "Apple CEO Tim Cook is on stage for the opening night of the WSJDLive conference in Palm Springs, California, with Wall Street Journal editor Gerry Baker interviewing Cook about a variety of topics. Live coverage of the interview is being offered by publications including WSJ.D and The Verge, and we'll be updating this post with highlights from the session.\n- On whether Apple wants to control every facet of our lives: Apple does very few products, and puts a lot of care into them, but Apple does want you to have a seamless experience throughout your home and work life.\n- Citing competitive reasons, Cook once again declines to share Apple Watch sales numbers. \"We shipped a lot the first quarter, then last quarter we shipped even more. And I can predict this quarter we will ship even more.\" Addressing Baker's skepticism about the device, Cook refers to customer satisfaction being \"off the charts.\"\n- Talking now about iPhone 6s and the iPhone Upgrade Program, Cook insists it's not meant to compete with carriers. It's simply a plan for people who want to get a new iPhone every year. Addressing the need to keep innovating on iPhone and whether Apple is on a two-year cycle as it appears to many people, Cook stresses all of the new features included on the iPhone 6s.\n- Cook says Apple Music has 6.5 million paying customers and 8.5 million more still on free trials. Cook stresses the human curation aspect of Apple Music and notes the company feels \"fantastic\" about customer uptake so far.\n- Regarding Apple TV, Cook sees it as a \"foundation\" for a new type of experience as Apple tries to fix the \"broken\" experience of watching television. With Apple TV, providers like HBO can sell directly to consumers. The current system of \"linear TV\" with channels needs to be \"brought up and modernized\" and apps will help do that.\n- Apple TV orders will kick off on Monday, October 26 with shipments beginning by the end of that week.\n- Baker asks about Apple's car project, but Cook hesitates to say much. He does admit that software becomes increasingly important, and that enables other shifts like electrification and autonomous control. But in the short term, Apple wants people to have the iPhone experience in the car. \"We'll see what we do in the future.\"\n- On the retail front, Cook notes Apple will have 40 stores in China by the end of next year, and China currently provided in the \"mid-20s\" percentage of Apple's revenue. Angela Ahrendts has also been focused on integrating online and in-store shopping experiences.\n- Cook and Baker talking about user privacy, with Cook giving his usual comments about how privacy is a key value for Apple but that the company believes it can still provide an excellent customer experience and services while maintaining that privacy. In response to a question about Apple's relationship to national security organizations, Cook says he is \"very\" comfortable with it and he shares the company's views that any software backdoors are unacceptable and encryption is a necessity. A rather tense debate about the tradeoff between privacy and national security ensues.\n- Final question of the interview is about Apple increasing its willingness to speak out on issues and take leadership roles, and Cook notes Apple has a \"responsibility to be a great global citizen.\" Cook points to the environment, human rights, and education as areas where it can lead. Cook says Apple has stepped up its efforts to \"leave the world better than we found it\" because \"government isn't working well.\" Cook says Apple isn't worried about alienating customers with its stances, noting the company isn't forcing its views on anyone, and he hopes people who may be upset with Apple's positions in these areas can still think Apple makes great products and respect Apple for making efforts to put its values into practice.",
        "sentiment": 0.3128701223060489
    },
    "article_23": {
        "title": "\"AdBlock\" extension for Safari and Chrome has been bought out by an undisclosed company for an undisclosed amount; now allows \"acceptable\" ads by default.",
        "body": "Owen was a reporter for TNW based in Amsterdam, now a full-time freelance writer and consultant helping technology companies make their word (show all) Owen was a reporter for TNW based in Amsterdam, now a full-time freelance writer and consultant helping technology companies make their words friendlier. In his spare time he codes, writes newsletters and cycles around the city.\nAdblock, a popular extension for blocking advertising in Chrome and Safari with more than 40 million users, was quietly sold today.\nThe extension displayed a popup on October 1 saying that it is now allowing EyeO’s acceptable advertising — which allows advertisers to buy their way onto the whitelist — through the filter.\nhttps://twitter.com/aahaworth/status/649702548358701056\nBuried in the bottom of that message, however, was a more notable change: Adblock has been sold.\nWhat’s strange is that the company won’t disclose who it’s been sold to, why it was sold, or how much it was sold for.\nFor the extension’s claimed 40 million users this raises an interesting question: Can the extension continue to be trusted if the new proprietor is entirely anonymous?\nTNW contacted Adblock’s remaining staff to ask if they’d disclose the buyer but the company refused, saying that the purchaser had specifically asked not to be named.\nThe only thing the team would tell us is that the tool’s creator Michael Gundlach will no longer have any relationship with the company — that probably means he’s cashed out.\nAdblock’s previous director, Gabriel Cubbage, is now running things under the new owner.\nSince its launch in 2009, Adblock featured a screen that pushed users to pay for the use of the extension because it was classed as “honor-ware.” An ironic gesture, considering its existence technically deprives others of money.\nGundlach worked full time on Adblock after he quit his job in 2011, able to survive on the proceeds of donations from users prompted to ‘gift’ money toward the development when installing the extension.\nWhat’s interesting is six months ago Adblock changed its name suddenly to BetaFish Adblocker, claiming it was an “experiment.”\nBetaFish is the name of Gundlach’s holding company that owned Adblock and around the same time had applied for a US trademark on the word ‘Adblock.’\nSupport staff claimed five months ago that the company was not being purchased by someone or preparing for participation acceptable ad program, but the move may have pre-empted today’s deal.\nThe name was later changed back to simply ‘Adblock’ without further explanation.\nThe sale comes at an interesting time for publishers as the debate rages over whether adblocking will become widespread, as Apple has allowed iOS user to block ads on their mobile devices for the first time.\nFor users of Adblock, the uncertainty over ownership of the Adblock extension is a reasonable concern, particularly if the new buyer has any sort of agenda with the purchase of the extension.\nWhy would they keep their identity secret, if it’s a legitimate deal? It’s possible that the new owner simply wants to sit back and let the cash roll in, or was looking for a way to gain back some control.\nWe’ve contacted Michael Gundlach for further comment on the sale and secrecy, but haven’t heard back at time of writing.",
        "sentiment": -0.5721319378776983
    },
    "article_24": {
        "title": "Boot Camp 6.0 on El Capitan no longer requires you to use a USB flash drive to install Windows",
        "body": "To see this page, you must enable JavaScript.\nPour afficher cette page, vous devez activer JavaScript.\nZur Anzeige dieser Seite müssen Sie JavaScript aktivieren.\nこのページを表示するには、JavaScript を有効にする必要があります。\n若要查看此页面，您必须启用 JavaScript。\nOm deze pagina te kunnen bekijken, moet JavaScript zijn ingeschakeld.\nPer visualizzare questa pagina, devi abilitare JavaScript.\n이 페이지를 보려면 JavaScript를 활성화해야 합니다.\nPara ver esta página, debe activar JavaScript.\n若要檢視此頁面，您必須啟用 JavaScript。\nلمشاهدة هذه الصفحة، يجب عليك تمكين JavaScript.\nPara visualizar esta página, você precisa ativar o JavaScript\nDu skal slå JavaScript til for at kunne se denne side.\nJos haluat nähdä tämän sivun, sinun on otettava JavaScript käyttöön.\nDu må aktivere JavaScript for å vise denne siden\nAby wyświetlć tę stronę, musisz włączyć JavaScript.\nPara poder ver esta página, tem de activar o JavaScript.\nДля просмотра этой страницы необходимо включить JavaScript.\nOm du vill se den här sidan måste du aktivera JavaScript.\nในการดูหน้านี้ คุณต้องเปิดใช้งาน JavaScript\nBu sayfayı görmek için JavaScript’i etkinleştirmeniz gerekir.\nPer veure aquesta pàgina heu d’activar JavaScript.\nZa prikaz ove stranice, trebate omogućiti JavaScript.\nChcete-li zobrazit tuto stránku, musíte zapnout JavaScript.\nΓια την εμφάνιση αυτής της σελίδας, πρέπει να ενεργοποιήσετε την JavaScript.\nכדי לראות עמוד זה, עליך להפעיל את JavaScript.\nAz oldal megtekintéséhez engedélyeznie kell a JavaScriptet.\nUntuk melihat halaman ini, Anda harus mengaktifkan JavaScript.\nUntuk melihat halaman ini, anda mesti mendayakan JavaScript.\nPentru a vedea această pagină, trebuie să activați JavaScript.\nAk chcete zobraziť túto stránku, musíte povoliť JavaScript.\nЩоб переглянути цю сторінку, потрібно ввімкнути JavaScript.\nĐể xem trang này, bạn phải bật JavaScript.\nPër të parë këtë faqe, duhet të aktivizoni JavaScript.\nЗа да видите тази страница, трябва да разрешите JavaScript.\nSelle lehe nägemiseks peate lubama JavaScripti.\nLai redzētu šo lapu, jāiespējo JavaScript.\nNorėdami matyti šitą puslapį, turite įgalinti „JavaScript“.\nZa ogled te strani morate omogočiti JavaScript.\nLorem ipsum dolor sit amet, consectetur adipiscing JavaScript.\n若要瀏覽此網頁，請先啟用 JavaScript。\nइस पृष्ठ को देखने के लिए, आपको JavaScript सक्षम करना होगा।\nБұл бетті көру үшін JavaScript тілін қосуыңыз керек.",
        "sentiment": 0.15211238350187029
    }
}