{
    "article_0": {
        "title": "Apple Is Buying Up 36,000 Acres Of Forest To Preserve It",
        "body": "Apple is partnering with an environmental nonprofit to purchase roughly 36,000 acres of private forestland, which will be sustainably harvested and used in Apple's packaging.\nThe land — two tracts in Maine and North Carolina that, combined, are roughly two and a half times the size of Manhattan — will be managed by The Conservation Fund. This land is part of an estimated 45 million acres of private forest in the U.S. that are in danger of being lost to development.\n\"Apple wanted to work with an organization that had the ability to acquire and manage these forests, and we're thrilled about this partnership,\" Larry Selzer, The Conservation Fund's president, told BuzzFeed News. \"Apple is doing something unprecedented here.\"\nThough Apple will harvest pulp from these forests, other companies will also be able to buy fiber from them as well. Selzer's organization will manage the forests under the \"working forest\" model, in which trees are harvested with what Daniel Brindis, a senior Forests Campaigner with Greenpeace, described to BuzzFeed News as \"an eye toward the long-term economic well-being of the forest.\"\nBrindis said that, generally speaking, working forests are \"an improvement over clear-cutting — but that doesn't mean they're a panacea.\"\n\"There are a lot of elements about what makes forest use responsible,\" he continued, and simply purchasing forestland doesn't necessarily mean a company (or in this case, a nonprofit) will manage it correctly.\nEven so, Lisa Jackson, Apple's vice president of environmental initiatives and former administrator of the U.S. Environmental Protection Agency, told BuzzFeed News that the company managing its own supply chain — rather than buying pulp from outside vendors — represents a massive step forward.\n\"Imagine if every time you opened a package from a company you knew that it came from a working forest. And imagine if companies took seriously their paper chain and made sure that was renewable, just like energy. And imagine if they didn't just buy renewable paper, but took the step of ensuring that they would stay working forests forever.\"\nApple declined to say how much paper it uses in its packaging, but the company does sell hundreds of millions of iOS devices a year, each of which comes in a paper package that's composed of about one-third nonrecycled fiber. According to Jackson, the paper produced by these two forests is equivalent to nearly half the virgin — that is, nonrecycled — fiber that went into Phone, iPad, iPod, Mac and Apple TV packaging last year. \"Where we want to get, of course, is 100 percent,\" said Jackson.\n\"We feel a deep responsibility to take real action and make sure we're addressing our own footprint, \" Jackson said. \"And if we take the approach of just buying sustainably sourced paper, we're not making the world a better place — we're zeroing out. Apple has been really clear that we want to leave the world better than we found it; that's one of our values.\"\nIndeed, this move comes at a moment at which Apple appears to be considering more deeply than ever before its social impact. Just last month, CEO Tim Cook penned an op-ed in the Washington Post decrying Indiana's Religious Freedom Restoration Act; as BuzzFeed's John Paczkowski noted at the time, \"Cook's call for social progress is now Apple's as well.\"\nAnd Apple has been focused on environmental issues in particular for years. The company's US facilities — stores, offices, data centers, you name it — are powered completely by renewable energy; Apple has also cut down on its use of conflict minerals and recently announced that it was building an $848 million solar farm in California. Just four years after ranking Apple dead last in a roundup of internet companies' carbon footprints, Greenpeace argued in February that \"other Fortune 500 CEOs would be well served to make a study of Tim Cook.\"\nJackson came to Apple in 2013 after serving as the director of the EPA under the Obama administration, and she spoke highly of Apple's commitment to her and the initiatives she oversees. \"I definitely feel like this company is stepping up to the plate and swinging for the fences in terms of not just being responsible, but using our voice,\" Jackson said.\nIn her view, Apple — with its massive market share, international visibility, and ability to set trends of all kinds — is particularly well-suited to chart a course for other companies considering their impact on the paper supply chain.\n\"We believe that we have a responsibility to lead in this area,\" said Jackson. \"Tim has said over and over that there are certain places where we can lead. And if other companies take this approach, that's great.\"\n\"There are some ideas,\" Jackson added, \"that we don't mind people copying.\"",
        "sentiment": 0.5107617049267695
    },
    "article_1": {
        "title": "Apple bans selfie sticks from WWDC",
        "body": "Now we know where Apple stands on the ever-controversial topic of selfie sticks.\nThe company has a clear message for people planning to attend its World Wide Developers Conference in June: leave those selfie sticks at home.\nApple announced Tuesday that tickets are now on sale for its WWDC event, which (for $1,599) gives developers access to five days of sessions, labs and special events around building software for iOS and the Mac. But hidden in its registration and attendance policy notes -- as first spotted by Chris Welsh -- is a gem of a request to not use selfie sticks or similar camera accessories while at the event, as well as e-cigarettes.\nCredit: Apple\n\"You may not use selfie sticks or similar monopods within Moscone West or Yerba Buena Gardens,\" the rules say. \"Solicitation or selling of items or services is not allowed at WWDC. Any attendee conducting these activities may be removed from WWDC. Smoking (including e-cigarettes) is not permitted anywhere inside Moscone West.\"\nApple added that attendees are not allowed to make audio recordings or take professional photos or video at the conference.\nThe event kicks off on Monday, June 8, and runs until June 12.",
        "sentiment": -0.37903379593044517
    },
    "article_2": {
        "title": "$20,000 gold Apple Watch Edition sold out in China in less than an hour",
        "body": "The Apple Watch Edition. Apple\nThe Apple Watch Edition has already sold out in China — and it took less than an hour for the most luxurious gold version of the device, which reportedly costs 126,800 yuan ($20,000), to get completely snapped up.\nApple on Friday put the Apple Watch Sport, Apple Watch, and Edition up for preorder in the US, UK, Australia, Canada, France, Germany, Hong Kong, Japan, and China. Customers can now try on and buy the watches, but the company says people will not get them until weeks later in the UK — elsewhere, it could be longer. Relatively few will actually walk out of shops wearing their new accessory.\nJust hours into sales in China, there was zero chance of grabbing an Apple Watch Edition, the most exclusive version. Author Ben Thompson tweeted that he had checked every store there and at every one the device was listed as out of stock, but it remains unclear just how many units have been sold and shipped on Friday.\nThe tweet was first spotted by Cult of Mac. Many people who lined up thousands to spend on the product, at least for now, will be bitterly disappointed.\" data-analytics-module=\"body_link\" rel=\"\">\nAs Cult of Mac points out, sales are expected to be big in the world's most populous country, which is known for its love of gadgetry and luxury items. But it appears that despite mixed reviews, every country in which the Apple Watch is available will be quick to snap the gadgets up. Within the first 10 minutes in the US, shipping times were pushed back from the original April 24 availability date to four to six weeks.\nTwo reporters from Business Insider UK have appointments for Watch purchases Friday morning, so stay tuned on this page for updates.",
        "sentiment": -0.38863817358819336
    },
    "article_3": {
        "title": "Apple: 'We don’t want to debate climate change. We want to stop it.'",
        "body": "Apple is continuing to take a strong stance against climate change, writing in its newly released 2015 Environmental Responsibility Report, \"We don’t want to debate climate change. We want to stop it.\" This is framed as a major piece in Apple's reasoning for turning to more environmentally sustainable practices when it comes to use of power and materials. \"We’ve made real progress in reducing the impact of the things we control directly — our offices, retail stores, and products,\" Apple writes. \"But there’s still a lot of work to be done to reduce the carbon footprint of our supply chain. And it’s our responsibility to lead that effort.\"\nThe 2015 report, which covers Apple's 2014 fiscal year, shows Apple continuing to move closer to its goal of using entirely renewable energy to power its operations. All of Apple's US operations are now powered with renewable energy, and 87 percent of its global operations are now renewable. The weak link appears to be Apple's retail stores, as it says that all data centers and offices are already on renewable power.\nApple intends to get all of its paper from sustainable sources\nThe other highlight in Apple's 2015 report is its new focus on reducing harmful usage of paper. It's working with The Conservation Fund, an environmental nonprofit, to begin sourcing product packaging from forests certified as being sustainably managed or controlled wood sources. In 2014, Apple says that 80 percent of the paper and cardboard used for packaging iPhones, iPads, iPods, Macs, and the Apple TV was sourced from responsible forests. Its goal is to reach 100 percent.\nApple announced its partnership with The Conservation Fund last week, saying then that they were working together to protect \"over 36,000 acres of working forest.\" Paper will still be sourced from those forests, but the intention is to do so in a way that allows the environment to thrive nonetheless — Apple says that it amounts to providing \"permanent environmental protection\" for those forests. \"For Apple, this is the beginning of a worldwide effort, one that represents a new approach as it reassesses its impact on the world’s paper supply chain,\" Lisa Jackson, Apple's environmental chief, wrote.\nThe environmental impact report was released alongside a new video this morning, also speaking to Apple's commitments and progress on sustainability. Minimizing Apple's negative impacts on the environment has been an increasingly prominent goal under CEO Tim Cook, and videos like these show how Apple is packaging that focus into a product as much as anything that the company would sell. That's nothing to complain about: Apple's outspoken stance on climate change makes it a potentially strong ally for environmentalists to have on their side.",
        "sentiment": 0.24536403989125238
    },
    "article_4": {
        "title": "Original reactions to the 2007 iPhone announcement",
        "body": "The Apple iPhone\nCapping literally years of speculation on perhaps the most intensely followed unconfirmed product in Apple's history -- and that's saying a lot -- the iPhone has been announced today. Yeah, we said it: \"iPhone,\" the name the entire free world had all but unanimously christened it from the time it'd been nothing more than a twinkle in Stevie J's eye ( comments, Cisco? ). Sweet, glorious specs of the 11.6 millimeter device (that's frickin' thin, by the way) include a 3.5-inch 480 x 320 touchscreen display with multi-touch support and a proximity sensor to turn off the screen when it's close to your face, 2 megapixel cam, 4GB or 8 GB of storage, Bluetooth 2.0 with EDR and A2DP, WiFi that automatically engages when in range, and quad-band GSM radio with EDGE. Perhaps most amazingly, though, it somehow runs OS X with support for Widgets, Google Maps, and Safari, and iTunes (of course) with CoverFlow out of the gate. A partnership with Yahoo will allow all iPhone customers to hook up with free push IMAP email. Apple quotes 5 hours of battery life for talk or video, with a full 16 hours in music mode -- no word on standby time yet. In a twisted way, this is one rumor mill we're almost sad to see grind to a halt; after all, when is the next time we're going to have an opportunity to run this picture ? The 4GB iPhone will go out the door in the US as a Cingular exclusive for $499 on a two-year contract, 8GB for $599. Ships Stateside in June, Europe in fourth quarter, Asia in 2008.\nRecent Posts\nPlease keep your comments relevant to this blog entry. Email addresses are never displayed, but they are required to confirm your comments.\nWhen you enter your name and email address, you'll be sent a link to confirm your comment, and a password. To leave another comment, just use that password.\nTo create a live link, simply type the URL (including http://) or email address and we will make it a live link for you. You can put up to 3 URLs in your comments. Line breaks and paragraphs are automatically converted — no need to use or tags.",
        "sentiment": -0.04063752622288816
    },
    "article_5": {
        "title": "Tim Cook: Apple employees will get 50% off Apple Watch, 1000+ apps submitted",
        "body": "Apple CEO Tim Cook today sent out a memo to all employees ahead of the Apple Watch’s retail try-on kickoff this Friday. Cook thanks employees who have worked on the Apple Watch by saying, “congratulations to everyone who has worked so hard for years to help this product reach our customers.” Cook also prepares the company’s retail division by noting that try-ons will begin in over 400 Apple Stores on Friday ahead of the official Friday, April 24th launch…\nLikely to the delight of Apple employees, Cook also announced major Apple Watch discounts for all employees: 50% off the aluminum sport and stainless steel models and $550 off of the gold Edition variations. By comparison, the iPad was not immediately offered at discount for employees, while the original iPhone was provided for free to a large percentage of the company. The special pricing for employees lasts for 90 days, starting on Friday, which is when general Apple Watch pre-orders begin. Commenting on the reduced price, Cook told employees that “we want you to share in that experience right alongside [customers].”\nCook also told employees that “more than one thousand apps were submitted in just four days last week when the App Store started accepting them, and the rate of submissions has only been climbing since then.” Apple started accepting Apple Watch app submissions last week. Apple has already previewed several Apple Watch applications on its website and during the March Apple Watch keynote presentation, which will be available to download via the Apple Watch Companion app.\nThe full memo from Cook to employees can be read below:\nTeam, The day we’ve all been waiting for is almost here: Apple Watch is ready to ship. Our retail stores are training for a whole new way to engage customers and help them experience Apple’s most personal product yet. On Friday, in over four hundred stores across four continents, we’ll open our doors to people who want to try on Apple Watch for the first time and start deciding which one is right for them. Tens of millions of people have seen our keynotes and demonstration videos about the watch, and there’s much more to come. Some of the most innovative developers in the world are working on new experiences designed specifically for Apple Watch. More than one thousand apps were submitted in just four days last week when the App Store started accepting them, and the rate of submissions has only been climbing since then. I know that many of you have been looking forward to choosing an Apple Watch for yourselves, and we want to make it easy for you. Starting Friday, in countries where the watch is available for pre-order, a special Employee Purchase Plan will offer a 50% discount on any Apple Watch or Apple Watch Sport for your personal use. As we introduce the watch in more countries, the special pricing for employees will be offered in those countries as well. Discounts will begin at pre-order and last for 90 days after availability. AppleWeb has more details, so I invite you to check it out. Our products enrich people’s lives like no others, and we think Apple Watch is going to delight our customers in ways people can’t yet imagine. We want you to share in that experience right alongside them. Congratulations to everyone who has worked so hard for years to help this product reach our customers. And thanks in advance to the thousands of retail employees around the world who will start placing it on people’s wrists starting Friday. Tim\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.3451225935266568
    },
    "article_6": {
        "title": "Apple Watch review: A day in the life",
        "body": "Apple tells me that upcoming software updates will address these performance issues, but for right now, they’re there, and they’re what I’ve been thinking about every morning as I get ready for work. Wearing a smartwatch like the Apple Watch is a far deeper commitment than carrying a smartphone in your pocket; you are literally putting the technology on your body and allowing it to touch and measure you while you display it to the rest of the world. Committing to technology that’s a little slow to respond to you is dicey at best, especially when it’s supposed to step in for your phone. If the Watch is slow, I’m going to pull out my phone. But if I keep pulling out my phone, I’ll never use the Watch. So I have resolved to wait it out.\nI’m putting my phone in my pocket and this Watch on my wrist, and we’re taking this trip together.\nThese mornings have been full of self-reflection, moody contemplation as I gather my screens of all sizes and pack them in a bag, work alerts flashing across an array of devices that are all less important than my phone. I love my phone. Everyone loves their phone. The only real question a smartwatch like the Apple Watch needs to answer is “why would I use this instead of my phone?” The answers so far haven’t been apparent; the Watch seems like it can do a little bit of everything instead of one thing really well. So I’m putting my phone in my pocket and this Watch on my wrist, and we’re taking this trip together.\nWe are going to need more coffee.\nAs an object, it makes sense that the Watch is not nearly as cold and minimal as Apple’s recent phones and tablets and laptops. It has to be warmer, cozier. It has to invite you to touch it and take it with you all the time. Take the bands off and it’s a little miracle of technology and engineering and manufacturing, a dense package containing more sensors and processing power than anyone could have even dreamed a few decades ago. It’s a supercomputer on your wrist, but it’s also a bulbous, friendly little thing, far more round than I expected, recalling nothing quite so much as the first-generation iPhone. It is unbelievably high tech and a little bit silly, a masterpiece of engineering with a Mickey Mouse face. It is quintessentially Apple.\nIt’s also surprisingly heavy. I noticed when I was wearing it, and everyone who held it commented on the weight. That might simply be a function of how unfamiliar watches have become; my stainless steel Apple Watch with leather loop band weighs 2.9 ounces, which is more than my plastic Nixon’s 1.7 ounces or the 1.8-ounce Moto 360, but much less than my 5-ounce Baume and Mercier. All in all, the Apple Watch isn’t light enough to fade away, but it’s also not so heavy that it’s a distraction.\nOn the right side of the Watch you’ll find the Digital Crown scroll wheel and a dedicated button (the official name is just “side button”) that opens your favorites list with one tap and activates Apple Pay with two taps. This side button is extraordinarily confusing — it looks and feels so much like an iPhone sleep / wake button that I still hit it to turn the screen on and off, even though I know I’m doing the wrong thing.\nOn the back of the Watch, there’s a slight dome that holds the optical heart rate sensor and the inductive charging system. You’ll also find a pair of buttons that release the watchbands. They’re flush with the case but relatively easy to depress, and the bands slide right out. You can make the Watch work in basically any orientation you’d like by flipping the screen with a setting in the iPhone app — a boon for the left-handed. It’s a fairly simple system, so expect to see tons of third-party Watch bands; Apple says it has no problem with that.",
        "sentiment": 0.10531940741930157
    },
    "article_7": {
        "title": "Apple: ‘We do not accept fart apps on the Apple Watch’",
        "body": "Those of you who were hoping the Apple Watch would usher in a new era of flatulence apps, prepare to be disappointed: Apple has already rejected the first app that serves no purpose other than to allow people to make fart sounds from their wrist.\nBack in March, we reported on Fart Watch, the first Apple Watch fart app. Like a glorified whoopee cushion, the idea was that you put your iPhone underneath someone’s seat cushion, then used your Apple Watch as a remote to let a fart rip by pushing a big blinking “Fart” button on your wrist.\n“Sadly,” it appears that Fart Watch, and by extension other farting apps, are not welcome on the App Store. The developer of Fart Watch reached out to us to let us know that Apple had rejected his app, for the following reasons:\n2.11 – Apps that duplicate Apps already in the App Store may be rejected, particularly if there are many of them, such as fart, burp, flashlight, and Kama Sutra Apps 8.1 – Apps must comply with all terms and conditions explained in the Guidelines for Using Apple Trademarks and Copyrights and the Apple Trademark List 2.11 Details We noticed that your Apple Watch app is primarily a fart app. We do not accept fart apps on Apple Watch.\nNot that the world needs another farting app, but it’s surprising to see Apple taking such a strong stance on the matter when there are so many fart apps on the iPhone. Then again, it’s hard to sell something like the Apple Watch as a luxe fashion accessory when celebrities like Pharrel and Beyoncé are using their Apple Watches to fart on command.\nIn the meantime, the developer of Fart Watch says he is already planning another Apple Watch business: WatchPops, a type of bling for your Apple Watch strap. You can sign up to be notified when it launches here.",
        "sentiment": -0.46120984144508836
    },
    "article_8": {
        "title": "iPhone Killer: The Secret History of the Apple Watch",
        "body": "In early 2013, Kevin Lynch accepted a job offer from Apple. Funny thing about the offer: It didn’t say what he would be doing. So intense is Apple’s secrecy that all Lynch knew was his vague title, vice president of technology, and that he’d be working on something completely new. ¶ It was odd that Apple even offered him a job. During his eight years at Adobe, most recently as chief technology officer, he was best known as the only person dumb enough to publicly fight Steve Jobs over the iPhone’s lack of support for Flash videos. When Lynch announced his move, the reaction was immediate: They want this guy? Apple blogger John Gruber called Lynch “a bozo, a bad hire.”\nKevin Lynch was responsible for turning the Watch from an idea into a product. Photo by: Riccardo Vecchio\nLynch had a lot to prove—and, apparently, a lot to do. When he showed up at 1 Infinite Loop on his first day, he was instructed to skip the usual new-employee orientation. His boss at the time, hardware czar Bob Mansfield, said to head straight to the design studio and get to work. He could learn about his 401(k) later.\nAs soon as he walked into the studio, he found out the project he’d been hired to run was already on deadline. In fact, it was behind schedule. There was a design review in two days, he was told, with the Apple brass. Lynch had better be ready.\nThere were no working prototypes; there was no software. There were just experiments—the iPod crew had made something with a click wheel—and lots of ideas. The expectations, however, were clear: Apple’s senior vice president of design, Jony Ive, had tasked them with creating a revolutionary device that could be worn on the wrist.\nIt was either hubris or an entirely justifiable expectation. Or both. After all, over the past 15 years, Apple has upended three major categories of consumer electronics and, in the process, become the most valuable company on Earth. There were MP3 players before the iPod, but Apple made you want one. The iPhone transformed the smartphone from business gear into pop culture. The iPad brought tablets in from the fringes, blowing past years of work by the likes of Nokia and Microsoft. For its fourth act, Apple chose a watch. This was to be the next step in a dynasty—the first without the guidance of Steve Jobs. Expectations and scrutiny would be impossibly high; the watch had to be, in the company’s parlance, insanely great.\nNo pressure, Kevin.",
        "sentiment": -0.11358252161278806
    },
    "article_9": {
        "title": "HBO NOW standalone streaming service debuts on Apple TV with 30-day free trial",
        "body": "HBO’s new standalone streaming service called HBO NOW has officially launched on Apple TV, iPhone, and iPad. HBO NOW allows subscribers to watch the premium network’s movies and TV shows online. The service is similar to Netflix as it’s delivered over a high-speed Internet connection rather than cable or satellite and doesn’t require long-term committments through contracts. Here’s how to get HBO NOW works:\nHBO NOW is available at launch exclusively through the App Store and Apple TV. This means movies and TV shows can be watched through the channel with the HBO NOW app for iPhone, iPad, and iPod touch or on your HDTV with a connected Apple TV using the HBO NOW channel. Once you subscribe to HBO NOW through Apple from any of those devices, you can also watch content online through hbonow.com with your Mac or presumably any other PC.\nHBO NOW differs from HBO GO, which has long been available on the App Store, Apple TV, and web. NOW subscribers pay a platform partner like Apple a monthly access fee, while GO is HBO’s complementary streaming service available to cable or satellite subscribers that pay for the HBO package as an add-on service.\nThe Apple TV channel for HBO NOW is a separate channel from the previously available HBO GO channel. Accessing the channel prompts you with a 1-month free trial offer. an HBO ID is created based on the email address you choose. After the free trial, iTunes will bill you monthly for $14.99.\nAfter you create an HBO NOW account and start the service, you can view HBO NOW online from your Mac at hbonow.com. HBO NOW can be viewed from multiple devices for viewing simultaneous streams.\nOriginal series available on HBO include popular shows like Game of Thrones, Girls, Last Week Tonight with John Oliver, Real Time with BIll Maher, Silicon Valley, Veep, and VICE. HBO also features dozens of recently released movies and a large catalog of other popular movies.\nThe standalone subscription to HBO NOW goes for $14.99 per month, and Apple is providing a 1-month free trial to new subscribers at launch as part of the promotion. HBO NOW for Sling TV is coming while Optimum broadband subscribers can also order the standalone service through their Internet service.\nHBO says the standalone subscription service will be available from more partners on more platforms (presumably Android) in the future. The HBO NOW channel is available on the latest Apple TV, and the HBO NOW app is now available for iPhone, iPad, and iPod touch through the App Store.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.020909332077611576
    },
    "article_10": {
        "title": "My fake Apple Watch arrived on the same day as my real one",
        "body": "The Apple Watch is the most anticipated new gadget in a very long time, and getting one on launch day—April 24—was extremely difficult, even if you happened to pre-order one within minutes of its availability. I was lucky enough to have not one, but two Apple Watches show up at my door.\nThe only problem is that one of them is fake.\nMike Wehner\nOn Friday, UPS dropped off a surprisingly heavy, rectangular box mid-afternoon. Inside it was a long white box, and inside that was my 38mm Apple Watch Sport. Without getting into a full review of Apple’s new smartwatch—there will be plenty of time for that in the coming days—I’ll simply say that it’s a really cool gadget and I’ve greatly enjoyed my time with it thus far.\nMike Wehner\nA few hours after the arrival of the Apple Watch, my wife arrived home and brought a package in from the mailbox. It was covered in silver plastic, clear tape, and Chinese writing, and the shipping tag said it came from Bao’an, Shenzhen, China. She asked me if I had ordered “a brick of heroin,” and given the appearance of the package I couldn’t blame her. The customs slip listed the contents of the package as “iPhone case” with a declared value of $10, but that’s not what was actually inside.\nMike Wehner\nAfter unwrapping the plastic and forcing myself through the strange, musty smell of the unmarked cardboard box, I discovered what was actually inside. It was a counterfeit Apple Watch.\nMike Wehner\nThe story of how I came to own this forgery isn’t particularly remarkable: In early March, just as the hype around Apple’s new wearable was reaching a fever pitch, I found a Taiwanese seller who claimed to be selling the Apple Watch for immediate shipment. There was no size option or “collection” to choose from, just four colors, so I selected one and placed an order. It cost me the equivalent of roughly $53, and while I knew the watch that eventually arrived wouldn’t be anything impressive, I was nonetheless curious about just how bad it would be. Now I know.\nMike Wehner\nThe copy came in a very generic box. On the front was a photo of the Apple Watch, along with the label “Smart Watch.” In the manual, which is more like a small slip of paper with some very poorly translated English on it, the watch is called “AW08,” which I can only guess is short for “Apple Watch.” Inside, the watch was crammed into a small plastic bag, and below it was a short USB charging cord and the aforementioned manual.\nMike Wehner\nThe watch had a large sticker on the front that mimicked the look of the actual Apple Watch, which I got a good laugh at. After removing the sticker and charging the watch—it arrived completely dead, of course—it started up with an ear-splitting beep.\nMike Wehner\nThe device is, as you can probably guess, not quite as advanced as the watch Apple is selling. There are no apps to speak of—the app display screen that has become a trademark of the Apple Watch is just a static image on the Chinese fake—only a set of 12 circular icons that represent typical smartwatch functions such as messaging, voice call, pedometer, phonebook, music player, and reminders.\nMike Wehner\nThere’s just a handful of watch faces, most of which are lifted straight from promotional imagery of the Apple Watch, like the butterfly face. Of course, on the fake watch it’s nothing more than a still photo.\nMike Wehner\nAs far as build quality goes, it’s very clearly just a chunk of painted plastic. The crown wiggles and doesn’t turn more than half a revolution, and the touchscreen, while quite responsive, is painfully low-resolution.\nMike Wehner\nTo its credit, the functions of the fake actually do work as advertised. You can take calls, make calls, send messages, get email, and even stream music from your iPhone right to the watch.\nA curious bonus “feature” is that the watch basically takes over all audio from the iPhone, including keyboard clicks and screen lock sounds. As I typed out a text message on my iPhone on Friday night, the Chinese forgery was producing all the key clicks and other effects. My wife found this very amusing.\nMike Wehner\nAs I’ve only had it for about a half of a day, I can’t definitively speak to its longevity, but the AW08’s documentation claims a battery life of as long as 160 hours. While that’s likely a huge exaggeration, I wouldn’t be surprised to see it double or even triple the battery life of the actual Apple Watch, if only because the impostor barely does anything at all and therefore has far more modest power demands.\nI’m sure this goes without saying, but I’ll be sticking with the real deal from here on out. Still, I imagine the Chinese copy will make a wonderful prank gift once Christmas rolls around.\nPhotos by Mike Wehner",
        "sentiment": -0.24176342070505424
    },
    "article_11": {
        "title": "Apple launches iOS 8.4 beta with revamped music service",
        "body": "Apple has just released the first iOS 8.4 beta, which includes Apple’s upcoming revamped Music app. The seed for developers is available via the Apple Developer Center website.\nAs we reported earlier this year, iOS 8.4 includes an all new Music application. The new software design is present in this beta, while Apple is expected to announce the streaming service component in June at WWDC.\nHere are the release notes from Apple for the new app:\n– All-New Design. Music app has a beautiful new design that makes exploring your music collection easier and more fun. Personalize playlists by adding your own image and description. Enjoy stunning pictures of your favorite artists in the Artists view. Start playing an album right from the album list. The music you love is never more than a tap away.\n– Recently Added. Albums and playlists you’ve recently added are now at the top of your library, making it effortless to find something new to play. Simply tap play on the artwork to listen.\n– Streamlined iTunes Radio. Discovering music with iTunes Radio is easier than ever. You can now quickly return to your favorite stations in Recently Played. Choose from a selection of hand-curated stations in Featured Stations, or start a new one from your favorite artist or song.\n– New MiniPlayer. With the new MiniPlayer, you can see what’s playing and control playback while browsing your music collection. To open Now Playing, just tap on the MiniPlayer.\n– Improved Now Playing. Now Playing has a stunning new design that showcases your album artwork the way it was meant to be. In addition, you can begin wirelessly streaming your music using AirPlay without leaving Now Playing.\n– Up Next. It’s now simple to find out which songs from your library will play next — just tap the Up Next icon in Now Playing. You can even reorder, add, or skip songs whenever you like.\n– Global Search. You can now search from anywhere in the Music app — just tap the magnifying glass. Search results are conveniently organized to help you quickly find that perfect song. You can even start an iTunes Radio station right from Search.\niOS 8.4’s Music application includes revamped search, the UpNext and MiniPlayer features from iTunes on the desktop, improved iTunes Radio functionality, a new Recently Added page, and more on top of the new design. On the iPad, there’s a new split-screen interface on the iPad, as seen in the screenshots below. On the iPhone, the landscape interface has been removed entirely. The icon for the app remains the same, however. We have a hands-on gallery of several more screenshots below:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.3802459689840261
    },
    "article_12": {
        "title": "Apple Reports Record March Quarter Results of $13.6B Profit on $58B Revenue, Boosts Dividend and Buybacks",
        "body": "Apple today announced financial results for the second fiscal quarter and first calendar quarter of 2015. For the quarter, Apple posted revenue of $58 billion and net quarterly profit of $13.6 billion, or $2.33 per diluted share, compared to revenue of $45.6 billion and net quarterly profit of $10.2 billion, or $1.66 per diluted share, in the year-ago quarter.\nGross margin for the quarter was 40.8 percent compared to 39.3 percent in the year-ago quarter, with international sales accounting for 69 percent of revenue. Apple also declared an increased dividend payment of $0.52 per share, payable on May 14 to shareholders of record as of May 11. The company currently holds $193.5 billion in cash and marketable securities.\nIn addition to the increase in the dividend payment, Apple said it will once again expand its share repurchase authorization to $140 billion from $90 billion and the company says it expects to spend over $200 billion in cash under its capital return program by the end of March 2017. Since the start of its capital return program in August 2012, Apple has returned over $112 billion to shareholders, including $80 billion in share buybacks.\nApple sold 61.2 million iPhones during the quarter, up from 43.7 million a year earlier and a new March quarter record, while Mac sales were also strong with 4.56 million units sold, up from 4.1 million units in the year-ago quarter. iPad sales were down, however, falling to 12.6 million from 16.35 million.\n“We are thrilled by the continued strength of iPhone, Mac and the App Store, which drove our best March quarter results ever,” said Tim Cook, Apple’s CEO. “We’re seeing a higher rate of people switching to iPhone than we’ve experienced in previous cycles, and we’re off to an exciting start to the June quarter with the launch of Apple Watch.”\nApple's guidance for the third quarter of fiscal 2015 includes expected revenue of $46-48 billion and gross margin between 38.5 and 39.5 percent.\nApple will provide live streaming of its fiscal Q2 2015 financial results conference call at 2:00 PM Pacific, and MacRumors will update this story with coverage of the conference call highlights.\nConference call and Q&A transcript is after the jump\nCEO Tim Cook's prepared statement\nGood afternoon, everyone, and thank you for joining us. We have a lot of great news to talk about, so I'll jump right in. Today we're reporting our strongest March quarter ever, with 27 percent revenue growth, and 40 percent earnings per share growth year over year. We're seeing fantastic results for iPhone, with revenue growth of 55 percent year on year, and we're seeing a higher rate of switchers than we've experienced in previous iPhone cycles. The success of iPhone has been extremely strong in emerging markets, where unit sales were up 63 percent year on year. The App Store had its best quarter ever, with a record number of customers making purchases, driving a new record for revenue and 29 percent year-on-year growth. We also reached an all-time quarterly record of $5 billion in total services revenue. We also continue to defy the trend of declining global PC sales, with double-digit Mac unit growth in a market that IDC estimates contracted by 7 percent.\nWe're now halfway through fiscal 2015, and our year-to-date results have been simply staggering. We sold over 135 million iPhones, 34 million iPads, and 10 million Macs in the first six months of the year. Our revenue has grown by 28 percent to over $132 billion, net income has increased 36 percent to over $31 billion, and EPS has grown by 44 percent.\nWe're making more strategic investments in Apple's future, in research and development, in our supply chain, and in our infrastructure, and we made 27 acquisitions in the last 6 quarters. We're in the very fortunate position of generating more cash than we need to run our business, and keep making these important investments. So today, we're announcing another significant update to our capital return program, expanding its size to $200 billion through March of 2017 to reflect our strong confidence in what lies ahead for Apple. Luca will go into this in more detail in a moment.\nWe're also making great progress in many other areas. The Apple ecosystem continues to expand in exciting ways. We're seeing great momentum with Apple Pay. Discover announced today that its cardmembers in the United States will be able to make contactless payments in participating stores through Apple Pay beginning this fall. And last month, we said that the number of locations accepting Apple Pay has tripled, and we continue to see great progress with merchants. Best Buy, which has been a longtime strong partner of ours, has just announced that it's now offering Apple Pay in-app, and later this year will offer Apple Pay in all of their U.S. stores. And merchants are the only ones jumping on board. Earlier this month, a leading healthcare payment network announced acceptance of Apple Pay for its clients, so over 50 major hospitals across the country, including Stanford Health Care and Aspen Valley will accept Apple Pay this year for co-pays and bill payments at registration and check-in.\nWe're also incredibly inspired by the momentum we're seeing in health-related solutions. Since we released HealthKit with iOS 8 last September, over 1,000 apps have been developed to transform how people track, manage, and interact with their health, and they're now available on the App Store. Just this past weekend, Cedars-Sinai in Los Angeles turned on the largest HealthKit integration to date, giving more than 87,000 patients the ability to share their health and fitness data seamlessly with their My CS-Link app, which syncs with their electronic medical record.\nAnd last month, we announced ResearchKit, an open-source software framework that helps doctors and scientists gather data from medical research participants more efficiently and accurately using iPhone applications. The response so far has been simply amazing, far exceeding our expectations. The first research apps developed using ResearchKit study asthma, breast cancer, cardiovascular disease, diabetes, and Parkinson's disease, and have enrolled over 60,000 iPhone users in just the first few weeks of being available on the App Store. Over 1,000 researchers have contacted us expressing interest in performing studies through ResearchKit. We think these types of solutions have the potential to revolutionize medical studies in life-changing ways, and we're proud that Apple is helping make this possible.\nLast quarter, we also announced a major economic investment in Europe, where we will spend $2 billion to build data centers in Ireland and Denmark. These will be our largest data centers in the world. Apple is now responsible for creating over 670,000 jobs across the European continent. Most of them have grown out of the success of the App Store, which has generated more than $7.5 billion for European developers since just 2008. We feel great about the economic contribution we've been able to make in Europe. The two data centers we're building will run on 100 percent renewable energy from day one.\nThis is just part of the work we're doing to protect the environment and leave the world better than we found it. Today, 100 percent of Apple's U.S. operations and 87 percent of global operations are powered by renewable energy. Just before Earth Day, we announced our plan to move to renewables in China. We're undertaking a ground-breaking partnership with several companies to build a 40-megawatt solar farm in Sichuan province. It will generate far more than the amount of energy used by all of our offices and retail stores in China combined.\nWe also announced an innovative new partnership with The Conservation Fund to permanently protect more than 36,000 acres of working forest in Maine and North Carolina, to help offset the impact our packaging has on the world's supply of sustainable virgin fiber. Apple is deeply committed to these initiatives and will continue to make them a priority.\nThe June quarter is off to an exciting start with great new products and services. Three of them in particular are giving our customers a glimpse of the future, and we are very happy with the reception each of them is receiving. First, the all-new MacBook began shipping just over two weeks ago, and we're very happy with the response we're getting from customers. The new MacBook is our lightest, most compact Mac notebook ever, and you really have to see it to believe it. It features a stunning, 12-inch Retina display, a new Force Touch trackpad, all-day battery life, and a revolutionary new keyboard. We believe, and I think most everyone agrees, this is the future of the notebook.\nSecond is the new streaming service from HBO which is available on Apple TV and iOS. We teamed up with HBO last month to help launch HBO NOW, a standalone service that lets customers stream the content they love from HBO on the devices they love from Apple, all without requiring a subscription to cable. HBO NOW has been incredibly popular with Apple TV users since its debut, and it has been one of the top downloaded apps on the U.S. App Store as well.\nAnd third, of course, is Apple Watch. It's been really great to see the reaction of customers since their watches began arriving on Friday morning. All around the world, we've seen the excitement on social networks as people start using their Apple Watch. The response has been overwhelmingly positive. Adding to the surprise and delight of Apple Watch are the more than 3,500 apps that are already available. Our developer community has already seen the potential in this new category, and put some of their best thinking into what wearable technology can do. We can't wait to see more of the inspiring apps developers dream up for Apple Watch as we head into our Worldwide Developers Conference six weeks from now.\nI'd like to thank all of those developers and our hundreds of millions of customers for their loyalty and support. I'd also like to thank all of the Apple employees around the world for their creativity, tireless effort, and passion for delivering the very best products in the world. With that, I'll turn the call over to Luca.\nCFO Luca Maestri's prepared statement\nThank you, Tim. Good afternoon, everyone. As Tim mentioned, we just completed another outstanding quarter. Revenue for the March quarter was $58 billion, an increase of $12.4 billion or 27 percent year over year. Growth was driven primarily by the very strong performance of iPhone, and the continued strength of the App Store and Mac sales. We achieved these terrific results despite growing foreign exchange headwinds. Our performance was particularly impressive in our Greater China and rest of Asia-Pacific segments. In Greater China, we established an all-time quarterly record for revenue, which grew 71 percent year over year to $16.8 billion.\nGross margin was 40.8 percent, ahead of our expectations, mainly due to stronger than expected iPhone results. Operating margin was 31.5 percent of revenue, and that income was $13.6 billion, a new Q2 record. Diluted earnings per share were $2.33, a 40 percent year-over-year increase. Cash flow from operations was $19.1 billion, also a new March quarter record. For details by product, I will start with iPhone.\nWe sold 61.2 million iPhones in the quarter, representing 40 percent year-over-year growth, and demand for iPhone 6 and 6 Plus has remained incredibly strong. iPhone sales more than double in Korea, Singapore, Taiwan, and Vietnam, and they were up 80 percent or more in several other markets including Canada, Mexico, Germany, and Turkey. The strong mix of iPhone 6 and 6 Plus, combined with the popularity of higher-capacity offerings led to iPhone ASPs of $659, an increase of $62 year over year, despite the very significant foreign exchange headwinds I already mentioned. We increased iPhone channel inventory by one million units during the quarter, which allowed us to get into the lower end of our target range of five to seven weeks of channel inventory.\nNext, I'd like to talk about the Mac. We sold 4.6 million Macs, representing 10 percent year-over-year growth, which is particularly impressive in the context of IDC's latest estimates of a 7 percent global PC market contraction. The growth was led by portables, and spurred by the updates to MacBook Air and MacBook Pro in March. We ended the quarter within our four to five week target range for Mac channel inventory.\nTurning to iPad, we sold 12.6 million compared to 16.4 million in the year-ago quarter. iPad sell-through was 13.7 million as we reduced channel inventory by about 1.1 million units coming off the holiday quarter. This left us within our five to seven week target range of iPad channel inventory. We set a new March quarter record for iPad sales in Japan, and an all-time record for iPad sales in China. Performance in other markets was more muted during the quarter. iPad turns five years old this month, and in every year since its introduction it has been the number one tablet in sales, in quantity and quality of tablet apps, in usage, and most importantly in customer satisfaction. And based on the latest data from NPD, iPad maintains a very strong leadership share in all of the price bands where we compete.\niPad has also consistently been the number one tablet in enterprise. A recent ChangeWave survey found that among corporate buyers planning to buyer tablets in the next 6 months, 77 percent plan to purchase iPads. In fact, we have seen very high interest from companies who want to use iPad to transform how work gets done. The vast majority of the app opportunities that have been identified as part of the Apple and IBM partnership are specifically for iPad. In addition to IBM, we're working closely with more than two dozen other leading business software and solution providers, including Box, DocuSign, MicroStrategy, Revel, and ServiceMax, to bring a broad range of innovative mobile solutions to more customers on iPad.\nTurning to services, revenue grew to a new all-time record of $5 billion an increase of 9 percent year over year. The growth was led by the App Store, which remains incredibly popular with our customers around the world, with revenue up 29 percent in the March quarter. According to AppAnnie, the App Store generated 70 percent more global revenue in the March quarter than Google Play, up from a 60 percent lead in the September quarter.\nTraffic to our online and retail stores was excellent, with a 22 percent year-over-year increase in customer visits. We're progressing well with our plans for retail store expansion in Greater China, where we added 6 new stores in the last quarter alone bringing us to 21 stores in 11 cities. We are on track to have 40 stores open in Greater China by the middle of next year.\nLet me now turn to our cash position. We ended the quarter with $193.5 billion in cash plus marketable securities, a sequential increase of $15.6 billion. Over $171 billion of this cash was offshore. In the March quarter, we issued 6.5 billion U.S. dollar denominated notes and 1.3 billion Swiss franc denominated notes as we continued to diversify our global debt investor base. We've now raised a total of $40 billion of term debt at very attractive rates. We spent $7 billion to repurchase 56.4 million Apple shares through open-market transactions, paid $2.7 billion in dividends and equivalents, and utilized about $100 million to net share settle vesting employee RSUs. We also retired an additional 15.3 million shares during the quarter with the conclusion of the accelerated share repurchase program we launched last August.\nWe have executed our capital return program aggressively, and we've now taken action on over $112 billion of our $130 billion program, including $80 billion in share repurchases at an average price of $85. As we've said consistently, creating value for shareholders by developing great products that enrich people's lives will always be our top priority, and the key factor driving our investments and our capital allocation decisions. With this framework in mind, Apple's board and management team continue to review capital allocation regularly, and we solicit input on our program from a broad base of shareholders. This process allows us to be thoughtful about the size, the mix, and the pace of the program. We very much appreciate all of the input the many shareholders have provided us.\nWe continue to be in the fortunate position of being able to return significant capital to shareholders. We first announced our capital return program three years ago with an initial size of $45 billion, and we've increased it annually since then. Today we're announcing the third update to our program, expanding its size by the largest amount yet and extending its duration. The existing program was set to conclude at the end of this calendar year, and we're now extending the program by five quarters to the end of March 2017. Once again, with this update we're allocating the majority of the expansion of the program to share repurchases, given our strong confidence in the future of Apple and the value we see in our stock. The board has increased the share repurchase authorization by $50 billion, raising it from the current $90 billion to $140 billion. We will also continue to net share settle vesting employee restricted stock units.\nWe also understand that the dividend is very important to many of our investors, and we are raising it for the third time in less than three years. The quarterly dividend will grow from $0.47 per share to $0.52 per share, an increase of 11 percent. This is effective with our next dividend, which the board has declared today and is payable on May 14, 2015 to shareholders of record as of May 11, 2015. We believe this a meaningful increase for those shareholders who value income and we continue to plan for annual dividend increases going forward. With over $11 billion in annual dividend payments, we are proud to be one of the largest dividend payers in the world.\nIn total, the size of our revised capital return program will increase by over 50 percent, from approximately $130 billion to $200 billion. As we've done in the past, we expect to fund our capital return program with U.S. cash, future U.S. cash flow generation, and borrowing from both domestic and international debt markets. And we plan to provide the next update on our program at about this time next year.\nNow, as we move ahead into the June quarter, I'd like to review our outlook, which includes the types of forward-looking information Nancy referred to at the beginning of the call. We expect revenue to be between $46-48 billion, compared to $37.4 billion in the year-ago quarter. We expect gross margin to be between 38.5 and 39.5 percent. We expect OPEX to be between $5.65 billion and $5.75 billion. We expect OI&E to be about $350 million, and we expect the tax rate to be about 26.3 percent. With that, let's open the call to questions.\nQ&A\nBill Shope, Goldman Sachs: When we look at the effect of currency on your gross profit, which I think was far less than anyone anticipated, have you been able to reduce some of the pressure by adjusting terms with your suppliers, or is that something we should expect to see more of as you progress through the year?\nMaestri: Let me give you some numbers on the currency because I know it's a topic that is top of mind. You're asking about gross margin, and you know we look at this on a sequential basis, and I mentioned during the call in January that we were expecting effects to have a negative impact on a sequential basis of about 100 basis points after the effect of the hedges, and that is exactly what happened in our actual results. So that was pretty much in line with what we were anticipating. Of course, we expect this headwind to continue, and on a sequential basis when we look into the June quarter, we expect to see another 40 basis points of negative impact from currency. We're dealing with these headwinds…they're part of business. And so, we're dealing with them in many ways. We are looking at, in some cases, the potential to increase prices in certain markets. We're looking of course at our cost structures, and we try to remain as competitive as possible, so we feel very good about the gross margins that we've generated in the March quarter, and we feel very good about the guidance that we provided given the severity of the impact.\nShope: Okay, great. Then as a follow-up, I guess one of the incremental tailwinds to gross margin continues to be the iPhone upside relative to expectations. Could you give us a bit more color on the dynamics of the customer mix for the iPhone? You had mentioned you're very excited about the new-to-iPhone rate so far, but if you could give us a bit more color as we had last quarter, on folks that are new to iPhone, Android switchers versus replacement.\nCook: Bill, we continue to see a higher rate of switchers than we have seen in previous cycles, so we're extremely excited about that. We also continue to see a reasonable percentage of first-time buyers, particularly in some of the emerging markets. And if you look at emerging markets in general, I think Luca covered some of this, the revenue from emerging markets just for the March quarter was up 58 percent year on year, and a big piece that is driving that is iPhone. Obviously those results would have been higher without some of the FX headwinds that Luca mentioned earlier.\nShope: Okay, that's it for me. Thank you.\nKaty Huberty, Morgan Stanley: You've said in the past that the watch may take longer to ramp given the new category and new interface to customers. Is that in fact playing out? Is the watch ramping slower than past product categories?\nCook: Katy, when you use the word \"ramp,\" I assume you're talking about supply?\nHuberty: Yeah, pre-orders, and first weekend sales, and any other data points that you track in terms of interest versus, say, when the iPad launched in 2010.\nCook: Let me tell you about supply and demand and sort of separate those two. Right now, demand is greater than supply, and so we're working hard to remedy that. We've made progress over the last week or so, and were able to deliver more customers an Apple Watch over the weekend than we initially anticipated. We're going to keep doing that, so we've already sent some notes out today with moving other customers in versus what we had communicated to them previously. So I'm generally happy that we're moving on with the ramp. It is a new product for us, and, you know, with any kind of new product, you wind up taking some time to fully ramp. Having said that, I think we're in a good position and by some time in late June we currently anticipate being in a position that we could begin to sell the Apple Watch in additional countries. And so that's our current plan.\nFrom a demand point of view, it's hard to gauge when you don't have product in stores and so forth, and so we're filling orders completely online at the moment. The customer response from people who have gotten theirs over the weekend has been overwhelmingly positive, and we're far ahead of where we expected to be from an application point of view. To give you a comparison, when we launched the iPhone, we had about 500 apps that were ready. When we launched iPad, we had about 1,000, and so our internal goal was to be able to beat the 1,000 level. And we thought it would be great if we could do that by a little bit, and as I mentioned before, we now have over 3,500 apps in the App Store for the watch. So we couldn't be happier about how things are going from that point of view.\nWe are learning quickly about customer preferences between the different configurations. There's a much larger breadth of possibilities here for customers than in our other products, and in some cases we called that well, in some cases we're making adjustments to get in line with demand. But I'm really confident that this is something we really understand how to do, and we'll do. And so I'm really happy where we are currently, and happy enough that we're looking forward to expanding into more countries in late June.\nHuberty: That's great. And then as a follow-up, research and development spend continues to track well ahead of revenue growth, and that has happened for many quarters now. Can you talk about what's driving that? Is there a broader set of projects that you're working on? Are you making bigger bets? Entering bigger markets? What's driving such a long period of elevated R&D spend?\nMaestri: Katy, of course we've said this several times now…when you look at our product portfolio, it is much broader than it used to be. We now develop two new iPhones every year. We were not doing that a few years ago. We develop two iPads, and of course now we have the Apple Watch. We're also developing some core foundational technologies more in-house now than we were in the past. And of course we're also spending ahead of some of the products that will generate revenues in the future. So when you combine all of these factors, that is the reason why you see these research and development increases year over year. Research and development is the core of the company. Innovation is the core of the company, and we're very proud of the fact that when you look for example at the last two quarters, the first half of 2015, our revenue growth has been higher than our OPEX growth. And when you look at our expense-to-revenue ratio for the first half of the year, it's been 8.2 percent. It's lower than it was a year ago, and it's definitely something that we consider extremely competitive, and we're very proud of.\nHuberty: Okay, thank you very much.\nGene Munster, Piper Jaffray: Good afternoon, and congratulations, and Tim, you mentioned there is more switchers versus previous cycles. Any thoughts on what that would mean or could mean for market share over the next few quarters, and kind of I guess the sustainability of the 6 cycle? And then second question for Luca in terms of any thoughts on what the margin impact from the watch is as that ramps over the next couple years? Thanks.\nCook: Gene, if you look at the overall, worldwide, we grew iPhone 40 percent, and IDC's estimate of the market for last quarter is at 16 percent, so we grew two and a half times. And if you kind of look through at the different countries, in almost every country we grew at a multiple of the market. And as I mentioned before, in emerging markets we did extremely well. And so I feel really good about where we are, and you can hopefully tell with the strong guidance that we provided that we're very bullish on the current quarter as well. And so I think things look very, very good. We're also pleased, in addition to the switcher number, that we're doing fairly well with first-time buyers, which is also a key metric for us. And so it's tough to find something in the numbers not to like.\nMaestri: And Gene, let me take your question on margins. I'll talk about Q3, because you know this is the quarter that we provided guidance for, and when we guided to 38.5 to 39.5 percent, which is slightly down versus our performance in Q2, and this is driven by a number of things. First of all is the loss of leverage from the sequential decline in revenue. This is typical of our seasonality. There's a foreign exchange element, and I mentioned before the negative impact on a sequential basis of about 40 basis points. And also we're launching the Apple Watch. Apple Watch is not only a new product but it's also a brand-new category with a lot of new features, a lot of new innovative technologies, and Apple Watch margins will be lower than the company average.\nMunster: One maybe quick follow-up, Tim, in terms of the base of iPhones that have upgraded, I think you provided a number last quarter on that. Is there any update to that metric?\nCook: Yes, sure. Our current estimate is that about 20 percent of the active install base has upgraded to a 6 or a 6 Plus. And so as I look at that number, that suggests there's plenty of upgrade headroom. In addition, we want to keep inviting over as many switchers as we can. So between both of those and the first-time buyers as well, it seems really good right now.\nMunster: Thank you.\nToni Sacconaghi, Bernstein: I just wanted to revisit the watch. You know, Tim, I think you said when you were talking about your new products, you said we're–quote–very happy with the reception, and in response to a previous answer you said that relative to demand it's hard to gauge with no product in the stores. I would say relative to other product launches, where your commentary around demand was characterized by superlative after superlative, that assessment feels very modest.\nPart of the reason that I ask is a) are we reading you right in terms of that? But if we look at consensus, consensus is expecting that Apple will ship more watches in its first two quarters than it did iPads, despite as you said very limited distribution in terms of only selling through your stores. So I'm wondering if you could talk a little bit about putting those demand comments in context given that they do seem different from how you characterized product demand for other products, and how, if at all, we should think about modeling demand in the context perhaps of the iPad, which was your most recent significant new category. And then I have a follow-up, please.\nCook: I'm thrilled with, Toni, so I don't want you to read anything I'm saying any way other than that. So I'm not sure how to say that any clearer than that. And in any situation, whether it's the watch or in the past on iPad or on iPhone, when demand is much greater than supply it's difficult to gauge exactly what it is. And so, as you know, we don't make long-term forecasts on here. We make forecasts on the current quarter, and so I don't want to make any comment about the consensus numbers. Honestly, I haven't even studied those. We've got enough to think about here. I feel really great about it. The customer response…I mean literally from what I've seen is close to 100 percent positive, and so it's hard to imagine it being better.\nSacconaghi: Okay, and I was wondering if, Luca or Tim, you talked about the watch having lower margins in the third quarter, which is surprising a) I think in the context of price points that many people thought were higher, b) in the context of what luxury watches sell for, c) I think in terms of what estimated margins might be on accessories like your watch bands. So I'm wondering if you believe that the watch's gross margins are being burdened by lower volumes and startup costs, and that you believe that as a category, watch margins will be in total, including everything else that you sell with it, will be on a sustained basis lower than the company average.\nCook: Toni, we're not going to guide to or give projections of gross margin outside of the current quarter, so what we have right now, which is a situation that's not surprising to us…we knew we would be here…is that the watch gross margins for the current quarter that we've included in the guidance that Luca's provided in the aggregate, are lower than the company average. And so that to us is intuitive that it would be, and so I think we must just be looking at it through a different lens than you are.\nSacconaghi: I guess the question is, is there anything unique about it being in its first quarter, providing that margin profile?\nCook: In the first quarter of any kind of product, you would always have learning and these sorts of things. We've had that with every product we've ever done, and so, again, we're not guiding to what it will be over time. We're talking about what it is now. But I would keep in mind that the functionality of the product that we're making is absolutely incredible, the power of it. And I'd also say, I haven't even seen this, but generally there is cost breakdowns that come out around our products that are much different than the reality. I've never seen one that is anywhere close to being accurate. And so, if that's the basis for your comment, I'd really dig on the data if I were you.\nSacconaghi: Thank you.\nShannon Cross, Cross Research: Tim, can you talk a bit about what you're seeing in China with 70 percent year-over-year growth in Greater China revenue and clearly very strong iPhone. If you can talk a bit about what consumers are saying, what carriers are saying in terms of demand, and in opportunities. Just any kind of color, because clearly it's quite strong.\nCook: It was an incredible quarter. We were up 71 percent year over year. We set a record in China for revenues. We did that now in a quarter that included Chinese New Year, and so we had the help of the strong holiday season. Much like the U.S. has a strong season in December, China's is obviously in the March quarter. iPhone led the way. It was up over 70 percent year on year, and the current estimates from Kantar are that we would gain more than 9 points of share on a year-over-year basis, and so by everything I can see we did extremely well. The Mac also had an unbelievable quarter China, and I'm particularly very happy with this, that Mac unit sales were up 31 percent, and like most of the rest of the world, IDC is projecting that PC sales in China contracted by 5 percent last quarter. And so we're once again bucking the tide. Also in China, consistent with the company but at a much different rate, the App Store had a record quarter and grew over 100 percent year over year. And so you can see the iPhone, the Mac, and the App Store adding, and with the iPad in PRC, not in Greater China but in the PRC, iPad had its best quarter ever, higher than all the others, and also grew in a market that contracted for overall market.\nAnd so, really and truly, it's sort of everything you look at in China was extremely good. We have been working significantly on expanding our ecosystem there, and so we added UnionPay as a payment option for customers. We increased the iPhone point-of-sales to over 40,000 during the quarter. That's up about 9 percent year on year. And more importantly than the total number, we are in many more cities than we were before. We worked significantly on our online store, and our online store revenue was up over three times year over year. As you probably heard us say before, we've opened several stores in China recently. We're now at 21 in Greater China and we're on track still to achieve 40 stores by the middle of next year. The online store will also be expanding from around 319 cities to where they can hit two-day delivery to 365 cities, so adding about 50 new cities by the end of this quarter. And so the net is, we're investing a lot across the board in our infrastructure, in our products, on partnering with different companies.\nThe Chinese developers are coming on in significant numbers. We've now made payments to developers in Greater China of almost $5 billion, over half of which was in the last 12 months. And so you can see this enormous momentum building in the developer community there as well. And so, lots of positive things, and as you probably heard me say before, I've never seen as many people coming into the middle class as they are in China, and that's where the bulk of our sales are going. And so we're really proud of the results there, and continue to invest in the country.\nCross: Okay, great, that was helpful. And then just sort of a follow-up on the iPad side. What do you think it's going to take to reaccelerate iPads? I mean, the sell-through was better than the sell-in this quarter, but are we seeing cannibalization from the iPhone 6 Plus? How are you sort of thinking about the iBM partnership as it relates to iPad? Thanks.\nCook: Yeah, I think number one, we have to stop having the situations where we sell through more than we sell in. So you know, where we don't have to have an inventory correction. That was over a million units. Two, have we had cannibalization? The answer is yes. We've clearly seen cannibalization from iPhone and on the other side from the Mac. Of course, as I've said before, we've never worried about that. It is what it is. That will play out, and at some point it will stabilize. I'm not sure precisely when, but I'm pretty confident that it will. The IBM partnership, I think is in its early stages in terms of bearing fruit here, but everything I see I like on it. I'm a big believer in the ability for iPad to play in a major way in enterprise. And so I'm looking to seeing that play out as we move forward. When you look at the underlying data, it makes you feel a lot better than the sales do. And so things like first-time buyer rates, the latest numbers from the U.S. are somewhere around 40 percent, and if you look at China, they're almost 70 percent. And so these numbers are not numbers that you would get if the market were saturated. And so I continue to believe even though I've seen different people write that, that I think that theory is not correct, and do not see that. We also see usage numbers that are off the charts, so far above competition it's not even in the same planet. And we see customer satisfaction at or near 100 percent. So these kind of numbers along with intent to buy numbers…everything looks fantastic, the e-commerce numbers. And so my belief is, that as the inventory plays out, as we make some continued investments in our product pipeline, which we're doing, that we already had planned and have had planned for some time. Between that, the inventory playing out, the enterprise starting to take over, I think still, i believe the iPad is an extremely good business over the long-term. When precisely it begins to grow again I wouldn't want to predict, but I strongly believe that it will.\nCross: Great, thanks very much.\nSteve Milunovich, UBS: Luca, could you comment a bit about the factors that went into your decision on the capital return program, particularly the share repurchase part? For example, I would think you're pretty well done in terms of taking U.S. cash down, so you are dependent on cash flow in the U.S., as well as debt. And regarding debt, do you have a debit-to EBIDTA ratio in mind that you don't want to go over? Do you want to keep your AA rating…is that important? Just other factors like capital spending needs, just curious what your thinking was.\nMaestri: Yes, Steve, so the logic has not changed over the years. We look at our business plans, we look at what we want to accomplish from a product perspective, we look at the capital needs that we have to run the business and to grow the business. And then we see that we're in this great position that we can return cash to shareholders. We know Apple very well. We are very excited by the level of customer response that we've got for our current portfolio.\nWe're super confident about the pipeline of products and services that we have, and therefore we believe that there is great value in our stock. And that is the reason why again this year we are allocating the majority of the increase, which is the largest increase that we've ever done – we are increasing the program by $70 billion – and the vast majority of that we allocating to the share repurchase because, again, we believe there's great value in the stock.\nWe also know and understand that we have several investors that value income, and so that is important for us to increase the dividend. And as we said in the past, we plan to continue to increase the dividend every year. And as we said in the past, we will come back at about this time next year and give you another update to the program because we will have better information and we'll be able to be very thoughtful about the size and the mix and the pace of the program.\nFrom a funding standpoint, of course we have a very strong balance sheet. We do have some cash in the U.S. We will continue to generate cash in the U.S., but definitely a good portion of the program will be funded through debt. We will raise debt both in the U.S. and outside the United States. And of course we've got a very, very strong balance sheet. We've got a very open dialogue with the rating agencies, and so we feel we have a lot of room for us to fund the program. So from a balance sheet standpoint, we feel very, very comfortable with the program that we have announced today.\nMilunovich: Thank you.\nKulbinder Garcha, Credit Suisse: Thanks. My first question is for Tim. Tim, on the comment you made about the 20 percent of the iPhone base being on the 6 and 6 Plus, are we right in interpreting the comment as that's substantially a lower number than at this point in previous cycles? And that would I guess argue for just a longer period of growth as the [unintelligible] upgrades. And then also linked to that, by the points you are making on new-to-iPhone users and switchers being higher. That number year-on-year, in the first six months, is clearly growing year on year. Is that the right way to interpret that comment? Then I have a follow-up.\nCook: I missed the second part of your question totally. Can you get a little closer to your phone?\nGarcha: Oh,sorry…yes. So the second part of my question is, in the first six months of the 6 and 6 Plus, is the gross number of new users to Apple, whether it's new users or switchers from Android, significantly growing year on year?\nCook: I don't have the comparisons in front of me, about the answer to either one of your questions. My understanding of what you asked was is the 20 percent number that I'd mentioned in the question from Gene…how does it compare year over year, is it a lot different. I don't know the answer to that off the top of my head. As I look at the number, my point from bringing it up is that there's a lot of people that haven't upgraded to a 6 and 6 Plus. And so, as I look at that, it screams that there's significant opportunity there, and that's before thinking about switchers and first-time buyers.\nGarcha: Luca, just from the gross margin decline from the March quarter to June…I understand the currency point. I understand the iPhone's a little bit older. I guess of the iPhone and the watch impact, can you help us…is the decline equally attributable to both those reasons, or is there something else going on?\nMaestri: So there are a number of reasons why our guidance for gross margins is lower than the actual for the second quarter. The first one is the loss of leverage because of the sequential decline in revenue. We've got the foreign exchange, we've got as you said a lower iPhone mix, we've got the Apple Watch, you know. I think we'll leave it as that and we're not going to get into more specifics. But those are the four reasons that drive the sequential decline.\nKeith Bachman, Bank of Montreal: Hi, Tim, this is for you. You mentioned something in your past comment that you thought a lot of the iPhone sales were going into the middle class in China. And I'm just wondering if you could elaborate on that and open it up more broadly speaking to the emerging geographies, if you have demographics that you could talk about for your iPhone specifically, and where you think those iPhones are ending up. Because I think it does raise the question as you look out over the next year or so, do you have the right price points for the demographics you're hitting?\nCook: Here's what I would share with you, Keith. If you look in the emerging markets, our revenues were up 58 percent year on year, and this accounted for just slightly less than 40 percent of the company's revenue. If you look at BRIC within the emerging markets, BRIC countries were up 64 percent year over year. And so as I look at that without having market research on the demographics that you're asking, it's clear to me that it has to be coming from middle class. Because the upper income earners, there's only so many of those. And you can't grow those kind of numbers without getting significantly into the middle class. And so I think that's where we are. I hope we're also beyond the middle class, but I don't have the data to suggest that that's the case or not the case, but it's clear to me that the middle class statement has to be true.\nBachman: Yeah, okay. Fair enough. My follow-on, I'm going to stay with you for a second, Tim, if you could. It sounds like HBO NOW is a great opportunity today and as you look out…if you could just speak more specifically how we should be thinking about Apple as a conduit for something like HBO NOW and other products. Is that a) a meaningful revenue opportunity, without getting specifics, and/or is it more about selling incremental devices, or is it about expanding the revenue pie as you look at opportunities like HBO NOW?\nCook: First of all, I think it's about giving the customers something they want, and giving it to them with Apple's classic ease of use and in the product environment and the user interface they're used to working in. And in this particular case in Apple TV. And so I think HBO in particular has some incredibly great content, and so we're marrying their great content, our great product and ecosystem, and it's clear from looking at the early returns, you know we've only been at this for a couple weeks or so, that there's a lot of traction in there. And so, where could it go? I don't want to speculate, but you can speculate probably as good as I can about where that can go. I think we're on the early stages of just major, major changes in media that are going to be really great for consumers. And I think Apple can be a part of that.\nBachman: Okay, thanks Tim.",
        "sentiment": 0.3292508131267051
    },
    "article_13": {
        "title": "Microsoft lets you control PowerPoint for iOS from an Apple Watch",
        "body": "Microsoft was quick to support Apple's new Watch with a OneDrive update, and the company is showing no signs of slowing down its backing of the new wearable. The software maker has updated PowerPoint for iPhone today to allow future Apple Watch owners to control presentations from their wrists. It's one of the more useful apps for the Apple Watch right now, with the ability to navigate between slides and see elapsed time or total number of slides in a deck.\nWhile it might be useful for iPhone owners to remote control slideshows from their wrist, Microsoft isn't extending this new functionality to the PC and Mac. You'll only be able to control presentations on an iPhone. Microsoft does have similar Office Remote functionality for Windows Phones and Android devices to control presentations on a PC, so it's possible the company may enable the same features on the Apple Watch in the future. With the vast majority of presentations still operating from laptops with projectors and VGA cables, extending this remote control to a PC would make this Apple Watch app even more useful.",
        "sentiment": 0.31865505608064787
    },
    "article_14": {
        "title": "iFixit got their hands on an Apple Watch and they're tearing it down *right now*",
        "body": "Time flies: it's been eight months since Apple announced its (digital) crowning achievement, the Apple Watch. Join us as we make time stand still by tearing down the Apple Watch—and see what makes it tick.\nUpdate: We've got more Apple Watch teardown goodness! When you're done here, wind your way over to our X-ray teardown.\nThe good times never end at iFixit—and you can be a part of the fun by following us on Instagram, Twitter, and Facebook!",
        "sentiment": -0.01260334849357605
    },
    "article_15": {
        "title": "Recently, several CurrentC retailers have launched support for Apple Pay, signaling the end of the exclusivity agreement.",
        "body": "MCX, the merchant consortium behind the Apple Pay competitor known as CurrentC, has announced today that CEO Dekkers Davidson is being replaced by Brian Mooney. MCX has given Mooney the title of interim CEO, which makes it unclear as to whether the consortium is actively looking for another CEO to replace Dekkers Davidson or if Mooney is the permanent choice.\nWhen Apple Pay launched, CurrentC and MCX received a flood of negative publicity. CurrentC’s exclusivity policy at the time prompted retailers such as CVS and Rite Aid to disable NFC terminals and therefore block Apple Pay. At the time, it was unclear how long that exclusivity deal was for, but it was later revealed that the agreement was for “months, not years.”\nRecently, several CurrentC retailers have launched support for Apple Pay, signaling the end of the exclusivity agreement. During Apple’s earnings call yesterday, Tim Cook revealed that Best Buy would gain Apple Pay support in retail stores later this year and in-app immediately. Acme and Home Depot have also both revealed Apple Pay support after being initial CurrentC partners. It was also recently announced that Discover cardholders will have Apple Pay support soon as well.\nApple has touted that Apple Pay is supported at contactless payment terminals in over 700,000 locations. MCX’s mobile wallet app is still in a private beta test at this point. Exact reasoning for CEO Dekkers Davidson’s departure is unclear right now, although it most likely has something to do with the bad press and lack of adoption from more retailers.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.21643402320998056
    },
    "article_16": {
        "title": "The Difference Between Apple and Samsung Industrial Design",
        "body": "Galaxy S9\nThree years later and Samsung either doesn't care about building aligned products from the ground (or board) up, or doesn't know how. The Galaxy S9:\nAnd here's how it compares to Apple's latest, the iPhone X.\nGalaxy S8\nTwo years later and Samsung has to have finally gotten the ports and buttons aligned, right? Not so much. The just-announced Galaxy S8, sadly:\nGalaxy S7\nSo, a year later, did Samsung get their ports and buttons in order? From the looks of the just-announced Galaxy S7, not so much.\nThe ports, microphones, speakers, jacks, and other elements still don't line up. Not even close.\nGalaxy S6\nIt's a quote from the late Steve Jobs' father intended to help instill pride in craft. Jony Ive, Apple's senior vice president of design, has spoken numerous times about the importance and inevitability of great design as well, about the care and consideration it takes, and how people notice it even when they don't notice themselves noticing it.\nRecently there was a brouhaha about a Qualcomm sticker junking up the Samsung Galaxy S6 on Verizon. You don't see a sticker like that on the iPhone 6 or any other iPhone, of course, because Apple cares more about the look of their product than the licensing fees or other considerations refusing it entails. Same with Intel Inside stickers on the Mac.\nBut when I looked at the picture of Samsung's product, it wasn't the sticker that bothered me so much. That, I assume, can be peeled off. It was something else I saw that bothered me, and something I can now never un-see.\nIt's the lack of basic alignment.\nHere's the top image again, this time with lines drawn through the center points. The sticker isn't even put on straight, which seems unimaginable given modern production equipment.\nI thought maybe it had something to do with the \"edge\" design, so I checked out the non-edge version as well.\nSame thing. Since the iPhone 6 is in the same photo, the lack of basic alignment is even more noticeable. In case it was just the bottom, I took a look at the top as well.\nAnd the side.\nAlmost nothing is aligned.\nSome people might not care. Like painting the back of the fence or finishing the underside of the cabinet, it's a detail that only people who take tremendous pride in craft really care about. And, of course, people who look for just exactly that kind of quality.\nThat's because it takes an incredible amount of time and resources to achieve it. It takes an incredible amount of planning and coordination as well. It also takes the willingness to not do something if you feel doing it right is important enough.\nTo align everything along the edge of a device takes designing and mounting the boards in a certain way, and the ports and speakers, and the buttons and jacks, and the grills and every other detail so they all line up at exactly the right place at the end. Painstaking is likely an understatement.\nIs it worth the effort? For me, as a customer, knowing that Apple had the consideration and took the time and effort to align their hardware speaks to the overall quality of their work. It reassures me that the same consideration and effort were likely spent making sure not a millimeter nor milliamp of battery space was wasted, not a nanometer of die, not a gap left around the screen, or a dead zone in the capacitive sensor.\nSure, problems crop up with every product, but like James Cameron says, when you aim unbelievably high, even your failures surpass other people's successes.\nAgain, I realize this won't matter to some people, and will serve as fodder for jokes for others. Software stability, some will no doubt cry. Yet bits can and are fixed. Software gets updated and services invisibly improved. Atoms, not so much. There's no magic patch that will ever bend those elements back into alignment. They, and owners, are stuck like that forever.\nThat's why it matters to me, and along with other things like privacy and security, better apps, Apple Stores and Apple Care, and a great Google experience and the best Microsoft experience, means it's absolutely something anyone who cares about design and quality should factor into their decision to switch to iPhone.\nI had the chance to spend several evenings with the Galaxies S6 recently and while Samsung ditched a ton of differentiation to offer a more iPhone-like product. Android stalwarts will bemoan the lack of removable battery, the lack of SD card support, and the lack of waterproofing. My reaction was to bemoan the lack of deep, detail oriented design culture and pride in craft.\nBecause once you know the back of the fence wasn't painted, not only can you never un-know it, you can never stop wondering what else wasn't given that same care and consideration.",
        "sentiment": -0.20030845903481045
    },
    "article_17": {
        "title": "'Bendgate' returns: Samsung Galaxy S6 Edge just as bendable as Apple's iPhone 6 Plus",
        "body": "'Bendgate' returns: Samsung Galaxy S6 Edge just as bendable as Apple's iPhone 6 Plus\nArticle Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nSamsung's Galaxy S6 Edge flagship handset was put to the test this week and found to be susceptible to bending under the exact same force as Apple's iPhone 6 Plus, putting the South Korean conglomerate on the hotseat in \"Bendgate\" redux.\nBoth the Galaxy S6 Edge and iPhone 6 Plus bent at approximately 110 pounds of pressure, according to tests performed by third-party warranty firm SquareTrade. Unlike the iPhone — which merely bent — the S6 Edge suffered a cracked screen as well.\nThis puts Samsung in a potentially embarrassing situation. The company was one of many that piled on Apple after stories of bent iPhone 6 Plus units began to surface last year. and now finds itself in the same unwanted spotlight.\nSquareTrade also tested HTC's new One M9, which bent — and broke completely — at 120 pounds of pressure.\nSquareTrade said that while these results may not constitute \"Bendgate 2,\" they could be even worse for Samsung fans than Apple's own PR issues of last year.",
        "sentiment": -0.5120843462646008
    },
    "article_18": {
        "title": "Apple photographed a flower over 24,000 times for a single Watch face",
        "body": "One of the Apple Watch's quirkier features is its \"Motion\" watch face, which sets the time against a backdrop of fluttering butterflies, floating jellyfish, and blooming flowers. Not everyone will like them, but Apple thought that some people really would. So, as Wired's David Pierce recounts, the Watch design team went to some pretty extreme measures.\n\"No reasonable person can see that level of detail.\"\n\"We shot all this stuff,\" human interface lead Alan Dye tells Wired. \"The butterflies and the jellyfish and the flowers for the motion face, it's all in-camera.\" The flowers were photographed in stop-motion, which can be a painstaking process — Dye says one flower required more than 24,000 shots over 285 hours. For the jellyfish, meanwhile, Apple built a tank inside its design studio and used a Phantom slow-motion camera to shoot 4K 300-fps footage, even though it would be displayed on a tiny 312 x 390-resolution watch.\nRead next: Read our Apple Watch review.\nWhile the Apple Watch is far from a perfect product at launch, it's clear that Apple expended a huge amount of effort in areas of its development. \"No reasonable person can see that level of detail,\" says Dye. \"And yet to us it's really important to get those details right.\"",
        "sentiment": -0.11402745149098337
    },
    "article_19": {
        "title": "The same strategy that helped make Jay-Z’s Tidal a disaster is making Apple look brilliant",
        "body": "Look at Beyonce. Just look at her. All beautiful and bright and laid back and… rich. Sitting on her private jet, casually glancing out the window with peacock feathers hanging from her bandana and hair brooch that is just too fashionable to bear. But… wait… what’s that on her wrist? Is that… an Apple Watch?\nYou know it is.\nDON’T MISS: Watch an angry Robert Downey Jr. walk out of the worst Avengers interview ever\nUsing celebrities to promote products isn’t exactly a novel concept. Celebrity endorsements have existed since the dawn of celebrity. But there’s something to be said for the way Apple is handling Apple Watch promotion.\nI mean, just look at Beyonce.\nHaving celebrities speak at launch events or appear in commercials is nice, but it’s not fooling anyone. When Matthew McConaughey waxes poetic while driving around in a Lincoln, we all know that he’s being paid to wax poetic and drive around in a Lincoln. Then the director yells “cut” and Matthew gets driven to lunch in the back of an S Class or some other luxury car.\nBut look at Beyonce. She’s not driving around in a Lincoln. She’s not splashing some water on her face in slow motion in a soap commercial. She’s just living her life, chilling on a private jet, rocking a gorgeous gold Apple Watch.\nAnd… hold on a minute… you can have an Apple Watch just like Beyonce’s! Just think about how cool you’ll look!\nThe sad irony is that Beyonce’s husband Jay-Z just launched a disaster of a music service called Tidal that is employing a very similar strategy, and it’s having the exact opposite impact.\nLet’s stop to consider why that is, because it really couldn’t be simpler.\nApple gave Beyonce a gold watch and told her to show it off. The message to consumers is clear: Wear an Apple Watch, be like Beyonce.\nTidal, on the other hand, is sending a completely different message. Jay-Z & Co. enlisted the help of a number of different celebrities to promote Tidal. They tweeted about it, they spoke about it, they encouraged fans to get on board.\nWhat is Tidal’s pitch? Pay more money for a higher-quality streaming music service, and the artists will make more money. After all, hard-working musicians created these songs and they shouldn’t have to live on the peanuts they make from services like Spotify and Pandora.\nThink of the artists! Won’t somebody think of the artists?!\nIt’s actually a great concept that would absolutely resonate with many music lovers. But look at who Tidal has promoting this service: Jay-Z, Rihanna, Madonna, Nicki Minaj and Kanye (well, maybe not Kanye). Are you kidding me?\nYou know who wants to see artists make more money for their music? Old people with stable jobs who truly appreciate the craft. Avid indie music fans who go out every weekend in search of new bands. People who are aspiring musicians themselves.\nYou know who could not possibly care any less whether or not artists make more money for their music? People who listen to Jay-Z, Rihanna, Madonna, Nicki Minaj and Kanye.\nRihanna’s fans, by and large, are young people who stream her music for free on YouTube, SoundCloud or another similar service. And guess what… she’s worth how much? $125 million? $140 million?\nRihanna and Beyonce fans don’t want Rihanna and Beyonce to make more money. Rihanna and Beyonce fans want to be like Rihanna and Beyonce.\nThey want that watch.\nIt amazes me all over again every time I think about how badly Jay-Z, a brilliant businessman — sorry, a brilliant business, man — botched this launch. Tidal is a fantastic concept that looks doomed to fail. There’s no free tier, there’s no clear support from musicians who actually need to make more money from streaming services, there are no unique features that people actually care about, and there is practically no one on Earth who cares whether Rihanna makes 6¢ or 12¢ per hundred streams.\nBut, I mean, just look at Beyonce.",
        "sentiment": 0.05548267347632714
    },
    "article_20": {
        "title": "iOS 8 adoption bumps up to 81% with help of Apple Watch",
        "body": "Update: 82% as of May 13.\nMore than 7 months after its official release, iOS 8 has now passed 80% adoption as a version of Apple’s latest mobile operating system is running on 81% of active devices, according to Apple’s App Store Distribution data. The new data puts iOS 8 up two points since this time two weeks ago. The remaining devices include 17% running a version of iOS 7, which is where the upgrades came from, while 2% of devices measured have iOS 6 or earlier.\nThat compares to MixPanel’s data that puts iOS 7 adoption at around 91% during the same period last year; its current data for iOS 8 is just a couple points above Apple’s. The trend has been that iOS 8 has seen a slower climb compared to the year ago update adoption rate, with Apple releasing more point updates in recent months to address performance issues and deliver new features.\nOne version of iOS 8 specifically noted addressing an issue with over-the-air updates requiring less internal storage space, an issue that hurt some early adoption especially with 8GB and 16GB devices in the mix.\nIn terms of features, Apple saved Apple Pay support for the iPhone 6 and 6 Plus as well as the iPad mini 3 and iPad Air 2 for iOS 8.1. The Apple Watch app appeared with iOS 8.2 while Apple added over 300 new emoji characters with iOS 8.3. A pre-release version of iOS 8.4 which includes an all-new Music app is currently being tested by developers and public beta users.\niOS 8.2 or later is also required for use with the Apple Watch.\nAs we reported earlier this year, Apple will largely focus on performance issues and stability with the next major release, iOS 9, which Apple is expected to preview in a few weeks at WWDC in early June where it will reveal “the future of iOS and OS X.”\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.08235091687395023
    },
    "article_21": {
        "title": "Microsoft is bringing Android and iOS apps to Windows 10",
        "body": "Alongside the iOS and Android SDKs, Microsoft is also revealing ways for websites and Windows desktop apps to make their way over to Windows universal apps. Microsoft has created a way for websites to run inside a Windows universal app, and use system services like notifications and in-app purchases. This should allow website owners to easily create web apps without much effort, and list those apps in the Windows Store. It’s not the best alternative to a native app for a lot of scenarios, but for simple websites it offers up a new way to create an app without its developers having to learn new code languages. Microsoft is also looking toward existing Windows desktop app developers with Windows 10. Developers will be able to leverage their .NET and Win32 work and bring this to Windows universal apps. \"Sixteen million .NET and Win32 apps are still being used every month on Windows 7 and Windows 8,\" explains Myerson, so it’s clear Microsoft needs to get these into Windows 10.",
        "sentiment": 0.46194805453221005
    },
    "article_22": {
        "title": "Apple says it will reject Apple Watch apps that just tell the time",
        "body": "Apple has today added a new guideline to the App Store Review Guidelines, the first clause specifically targeted at Apple Watch development. This rule that Watch apps that only tell time will be rejected has actually been enforced since Apple started accepting WatchKit submissions as many developers complained to find their apps had been rejected for this reason. The documentation change now formalizes this rule into an official policy.\nThe Apple Watch does not currently allow third-parties to create custom watch faces. Users are limited to the choice of ten faces that come pre-installed. Most of these faces can be customized with different features and complications (info panels) to suit user’s preferences, but it still leaves many eager for a wider choice of clock faces, especially when you consider that one of the ten faces available is Mickey Mouse.\nHope for third-party faces is resting on Apple’s announcement of a native SDK, which it has promised for later this year. It is very possible though that the native SDK will only allow developers to create apps, not system-level watch faces. As a compromise, there has been some speculation that Apple will add support for third-party complications but not whole watch faces.\nApple does seem to be considering adding more first-party faces soon, though. The Help Guide includes this paragraph:\nApple Watch includes a variety of watch faces, any of which you can customize to suit you. Check frequently for software updates; the set of watch faces that follows might differ from what you see on your Apple Watch.\nThis seems to imply that forthcoming software updates to the Apple Watch firmware will ship with more watch faces to choose from. At least, that text suggests that Apple has plans for changing the set of faces it bundles with Watch OS in the near term. In September, Apple showed two watch faces, Photo and Timelapse (Timelase is the third screenshot above), in marketing materials that disappeared by the time the Apple Watch was released. It is not unconceivable for these faces to make a return in future.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.17028225916955206
    },
    "article_23": {
        "title": "Hypercritical: OS X Reviewed",
        "body": "OS X Reviewed\nApril 15, 2015 at 9:04 PM by John Siracusa\nNearly 15 years ago, I wrote my first review of Mac OS X for a nascent “PC enthusiast’s\" website called Ars Technica. Last fall, I wrote my last. Though Apple will presumably announce the next major version of OS X at WWDC this coming June, I won’t be reviewing it for Ars Technica or any other publication, including the website you’re reading now.\nThose who listen to the ATP, the weekly podcast I host with Marco Arment and Casey Liss, know that I’ve been contemplating hanging up my OS X reviewer’s hat for some time now. Producing thousands of words (and hundreds of screenshots) about each major release of OS X was my first real claim to fame on the Internet. The prospect of stopping has made me reconsider my public identity and sense of self. Who am I if I’m not “that guy who writes those OS X reviews”? But when I finally decided, the relief I felt let me know I’d made the right choice.\nThere is no single, dramatic reason behind this. It’s an accumulation of small things—the time investment, the (admittedly, self-imposed) mental anguish, the pressure to meet my own expectations and those of my readers year after year—but it all boils down to a simple, pervasive feeling that this is the time to stop. I’ve done this. It is done.\nWhen I started, I was at the forefront of long-form nerd-centric tech writing. Today, the world has moved on. I might have stopped with my OS X 10.9 review in 2013 if not for my love of round numbers and my expectation that OS X 10.10 would bring a complete interface overhaul that I really wanted to write about.\nWhile OS X reviews were my public debut, the Hypercritical podcast brought me to a new audience starting in 2011. Hypercritical ran for 100 episodes, and in the years that followed I’ve recorded at least one podcast every week. (I’m currently a co-host of the weekly Accidental Tech Podcast and a regular guest on The Incomparable.) The one, long article I wrote about OS X for Ars Technica every year or two has long since been dwarfed by the volume of my audio output.\nI still love OS X—and I still have many complaints about it. I will certainly talk about OS X 10.11 (whatever it’s called) at length on ATP, and I’ll read the many great reviews written by others when it’s released. But neither podcasting nor writing have ever been full-time jobs for me. I’ve always had to fit them into my life alongside my actual job and my family. Right now, I’m looking forward to my first summer in many years that won’t be dominated by stolen daytime minutes and long, sleepless nights in front of a screen with a noisy air conditioner blowing behind me. I’m content to have reviewed 10.0 through 10.10. Someone else can pick up the baton for the next 15 years.\nReleases\nRetrospectives\nPre-release\n© 2010-2022 John Siracusa",
        "sentiment": 0.43073515135508317
    },
    "article_24": {
        "title": "WWDC Starts June 8th",
        "body": "Apple's big developer conference will begin on June 8th this year, when it'll likely show the next versions of iOS, OS X, and perhaps new hardware as well. The tagline for this year's Worldwide Developers Conference is \"the epicenter of change,\" and that's a good explanation for why this event is so popular. Like last year, Apple has actually switched over to a lottery process for selling tickets — rather than offering them first come, first serve — because their demand is so high. The event will once again be held at the Moscone Center in San Francisco. Developer events will run through June 12th, and this time around, they'll actually stream live to those offsite.\nWill a new Apple TV be introduced?\nAs usual, Apple is vague about what we can expect to hear about at WWDC, giving its regular statement that we'll see \"the future of iOS and OS X.\" That's pretty much a given, though. Each year, WWDC kicks off with a keynote presentation from Apple's top executives, who usually run through sales and distribution highlights and then introduce major software updates. Hardware debuts are not as common at WWDC as they once were — for a while, it was where new iPhones were introduced — but they're certainly not out of the question. A couple years ago, Apple used the stage to preview its long-awaited Mac Pro update.\nThis year, it's been reported that Apple will introduce a new version of the Apple TV at the conference. It would be a logical place for the streaming box's introduction: the new model is supposed to include support for third-party apps, and Apple's developers conference is the obvious place to announce that if it wants to get people coding. Developers interested in attending will be able to apply for tickets from today through Friday at 10AM in California. Those chosen will be lucky enough to have the chance to pay $1,599 to attend. One final, important note to attendees: selfie sticks are banned this year on the Moscone grounds.",
        "sentiment": 0.24281138603885968
    }
}