{
    "article_0": {
        "title": "Apple pushing music labels to kill free Spotify streaming ahead of Beats relaunch",
        "body": "Apple has an antitrust monitor on its campus, courtesy of the DOJ after Apple was found guilty in an ebook antitrust case last year (Apple is appealing the decision), but it's not clear if that monitor is involved in this latest situation. The DOJ and the FTC aren't the only entity looking into Apple’s dealings with the music industry, either. According to the New York Post, Apple is being probed by the European Union’s Competition Commission to find out if the company is working with the labels to rid the industry of freemium services.",
        "sentiment": -0.3673081770539284
    },
    "article_1": {
        "title": "Apple releases cheaper Retina iMac and 15-inch MacBook Pro with Force Touch",
        "body": "In addition to the iMac, Apple is also releasing new models of the 15-inch MacBook Pro that include a Force Touch trackpad. Apple says that these models have up to an additional hour of battery life, faster storage, and up to 80 percent faster graphics — though that final item is thanks to a new discrete GPU that only ships on the high-end model. Unlike the iMacs, these changes are actually bringing up the price of the MacBook Pros. The two configurations Apple offers now run for $1,999 and $2,499, up from $1,899 and $2,399. Apple added the Force Touch trackpad to the 13-inch MacBook Pros after announcing it for the new MacBook in March, so it's been expected to arrive in these models alongside a spec bump.",
        "sentiment": 0.28953633904457093
    },
    "article_2": {
        "title": "Apple's iOS drives 75% of Google's mobile advertising revenue",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nDespite the ever-increasing competition between Google and Apple, iOS remains an exceptionally important advertising platform for the search giant, with one Wall Street estimate attributing as much as three-quarters of Google's mobile ad revenue to users of Apple's devices.\nOf the $11.8 billion in mobile search revenue Google booked in 2014, 75 percent — Â nearly $9 billion — Â came from iOS, according to a recent Goldman Sachs analysis cited by the New York Times. Half of that total is chalked up to a deal with Apple that makes Google the default search engine for mobile Safari.\nThat arrangement is thought to cost Google between $1 billion and $2 billion each year, and many believe that it will end sooner than later. Apple is rumored to be considering a switch to Yahoo or Bing, and might also enter the market with its own solution.\nApple is known to be working on a large-scale web search program, led by the team acquired with social analytics firm Topsy in 2013.\nThese developments put Google in a precarious position when it comes to mobile search, and losing iOS is a potentially disastrous scenario. Google has already seen mobile search volume eclipse desktop search volume in 10 markets — Â including the U.S. and Japan — Â and many new Android-based manufacturers have eschewed Google's own services in favor of other local options.",
        "sentiment": 0.0013472280568546718
    },
    "article_3": {
        "title": "Woman dumps $200K Apple 1 computer at recycling centre",
        "body": "Her electronic waste is someone else's treasure.\nA recycling centre in the Silicon Valley is looking for a woman who dropped off an old Apple computer that turned out to be a collectible item worth $200,000 US.\nThe computer was inside boxes of electronics that she had cleaned out from her garage after her husband died, said Victor Gichun, the vice president of Clean Bay Area.\nShe didn't want a tax receipt or leave her contact information, and it wasn't until a few weeks later that workers opened the boxes to discover an Apple I computer inside.\nThe San Jose Mercury News reports it was one of only about 200 first-generation desktop computers assembled by Steve Jobs, Steve Wozniak and Ron Wayne in 1976.\n\"We really couldn't believe our eyes. We thought it was fake,\" Gichun told KNTV-TV.\nThe recycling firm sold the Apple I for $200,000 to a private collection, and because the company gives 50 per cent of items sold back to the original owner, Gichun said he wants to split the proceeds with the mystery donor.\nHe said he remembers what she looks like and is asking her to come back to claim her $100,000 cheque.",
        "sentiment": -0.44979995571904713
    },
    "article_4": {
        "title": "Apple CEO Tim Cook donates 50,000 AAPL shares ($6.5 million) to charity",
        "body": "In a filing with the Securities and Exchange Commission (SEC) today, Apple revealed that CEO Tim Cook has donated 50,000 Apple stock shares to charity this week. At today’s stock price of just over $130 per share, this number of shares is equivalent to approximately $6.5 million. Cook’s previous publicly-known, personal donation was to Project One America, an LGBT equality campaign…\nApple did not disclose which charities Cook donated these shares to today’s filing, which was first noted by Daisuke Wakabayashi. The filing notes that Cook did not simultaneously sell any shares for his benefit. In related news, Apple’s Senior Vice President of Hardware Engineering Dan Riccio sold 24,085 shares this week, which is equivalent to approximately $3.1 million at today’s share price.\nSince becoming CEO in 2011, Cook has promoted charity as a key part of Apple’s mission. Upon taking over, Cook initiated an employee charity program. Cook has also held several lunches for charity on Apple’s campus and has pledged to give away all of his money to charity over the course of the rest of his life. Apple has also expanded its offerings for employees to help their communities.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.025931685019961813
    },
    "article_5": {
        "title": "Jonathan Ive promoted to Chief Design Officer as two new execs step in to lead design departments",
        "body": "Apple’s Jony Ive has served as the company’s Senior Vice President of Design for several years now, but Apple has announced today that the executive is being named Chief Design Officer (a newly-created position). Additionally, Ive and will be handing the managerial reins of both the industrial and software design units at Apple over to two new leaders on July 1st.\nRichard Howarth will become VP of Industrial Design and focus on hardware. Howarth has been part of the iPhone team since the very first generation of the device was in development.\nAlan Dye will now be VP of User Interface Design, which covers both desktop and mobile devices. He was a key player in iOS 7’s major redesign as well as the work on the new Watch OS interface. Both of these executives were mentioned as key Apple employees during the New Yorker and WIRED Apple Watch profiles earlier this year.\nIve’s new role will still leave him in charge of the company’s hardware and software design teams overall, but allowing others to handle the day-to-day affairs of each design group will free him up for other tasks. Among those other tasks, Ive says, is a focus on the design of Apple’s retail stores and new campus.\nIn fact, Ive’s part in designing the new campus extends beyond the building itself. He is responsible for designing a number of other items, such as the desks and chairs that will be used by employees.\nThe leadership change was first announced in a Telegraph profile by Stephen Fry today. An email from CEO Tim Cook to Apple employees, obtained by our Mark Gurman, confirmed the change today and helped flesh out the details of Ive’s new position and those of his new design leaders:\nTeam, I have exciting news to share with you today. I am happy to announce that Jony Ive is being promoted to the newly created position of Chief Design Officer at Apple. Jony is one of the most talented and accomplished designers of his generation, with an astonishing 5000 design and utility patents to his name. His new role is a reflection of the scope of work he has been doing at Apple for some time. Jony’s design responsibilities have expanded from hardware and, more recently, software UI to the look and feel of Apple retail stores, our new campus in Cupertino, product packaging and many other parts of our company. Design is one of the most important ways we communicate with our customers, and our reputation for world-class design differentiates Apple from every other company in the world. As Chief Design Officer, Jony will remain responsible for all of our design, focusing entirely on current design projects, new ideas and future initiatives. On July 1, he will hand off his day-to-day managerial responsibilities of ID and UI to Richard Howarth, our new vice president of Industrial Design, and Alan Dye, our new vice president of User Interface Design. Richard, Alan and Jony have been working together as colleagues and friends for many years. Richard has been a member of the Design team for two decades, and in that time he has been a key contributor to the design of each generation of iPhone, Mac, and practically every other Apple product. Alan started at Apple nine years ago on the Marcom team, and helped Jony build the UI team which collaborated with ID, Software Engineering and countless other groups on groundbreaking projects like iOS 7, iOS 8 and Apple Watch. Please join me in congratulating these three exceptionally talented designers on their new roles at Apple. Tim\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.6473049782932951
    },
    "article_6": {
        "title": "Trader Joe's grocery chain preparing to accept Apple Pay",
        "body": "Photo credit: Victor Marks.\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nPopular U.S. grocery chain Trader Joe's is gearing up to begin accepting contactless payments via Apple Pay at check-out, AppleInsider has learned.\nKiosks at Trader Joe's checkout counters across the U.S. have been seeing upgrades in recent weeks and months to VeriFone touchscreen machines. Some of these payment terminals already advertise that they accept Apple Pay, as seen above at a store in Raleigh, spotted by AppleInsider.\nNot all stores have yet enabled support for Apple Pay, even if the new VeriFone terminals are installed. For example, a trip Friday afternoon to the Trader Joe's in Brooklyn revealed that Apple Pay is not yet being accepted, and a check-out clerk mentioned that support is forthcoming at an unknown date.\nAppleInsider reached out to Trader Joe's to find out when Apple Pay support might be officially, fully coming to the grocery chain, but requests for comment were not returned as of Friday afternoon.\nManagers at two California stores separately verified that Trader Joe's is experimenting with touchless payment solutions, including Apple's, but has yet to make a formal decision on support. Employees at other locations had not yet heard of upcoming functionality.\nThe California-based, privately-held company owns more than 400 locations across the U.S., spanning to both coasts. Specializing in private label foods, organics and specialty products, it raked in an estimated $12 billion in revenue last year.",
        "sentiment": -0.19608823132390776
    },
    "article_7": {
        "title": "iPhone 6s could be Apple’s biggest ‘incremental’ upgrade of all time",
        "body": "The iPhone 6s and 6s Plus may just be the biggest incremental “s” upgrades Apple has ever done, according to a new report.\nAs per well-connected KGI Securities analyst Ming-Chi Kuo, the iPhone 6s will feature twice the RAM of its predecessors, a significant processor upgrade, better camera, new color option, sapphire display, strengthened shell, improved Touch ID and Force Touch.\nJust about the only thing that would stay the same, in fact, are the two size options!\nOn the RAM front, today’s report claims the iPhone 6s and 6s Plus will have 2GB of LPDDR4 RAM, compared to the 1 GB LPDDR3 RAM seen in the iPhone 6 and 6 Plus. The main difference between DDR3 and DDR4 are the price and the fact that the latter hits much higher clock speeds than the former.\nIt is also suggested that the iPhone 6s devices will boast Apple’s A9 chipset, 12-megapixel rear-cameras, improved Touch ID for Apple Pay and the same Force Touch technology seen on the Apple Watch and Retina MacBook.\nOn the exterior design front, Apple will reportedly attempt to avoid a redo of the (overblown) “Bendgate” phenomenon by using Series 7000 aluminum, which is approximately 60 percent stronger than the material used in current iPhones. (That’s the same aluminum utilized for the Apple Watch Sport.)\nCupertino is said to be planning to market a rose gold color option, again borrowing from the Apple Watch.\nFor those interested in a high-end device, KGI suggests there could be a limited-edition iPhone 6s Plus featuring a sapphire display — something that would serve as a trial run for an innovation Apple had hoped to apply to the entire iPhone 6 range before the collapse of GT Advanced Technologies put paid to those plans.\nThe report denies that a 4-inch iPhone will ship this year, saying Apple will instead stick with 4.7-inch and 5.5-inch versions. This makes sense given that Apple rarely changes the form factor dramatically for “s” releases.\nKGI’s rundown concludes that Apple is planning mass-production to start in August, predicting sales of 80 million to 90 million this year, and is once again expecting the smaller 6s to be more popular than the phablet 6s Plus.\nSuddenly, September can’t come quickly enough…\nVia: GforGames",
        "sentiment": 0.15097447312795198
    },
    "article_8": {
        "title": "Jewelers start gold plating Apple Watch to undercut Apple’s pricey Edition models",
        "body": "It’s no secret that the price of the Apple Watch rapidly increases if you want a gold model. The Apple Watch Edition with an 18 karat rose gold case starts at $10,000 and ranges to $17,000 for yellow gold models with a gold-plated band. Jewelers, however, looking to take some of Apple’s high-end Watch market, have now started offering their own take on the gold Apple Watch…\nFirst, Watch Plate offers to gold plate your own Apple Watch for $399. The process is relatively simple. You simply FedEx them your stainless steel Apple Watch and they will gold plate the device and ship it back to you, all within 3 business days. Watch Plate will even email you a FedEx label to make the shipment process as simple as possible. The company says it is using 24 karat rose gold or 24 karat yellow gold during its process.\nGolden Dreams takes a different approach to offering gold Apple Watch units. For $3,550, the company will soon offer gold-plated Apple Watch models in 24 karat yellow gold, 18 karat rose gold, and 18 karat white gold models. These watches are all custom-made in Geneva and ship worldwide. The company also touts that their gold-plated Apple Watch ships in a high-end luxury box. Alongside the Watch itself, Golden Dreams will also offer over 160 different colored Alligator leather straps. Hand engraving will also be available, according to the company.\nThe difference between the two is that with Watch Plate’s offering, you must supply your own Apple Watch unit, while Golden Dreams handles the entire acquisition process and ships gold-plated Apple Watch units directly to consumers. The latter makes for a more seamless, albeit more expensive, process. Golden Dreams also touts that its straps are of the same quality of a Rolex and other high-end watch manufacturers.\nLast month, we also showed how you could easily turn an Apple Watch Sport into an Apple Watch Edition with a can of spray paint. Of course with that method, you’re only coating the device in paint, not actually plating it in gold like the offerings from Gold Dreams and Watch Plate. It’s the appearance that matters, though, right?\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.2974752737652688
    },
    "article_9": {
        "title": "Apple drops discoveryd in latest OS X beta, following months of complaints about network issues with Yosemite",
        "body": "After many complaints from the developer community about poor networking performance on Yosemite, the latest beta of OS X 10.10.4 has dropped discoveryd in favor of the old process used by previous versions of the Mac operating system. This should address many of the network stability issues introduced with Yosemite and its new networking stack.\nThe discoveryd process has been subject to much criticism in recent months as it causes users to regularly drop WiFi access and causes network shares to list many times over, due to bugs. Many developers, such as Craig Hockenberry, have complained about the buggy software and workarounds have been found to include substituting the older system (called mDNSResponder) back into Yosemite.\ndiscoveryd would cause random crashes, duplicate names on the network and many other WiFi-relate bugs. In the latest beta, Apple appears to have applied the same fix as the enthusiasts by axing discoveryd completely.\nLooking at Activity Monitor on OS X 10.10.4 seed 4, discoveryd is no longer loaded by the system — instead relying on mDNSResponder. The ‘new’ process is really the one Apple used to use pre-Yosemite and did not have these problems.\nIt is still unclear why the change in the networking stack was ever made given that the old process worked so well and the new process had so many issues. There has been some speculation that the new stack is related to AirDrop and Handoff functionality although testing showed that these features still worked when the system was reverted back to the old process.\nRegardless, it will please many to see that Apple has finally addressed these complaints, even if it embarrassingly involves going back to the old system rather than fixing the new code. OS X 10.10.4 will be released to the public in the coming months.\nApple is focusing on performance and stability for iOS 9 and OS X 10.11, so it will be interesting to see whether discoveryd makes a comeback in Apple’s next-generation operating system.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.19291763727863628
    },
    "article_10": {
        "title": "Apple plans to refresh iOS 9, OS X 10.11 using new Apple Watch font",
        "body": "Apple is currently planning to use the new system font developed for the Apple Watch to refresh the looks of iPads, iPhones, and Macs running iOS 9 “Monarch” and OS X 10.11 “Gala,” according to sources with knowledge of the preparations. Current plans call for the Apple-designed San Francisco font to replace Helvetica Neue, which came to iOS 7 in 2013 and OS X Yosemite just last year, beginning with a June debut at WWDC…\nThe slightly flashier and somewhat more readable San Francisco font first appeared on the Apple Watch, which was shown in September 2014 and released last month. Given the considerably smaller displays used on 38mm and 42mm Apple Watches, Apple developed the San Francisco font “specifically for legibility,” according to a description of typography on the Apple Watch Human Interface webpages for developers. San Francisco scales more dynamically to “maintain clarity and legibility” regardless of text size.\nUsers have already hacked OS X Yosemite to use San Francisco\nEver since switching to particularly thin weights of Helvetica Neue in iOS 7, Apple has been chastised for using a font that emphasizes clean lines over readability, and San Francisco is intended to solve this. According to the sources familiar with the decision to move to the San Francisco type face on iOS and OS X, Apple higher-ups also believe that the new look will serve to refresh its familiar operating systems, helping iOS and OS X to avoid becoming stale. However, some Apple engineers have told us that they are not fans of the new font, which may look particularly rough on non-Retina screens.\nInstalling a new system-wide font is also not as simple as it may seem. The change requires Apple to tweak all of its pre-bundled applications across iOS and OS X to fit the new font. It also requires additional quality assurance testing to ensure that the font does not unintentionally alter usability at different font sizes, or across third-party App Store apps. Multiple Apple employees tell us that new daily builds of OS X 10.11 and iOS 9 began including the new font toward the end of March. Apple will likely also push developers to redesign their apps ahead of the new font’s general release this fall.\nSome third-party developers have already started to redesign their apps for San Francisco, which began to stretch beyond the Apple Watch when the new 12-inch MacBook debuted with keyboard characters printed in the new font. While Apple is certainly well into the process of redesigning its two main operating systems to match the Apple Watch’s typography, sources did warn that Apple could ultimately choose to retain Helvetica Neue this year and push back or cancel its plans for San Francisco. The WWDC keynote will be held on Monday, June 8th.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.06251709037186469
    },
    "article_11": {
        "title": "iOS 9 &amp; OS X 10.11 to bring ‘quality’ focus, smaller apps, Rootless security, legacy iPhone/iPad support",
        "body": "For the first time in several years, Apple is changing up its annual iOS and OS X upgrade cycle by limiting new feature additions in favor of a “big focus on quality,” according to multiple sources familiar with the company’s operating system development plans. We first reported in February that iOS 9, codenamed “Monarch,” would heavily feature under-the-hood optimizations, and we’ve now learned that Apple is taking the same approach with OS X 10.11, codenamed “Gala.” Sources have revealed additional new details on how Apple will optimize the new operating systems for improved stability and performance, add several new security features, and make important changes to its Swift programming tools for developers…\nAccording to sources within Apple’s software development departments, Apple engineers have been pushing executives for a Snow Leopard-style stability focus in 2015, following numerous bugs that clouded the launches of both iOS and OS X. Apple directors reportedly opposed a complete pause on new features, but agreed to focus on quality assurance by holding back some features that were initially planned for the latest operating system launches. One source explained, “I wouldn’t say there’s nothing new for consumers, but the feature lists are more stripped down than the initial plans called for.”\nNew Features For iOS 9 and OS X 10.11\nApple’s broader and deeper quality assurance testing includes stricter stability and polish guarantees before new features are officially added to iOS 9 and OS X 10.11. We reported that iOS 9 is expected to include the Apple Watch’s new San Francisco typeface as its system-wide font, while a new Home application for managing HomeKit devices, split-screen iPad app views, and an upgraded Apple Maps application with mass transit directions are also in the cards. As for OS X 10.11, we are told that Apple has realized that annually adding new features to the mature Mac operating system is more challenging than with iOS, so 10.11’s upgrade list may be slimmer than iOS 9’s.\nBut that does not mean OS X 10.11 will be feature-less: we’re told that the new operating system will have system-wide interface tweaks to continue the work done in OS X Yosemite, as well as the San Francisco font from the Apple Watch and iOS 9. Additionally, Control Center has been planned for inclusion in OS X 10.11, after appearing in some early beta seeds of last year’s OS X Yosemite, only to be left out of the final release. Control Center moves many of the controls from the Mac’s Menu Bar to a pane that slides out from the left side of the Mac’s display, adding on-screen music controls and other iOS-influenced features. However, Control Center reportedly has been in flux during development, and could be pushed back again.\nSecurity Upgrades – Rootless, iCloud Drive + Trusted Wi-Fi\nMarquee features aside, Apple has been working on significant enhancements to the security fundamentals of both operating systems, ranging from a major new initiative called “Rootless,” re-architected Apple apps with iCloud Drive file encryption, and a new feature called “Trusted Wi-Fi.”\nRootless\nSources within Apple are particularly enthusiastic about a new security system called Rootless, which is being described internally as a “huge,” kernel-level feature for both OS X and iOS. To prevent malware, increase the safety of extensions, and preserve the security of sensitive data, Rootless will prevent even administrative-level users from being able to access certain protected files on Apple devices. Sources say that Rootless will be a heavy blow to the jailbreak community on iOS, though it can supposedly be disabled on OS X. Even with this Rootless feature coming to OS X, sources say that the standard Finder-based file system is not going away this year.\niCloud Drive\nIn order to make its syncing apps more secure for consumers, Apple is in the process of converting many of its core applications to an iCloud Drive back end. Currently, Apple applications such as Notes, Reminders, and Calendar utilize an IMAP-based back end for syncing content across devices, whether you’re using an iCloud, Gmail, or Yahoo account.\nWith iOS 9 and OS X 10.11, Apple plans to transition this sync process to iCloud Drive, which offers better end-to-end encryption and faster syncing than traditional IMAP servers. As an example of how this will work, when a user launches Notes in either of the new Apple operating systems, a splash page offering to move content from the IMAP server over to iCloud Drive will appear, making the transition easy for users.\nThe promotion of iCloud Drive will also likely pull some users away from competitors, and move them over to Apple’s cloud services. According to sources, Apple is also upgrading its iCloud Drive and CloudKit servers to sustain the expected uptick in usage when more core applications move to a pure iCloud foundation. A dedicated iCloud Drive app to view files has also been developed, but it may remain for internal use only.\nTrusted Wi-Fi\nLast on the security front, we are told that a new feature dubbed “Trusted Wi-Fi” is in development for release as soon as later this year, but that it could be pushed back to next year’s iOS and OS X releases. Trusted Wi-Fi would allow Macs and iOS devices to connect to authorized wireless routers without additional security measures, but would instate a more heavily encrypted wireless connection for non-trusted routers. Apple has been testing its own apps and third-party apps to ensure that they will still work over various wireless networks with this feature enabled.\nOlder Device Optimization – Good News for iPhone 4S + iPad mini\nWhile some users of older iOS devices have speculated that Apple’s recent operating systems were built to encourage the purchase of new phones and tablets, the company has actually been working on ways to make legacy iPhones and iPads more efficient while running the upcoming iOS 9.\nIn what will come as a surprise to many people, our sources note that even A5-based Apple devices, including the original iPad mini and discontinued iPhone 4S, will be able to run iOS 9. In order to avoid the sluggishness and bugginess that was most notably seen in iOS 7 for the iPhone 4, Apple has restructured its software engineering process to better support older hardware.\nInstead of developing a feature-complete version of iOS 9 for older hardware and then removing a handful of features that do not perform well during testing, Apple is now building a core version of iOS 9 that runs efficiently on older A5 devices, then enabling each properly performing feature one-by-one. Thanks to this new approach, an entire generation (or two) of iPhones, iPads, and iPod touches will be iOS 9-compatible rather than reaching the end of the iOS line.\nSwift 2.0 + Smaller App Sizes\nBesides re-organizing its development process to improve older iOS hardware, Apple is preparing a major upgrade to its Swift programming language. Swift was first introduced at the 2014 Worldwide Developers Conference, and the new version will benefit both developers and users.\nSince Swift is still evolving as a development language, Apple previously did not include Swift programming “code libraries” within iOS. For this reason, developers who choose to write App Store apps with Swift must include the code libraries inside each of their apps. Consequently, App Store applications written in Swift carry approximately 8MB of additional code, and the more Swift apps you have, the more storage space you lose to code library copies.\nWith iOS 9 and OS X 10.11, we are told that this will change: Swift is planned to reach what is known as “Application Binary Interface (ABI) stability,” and its code libraries will therefore be pre-installed within the new iOS and Mac operating systems. This means that Swift applications updated for iOS 9 and OS X 10.11 will require less space and consume less data when downloaded over a cellular connection. Users with lower-capacity iPhones and iPads or non-unlimited cellular data plans will see at least small improvements over time.\nWhile Swift is planned to reach ABI stability in version 2.0 at WWDC 2015, Apple will apparently not ship Swift versions of its own iOS and OS X applications this year. Instead, we are told that Apple currently plans to convert its own apps over to Swift in 2016 via iOS 10 and OS X 10.12, unless unforeseen roadblocks emerge over the next year.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.20377470863362154
    },
    "article_12": {
        "title": "Microsoft announces Cortana for iOS and Android",
        "body": "While Cortana on iOS or Android won’t be as powerful as the Windows variant, due to various integrations, Microsoft is still providing notification support. You’ll get notifications for sports results, flights, and most of the Cortana features that currently exist in the Windows Phone and Windows 10 versions of the digital assistant. Microsoft’s Cortana cross-platform work is all part of a new phone companion experience for bringing services and features from Windows 10 to all smartphones. Microsoft’s phone companion will help Windows 10 PC owners find relevant apps on their Android, Windows, or iOS phones to make use of OneNote, OneDrive, and many other apps and services.",
        "sentiment": 0.5700867772102356
    },
    "article_13": {
        "title": "Apple Confirms Tattoos Can Interfere With Apple Watch [iOS Blog]",
        "body": "Apple has confirmed on a support page on its website that dark wrist tattoos have the potential of interfering with the Apple Watch's heart rate sensor (via Trusted Reviews). It was reported earlier this week that some tattoos, particularly dark or saturated ones, can affect the Apple Watch's heart rate sensor and ability to register contact with the wearer's skin.\n\"Permanent or temporary changes to your skin, such as some tattoos, can also impact heart rate sensor performance. The ink, pattern, and saturation of some tattoos can block light from the sensor, making it difficult to get reliable readings.\"\nApple does not offer a useful solution beyond connecting the Apple Watch wirelessly to external heart rate monitors such as Bluetooth chest straps, suggesting that users with tattoos covering the wrist may be forced to deal with this issue. Apple outlines skin perfusion and rhythmic movements as two other factors that can affect the performance of the Apple Watch's heart rate sensor.",
        "sentiment": -0.8153744538625082
    },
    "article_14": {
        "title": "Apple Pay is creaming Walmart",
        "body": "const FP = {“featured_posts_nonce”:”7ef09c8140″,”featured_posts”:[{“description”:”Passive income can help you make more money outside of your day job and reach your financial independence goals. Give one or more of these ideas a try.”,”hub”:{“hub_title”:”Financial Independence”,”hub_link”:”https:\\/\\/time.com\\/nextadvisor\\/financial-independence\\/”},”ID”:65583,”image”:”https:\\/\\/time.com\\/nextadvisor\\/wp-content\\/uploads\\/2023\\/01\\/passive-income-ideas.jpg”,”link”:”https:\\/\\/time.com\\/nextadvisor\\/financial-independence\\/passive-income-ideas\\/”,”post_title”:”5 Passive Income Ideas That Will Make You Money in 2023″,”reading_time”:5},{“description”:”If your finances are in the red heading into the new year, you\\u2019re not alone. Total debt across U.S. households reached $16.51 trillion in the third quarter of 2022, exceeding pre-pandemic levels and reflecting a surge in consumer prices and demand. The biggest contributors were credit card balances, which increased at their fastest pace in […]”,”hub”:{“hub_title”:”Loans”,”hub_link”:”https:\\/\\/time.com\\/nextadvisor\\/loans\\/”},”ID”:65275,”image”:”https:\\/\\/time.com\\/nextadvisor\\/wp-content\\/uploads\\/2022\\/12\\/You-Took-Out-New-Debt-in-2022.-Heres-How-to-Manage-It-in-2023.jpg”,”link”:”https:\\/\\/time.com\\/nextadvisor\\/loans\\/managing-debt-in-2023\\/”,”post_title”:”You Took Out Debt in 2022. Here’s What to Do With It in 2023″,”reading_time”:5},{“description”:”While taxes might be the furthest thing from your mind right now, there is a lot you can do before the end of January filing date to make the 2022 tax filing season easier. “,”hub”:{“hub_title”:”Taxes”,”hub_link”:”https:\\/\\/time.com\\/nextadvisor\\/taxes\\/”},”ID”:65254,”image”:”https:\\/\\/time.com\\/nextadvisor\\/wp-content\\/uploads\\/2022\\/12\\/Tax-Tips.jpg”,”link”:”https:\\/\\/time.com\\/nextadvisor\\/taxes\\/best-money-expert-tax-tips\\/”,”post_title”:”3 Things Money Experts Are Doing Now to Make Tax Season a Breeze”,”reading_time”:7}]};",
        "sentiment": -0.1915758490562439
    },
    "article_15": {
        "title": "Apple discontinues 15\" MacBook Pro BTO models ahead of Force Touch refresh",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple on Friday began discontinuing many models of its professional 15-inch notebook ahead the company's annual developers conference, which is widely expected to give way to updated models with Force Touch trackpads and Intel's latest mobile processors.\nIn an effort to draw down channel inventory ahead of the conference — which runs June 8 to 12 in San Francisco — Apple began delaying shipments of many non-standard (otherwise referred to as \"BTO\" or \"CTO\" configurations) several weeks ago. At the time, AppleInsider reported on the MacBook drawdown, noting that estimated shipping times were rapidly increasing.\nSince then, most indirect channel partners and some retail stores have run out of many or all 15-inch MacBook Pro models, as seen in our Mac Price Guides. And on Friday, the Cupertino-based company began officially discontinuing many of those same CTO models while preparing final shipments of the two standard 15-inch MacBook configurations.\nFor instance, MacMall is completely out of 15-inch MacBook Pro models, including retail configurations, while Amazon and most other resellers only retain stock of the base configuration. Meanwhile, Apple's own online store says standard models are available to ship in three to five business days, but configuring a model with faster processors bumps up the lead time to two to three weeks — around the time of Apple's annual Worldwide Developers Conference (WWDC).\nMost telling, however, are two pages (one & two) on the online store of Apple Authorize Reseller B&H's which were updated within the last 12 hours to indicate that both models have been marked end-of-life (EOL), or retail speak for a product that is discontinued. The first being a 2.8GHz version with 512GB SSD and another with 1TB of flash storage. At the same time, B&H also raised the price of the two standard 15\" configurations (MGXA2LL/A & MGXC2LL/A) overnight — the latter back to MSRP — indicating that stock of those models is similarly running thin.",
        "sentiment": -0.1924144309014082
    },
    "article_16": {
        "title": "EXCLUSIVE: iOS 9 to have dual-app viewing mode, multi-user support",
        "body": "Facing slowing growth for the first time since the iPad’s 2010 debut, Apple is working on several significant software and hardware updates to reinvigorate the tablet over the next year. Apple is developing a dual-app viewing mode, 12-inch iPads codenamed “J98” and “J99,” as well as support for multi-user logins, according to sources briefed on the plans. First planned for debut last year, the split-screen applications feature for the iPad could be introduced as soon as June at Apple’s annual Worldwide Developers Conference, while multi-user login support and the 12-inch iPads will apparently arrive later…\nApple had originally intended to debut side-by-side app support with iOS 8 on the iPad Air in 2014, matching the cornerstone feature of Microsoft’s Surface and Surface Pro tablets. In the lead up to WWDC 2014, the feature was deemed too unpolished for public consumption and pulled from iOS 8.0, with tentative plans to appear in iOS 8.1. However, Apple reprioritized its software engineering resources to finish up the iPhone 6, iPhone 6 Plus, and Apple Watch, opting to cut the split-screen app feature for the time being, and reassign the majority of the engineers who were working on it.\nSources now say that Apple plans to show off the side-by-side feature for iOS 9 using currently available iPad models. The latest plans suggest that the split-screen mode will support 1/2, 1/3, and 2/3 views depending on the apps. When split, the screen can either display two different apps side-by-side, or multiple views of the same app. This would enable iPad users to see two separate Safari tabs, or compare a pair of Pages documents at the same time. Sources are quick to warn, however, that the feature could still be pulled before next month’s conference, as additional polish would be needed to bring it to the same level as other features that will be making their way into the first iOS 9 beta next month.\nWhile Apple has tested the feature with plans to release it for current iPads, we are told that the feature was actually developed with a larger, 12-inch iPad in mind, so it could potentially be held back for a debut with the new hardware. Sources have confirmed that Apple is testing jumbo-sized iPads internally codenamed “J98” and “J99,” which are apparently larger versions of the Wi-Fi-only and Wi-Fi + Cellular iPad Air 2, save for additional speaker holes. Dubbed “iPad Pro” in prior reports, the larger device’s launch date is yet to be locked down, as the tablet is still waiting for its software to be finished up, and new hardware components to be readily available.\nWhile current “iPad Pro” prototypes are said to run a version of iOS that looks like a larger variant of the iPad mini and iPad Air version, Apple’s goal is to further tweak iOS for the bigger iPad so users can better leverage the additional screen real estate. Besides split-screen apps, Apple is considering redesigning core apps and features, including Siri and Notification Center, to be better presented on the larger display. This new iPad is also rumored to have additional keyboard and USB support, and basic manufacturing schematics for the device leaked late last year.\nAnother significant iPad feature in the pipeline is support for multiple users, according to sources. This feature will allow several users to share an iPad, but have access solely to their own apps, documents, and media, like on a Mac. As of earlier this year, Apple had planned to ship multiple user support in iOS 9, but sources now indicate that the feature has been pushed back from its planned WWDC Keynote debut and is unlikely to be ready for iOS 9.0 this fall. However, the feature is still in simultaneous development with iOS 9 as Apple executives believe it to be critical to the enterprise and education sectors. Consequently, it could be released later this year as a .1 or .2 upgrade to iOS 9, alongside the “iPad Pro,” or next year.\nFor iOS 9, we have reported that Apple is planning transit directions support for Maps, a font change to the Apple Watch’s San Francisco typeface, and a new Home app to support HomeKit. We first reported in February that iOS 9 will also have a major focus on stability, optimization, and security fixes.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.00338471915434908
    },
    "article_17": {
        "title": "Discoveryd Clusterfuck",
        "body": "discoveryd Clusterfuck\nI usually keep things fairly clean on this site. I have a simple metric: would I be embarrassed if my Mom read this post? As you’ve probably guessed from the title, this post is going to be different.\nSo, Mom, it’s time to stop reading. I’m pissed off and you know how I get when that happens.\nIn case you’re wondering what I’m talking about, look at this shit. A network process using 100% of the CPU, WiFi disconnecting at random times, and names, names (1), names (2), names (4). All caused by a crappy piece of software called discoveryd .\nI started reporting these issues early in the Yosemite beta release and provided tons of documentation to Apple engineering. It was frustrating to have a Mac that lost its network connection every few days because the network interfaces were disabled while waking from sleep (and there was no way to disable this new “feature”.)\nRegardless of the many issues people were reporting with discoveryd , Apple went ahead and released it anyway. As a result, this piece of software is responsible for a large portion of the thousand cuts. Personally, I’ve wasted many hours just trying to keep my devices talking to each other. Macs that used to go months between restarts were being rebooted weekly. The situation is so bad that I actually feel good when I can just kill discoveryd and toggle the network interface to get back to work.\nOnly good thing that’s come of this whole situation is that we now have more empathy for the bullshit that folks using Windows have suffered with for years. It’s too bad that Apple only uses place names from California, because OS X Redmond would be a nice homage.\nIt’s no secret in the tech community that discoveryd is the root cause of so many problems. There are even crazy workarounds. With so many issues, you’d expect some information from Apple explaining ways to mitigate the problems.\nNope.\nThe only explanation I can come up with for this astounding lack of information is that there’s some mid-level product manager at Apple who’s covering their ass. I hope this person who’s responsible for withholding advice feels good about themselves, because the rest of us hate them with the burning passion of a thousand suns. Being stingy with knowledge in an engineering organization is a fucking stupid career move.\nTo give you an idea of how helpful a tiny piece of information is towards people’s productivity, let me give you a simple example that’s already saved me hours of frustration.\nFor months, I’ve seen bullshit like this in Bonjour:\nThat shows the xScope service on the Mac that provides data for the Mirror on iOS. In that screenshot, the service is being shown as available on three devices: one with just an IPV6 address, one with no IP addresses, and one with a duplicate IPv6 address and a valid IPv4 address. The name “CedarX” was the only way I could find to prevent names from incrementing (and breaking things that use the host name of that device.)\nThe “funny” thing is that this Mac is running the latest version of 10.10 with fixes for “WiFi issues”. And after tweeting about it in frustration, I got this response:\n@chockenberry do you have airport extreme and Apple TVs on your network? Turn all Apple TVs off, reboot the airport. Power up the Apple TV. — Hendrik ☠ (@Asmod4n) March 31, 2015\nI followed Hendrik’s advice and guess what? No more network issues.\nBonjour keeps a cache that’s shared amongst devices on the network. This is so that if the device is asleep, another one that’s awake can provide the necessary information. I suspect that a device running an older version of discoveryd poisoned this cache. For some reason, the invalid cache information couldn’t be corrected by a newer version of the software which screwed things up in the first place.\nBut this is all just conjecture because Apple hasn’t written that fucking tech note.\nThis situation also shows another important aspect of the discoveryd clusterfuck: this code is all over the place. It’s in use by iOS, OS X and presumably whatever is running on the Apple Watch. As such, any one of those devices can poison Bonjour for everything else on your network.\nThis workaround is fairly simple if you’re on a home network where you have direct physical access to the all the devices. But as we all know, wireless networking is essential in places like an office, an airport or a coffee shop. Good luck rebooting everything in that kind of environment. And what happens when someone running an older version of OS X connects to that network and poisons it? Time to reboot!\nYou also can’t rely on software updates to fix everything: I have both an Airport Express and Apple TV that are no longer receiving fixes. Having to buy new hardware because of crappy software adds insult to injury.\nIronically, these issues are most likely to affect Apple’s best customers. The more devices you have, and the longer you have them, the more likely you are to get an unstable network. The only advice I can offer is to restart your entire network.\nC:\\ONGRTLNS.OSX",
        "sentiment": -0.40607035638026473
    },
    "article_18": {
        "title": "Spotify turns up the heat against Apple’s streaming music service, making fresh anti-competitive behaviour claim",
        "body": "Spotify, which is widely believed to be behind the antitrust allegations that led to both EC and DOJ investigations into Apple, has now added a fresh complaint. The Verge reports Spotify is complaining that the 30% cut Apple takes from in-app Premium subscriptions in the iOS app amounts to an “Apple tax.”\nApple charges a 30 percent fee toward any sales through its App Store, and that includes subscription services. That means if Spotify wants to sell its premium subscription service — which usually costs $9.99 a month — through the App Store, it has to raise the price 30 percent higher to $12.99 to pull in the same revenue, while Apple can still offer Beats at a lower price. Spotify and many others in the music industry believe Apple’s App Store tax gives them an unfair advantage over the competition.\nOne unnamed music industry source said that Apple taking 30% was “**cking bullsh**” …\nSpotify Premium normally costs $9.99/month, and if you sign up via the web at that price, you can use your Premium subscription in the iOS app. But if you download the app, use the free tier and then buy a Premium subscription via an in-app purchase, it costs $12.99 – and App Store guidelines mean the app can’t point you to the web instead.\nThe allegations leading to the EC and DOJ investigations are that Apple has been engaging in anti-competitive behavior by pressuring music labels into dropping support for free, ad-supported streaming services like Spotify and YouTube. If true, this would suggest Apple is trying to reduce competition in the market from free services in order to make its rebranded Beats Music service more appealing.\nApple had reportedly hoped to offer its own service for $5/month, but was unable to secure the necessary deals from music labels. A revised attempt at hitting $7.99/month also reportedly failed for the same reason, even though Google Play offered initial All Access Signups for a $7.99 locked in.\nApple is expected to formally announce its streaming music at WWDC as part of an iOS 8.4 update that will see it integrated into the existing Music app, with access on Macs via an iTunes update. There is some doubt as to whether the service will actually launch at the point at which it is announced.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.4325289121052871
    },
    "article_19": {
        "title": "Steve Jobs' vision for Apple realized as iPhones reveal injustice, says Tim Cook",
        "body": "Steve Jobs’ vision of Apple products helping to change the world has come true, Apple chief executive Tim Cook said on Sunday, thanks to iPhone cameras enabling people to capture instances of injustice on film.\nCook was delivering the commencement speech at George Washington University, in Washington DC.\n“His vision for Apple was a company that turned powerful technology into tools that were easy to use, tools that would help people realize their dreams and change the world for the better,” Cook said of Jobs, Apple’s co-founder who died in 2011.\n“Our products do amazing things, and just as Steve envisioned, they empower people all over the world,” Cook continued. “People who are blind and need information read to them because they can’t see the screen. People for whom technology is a lifeline because they are isolated by distance or disability.\n“People who witness injustice and want to expose it. And now they can, because they have a camera in their pocket all the time.”\nIn one recent, high-profile instance, a video recorded by a bystander in South Carolina showed a white police officer shooting Walter Scott, a 50-year-old black man, eight times in the back as he ran away. The officer, Michael Slager, was charged with murder.\nPhone footage shows South Carolina police officer Michael Slager shooting dead Walter Scott. Guardian\nIn his 20-minute speech, Cook spoke about growing up in southern Alabama, where former governor George C Wallace blocked school doors to prevent blacks from enrolling. According to Cook, Wallace “embraced the evils of segregation”.\n“Meeting my governor was not an honor for me,” Cook said. “My heroes in life were Dr Martin Luther King and Robert F Kennedy, who have fought against the very things that Wallace stood for.\n“Keep in mind that when I grew up, I grew up in the place where King and Kennedy were not held in high esteem. When I was a kid, the south was still coming to grips with its history. My textbooks even said that the Civil War was about states’ rights. They barely mentioned slavery.”\nCook said that when he was 16, shaking hands with Wallace felt like a betrayal of his own beliefs. He impressed upon the students that “injustices like segregation have no place in our world” and that “equality is a right”.\n“In his letter from the Birmingham jail, Dr King wrote that our society needed to repent – not merely for the hateful words of the bad people, but for the appalling silence of the good people,” Cook said.\n“Sidelines are not where you want to live your life. The world needs you in the arena. There are problems that need to be solved. Injustices that need to be ended. People that are still being persecuted.”\nSince coming out last October, Cook has used his position to speak out against ‘religious freedom’ laws mooted in states such as Indiana and Arkansas, which critics say enable discrimination against gay people.\nAs he introduced Cook, GW’s president, Steven Knapp, said: “You’ve used your position as a platform to speak out about injustice and press for societal progress in the United States and around the world. As you recently told Fortune magazine, you want to be the pebble in the pond that creates the ripples for change.”\nCook was invited to be the commencement speaker on the suggestion of the GW students. He joined Apple in 1998 and served as chief operating officer before taking over as CEO in 2011.\nEnding his speech, Cook put his iPhone camera to use by taking a photo of the graduates.\n“This is the best view of the world,” he said.",
        "sentiment": 0.0899204043123652
    },
    "article_20": {
        "title": "Quebec man fined $120 for using Apple Watch while driving",
        "body": "A Quebec man plans to fight the $120 ticket and four demerit points he got for using his Apple Watch while driving.\nJeffrey Macesin said he was using his smartwatch to change songs when a provincial officer pulled him over on a road near Pincourt, Que.\nMacesin said he was confused about why the officer’s flashing lights were on.\nThe officer then charged him under the section of the Quebec Highway Safety Code that says “no person may, while driving a road vehicle, use a hand-held device that includes a telephone function.”\nMacesin disputes that an Apple Watch counts as a “hand-held.”\n“It’s on my wrist,” he said. “That's where it gets really controversial.”\nTraffic lawyer Avi Levy agreed the law isn’t clear.\n“It was just a question of time before we actually got a case like this,” Levy said.\n“I'm not convinced that the Apple Watch itself is a phone,” he added. “It's rather a Bluetooth device that communicates the telephone signal from the phone and it has been established under the law that you are allowed to use Bluetooth devices.”\nWith a report from CTV Montreal",
        "sentiment": -0.5700947402722456
    },
    "article_21": {
        "title": "Thieves can bypass Apple Watch passcode to pair a stolen watch with their own phone",
        "body": "Wrist-detection on the Apple Watch is supposed to ensure that it will ask for the passcode if removed from your wrist, but as a YouTube video posted by iDownloadBlog demonstrates, a thief is able to reset the watch without having to enter the passcode. They are then free to pair it with any other iPhone.\niPhones are protected by Activation Lock, which means that even if a thief performs a hard reset of the phone, it cannot be reactivated without the original owner’s Apple ID and password. The Apple Watch, however, has no such protection, and does not require a passcode to wipe it – as shown in the video below …\nSince Activation Lock was introduced in iOS 7 and turned on by default in iOS 8, there has been a dramatic reduction in iPhone thefts around the world, officials noting reductions of 25% in New York, 40% in San Francisco and 50% in London.\nThe Apple Watch is theoretically protected by a passcode which has to be entered if the device is removed from your wrist, but an apparent bug allows a hard reset to be performed without it.\nA hard reset is carried out by a long-press of the Contacts button until a power-off option is offered. Force Touching this option brings up a dialogue offering to erase all contents and settings, which can be executed simply by placing the watch on the charger – no passcode required.\n[youtube=https://www.youtube.com/watch?v=cOcd7xx0vMs]\nI verified this with my own Apple Watch, and it works exactly as shown.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.1935902318606774
    },
    "article_22": {
        "title": "Google finally working on improvements to RAM and power usage for Chrome [x-post r/pcmasterrace]",
        "body": "Chances are, if you use Google Chrome, you have noticed just how much RAM the browser tends to eat up. Well, Google's development team is also aware of this and is now working on a fix, which will hopefully make Chrome use up fewer resources.\nCurrently Chrome creates a new process for each tab and instance of the browser opened. This can make the browser sluggish on some machines and a battery life nightmare for mobile users. Speaking during a Reddit AMA session late last week, a Chrome for Android engineer said: “We are actively working on reducing battery usage and we are looking into when Chrome is in the foreground and in the background.”\n“Since its inception Chrome has been focusing on security and performance of the web across all supported platforms. Performance sometimes has come at the cost of resource usage, but given the importance of the mobile platform this is one of the top things we are looking into.”\nWhile mobile is a big focus, Google has not forgotten about desktop users. On the desktop side, Google is currently trying to fight memory leaks: “We are profiling Chrome to improve our start-up speed and proactively fighting memory bloat and memory leaks. For example, this year the first gesture latency and mean input latency has decreased steadily.”\nDiscuss on our Facebook page, HERE.\nKitGuru Says: Google does tend to eat up as much RAM as you can throw at it. Have any of you guys had any problems with Chrome RAM usage?\nVia: The Inqurier\nBecome a Patron!",
        "sentiment": 0.08268567094845432
    },
    "article_23": {
        "title": "Schiller’s Law (\"When assessing sales for a new model of the iPhone, Apple used an easy shorthand: “Each new generation sold approximately equal to all previous generations combined.”\"﻿)",
        "body": "We know how many iPhones Apple ships but we don’t know exactly how many of each model. We can try to come close in such estimates of “mix” by looking also at the market pricing of the phones and the average price Apple obtains\nCombining what we know with some guesses allows some of us to estimate the composition of iPhone models in any given quarter’s sales. Here is a graph showing my estimates:\nHaving this, we can then assess how each generation of iPhones has performed. Remember that although we had a new iPhone for each of the last eight years, there are only 5 generations in total. Starting with the 3G (second generation) the generations were two yearly product cycles long.\nThe resulting estimates for generational growth are shown below.\nI included a second graph with revenues. Note that the iPhone 5 and iPhone 6 have not run their course. History suggests at least a five year run for any one generation and the 5 is at less than three years old and the 6 is at less than one.\nThe interesting question is therefore not whether each generation sells more than its predecessor but whether it does so by a substantial multiple. I drew in outline a few estimates on future volumes for the 5 through its end of life and for the 6 for the current and next year. Of course these are highly speculative but the question of how much can be expected from these generational leaps is interesting.\nRecall that\nWhen assessing sales for a new model of the iPhone, Apple used an easy shorthand: “Each new generation sold approximately equal to all previous generations combined.” Phil Schiller’s Testimony in Apple v. Samsung trial\nSuch a pattern of growth, which I call “Schiller’s Law” is extremely difficult to maintain and probably won’t apply in the case of the 5 or 6. However the growth of the overall franchise is very apparent. In particular you can see how first year sales have a very healthy pattern of growth, especially when measured in terms of revenues.",
        "sentiment": 0.03495303029194474
    },
    "article_24": {
        "title": "Linked to by Phil Schiller: A review of the Apple Watch by someone with Usher Syndrome",
        "body": "Having known about the Apple Watch for some time and knowing lots of my friends were planning to buy one, I was sceptical as my needs are quite different to that of those of the sighted and hearing.\nI have to rely on specific accessible features.\nHowever, I was curious as Apple products have been more than just up market gadgets to me, they really have been my access to the many things most take for granted but that those of us with deafblindness, particularly struggle with.\nI was born deaf and registered blind when I was 14. The condition I have is Usher Syndrome Type 2a. I am severely deaf and have only a very small tunnel of vision in my right eye now so I was concerned not just about the face size but how busy it would appear to me and also if there would be an uncomfortable glare.\nCuriosity got the better of me so I ordered one but I wasn’t excited, so not disappointed when informed I would not receive mine until mid June!\nI should explain that I wear two digital hearing aids and communicate orally – not everybody with usher syndrome communicates orally and there are not two people with the condition the same, but there are similarities.\nI had been wearing a Bradley Timepiece since last summer and love both the retro look and the practicality of a completely tactile watch brilliant and stylish, quite a rarity when it comes to anything designed specifically for people with disabilities.\nI can read the time by touch completely independently with my Bradley and I still love it.\nI decided to order the Apple Watch Sport 42mm (the bigger face size) with white strap so I’d not lose it quite so easily.\nThe white strap, silver casing and black face would be a workable contrast for me.\nI was surprised to receive an email the day before launch date to say my Apple Watch had been dispatched and you guessed it “I was excited!”\nI was delighted when the long white box arrived on Friday morning as I was heading into London that afternoon.\nMy first impression on opening the box was it was nice to hold, smooth rounded edges and the face size felt right on my wrist.\nThe watch strap on the “Sport” felt nice and was easy to fasten by touch alone.\nThe Apple Watch App had appeared automatically on the iPhone some time ago and it certainly made the set up “pairing” of the Watch simple, literally took a photo of the Watch face on my iPhone and that was that.\nI am already very familiar with the iPhone settings so fiddling around with the Apple Watch App was easy. I was able to adjust, fiddle and play with a few settings.\nIt was great the Apple Watch App to exactly what I need “Accessibility Features”\nBlack background with white writing, I personally prefer this as white background gives off a glare that is even more blinding to me and actually hurts my eyes.\nWhilst this works for me, I do prefer the colours and contrasts on my own website as they are less harsh on the eye.\nThe default settings I have on my iPhone are set to large text and I was pleased to be able to have this on my Apple Watch. I also use Zoom large text set to the largest.\nThe new setting “Prominent Haptic” is perhaps my favourite in accessibility.\nOn putting the Apple Watch on my wrist although on my small wrist it appeared large, it felt light and comfortable.\nAfter a little playing I discovered by holding down the face of the watch you can vary how the time is displayed, a standard clock face but typically Apple quirky or large numbers and digital.\nFor me personally the ‘home screen’, even with the bigger of the two watch face sizes is small to see and sometimes a little tricky to select certain apps. However, through the Apple Watch App on the iPhone most things can be set up.\nIt is possible to change your ‘Glances’ (shortcuts) by swiping upwards.\nI chose the weather, my calendar, my activity board, my music and my location.\nI have found this facility very useful and has made accessing the watch very quick and easy.\nOn the same day I got my watch Mum received hers too. This benefitted the trial use of communication between us. Just by selecting the button underneath the digital crown, you reach your favourite contacts.\nTo contact any of my favourites, which are already selected on my iPhone, is incredibly easy. Either speak into the Apple Watch or just sending an ‘emoji’ is also very easy. The speech to text is very impressive.\nI personally would not chose to read long emails or text messages on my watch, so although I want to be alerted via the Prominent Haptic setting I can choose when and how to access them that suits me best.\nBefore getting my Apple Watch I would have my phone either in my hand or a pocket nearest to my hand I would rarely feel the vibration from my iPhone and often missed messages. With the Apple Watch on my wrist, I am being notified via Prominent Haptics without issue and I really like that.\nAnother important safety point is the Apple Watch is very secure on my wrist so far less likely than an iPhone to be swiped from me.\nI am fortunate to have a few friends who also have the Apple Watch and together have devised ways of communicating in ‘Code’ when out, particularly when out at night and in dark situations when I am completely blind.\nUseful codes in the event I need help of any kind, for instance if I am in a badly lit and noisy environment and struggling to be included in something I can get message to friend I’m uncomfortable or I need assistance or help of some kind or “I’m bored” can we do something else!\nFor instance I can communicate using my Apple Watch screen using a small sketch, a “tap” or even send my heartbeat, each can be sent to another person with an Apple Watch and appears as a distraction, a vibration on the wrist and immediately I look to the watch.\nMum has certainly found benefit in the ‘tap’ for getting my attention when I am in my bedroom without my hearing aids on, I feel the nudge to get a move on or she wants my attention for something.\nThere is a vibration when a text message is received too – Prominent Haptics is definitely awesome for me as a deafblind person.\nSo far for me the most useful App on the Apple Watch is Maps – on my iPhone I can plan my journey from one destination to another, for me it will be on foot with Unis my guidedog.\nThis is where Haptics really come into its own – I can be directed without hearing or sight, but by a series of taps via the watch onto my wrist – 12 taps means turn right at the junction or 3 pairs of 2 taps means turn left, I’m still experimenting with this but so far very impressed – usher syndrome accessible!\nI have not reached the stage yet where I am fully reliant on Voice Over, though I have tried it. It is fairly good for navigating the watch. If at home, the Voice over is great, though if like me you are dual sensory impaired, it would be a real struggle to hear outside or in public. Though I have been told with Bluetooth hearing aids, there could be a solution.\nThese are my early findings and I’m now sure there will be much more for those like me who need to rely on technology.\nThe positives far outweigh the negatives for me personally. The audio could be louder and the price more accessible for those with sensory impairment and reliant on the sort of accessibility features Apple offer.\nI am now very happy to own an Apple Watch and look forward to making it work well for me.\nI will blog again in a few weeks when I’ve had time to use it more but so far very happy with it.",
        "sentiment": 0.2081161889721427
    }
}