{
    "article_0": {
        "title": "Apple debuts Smart Battery Case for iPhone 6s, extends life up to 25 hours",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nIn a surprise release on Tuesday, Apple debuted the Smart Battery Case for iPhone 6s and 6, the first integrated battery pack to come out of Cupertino since the original iPhone launched in 2007.\nAccording to the item's description, the Smart Battery Case is designed specifically for iPhone 6s and iPhone 6 devices, offering users a high level of protection and up to 25 hours of extended usage.\nLike Apple's current lineup of custom-fit iPhone cases, the battery-packed version is made from soft touch silicone and comes lined with microfiber material. A special elastomer hinge design allows for easy insertion and removal, suggesting the case itself is somewhat pliable.\nA small \"chin\" section houses the Lightning connector and what appears to be acoustic channels for iPhone's speaker and microphone. Importantly, a female Lightning port is built in to the case bottom, meaning iPhone owners connect their favorite Lightning accessories or charge iPhone and the Smart Battery Case simultaneously. Apple points out compatibility with the official Lightning dock.\nUnlike popular third-party designs that effectively double iPhone's sleek profile, like Mophie's Juice Pack, Apple chose to stuff the external battery into a small hump. Cutouts along the edges and case back provide access to iPhone's iSight camera, mute switch and headphone jack, while system volume controls and sleep/wake button remain snugly covered.\nApple fails to specify exact battery capacity information, but claims talk times can increase up to 25 hours, Internet browsing over LTE up to 18 hours, and audio and video playback up to 20 hours.\nWhen attached and charging iPhone, users can quickly check the pack's power status through a special lock screen graphic and in Notification Center's Batteries section.\nGerman language site iPhone-ticker.de also reported on Apple's Smart Battery Case launch.",
        "sentiment": 0.1247586056124419
    },
    "article_1": {
        "title": "Swift is now open source",
        "body": "Welcome to Swift.org\nWelcome to the Swift community. Together we are working to build a programming language to empower everyone to turn their ideas into apps on any platform.\nAnnounced in 2014, the Swift programming language has quickly become one of the fastest growing languages in history. Swift makes it easy to write software that is incredibly fast and safe by design. Our goals for Swift are ambitious: we want to make programming simple things easy, and difficult things possible.\nFor students, learning Swift has been a great introduction to modern programming concepts and best practices. And because it is open, their Swift skills will be able to be applied to an even broader range of platforms, from mobile devices to the desktop to the cloud.",
        "sentiment": 0.9508202416556222
    },
    "article_2": {
        "title": "TIL you can clear the iOS App Store cache by tapping one of the menu bar items 10 times.",
        "body": "If the App Store app on your iOS device is getting slower or not showing app updates correctly, a new trick can help, courtesy of Zachary Drayer.\nTo refresh your App Store app’s cache, tap on any of the tab bar items 10 times. The choices are: Favorites, Top Charts, Explore, Search, or Updates.\nKeep in mind: You must tap on the same item 10 times for the cache to clear. When it does, the app screen will go blank for a few seconds before resetting.\n@steipete tap on any of the tab bar items 10 times. — zachary drayer ✌ (@zadr) December 29, 2015\nAs saniul later confirmed, this fix also works in the native Watch and iTunes apps too, which is great to know.\nIf you come across iOS tips that you think would benefit other AppAdvice readers, let us know. You can find us on Twitter @appadvice.\nWe thank Drayer for bringing this fix some attention on Twitter.\nFor more news, see: Apple is expected to work on its own virtual reality products in 2016, 7 apps to help you start off the new year right, and AppAdvice’s top 10 free iPhone apps of 2015.",
        "sentiment": 0.056369006633758545
    },
    "article_3": {
        "title": "Google Maps for iOS gains up-to-date gas prices, popular business hours",
        "body": "Google’s Maps app for iPhone and iPad got a small but useful update on the App Store today. The latest version of the Google Maps iOS app now includes a couple of handy features.\nFirst up, and undoubtedly the most useful for drivers is the up-to-date gas prices in the US and Canada. The feature was included in the Android version of Google’s app a couple of months ago and lets users check nearby gas stations to see which has the most affordable prices. You can find prices simply be searching for ‘gas’ or ‘gas stations’ in the search field and Google Maps will automatically bring up the nearest options and list pricing for those locations.\nBusiness hours have been included in the app for some time, but today’s update also lets you check when is best to avoid/visit particular businesses. Like its online search and maps tools, the updated iPhone app brings the ability check popular visiting hours for local stores and outlets. Now you can see what you always knew about any business or retail location: It starts getting busy after lunch.\nGoogle Maps version 4.13.0 is available to download from the App Store for free and requires users to be running iOS 7.0 or later and is compatible with iPhone, iPod touch, and iPad.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.07450529594313014
    },
    "article_4": {
        "title": "Apple comes out against new UK spying bill, says it will endanger privacy and security",
        "body": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nApple has launched a scathing attack on the Government’s plans to give spies more powers.\nThe company has said in a rare public statement that it believes that Theresa May’s Investigatory Powers Bill would make the “personal data of millions of law abiding citizens […] less secure”.\nThe Government intends to bring in the Investigatory Powers Bill as soon as possible, to bring new powers to help intelligence agencies and law enforcement to conduct surveillance. But the legislation has been repeatedly criticised for over-reaching, and apparently banning some of the most central parts of modern technology.\nApple argues that the legislation should be re-written to be more clear about how the powers that are contained within it will be used. It made the statement as part of its submission to the joint scrutiny committee for the Investigatory Powers Bill.\n\"We believe there is a need for much greater clarity as to how the powers in the bill will be applied,” Apple’s submission reads. “Not least because, once again, the [powers] could endanger the privacy and security of users in the UK and elsewhere.\"\nApple’s criticisms centre around three key parts of the bill.\nThe first is that it requires that companies can break their own security measures so that messages can be more easily read.\nEncryption – which can be found in Apple’s iMessage and FaceTime messaging services – uses mathematical techniques to ensure that a message can only be read by the person it was sent to. But parts of the bill seem to suggest that technology should be broken open, so that messages can’t be kept from intelligence agencies.\nGadget and tech news: In pictures Show all 25 1 / 25 Gadget and tech news: In pictures Gadget and tech news: In pictures Gun-toting humanoid robot sent into space Russia has launched a humanoid robot into space on a rocket bound for the International Space Station (ISS). The robot Fedor will spend 10 days aboard the ISS practising skills such as using tools to fix issues onboard. Russia's deputy prime minister Dmitry Rogozin has previously shared videos of Fedor handling and shooting guns at a firing range with deadly accuracy. Dmitry Rogozin/Twitter Gadget and tech news: In pictures Google turns 21 Google celebrates its 21st birthday on September 27. The The search engine was founded in September 1998 by two PhD students, Larry Page and Sergey Brin, in their dormitories at California’s Stanford University. Page and Brin chose the name google as it recalled the mathematic term 'googol', meaning 10 raised to the power of 100 Google Gadget and tech news: In pictures Hexa drone lifts off Chief engineer of LIFT aircraft Balazs Kerulo demonstrates the company's \"Hexa\" personal drone craft in Lago Vista, Texas on June 3 2019 Reuters Gadget and tech news: In pictures Project Scarlett to succeed Xbox One Microsoft announced Project Scarlett, the successor to the Xbox One, at E3 2019. The company said that the new console will be 4 times as powerful as the Xbox One and is slated for a release date of Christmas 2020 Getty Gadget and tech news: In pictures First new iPod in four years Apple has announced the new iPod Touch, the first new iPod in four years. The device will have the option of adding more storage, up to 256GB Apple Gadget and tech news: In pictures Folding phone may flop Samsung will cancel orders of its Galaxy Fold phone at the end of May if the phone is not then ready for sale. The $2000 folding phone has been found to break easily with review copies being recalled after backlash PA Gadget and tech news: In pictures Charging mat non-starter Apple has cancelled its AirPower wireless charging mat, which was slated as a way to charge numerous apple products at once AFP/Getty Gadget and tech news: In pictures \"Super league\" India shoots down satellite India has claimed status as part of a \"super league\" of nations after shooting down a live satellite in a test of new missile technology EPA Gadget and tech news: In pictures 5G incoming 5G wireless internet is expected to launch in 2019, with the potential to reach speeds of 50mb/s Getty Gadget and tech news: In pictures Uber halts driverless testing after death Uber has halted testing of driverless vehicles after a woman was killed by one of their cars in Tempe, Arizona. March 19 2018 Getty Gadget and tech news: In pictures A humanoid robot gestures during a demo at a stall in the Indian Machine Tools Expo, IMTEX/Tooltech 2017 held in Bangalore Getty Gadget and tech news: In pictures A humanoid robot gestures during a demo at a stall in the Indian Machine Tools Expo, IMTEX/Tooltech 2017 held in Bangalore Getty Gadget and tech news: In pictures Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty Gadget and tech news: In pictures Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty Gadget and tech news: In pictures The giant human-like robot bears a striking resemblance to the military robots starring in the movie 'Avatar' and is claimed as a world first by its creators from a South Korean robotic company Jung Yeon-Je/AFP/Getty Gadget and tech news: In pictures Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty Gadget and tech news: In pictures Waseda University's saxophonist robot WAS-5, developed by professor Atsuo Takanishi Rex Gadget and tech news: In pictures Waseda University's saxophonist robot WAS-5, developed by professor Atsuo Takanishi and Kaptain Rock playing one string light saber guitar perform jam session Rex Gadget and tech news: In pictures A test line of a new energy suspension railway resembling the giant panda is seen in Chengdu, Sichuan Province, China Reuters Gadget and tech news: In pictures A test line of a new energy suspension railway, resembling a giant panda, is seen in Chengdu, Sichuan Province, China Reuters Gadget and tech news: In pictures A concept car by Trumpchi from GAC Group is shown at the International Automobile Exhibition in Guangzhou, China Rex Gadget and tech news: In pictures A Mirai fuel cell vehicle by Toyota is displayed at the International Automobile Exhibition in Guangzhou, China Reuters Gadget and tech news: In pictures A visitor tries a Nissan VR experience at the International Automobile Exhibition in Guangzhou, China Reuters Gadget and tech news: In pictures A man looks at an exhibit entitled 'Mimus' a giant industrial robot which has been reprogrammed to interact with humans during a photocall at the new Design Museum in South Kensington, London Getty Gadget and tech news: In pictures A new Israeli Da-Vinci unmanned aerial vehicle manufactured by Elbit Systems is displayed during the 4th International conference on Home Land Security and Cyber in the Israeli coastal city of Tel Aviv Getty\nApple’s submission says that the “best minds in the world cannot rewrite the laws of mathematics”, and that as a result there is no way of creating methods of encryption that would only give access to the Government or the intelligence agencies.\n\"The bill threatens to hurt law-abiding citizens in its effort to combat the few bad actors who have a variety of ways to carry out their attacks,” Apple’s section on encryption argues. “The creation of backdoors and intercept capabilities would weaken the protections built into Apple products and endanger all our customers.\n“A key left under the doormat would not just be there for the good guys. The bad guys would find it too.\"\nApple’s second criticism is that the law contains measures that would force companies like Apple to help the government to hack into phones so that information can be taken from them. The company points out that this will “extend responsibility for hacking from Government to the private sector”, and that it will undermine trust between technology companies and their users.\nBecause Apple sends the same version of its software to every user, wherever they are, the company would have to build those hacking and interception capabilities into every phone that it sells. That would mean that the same weaknesses could be used by governments and other bodies across the world, including in areas with much lesser safeguards or less strong human rights records.\nFinally, the company objects to the international aspects of the law, which allow it to apply extraterritorially. That means that Apple and other companies will have to abide by the law despite being based elsewhere, potentially putting it into conflict with other local laws.\nApple’s Tim Cook has spoken out publicly about safeguards for privacy and security, including comments about the Investigatory Powers Bill made in recent interviews. But the public criticism is an unusual step for the company itself, which has in the past rarely made statements about legislation or policy.\nNew legislation will have to be passed by the end of 2016, in part because existing laws will run out by the end of next year.\nBut Apple’s primary suggestion is that the bill should be re-written to provide more clarity about the more contested parts of the legislation.",
        "sentiment": -0.24895686771426545
    },
    "article_5": {
        "title": "PlayStation, Nintendo 64, Sega CD, and 13 other consoles come to OpenEmu 2.0",
        "body": "The creators of OpenEmu, the attractive multi-console emulator front end for OS X, have released version 2.0 of the software just in time for the holidays. OpenEmu 2.0 redesigns the user interface, adds real-time rewinding for gameplay, can organize screenshots and save-states, adds more than 80 homebrew games, and makes other improvements. But the biggest reason to update is that the front end now features support for 16 new consoles, including early 3D systems like the Nintendo 64 and Sony PlayStation.\nThe full list of consoles (and the emulator \"cores\" that are actually handling the heavy lifting) are all listed below.\nAtari 5200 (Atari800)\nAtari 7800 (ProSystem)\nAtari Lynx (Mednafen)\nColecoVision (CrabEmu)\nFamicom Disk System (Nestopia)\nIntellivision (Bliss)\nNintendo 64 (Mupen64Plus)\nOdyssey²/Videopac+ (O2EM)\nPC-FX (Mednafen)\nSG-1000 (CrabEmu)\nSega CD (GenesisPlus)\nSony PSP (PPSSPP)\nSony PlayStation (Mednafen)\nTurboGrafx-CD/PCE-CD (Mednafen)\nVectrex (VecXGL)\nWonderSwan (Mednafen)\nThose wanting to play disc-based games will be pointed to this section of the user guide, which outlines the specific formats that your game backups need to be stored in. Many of the newer consoles will also require BIOS files to work properly.\nOpenEmu 2.0 still has most of the same strengths and weaknesses as the first release—it makes configuration of gamepads and various emulation cores pretty simple, and it's a great way to visualize and organize collections of games, but it still lacks the 10-foot, controller-driven UI that you'd want if you were going to hook your Mac up to a television (the feature request is on the team's radar but doesn't appear to be a priority). OpenEmu 2.0 requires OS X 10.11, so those of you who haven't upgraded yet will want to do so first.",
        "sentiment": 0.2714286418631673
    },
    "article_6": {
        "title": "Daring Fireball on Sketch: the Mac App Store is rotting",
        "body": "Bohemian Coding:\nWe don’t expect this decision to be unanimously popular, but we want to share how we arrived at it. We take your satisfaction and support seriously, and hope you can understand the choice we have made. There are a number of reasons for Sketch leaving the Mac App Store — many of which in isolation wouldn’t cause us huge concern. However as with all gripes, when compounded they make it hard to justify staying: App Review continues to take at least a week, there are technical limitations imposed by the Mac App Store guidelines (sandboxing and so on) that limit some of the features we want to bring to Sketch, and upgrade pricing remains unavailable. We should also add that this move is not a knee-jerk reaction to the recent certificate expiration problems that affected so many Mac App Store customers. However, in light of what happened, we can’t help but feel vindicated in our decision that the Mac App Store is not in our customers’ best interests right now.\nDeeply troubling indictment of the Mac App Store. Sketch isn’t the first big name professional app to be pulled from the Mac App Store (Bare Bones Software’s BBEdit, Panic’s Coda, Quicken, just to name a few). But Sketch is the poster child for Mac App Store era professional Mac software. It’s the sort of app Apple might demo in a keynote — and the winner of an Apple Design Award. Apple thinks so highly of it that they provide Sketch templates for Apple Watch UI designers. It’s incredibly popular (and was among the top-grossers on the Mac App Store), Mac-only, and they want no part of the Mac App Store.\nThe Mac App Store should be designed to make developers like Bohemian Coding (and Bare Bones, and Panic, etc.) happy. It should make developing for the Mac better, not worse than selling outside the App Store. These are among the best apps on the platform, from developers who have been loyal to Apple and the Mac for decades.\nThe Mac App Store is rotting, at least for productivity software. There’s no other way to put it. If this hasn’t set off alarm bells within Apple, something is very wrong.\n★ Tuesday, 1 December 2015",
        "sentiment": 0.1672449144289682
    },
    "article_7": {
        "title": "The iPhone's camera is so good because 800 people are working on it",
        "body": "Apple was the subject of a wide ranging but not very hard hitting 60 Minutes segment on Sunday night. Charlie Rose steered the conversation through topics that Apple and its CEO Tim Cook have addressed repeatedly over the last few years. (Yeah, those Steve Jobs questions just keep coming.) But the episode did reveal one semi-interesting new detail: Apple now says there are 800 people solely dedicated to working on the iPhone's camera. That team of \"engineers and other specialists\" is led by Graham Townsend, who took Rose on a tour of the camera testing lab.\n\"There's over 200 separate individual parts\" in the iPhone's camera module, Townsend said. Then he demonstrated how Apple simulates various conditions to test out the camera's performance, from sunsets to lousy indoor lighting. \"We can simulate all those here,\" Townsend said. Apple's competitors certainly conduct many of those same tests, but the sheer size of Apple's camera team shows you how high up on the priority list it's risen. Apple has built entire ad campaigns around the iPhone's camera, and always makes it a point to highlight improvements with each new iPhone revision.\nGenerally, the interview lacked anything else noteworthy. At one point, marketing chief Phil Schiller addressed product cannibalization, but seemed pretty nonchalant about it. \"It's not a danger, it's almost by design,\" he said of Apple's products making other Apple products less appealing. \"You need each of these products to try to fight for their space, their time with you. The iPhone has to become so great that you don't know why you want an iPad. The iPad has to be so great that you don't know why you why you want a notebook. The notebook has to be so great, you don't know why you want a desktop. Each one's job is to compete with the other ones.\" As long as there's an Apple emblem somewhere on whichever you choose, the company seems okay with that.\nCBS previewed tonight's interview on Friday with a short clip covering accusations that Apple skimps on taxes surrounding its billions in overseas revenue. A visibly frustrated Tim Cook told host Charlie Rose that Apple \"pays every tax dollar we owe\" — more than any other company in the United States. Claims that Apple is scheming to evade US taxes are \"total political crap,\" the CEO said. Cook acknowledged that Apple keeps billions of dollars outside US borders, but said it's necessary due to an antiquated and \"backwards\" tax code. \"It's awful for America,\" Cook said. \"It should have been fixed many years ago. It's past time to get it done.\"",
        "sentiment": -0.041954762472484544
    },
    "article_8": {
        "title": "Lawsuit seeks more than $5M from Apple for slowing older iPhones with iOS 9 upgrade",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA class action lawsuit lodged with a New York district court on Tuesday dredges up claims that Apple engages in planned obsolescence, saying the company knew of potential compatibility issues when it foisted its latest iOS 9 software update on iPhone 4s owners.\nPlaintiff Chaim Lerman asserts Apple engaged in deceptive trade practices and false advertisement by touting iOS 9 as compatible with legacy handsets dating back to iPhone 4s models. In actuality, the complaint reads, iOS 9 significantly interferes with iPhone 4s performance, and because Apple security protocols prevent users from downgrading, owners were forced to choose between an inoperable device or spending hundreds of dollars on a new version.\nThe class, which includes more than 100 members, asserts iOS 9 bogged down their iPhone 4s devices to the point of being unfit for daily use. After upgrading, both first- and third-party apps exhibited delayed launch times, slow response to touchscreen input and other problems. Overall performance became sluggish, while some users, including Lerman, reported freezes and crash events.\nThe lawsuit goes on to claim that Apple, through \"internal testing and/or through other means,\" was well aware of iOS 9's negative impact on iPhone 4s functionality. Despite this knowledge, the company went through with a broad marketing campaign advertising faster performance, enhanced security, longer battery life and other enticing features. Further, the company's ads, website and iOS update page fail to warn owners of older hardware, specifically iPhone 4s devices, of potential compatibility issues.\nThe complaint goes after Apple's iOS ecosystem itself, saying users are more likely to buy a newer device than switch away to a competing platform because of non-transferrable investments like apps. It is also argued that Apple stands to profit from new cellular carrier contract agreements, but those claims were not fully fleshed out.\nPlaintiffs are seeking over $5 million in damages with an option to treble.\nAs with every annual iOS update, iOS 9 was designed to take full advantage of Apple's latest hardware, in this case iPhone 6s. Aside from iPhone 6s-specific features like 3D Touch, iOS 9 is built to push Apple's class-leading A9 system-on-chip, a much more capable version of its 32-bit, dual-core A5 ancestor found in iPhone 4s.\nWhile legacy handsets are technically compatible with iOS 9, older hardware is simply incapable of performing on a par with iPhone 6s. By definition, next-generation software is limited in its support of last-generation hardware. The case, then, in part argues Apple has a responsibility to protect consumers who are unfamiliar with rapidly evolving computer technology, or by extension consumer markets.\nApple faced similar accusations in 2011 from plaintiffs in a class action complaint who claimed iOS 4 turned their iPhone 3G into \"iBricks.\" The case was tossed a year later, though the topic of planned obsolescence continues to crop up with nearly every significant Apple release.",
        "sentiment": -0.4470743979909457
    },
    "article_9": {
        "title": "Apple's Tim Cook defends encryption. When will other tech CEOs do so?",
        "body": "It seems everywhere he goes these days, Apple CEO Tim Cook is out there forcefully and publicly defending his company’s decision to provide iPhone users with end-to-end text messaging and FaceTime encryption to protect against the constant threat of criminal hackers and foreign governments. The question is: when will other tech company leaders follow his lead?\nIf we’re going to avoid having a horrible law banning encryption passed in the next year, more of the tech company giants’ high-profile representatives – the Mark Zuckerbergs, Marissa Mayers and Eric Schmidts – need to use their platforms as the world’s most well-known technology chiefs to make crystal clear how important encryption is to users everywhere.\nUS and UK officials have not let up on their months-long PR blitz villainizing encryption in an attempt to force tech companies to provide a surveillance backdoor into their products. This, despite the fact that officials still haven’t produced any evidence that encryption was involved in the planning of any of the recent attacks in Paris and San Bernardino.\nNot that it should matter; even if terrorists do use encrypted communications apps there are plenty of ways to track them and plenty of reasons to still encourage the technology’s use. On 60 Minutes earlier this week, Cook explained why encryption is so important and why installing backdoors for government access to everyone’s communications is such a bad idea:\nHere’s what the situation is on your smartphone today, on your iPhone, there’s likely health information, there’s financial information. There are intimate conversations with your family, or your co-workers. There’s probably business secrets and you should have the ability to protect it. And the only way we know how to do that, is to encrypt it. Why is that? It’s because if there’s a way to get in, then somebody will find the way in. There have been people that suggest that we should have a back door. But the reality is if you put a back door in, that back doors for everybody, for good guys and bad guys.\nUnfortunately, Cook is badly outnumbered by an onslaught of ignorant politicians making misleading and false statements about how encryption works and why we should ban it. And it isn’t just a problem in the US and the UK: all over the world countries are grappling with their sudden loss of power to surveil everything their citizenry says or does. A judge in Brazil briefly ordered Facebook’s WhatsApp messaging application be blocked across the entire country because the service has no way of decrypting a suspect’s communications.\nThankfully the court backed down, but in his statement on that ruling, Mark Zuckerberg did not even mention the word “encryption”, let alone explain why it’s so important that every user be given this protection even if it means that the government can never access the content. Other tech companies, while they rightfully oppose the government’s push to ban encryption, have not been nearly as vocal in public as Apple, in many cases speaking through privately through lobbyists or industry representatives.\nThat’s not to say these companies aren’t doing anything: they’ve all released statements at various points condemning attacks on encryption; Facebook’s WhatsApp has brought end-to-end encryption to more people – over 800 million – than any other service; and Google’s engineering team has been a leader in securing much of the web in the post-Snowden era.\nBut this is much more than an engineering fight – it’s a political one where public opinion is crucial. And if the CEOs of these tech companies and their highest-profile representatives aren’t out there every day loudly fighting for our right to encryption where millions of people can hear them, then it’s quite likely we might wake up one day and find that the US or UK has passed some awful bill, which will only encourage China to do the same – and very soon half the world may try to outlaw encryption in some way, shape or form.",
        "sentiment": -0.41195598684928636
    },
    "article_10": {
        "title": "Tesla now using leftover upholstery leather from its cars to make stylish iPhone cases",
        "body": "Just barely in time for Christmas, Tesla updated its online store to add new apparel and accessories, including new iPhone 6 and 6 Plus leather cases/wallets. If you have a Tesla enthusiast on your Christmas list, this might be your best last-minute shot for a holiday gift.\nLike most luxury automakers, Tesla offers accessories made from automotive-grade leather leftover from making the interior of its vehicles, which is an interesting way for the manufacturer to promote its brand while reducing upholstery losses. The company rarely updates its collection since launching it last year with travel bags, gloves and purses – making the new iPhone cases the first significant addition to the ‘Tesla Design Collection‘.\nYou can get a Tesla designed iPhone 6 or 6 Plus case for $45. For $5 more, Tesla can add 2 (or 3 for the 6 Plus) credit card slots stitched to the back of the case for a smartphone case/wallet amalgam.\nTesla says that its wallet-case option is RFID blocking, which can be reassuring if you see RFID skimming as a security risk.\nTesla also offers $100 touchscreen-friendly leather gloves to match your new iPhone case.\nIf you plan on matching those accessories with the ultimate Tesla product, the Model S, make sure to use Seth’s referral code to get a $1,000 discount on your purchase (valid until December 31).\nAlso, if you want more Tesla Motors and electric vehicle news, make sure to follow our sister-site Electrek on Twitter,Facebook or Google+ to get our latest articles.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.07748297105232875
    },
    "article_11": {
        "title": "Dropbox is shutting Mailbox down - any suggestions on your favorite mail clients to replace it?",
        "body": "Dropbox is doing away with Mailbox, the email app it acquired in March 2013, and Carousel, the company's attempt at a standalone photo management app. The company says that it's making this decision now to focus more directly on the primary Dropbox app and the collaborative features it's known for. \"The Carousel and Mailbox teams have built products that are loved by many people and their work will continue to have an impact,\" wrote Dropbox's founder / CEO Drew Houston and CTO Arash Ferdowsi in a blog post. \"We’ll be taking key features from Carousel back to the place where your photos live — in the Dropbox app. We’ll also be using what we’ve learned from Mailbox to build new ways to communicate and collaborate on Dropbox.\"\nMailbox will shut down on February 26th, with Carousel following the next month on March 31st. Dropbox says it's giving Carousel extra time so that users can download their photos and move them elsewhere if they so choose. \"If you have conversations or shared albums you want to save from Carousel, we’ll provide a simple export tool early next year,\" the company notes.\nBoth apps have seen little development in recent months, allowing competition from bigger rivals to move ahead of Dropbox's software. Mailbox was effectively abandoned on both iOS and Android months ago, and even the Twitter account has gone silent. Other third-party email apps like Microsoft's Outlook and Google Inbox have built upon the unique swipe and time management features that Mailbox introduced. The company acknowledges as much, saying \"many of its innovations are now ubiquitous across the industry.\"\nSimilarly, Google Photos and Apple Photos have made Dropbox's Carousel app somewhat useless by comparison. Dropbox says it'll bring some of Carousel's better features to the main app \"in the coming months.\" So there's the closure you might've been looking for; it just would've been nice to see this happen a few months sooner.",
        "sentiment": -0.20658620471755665
    },
    "article_12": {
        "title": "Apple files trademarks for Beats 2, 3, 4, and 5",
        "body": "Apple filed trademark applications for the word marks B2, B3, B4, and B5 with the U.S. Patent and Trademark Office in November, including the matching marks Beats Two, Beats Three, Beats Four, and Beats Five, as spotted by French website Consomac [Google Translate]. The applications are currently pending review.\nAll four trademark applications are assigned to \"Beats Electronics, LLC,\" have the same logo that Apple uses for its Beats 1 radio station, and are listed under broadcasting- and streaming music-related categories, indicating that Apple could be planning an expansion of its Beats radio network in the future.\nGoods and Services: broadcasting and transmission of voice, data, images, music, audio, video, multimedia, television, and radio by means of telecommunications networks; broadcast and transmission of streamed music, audio, video, and multimedia content by means of telecommunications networks; matching users for the transfer of music, audio, video, and multimedia by means of telecommunications networks; providing access to websites, databases, electronic bulletin boards, on-line forums, directories, music, and video and audio programs\nApple's licensing terms with record labels reportedly give the company permission to create up to five additional radio stations like Beats 1 without needing to negotiate new terms. Apple could potentially launch additional Beats stations around the world, adding DJs in other countries or launching stations with a specific focus or genre.\nMacRumors previously discovered that Apple has registered domains such as beats2.com.cn, beats2.hk, and beats4.com.ru in various countries around the world. Beats 1 is broadcast worldwide, but in the future, Apple may wish to offer stations that cater to different languages and musical preferences around the world.\nBeats 1 is broadcast in over 100 countries and has been on air since Apple Music launched on June 30. Apple's 24/7 live global radio station, anchored by renowned DJs Zane Lowe, Ebro Darden and Julie Adenuga, provides a mix of the latest music, guest interviews and more. Beats 1 can be streamed through Apple Music and iTunes.",
        "sentiment": 0.23427302576601505
    },
    "article_13": {
        "title": "Apple expected to bid on Thursday Night Football streaming deal",
        "body": "The NFL is looking for a new partner to host Thursday Night Football, and it appears that Apple may be gunning to make an interception from Yahoo and Google.\nTraditional networks like CBS, ESPN, Fox, and NBC were all informed by the NFL that it is ready to accept bid for broadcasting rights to its Thursday Night Football package, but the league also notified Apple that it can bid for a non-exclusive streaming deal for Apple TV and iOS users.\n“The league also sent RFPs to several digital companies, like Google, Yahoo, Apple and Amazon, to stream the entire Thursday night schedule on a non-exclusive basis,” reports SportsDailyBusiness. “The league’s initial plan would have the digital streams serve as a simulcast of the television production — with the same ads and in-game production features.”\nAdding the option to stream Thursday Night Football could be a great way for Apple to get more customers to buy the new Apple TV. Games could be sold on an individual or seasonal basis through iTunes and Apple TV, or Apple could just give away access for free as a marketing promotion.\nYahoo purchased exclusive rights to stream one game this season, paying around $15 million. NFL Network CEO Brian Rolapp revealed in a recent interview that the league is looking to bring a ‘heavy digital component’ to Thursday games. If Apple doesn’t buy up the rights, we expect Amazon and Google will be more than happy to scoop up the fumble.",
        "sentiment": -0.6180788959479995
    },
    "article_14": {
        "title": "[Rumor] The Beatles set to hit music streaming services on Christmas Eve",
        "body": "The Beatles, the most beloved rock band in history — and one of the most persistent holdouts in the digital age of music listening — are set to finally arrive on streaming services, according to Billboard sources with knowledge of the negotiations.\nWhile Billboard has received conflicting reports on the timing of the Fab Four’s arrival to streaming platforms, there’s a strong indication that fans will be able to hear “Hey Jude” on Thursday, Dec. 24. (Keep an eye out for whether Liverpool’s most famous sons unseat Justin Bieber‘s streaming record.)\nRelated Kanye West Tweet Taken Down for Violating Twitter Rules\nChatter around a six month “exclusive” for a known streaming service reportedly began to trickle out of Apple Records in 2014, according to one source, but fizzled out. This past January, former Universal Music Group digital executive Rob Wells restarted discussions for the massive get, with papers reportedly having been signed in mid-September. It’s unknown which specific services have secured the deal, though sources strongly suggest that most, if not all, will have access to the band’s catalog of studio albums next week. (The Beatles are already available on Pandora because of how “non-demand” web radio is licensed.)\nWhen asked, a Spotify representative said the company “would not comment on that.” Rhapsody also refused to comment. Apple, Tidal, Deezer and Slacker did not immediately return a request for comment.\nThe Beatles as an entity has been notoriously slow in adopting and adapting to new technology — it took the band six years to arrive on the iTunes Store, selling two million songs during its first week. The group took 25 years, since its breakup in 1970, to issue the comprehensive Anthology documentary. It didn’t get involved with video games until The Beatles: Rock Band was released in 2009. The Beatles music was released on CD in 1987, but the band didn’t remaster their work until 22 years later.\nThe group joins the streaming revolution just as music consumption on such platforms has begun to officially overtake downloads in revenue generation for major labels. They’ve sold 178 million albums in the U.S., according to the RIAA.\nIt’s not as though the group needs the exposure. Since the arrival of Beatlemania, the band has maintained a constant presence around the world through members’ solo work — Paul McCartney appeared on two Kanye West songs this year, “FourFiveSeconds” and “Only You” — reissues like the 2009 The Beatles in Mono box set and tributes from seemingly every musical artist in history (Kurt Cobain, perhaps most infamously), much of it fueled by a perpetual cycle of rediscovery of the group’s work by younger listeners.\nAdditional reporting by Glenn Peoples.",
        "sentiment": -0.08305187504738569
    },
    "article_15": {
        "title": "Apple Once Again Rumored to Be Developing High-Resolution Audio Formats",
        "body": "Apple is reportedly preparing to launch new higher-quality audio streaming in 2016, according to industry sources who spoke to Mac Otakara at this weekend's Portable Audio Festival in Tokyo.\nAccording to several insiders familiar with Apple, whose products are exhibited at PORTABLE AUDIO FESTIVAL 2015, the company has been developing Hi-Res Audio streaming up to 96kHz/24bit in 2016. The Lightning terminal with iOS 9 is compatible up to 192kHz/24Bit, but we do not have information on the sampling frequency of Apple Music download music.\nThe report also claims many audio equipment manufacturers are preparing their own third-party Lightning cables in anticipation of Apple's move toward improved audio quality.\nApple has long been rumored to be looking to introduce higher-quality audio formats for iTunes Store downloads and perhaps also Apple Music streaming. A year and a half ago, music blogger Robert Hutton claimed Apple was working to roll out high-resolution audio for the iTunes Store, and Mac Otakara made similar claims about an HD Audio format and new hardware being planned for release alongside iOS 8 later that year.\nAn even earlier flurry of rumors came in 2012 after Neil Young revealed that he and Steve Jobs had discussed ideas for improving the audio quality of iTunes Store content. Young ultimately went on his own in an effort to increase the quality digital music, releasing his PonoPlayer in early 2014.",
        "sentiment": -0.041955875465646386
    },
    "article_16": {
        "title": "Tim Cook is over discussing the ‘hump’ on the new iPhone Smart Battery Case",
        "body": "Apple’s first ever battery iPhone case has generated a range of reactions and emotions. Some people simply can’t get over the hump.\nI caught up with Apple CEO Tim Cook, who was in town to participate in an Hour of Code event, to take his temperature on the $99 iPhone 6 and 6s case, with the noticeable battery pack hump on its back.\nWe asked Cook if he is excited about the hump.\n“You know, I probably wouldn’t call it ‘the hump,'” said Cook, who added he was aware of the comments surrounding the Smart Battery Case.\n“As you probably know from being a user of this now,” said Cook as he grabbed my iPhone 6, which was sporting the new case, “one of the real insights here is, have you ever used other cases and tried to get them on?”\nCook was pointing out the issue with cases, like those from Mophie, that are so rigid it takes considerable strength and patience to put them on and take them off.\n“If you make this solid all the way across,” said Cook, indicating the spots where the Apple case’s embedded battery stops and you just have the soft fluoroelastomer casing, “in order to get it on, you’d find it very difficult to get it on and off.”\n“So the guys had this great insight to put the bend in along with making it a smart case,” Cook explained.\nSome also see the introduction of an Apple battery case as an admission that battery life on the iPhone 6 and 6s isn’t all it should be.\nCook, though, said that “if you’re charging your phone every day, you probably don’t need this at all. But if you’re out hiking and you go on overnight trips… it’s kind of nice to have.”\nApple’s VP of software engineering Cheryl Thomas, who was also at the event and had been listening to Cook's description of Smart Battery Case usage scenarios, then chimed in. “When you need it, you need it.”\nCook laughed and agreed, “When you need it, you need it. That’s right.”",
        "sentiment": 0.09172310202848166
    },
    "article_17": {
        "title": "Charlie Rose to tour Jony Ive’s ‘secret design studio’ and new Apple Store design for CBS on 60 Minutes this Sunday",
        "body": "Jony Ive will give a rare look into Apple’s secret design studio in Cupertino this coming Sunday, December 20th. Ive will lead Charlie Rose through the secret design study for his popular show 60 Minutes on CBS. In addition to a tour of the design lab, Rose will also get a “first look at Apple’s store of the future” from retail chief Angela Ahrendts.\nThe news was revealed in a pair of tweets from the 60 Minutes Twitter account tonight, both of which included a teaser image. In one image, Ive can be seen showing Rose a portion of his secret design lab in Cupertino. In the other, Ahrendts can be seen leading Rose into an unidentified Apple Store.\nThis isn’t the first time Charlie Rose has landed an interview with notable Apple executives. In 2013, Rose sat down with Jony Ive and Marc Newson to discuss Apple’s partnership with RED, as well as other details about the design process at Apple. Last year, Tim Cook joined Charlie Rose to discuss Steve Jobs, Beats, Apple TV, and much more.\n60 Minutes with Jony Ive and Angela Ahrendts airs this Sunday, December 20th, at 7:30PM ET & 7PM PT on CBS in the United States. The teaser tweets can be seen below:\n[tweet https://twitter.com/60Minutes/status/677632512827506688 align=’center’]\n[tweet https://twitter.com/60Minutes/status/677632837089107969 align=’center’]\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.09134645604838927
    },
    "article_18": {
        "title": "OpenEmu for OSX gets update. Can now play N64 and PS1 titles.",
        "body": "OpenEmu, an open source retro and arcade game emulator for OS X, has been updated to version 2.0.1 with support for 16 additional gaming systems, including Nintendo 64, Sony PlayStation 1 and PSP, ColecoVision, Intellivision and others listed below.\nOpenEmu 2.0.1 also features a redesigned user interface, real-time gameplay rewinding, save states and screenshots organizers, automap support for SteelSeries Nimbus and Stratus XL controllers, performance improvements, bug fixes and other changes.\nNew Gaming Systems Supported\n- Atari 5200\n- Atari 7800\n- Atari Lynx\n- ColecoVision\n- Famicom Disk System\n- Intellivision\n- Nintendo 64\n- Odyssey²/Videopac+\n- PC-FX\n- SG-1000\n- Sega CD\n- Sony PSP\n- Sony PlayStation 1\n- TurboGrafx-CD/PCE-CD\n- Vectrex\n- WonderSwan\nOpenEmu was designed specifically for OS X with an iTunes-like design that lists ROMs in a unified card-style menu organized by gaming system. The emulator offers full save state support, allowing multiple ROMs to be played at once, and it also provides OpenGL scaling, multithreaded playback, a homebrew collection of over 80 games, gamepad support and more.\nOpenEmu 2.0 for OS X El Capitan features a redesigned user interface\nOpenEmu 1.0 launched in December 2013 with support for several 16-bit systems, including the Game Boy, Game Boy Color, Game Boy Advance, Game Gear, NeoGeo Pocket, NES, Sega Genesis and Super Nintendo. The emulator also supports multiple controllers , including Nintendo, PlayStation and Xbox controllers and virtually any generic HID compliant USB or Bluetooth gamepad.\nOpenEmu 2.0.1 is a free download and requires a Mac running OS X 10.11 or later.",
        "sentiment": 0.8611123755574226
    },
    "article_19": {
        "title": "TIL: iOS has a restricted mode for all you with children!",
        "body": "Open the app that you want. On an iPhone X or later, triple-click the side button. On an iPhone 8 or earler, triple-click the Home button. If you want parts of your screen to stop responding to touch, use one finger to circle those areas. You can move or resize the circle, or tap the X to remove it. Tap Guided Access, then tap Start.\nOr to start a Guided Access session with Siri*, open the app that you want, then tell Siri \"Turn on Guided Access.\"\n*Siri features might vary by country or region.",
        "sentiment": -0.7120525194332004
    },
    "article_20": {
        "title": "Apple Dominates Holiday Sales With Nearly 50% of All New Device Activations",
        "body": "Apple devices accounted for just under half of new mobile device activations during the holiday season, according to a new report released today by mobile analytics firm Flurry. 49.1 percent of all new devices activated were Apple devices, and while that number is slightly down from last year's 51.3 percent, Apple still dominated all other mobile device companies.\nSamsung devices, for example, were responsible for 19.8 percent of all device activations, while Nokia devices made up 2 percent and Xiaomi devices made up 1.5 percent of all device activations.\nLarger-screened \"phablets\" like Apple's 5.5-inch iPhone 6s Plus were especially popular during the 2015 holiday season compared to prior years, representing 27 percent of new device activations. That's up from 4 percent in 2013 and 13 percent in 2014. Full-sized tablets have gone down in popularity, making up only 9 percent of new device activations in 2015.\nMedium-sized iPhones like the 4.7-inch iPhone 6 were still the most popular Apple devices over the holiday period at 65 percent, followed by full-sized tablets, phablets, and smaller tablets like the iPad mini. Comparatively, only 35 percent of Android devices activated were medium-sized smartphones, while 50 percent were phablets.\nApple's phablet was introduced in September 2014, and in less than a year and a half has commanded 12% share of all Apple devices activated during Christmas week. This appears to be coming at the expense of medium phones and small tablets as more users opt for the size in between the iPhone and iPad Mini. You'll note we did not break out a \"Large Tablet\" category for the new iPad Pro. These are grouped into \"Full-Size Tablets\" and represented less than 1% of device activations.\nAs for app downloads, Christmas day saw customers downloading 2.2x as many apps as the average day in December across multiple platforms including the Apple App Store and Android's Google Play.\nTo gather its data, Flurry measured smart device activations and app downloads from the more than 780,000 apps it tracks. Data was collected from December 19 to December 25.",
        "sentiment": -0.25816469714045526
    },
    "article_21": {
        "title": "Apple confirms \"leaked\" MacBook on 60 Minutes was just 12\" MacBook 2015",
        "body": "Apple has confirmed to Tech Insider that the notebook pictured behind Apple general counsel Bruce Sewell during the 60 Minutes special Inside Apple is the 12-inch MacBook released in April, debunking some users on Reddit and social media who speculated the notebook could be an ultra-thin MacBook Pro.\n12-inch MacBook pictured behind Apple general counsel Bruce Sewell (Image: CBS)\nThe chances of Apple leaving an unreleased MacBook in plain sight for a national TV program were slim to begin with, especially in a room full of Apple's top executives. In a later segment, Apple even covered desks in its secretive design studio so that cameras could not capture what the company is working on next.\nThe rumor mill is also abuzz after a fake \"iPhone 7\" leaked video circulated on social media this week. The sketchy video, spotted by French website Nowhereelse.fr, falsely depicts an alleged Foxconn employee handling a purported next-generation iPhone prototype that seemingly lacks a home button.\nThe staged video from \"ViralVideoLab\" shows a metallic device with an Apple logo, but it is noticeably thicker than the iPhone 6s and includes regulatory markings that are questionable for such an early prototype. The prototype more closely resembles an HTC One M9 with thin bezels along the top and bottom of the screen.\nFoxconn has been the source of iPhone leaks in the past, including the iPhone 6 rear shell and dimensions, but it is unlikely Apple has provided the supplier with an assembled \"iPhone 7\" prototype over nine months ahead of its expected release. No other physical components for the next-generation iPhone have leaked to date.",
        "sentiment": -0.6754116275347769
    },
    "article_22": {
        "title": "Apple Releases iOS 9.2 With Safari View Controller Improvements, AT&amp;T NumberSync Support and Bug Fixes",
        "body": "Apple today released iOS 9.2 to the public, marking the second major update to the iOS 9 operating system since its September launch. Prior to being released, iOS 9.2 was in testing since late October after being seeded to developers and public beta testers one week after the launch of iOS 9.1.\nToday's iOS 9.2 release is available as an over-the-air update to all iOS 9 users. Though it is the second major update, iOS 9.2 is actually the fourth update to iOS 9 in total, following the launches of iOS 9.0.1, iOS 9.0.2, and iOS 9.1. Xcode 7.2 is also available today.\niOS 9.2 includes a huge list of bug fixes, which we've outlined below.\nThis update contains improvements and bug fixes including: - Apple Music improvements\n--You can now create a new playlist when adding a song to a playlist\n--Your most recently changed playlist is now listed at the top when adding songs to playlists\n--Download albums or playlists from your iCloud Music Library by tapping the iCloud download button\n--See which songs have been downloaded with the new download indicator next to each song in My Music and Playlists\n--See works, composers, and performers while browsing Classical music in the Apple Music catalog\n- A new Top Stories section in News so you can stay up to date with the most important news of the day (available in the United States, United Kingdom, and Australia)\n- Mail Drop in Mail for sending large attachments\n- iBooks now supports 3D Touch to peek and pop pages from the table of contents, your notes and bookmarks, or from search results inside a book\n- iBooks now supports listening to an audiobook while you browse your library, read other books, or explore the iBooks Store\n- iPhone support for the USB Camera Adapter to import photos and videos\n- Improved stability of Safari\n- Improved stability of Podcasts\n- Fixing an issue that caused mail attachments to be inaccessible for some users with POP email accounts\n- Resolving an issue for some users that caused attachments to overlap text in mail\n- Fixing an issue where Live Photos could have turned off after restoring from a previous iCloud backup\n- Addressing an issue that could cause search in Contacts to display no results\n- Resolving an issue that could have prevented Calendar from displaying all seven days in week view\n- Fixing an issue where Camera screen on iPad could be black when attempting to capture video\n- Addressing an issue that could cause instability in the Activity app when viewing the day of Daylight Savings Time transition\n- Fixing an issue that could prevent data from appearing in Health\n- Fixing an issue that could prevent Wallet updates and Lock screen alerts from displaying\n- Addressing an issue where updating iOS could prevent an alarm from going off\n- Fixing an issue where some users were unable to login to Find my iPhone\n- Fixing an issue that prevented some manual iCloud Backups from completing\n- Addressing an issue where using the iPad keyboard could unintentionally trigger text selection mode\n- Improved keyboard responsiveness when using Quick Reply\n- Improved punctuation input on the 10-key Chinese (Pinyin & Stroke) keyboards with new expanded view of punctuation symbols and better predictions\n- Fixing an issue on Cyrillic keyboards where caps lock would be enabled when typing in URL or email fields\n- Siri support for Arabic (Saudi Arabia, United Arab Emirates)\n- Accessibility improvements\n--Fixing issues with VoiceOver when using Camera face detection\n--Adding support for VoiceOver to wake up the screen\n--Adding support for VoiceOver to invoke app switcher with 3D Touch gesture\n--Fixing an issue with Guided Access when trying to end phone calls\n--Improved functionality for Switch Control users when using 3D Touch\n--Fixing an issue with speech rate of Speak Screen\nBeyond bug fixes, iOS 9.2's biggest change is a tweak to the way the Safari View Controller works within third-party apps. The Safari View controller is what allows a pop-up Safari window to be used within third-party apps, and with iOS 9.2, the Safari View Controller supports third-party Action Extensions, letting apps like 1Password to be accessed in the Safari view of other apps like Tweetbot.\nIn the Hipchat app for iOS, clicking a link brings up an in-app browser. In iOS 9.1, seen on the left, there's no option for third-party extensions. In iOS 9.2, seen on the right, there's support for third-party extensions like 1Password.\nThe Safari View Controller has also been updated with the ability to long tap on the Reload button to reload content without content blockers and it now supports the request desktop site function and an edge swipe to dismiss the Safari window.\niOS 9.2 also includes support for AT&T's NumberSync Wi-Fi calling feature, allowing AT&T users to accept calls on any device even when their phone is not nearby.",
        "sentiment": 0.1846873748426636
    },
    "article_23": {
        "title": "AT&amp;T to ditch two-year phone contracts on January 8th (If you want to keep that unlimited data you'll have to buy your next phone upfront full price)",
        "body": "AT&T's long affair with the two-year contract continues to wind down, Engadget has learned. According to an internal document sent to employees this morning, new and existing customers will only be able to get new phones by paying the full price upfront or in installments over time. The move is set to take effect on January 8th, so you'd better act fast if you (for some reason) really want to lock yourself down for a few more years.\nJust to be perfectly clear, this move applies to all of AT&T's phones. Once the new year rolls around, even flip phones and non-smartphones with keyboards (what AT&T likes to call \"Quick Messaging Devices\") must be bought outright or with an installment plan. What's less clear is the status of wearables like the Samsung Gear S2 and tablets, which are currently sold (and promoted heavily) with two-year contracts. It's also possible (if not likely) that AT&T will keep multi-year contracts around for large corporate accounts, and we're looking into both situations. AT&T's vague, highly vetted statement says the change is being made for the sake of \"aligning... service offerings with customer and industry trends\". Well, we can't argue with that. While smaller, scrappier carriers like T-Mobile have already bailed on the multi-year contract model, AT&T has been slower to act.\nThis June, the company stopped offering contracts for smartphones to customers through local dealers and partner retailers like Best Buy and Apple. The option to ink a contract remained for people who bought basic phones or went straight to an AT&T store and asked specifically for a contract extension. The message? Payment plans like AT&T Next were the future. That sentiment was echoed when Verizon stopped pushing two-year contracts a few months later. The thing is, people who had those contracts could keep them and still get subsidized phones if they wanted — an option that won't be available to AT&T customers. Still have questions? Feel free to refer to the FAQ our tipster friend also provided:",
        "sentiment": -0.6939925564562573
    },
    "article_24": {
        "title": "Apple CEO Tim Cook calls US tax code outdated and 'awful for America'",
        "body": "AppleInsider may earn an affiliate commission on purchases made through links on our site.\nThe full interview between Charlie Rose and Apple Chief Executive Tim Cook will air this Sunday, but CBS has posted a teaser clip from the conversation, in which Cook again defended his company's tax policies, stating that they pay more than any other company in a \"backwards\" system.\nCook's aggressive comments are even more forceful than some he has made in the past, but the message remains the same: Apple pays every dollar it owes, and does not illegally avoid any U.S. taxes. He said the same more than two years ago, when he testified before the U.S. Congress.\nCook's latest comments will air on broadcast television this Sunday on 60 Minutes, and a minute-long clip from the interview was shared online on Friday. During the conversation with Rose, Cook noted that his company pays more taxes than anyone else in the U.S.\n\"We happily pay that,\" he said.\nThe question, however, centers around the money Apple earns overseas. More than $200 billion of it rests internationally, because repatriation taxes are excessively high, in the eyes of Cook and many other business executives.\nCook told Rose that he would \"love to bring it home,\" but current policies are outdated and unfair.\n\"It would cost me 40 percent to bring it home, and I don't think that's a reasonable thing to do,\" Cook said. \"This is a tax code, Charlie, that was made for the industrial age, not the digital age. It's backwards. It's awful for America. It should have been fixed many years ago. It's past time to get it done.\"\nAfter he testified before Congress in 2013, some politicians concluded that Apple was involved in a \"scheme\" to pay little or no taxes to the U.S. When questioned about that conclusion by Rose, Cook responded fiercely.\n\"That is total political crap,\" he said. \"There is no truth behind it. Apple pays every tax dollar we owe.\"",
        "sentiment": -0.5966236831032132
    }
}