{
    "article_0": {
        "title": "Apple joins Google, Microsoft and others in an open letter declaring anti-encryption bill ‘unworkable’",
        "body": "Just a day after a prominent legal expert described the proposed anti-encryption Burr-Feinstein bill as unconstitutional, unenforceable and harmful, Apple has called the proposal ‘well-intentioned but ultimately unworkable.’\nThe description is in an open letter from the Reform Government Surveillance coalition, of which Apple is a key member, alongside companies such as Google, Dropbox, Facebook, Microsoft and Twitter. The letter, addressed to the two Senators behind the proposed bill, explains why it would be harmful to the interests of both the U.S. people and American businesses …\nWe write to express our deep concerns about well-intentioned but ultimately unworkable policies around encryption that would weaken the very defenses we need to protect us from people who want to cause economic and physical harm. We believe it is critical to the safety of the nation’s, and the world’s, information technology infrastructure for us all to avoid actions that will create government-mandated security vulnerabilities in our encryption systems.\nThe letter says that building in backdoors would ‘create opportunities for exploitation by bad actors’ and ‘push users to non-U.S. companies, in turn undermining the global competitiveness of the technology industry in the United States.’ It is also signed by three other industry coalitions.\nThe Burr-Feinstein bill – formally known as the Compliance with Court Orders Act of 2016 – was last week published as a draft for discussion. It still has many stages to go to before reaching the floor of the Senate, something which is unlikely to happen before the elections, with one Senator vowing to filibuster it if it does get that far.\nThe Reform Government Surveillance coalition has five goals, including limiting the authority of governments to collect user data, ensuring transparency in government demands for access to same and ensuring a clear legal framework with appropriate checks and balances.\nYou can read the full text of the letter below.\nLetter to Chairman Burr and Vice-Chairman Feinstein Regarding Encryption April 19, 2016 The Honorable Richard Burr Chairman Select Committee on Intelligence United States Senate Washington, DC 20515 The Honorable Dianne Feinstein Vice-Chairman Select Committee on Intelligence United States Senate Washington, DC 20515 Dear Chairman Burr and Vice-Chairman Feinstein: We write to express our deep concerns about well-intentioned but ultimately unworkable policies around encryption that would weaken the very defenses we need to protect us from people who want to cause economic and physical harm. We believe it is critical to the safety of the nation’s, and the world’s, information technology infrastructure for us all to avoid actions that will create government-mandated security vulnerabilities in our encryption systems. As member companies whose innovations help to drive the success and growth of the digital economy, we understand the need to protect our users’ physical safety and the safety of their most private information. To serve both these interests, we adhere to two basic principles. First, we respond expeditiously to legal process and emergency requests for data from government agencies. Second, we design our systems and devices to include a variety of network- and device-based features, including but not limited to strong encryption. We do these things to protect users’ digital security in the face of threats from both criminals and governments. Any mandatory decryption requirement, such as that included in the discussion draft of the bill that you authored, will to lead to unintended consequences. The effect of such a requirement will force companies to prioritize government access over other considerations, including digital security. As a result, when designing products or services, technology companies could be forced to make decisions that would create opportunities for exploitation by bad actors seeking to harm our customers and whom we all want to stop. The bill would force those providing digital communication and storage to ensure that digital data can be obtained in “intelligible” form by the government, pursuant to a court order. This mandate would mean that when a company or user has decided to use some encryption technologies, those technologies will have to be built to allow some third party to potentially have access. This access could, in turn, be exploited by bad actors. It is also important to remember that such a technological mandate fails to account for the global nature of today’s technology. For example, no accessibility requirement can be limited to U.S. law enforcement; once it is required by the U.S., other governments will surely follow. In addition, the U.S. has no monopoly on these security measures. A law passed by Congress trying to restrict the use of data security measures will not prevent their use. It will only serve to push users to non-U.S. companies, in turn undermining the global competitiveness of the technology industry in the U.S. and resulting in more and more data being stored in other countries. We support making sure that law enforcement has the legal authorities, resources, and training it needs to solve crime, prevent terrorism, and protect the public. However, those things must be carefully balanced to preserve our customers’ security and digital information. We are ready and willing to engage in dialogue about how to strike that balance, but remain concerned about efforts to prioritize one type of security over all others in a way that leads to unintended, negative consequences for the safety of our networks and our customers Signed, Reform Government Surveillance Computer & Communications Industry Association Internet Infrastructure Coalition (I2C) The Entertainment Software Association\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.21900309436023235
    },
    "article_1": {
        "title": "Last year, Rolex did $4.5 billion in sales. Apple Watch did $6B.",
        "body": "A Flop Unlike Any Other…\nThe amazingly underwhelming Apple Watch\nLast year, Rolex did $4.5 billion in sales. A solid year for the premium watchmaker. Of course, it was no Apple Watch. That business did roughly $6 billion in sales, if industry estimates are accurate.\nThe point here isn’t to compare the two devices — an Apple Watch is just about as comparable to a watch as an iPhone is to a phone. But it does provide an interesting context for Apple’s fledgling business — a new product category which has come under a lot of scrutiny since its launch a year ago. Many have called it a “flop,” which, again, is interesting in context.\nFor even more context, The Wall Street Journal notes today:\nSo far, the numbers appear solid. Apple doesn’t disclose sales, but analysts estimate about 12 million Watches were sold in year one. At an estimated average price of $500, that is a $6 billion business — three times the annual revenue of activity tracker Fitbit Inc. By comparison, Apple sold roughly six million iPhones in its first year. As a new entrant, the Watch accounted for about 61% of global smartwatch sales last year, according to researcher IDC.\nBelieve me, I too am full of Apple Watch gripes. The main issue, in my view, is that I simply never use the apps. And wasn’t that supposed to be the point of the thing? Instead, I use the device almost solely for push notifications, which, don’t get me wrong, are still useful. In fact, some, like the notification you get when an Uber is arriving, are extremely useful. But I’d be lying if I said I wasn’t disappointed in terms of overall experience thus far.\nAnd yet, one year later, I’m still wearing the thing every day.\nMaybe I’m delusional. But I don’t think so. I feel like I still see a ton of people wearing them around as well. And actually, increasingly so. Yes, I live in San Francisco, so maybe I’m in a bubble (but not the Bubble). Then again, as overcrowded as it may be, I’m pretty sure 12 million people don’t live in San Francisco. Or even the entire Bay Area.\nAgain, if the numbers are to be believed (Apple doesn’t break out Apple Watch sales), the Watch is hardly just a Silicon Valley thing. And given the average selling price, there’s no question that it’s a pretty great business — bigger than most businesses, in fact.\nBut this is Apple. This is the company where selling 300 million iPads in five years isn’t good enough for many, because it doesn’t match the iPhone. Never mind that the iPhone is the greatest business in the history of ever. The bar has been set extremely high, and the reality is that a $6B business doesn’t move the needle much for Apple.\nBut it also doesn’t have to. At least not yet.\nBecause the Watch can only work when tethered to an iPhone, it’s just an additive business right now. That is, it makes the iPhone business more valuable. Or, at the very least, it creates slightly more lock-in to that product. This may change if/when the Apple Watch gets its own cellular antenna. But presumably, that’s at least a couple years out.\nThis points to what really matters here. In framing the Apple Watch sales in the context of first-year iPhone sales, WSJ seems to be suggesting the Watch could be on the verge of breaking out. Of course, in an info graphic further down the page, they note that the iPad also blew away iPhone sales in its first year — to the tune of 19.5 million sold.\nSo will the Apple Watch be the next iPhone (slow to start, then nearly exponential) or the iPad (explosive growth to start, then trickled off)?\nImpossible to say right now, of course. But it seems entirely unrealistic to think it will match the iPhone’s trajectory. Because, again, no other business ever has. If I had to guess, I’d imagine the Apple Watch lands in between the two product categories in terms of how it progresses. I think it will be more upgrade-worthy than the iPad, but less so than the iPhone has been thus far.\nThe caveat here is that it has to get better than it is right now. But if history is any guide, this is always what happens with Apple products. I happen to believe Apple Watch is a bit more “v1” than a lot of other products the company has put out there. But that may just mean that it has more opportunity to grow into something truly unique, useful, and worth upgrading for as iterations come.¹\nIf this doesn’t happen, the Apple Watch may turn out to be an actual flop. Again, that’s clearly not the case right now. But if the value proposition isn’t consistently raised, this first year of sales may be the equivalent of a movie that opens to huge business, then falls 60% in its second weekend in release, then even more in its third weekend…\nSo let’s see what this fall has in store in terms of iteration. Then we should have a better sense of the staying power of the device. Let’s give it… time.",
        "sentiment": -0.007178885197000844
    },
    "article_2": {
        "title": "Apple releases new 12 inch Retina MacBook line: new processors, Rose Gold, better battery life",
        "body": "Apple has today released an update to the 12 inch Retina MacBook line, with new Skylake processors, overall better performance, and a new color: Rose Gold. The new internals have also allowed Apple to grab an extra hour of battery life out of the same sized product. The MacBook refresh keeps the same thin chassis, the same edge-to-edge keyboard and the same single USB-C port design as the original Retina MacBook, released about a year ago. The new Retina MacBook costs the same as before, starting at $1299.\nThe lineup means Apple now offers the MacBook in the same colors as its iOS devices, Space Grey, Silver, Gold, and Rose Gold. For the 13 inch MacBook Air, Apple has also made 8 GB RAM the standard spec across every configuration. More specs after the jump.\nThe new MacBooks include sixth-generation Intel Core M processors, with clock speeds from 1.1 GHz to 1.2 GHz. The new integrated graphics are up to 25% faster than the previous generation. The USB-C port appears identical and does not support Thunderbolt 3 as some rumors had suggested. The MacBook comes in two configurations. For $1299, you can get a Retina MacBook with a 1.1 GHz processor, 8 GB of memory and 256 GB storage. A more expensive $1599 configuration is also available with a faster processor and 512 GB of flash memory.\nApple SVP Marketing Phil Schiller described the new Retina MacBook as Apple’s ‘vision for the future of the notebook’.\n“MacBook is the thinnest and lightest Mac we have ever made and it’s our vision for the future of the notebook,” said Philip Schiller, Apple’s senior vice president of Worldwide Marketing. “Customers are going to love this update to MacBook, with the latest processors, faster graphics, faster flash storage, longer battery life and a beautiful rose gold finish.”\nApple says the new MacBook gets better battery life rated at 11 hours of iTunes movie playback and 10 hours of wireless web browsing. Customers can buy the new MacBook from Apple.com today, as well as Apple Stores and authorized resellers. Read more about the new laptops on Apple’s website.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.26332412950605866
    },
    "article_3": {
        "title": "Apple should give customers free iCloud space to match their devices",
        "body": "The new MacBooks announced Tuesday aren’t very upgradeable: You can bump up the processor in either model to a 1.3GHz Intel Core m7 for a $150 upcharge, and they both come with 8GB of RAM. But you can’t upgrade the storage. The $1299 model has 256GB, and that’s all it will ever have. The $1599 model has 512GB, and that’s as high as it goes.\nI love portable Macs, but I also have a lot of files, and managing them on my 256GB MacBook Air is a chore. The biggest offender is my local Dropbox folder, which I use to back up my iPhone’s Camera Roll, but I also can’t keep a big iTunes library on this machine, or even local iTunes backups of all of my iPhones and iPads. I’ve got two USB drives mounted whenever I’m at my desk: one for Time Machine, and one for just offloading device backups and big files.\nMy data-juggling act would get a lot easier with a terabyte of storage, but that’s hard to find in a Mac laptop. The 13-inch MacBook Pro with Retina display only offers a storage upgrade for the most-expensive $1799 model, which comes with 512GB of storage off the shelf but can go to 1TB for $500 more. (It’s worth mentioning that the entry-level 13-inch MacBook Pro only offers 128GB of storage for $1299, the same price as the 12-inch MacBook with 256GB.)\nBoth models of 15-inch MacBook Pro with Retina display offer storage upgrades. The $1999 model that comes with 256GB of storage can go to 512GB for $300 more or 1TB for $500 more. And a $500 1TB upgrade is also available for the $2499 model. That means that Apple will sell you three MacBook Pro configs with 1TB of storage, staring at $2299 for a 13-inch model, and $2499 to $2999 for the 15-inch model. None of those are in my price range—and like the 12-inch MacBook, the MacBook Air has no terabyte option at all. But maybe there’s another way to get the storage I need.\niCloud to the rescue?\nIn the fall of 2014, Apple cut the prices on iCloud storage to fall more in line with competitors like Amazon and Google. But the best thing Apple could do is recognize that we’re already paying a lot to play in its garden, and throw in free iCloud storage that matches the capacities of our Macs, iPads, and iPhones.\nIt wouldn’t have to be forever. Just start me off with a year or two and I’d probably keep paying for it when the time ran out. Apple made headlines last week for updating its environmental FAQ with estimates the typical “years of use” life span of its devices: The company “assumes” Macs and Apple TVs will be used for four years, and iPads, iPhones, and Apple Watches for three. Even rounding that down to two years for each new device would be sufficient, and Apple could even exclude Apple Watch and Apple TV from the deal, since those don’t need associated iCloud storage nearly as much.\nYes, that would be a lot of free storage given away. People only pay for iCloud storage to use with their Apple devices, so if new Apple devices suddenly came with free iCloud storage…then who would pay for iCloud storage? Well, some people (maybe people with 16GB iPhones) might use the free storage to back up the whole device, and then buy a little more to keep their photos and videos flowing to iCloud Photo Library without having to sync the iPhone to a Mac to offload photos that way. To facilitate this, Apple could make it easier to manage what files are kept where—say, by providing an “iCloud Locker” that only lived in the cloud and didn’t sync to your devices. That way you could offload files to the cloud, freeing up space on your devices but still having those files accessible on demand.\nThe Services portion of Apple’s business is growing, but it comprises a lot more than just iCloud storage fees. If millions of customers suddenly got more iCloud storage for free, it’s possible some other services would see an increase in revenue that would offset some of the lost opportunity. For example, you might buy more apps or content to fill up your device, since you know that even when it’s stuffed to the gills you’ll be able to back up the whole thing to iCloud. Since the free iCloud storage would cumulative, customers have more incentive to go all-in with iPhone, Mac, and iPad, and the more Apple devices you own, the more likely you are to buy apps, purchase content from iTunes, subscribe to Apple Music, enroll in AppleCare+, and so on.\nThis certainly isn’t a brand-new idea, but consider me firmly on the bandwagon. Apple has tons of money, so giving away free iCloud storage when you buy a Mac, iPad, or iPhone probably wouldn’t send the company to the poor house. It would, however, suddenly make a 256GB laptop or a 16GB iPhone or iPad seem a lot more valuable.",
        "sentiment": 0.03354592025279999
    },
    "article_4": {
        "title": "Apple's aging Mac Pro is falling far behind Windows rivals",
        "body": "Apple's Mac Pro is aging fast, especially with screaming fast Windows desktops being announced in recent weeks.\nIntroduced in 2013, the Mac Pro was a top-of-the-line desktop at that time. It looked exquisite in its sleek cylindrical design, and it sported new features like Thunderbolt 2 ports, plus the latest CPUs, GPUs and NVMe storage.\nMore importantly, it was a signal that Apple had not abandoned the professional computing market. The latest Mac Pro was a relief to those clamoring for an upgrade from an older version of the computer, which last received a face-lift in 2010.\nBut the Mac Pro is again falling behind the competition, with powerful new workstations from Lenovo, Dell and HP carrying superior technology. The PC companies are waging an active campaign to tempt Mac Pro users, many of them creative professionals, to move over to Windows PCs with better CPUs, GPUs, and memory.\nThe new Windows desktops are targeted at video editing, professional applications and the creation of virtual reality content for headsets like Oculus Rift and HTC Vive.\nAmong the powerful new Windows machines are HP's new Z Workstations. Starting at US $4,363, the Z Workstations announced this week can be configured with Intel Xeon E5-2600 v4 chips, which have up to 22 cores. Two Nvidia Quadro M6000 GPUs in an SLI (scalable link interface) configuration can provide super-fast graphics performance. The desktop supports DDR4 memory, and there are multiple slots for SATA, SAS (serial-attached SCSI) and NVMe (non-volatile memory) SSD storage.\nNew Dell Precision workstations, announced last week, can also support the latest 22-core Xeon E5-2600 v4 chips, based on the Broadwell architecture and also introduced last week.\nBy comparison, the Mac Pro -- which starts at $2,999 -- supports up to 12-core Intel Xeon E5 chips based on the older Ivy Bridge microarchitecture, which started shipping in the third quarter of 2013. The desktop has older AMD FirePro GPU models and DDR3 memory. The Thunderbolt 2 ports are also outdated, and Thunderbolt 3 is two times faster, with its 40Gbps data transfer rate.\nThe Mac Pro is still a fast machine, but creative professionals want the latest and greatest hardware, said Bob O'Donnell, principal analyst at Technalysis Research.\n\"I compare it more to a low-end workstation,\" O'Donnell said.\nThe desktop is adequate for engineering applications and video editing, but faster computers will allow creative professionals to dabble in VR, O'Donnell said.\nVR is a niche but emerging market, and workstations will need more horsepower for visual computing, O'Donnell said.\nApple hasn't indicated it is focused on VR, which still has an uncertain future. But earlier this month, Oculus founder Palmer Luckey said Rift headset support would come to Macs if Apple ever releases \"a good computer” to handle the stereoscopic content. VR headsets require top-line CPUs and GPUs in desktops.\nApple has more than VR to consider if it wants to retain Mac Pro users. Apple may enter the fast-growing car market, and computer-aided automobile design will happen on workstations like Mac Pro, O'Donnell said.\nO'Donnell also suggested Apple could opt to merge Mac Pro with the iMac. It's not an unprecedented idea; Apple in 2010 killed its Xserve product line and provided a guide for users to transition to the Mac Pro or Mac Mini.\nBut patience has its virtues. If Apple hangs on before upgrading Mac Pro, some breakthrough technologies could put the desktop leagues ahead of its Windows rivals.\nIntel is developing super-fast Optane memory SSD products, which will come to high-end gaming desktops and workstations later this year. Intel claims that Optane, which is based on a technology called 3D Xpoint, is 1,000 times faster and durable than NAND flash storage.\nFaster GPUs are en route as well. Apple has shown an affinity for graphics processors from AMD, which plans to release GPUs based on its Polaris architecture later this year.\nAMD's rival Nvidia this week introduced a new GPU called Tesla P100, based on its new Pascal architecture and targeted at high-performance computing. Nvidia could also release Quadro GPUs, based on Pascal, for workstations later this year.\nApple could upgrade the Mac Pro if only to show evidence of its technological superiority over Windows rivals. There's no mantra like \"good enough\" computing for high-end desktops like the Mac Pro, O'Donnell said.\n\"It's about maintaining relevance,\" O'Donnell said.",
        "sentiment": 0.33461366819315835
    },
    "article_5": {
        "title": "Apple hangs pirate flag over Infinite Loop on its 40th birthday",
        "body": "In homage to its history, Apple has hung a pirate flag at its Infinite Loop Headquarters (images via @twfarley and @mjisrawi). On April 1st, 40 years ago, Apple was founded by Steve Jobs, Steve Wozniak and Ronald Wayne. The iconic flag, complete with rainbow Apple logo for an eye, dates back to the creation of the original Mac. The Mac team hung the flag as an act of rebellion, distinguishing their cool work, led by Jobs, from the rest of the company which was preoccupied making the Lisa.\nWatch Apple’s 40 year celebration video, first shown at its event last month, after the jump …\nOn a typical day, Apple flies a company flag featuring the apple logo, rotating between different colors. It has used the flag to commemorate other events before, including a Pride flag to show support for the LGBT community.\nhttps://www.youtube.com/watch?v=mtY0K2fiFOA\nA better angle. For those who don’t know: it’s Apples 40th anniversary on April 1st. pic.twitter.com/6qlvuHe6Sn — Mohammed Jisrawi (@mjisrawi) April 1, 2016\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.07163397666926567
    },
    "article_6": {
        "title": "KGI: Apple to drop aluminum iPhone casing in 2017 in favor of new ‘all glass’ enclosure with AMOLED screen",
        "body": "In a new report by KGI’s Ming-Chi Kuo, the reliable Apple analyst claims that the iPhone will be seeing a major redesign in 2017, dropping the iconic aluminum casing for an all-glass enclosure with AMOLED screen. This follows on from another of Kuo’s reports in late March, where he first suggested Apple will return to an iPhone design akin to the iPhone 4. It does not seem like the iPhone 7 for 2016 will be seeing such a major overhaul, breaking Apple’s tick-tock pattern of a significant chassis redesign every other generation.\nKuo believes that Apple will be moving to an all-glass enclosure, dropping aluminum completely as it will no longer appear modern or fresh in 2017. Apple’s smartphone competitors are also adopting aluminum designs in droves, making it more likely Apple will want to differentiate with entirely new materials.\nKuo does not elaborate on how Apple will make the next iPhone entirely out of glass, so currently the specifics of the drastic redesign will have to be left to the imagination. Apple used glass for the iPhone 4/4s front and back, but this was sandwiched together with a stainless steel band. It’s currently unclear how an iPhone could be constructed primarily out of glass.\nThe new glass phone will also feature a new AMOLED display panel, which will be thinner and lighter to compensate for the slight weight increase of glass compared with metal exteriors. Kuo does not believe that drop test issues will be a roadblock in Apple’s decision making, given the iPhone 4 and iPhone 4s already relied heavily on glass front and back. Last week, Apple reportedly reached a $2.6 billion agreement with Samsung to supply OLED panels for iPhone displays.\nIt definitely seems like Apple is saving a major new iPhone form factor for 2017, which leaves Apple’s 2016 iPhone 7 refresh somewhat in question. Leaks to date have shown very modest changes for the iPhone 7, with a design largely the same as the existing iPhone 6s and iPhone 6s Plus models. It certainly looks like Apple’s next big refresh for the iPhone will not come to light this year, perhaps earlier in 2017 if not the fall. So far, the biggest new thing for the iPhone 7 appears to be the addition of a dual-camera for better pictures, although rumors have indicated this will be exclusive to the 5.5 inch iPhone 7 Plus.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.13421794958412647
    },
    "article_7": {
        "title": "Apple to Nix Plastic Bags for Environmentally Friendly Paper Bags on April 15",
        "body": "When a customer buys an Apple product in an Apple retail store, it's packaged in a white plastic drawstring bag emblazoned with an Apple logo, something that's become an iconic part of the Apple experience. Starting later this month, Apple is introducing changes to its bagging policy, phasing out plastic bags in favor of a more environmentally friendly paper option.\nApple is planning to switch from the plain white plastic bags to paper bags made from 80 percent recycled materials, which Apple says will further its goal of leaving the world \"better than we found it.\" Apple informed employees of the impending change in a note, which was shared by 9to5Mac.\nIn addition to handing out paper bags, employees are also being asked to adopt a new policy of querying customers as to whether a bag is needed at all instead of simply providing one.\nImage via the Daily Mail\nWe're committed to leaving the world better than we found it. One bag at a time. So on April 15, we'll switch to paper shopping bags made from 80 percent recycled materials. These bags come in medium and large. When customers are buying a product, ask if they need a bag. They may decide they don't. And you'll encourage them to be even more environmentally friendly. If you still have plastic bags in stock, use them before you switch to the new paper bags.\nWhile Apple will begin offering the new bags on April 15, employees have been instructed to continue to use all of the available stock of plastic bags before switching to paper. Once the supply is exhausted, the new paper bags, the design of which is unknown, will be used exclusively.\nGiven Apple's focus on recycling, clean energy, and reducing its carbon footprint, the company's switch from plastic to paper should come as no surprise. Apple already focuses on minimizing packaging size for its products from iPhones to Macs and two-thirds of the paper used for packaging is from recycled content with the rest sourced from sustainable forests.",
        "sentiment": 0.16291308863198056
    },
    "article_8": {
        "title": "Hackers use Congressman’s iPhone to demo ability to listen into calls, monitor texts, track location",
        "body": "Update: Rep. Ted Lieu has now written to the Chairman of the House Committee on Oversight and Government Reform requesting a formal investigation into the vulnerability. In his letter, the Congressman says that the flaw threatens ‘personal privacy, economic competitiveness and U.S. national security.’ The full text of his letter can be found at the bottom of the piece.\nApple may take iOS security so seriously that it’s willing to do battle with the FBI over it, but German hackers have demonstrated that all phones – even iPhones – are susceptible to a mobile network vulnerability that requires nothing more than knowing your phone number. Armed with just that, hackers can listen to your calls, read your texts and track your position.\n60 Minutes invited the hackers to prove their claims by giving a brand new iPhone to Congressman Ted Lieu – who agreed to participate in the test – and telling the hackers nothing more than the phone number. The hackers later replayed recordings they’d made of calls made on that iPhone …\nThey were able to do it by exploiting a security flaw they discovered in Signaling System Seven — or SS7 […] The SS7 network is the heart of the worldwide mobile phone system. Phone companies use SS7 to exchange billing information. Billions of calls and text messages travel through its arteries daily. It is also the network that allows phones to roam.\nKarsten Nohl, a German hacker, with a doctorate in computer engineering from the University of Virginia, carried out the demonstration from a hacking conference in Berlin. In addition to recording calls and texts, he also demonstrated that he was able to track the Congressman’s location, even with the iPhone’s GPS turned off, using cellphone tower triangulation. Additionally, he was able to log the phone number of everyone who called the phone. None of this required any ability to access the iPhone itself, only the mobile networks.\nRep. Ted Lieu said that he was shocked by what the hackers had been able to achieve.\nLast year, the president of the United States called me on my cellphone. And we discussed some issues. So if the hackers were listening in, they would know that phone conversation [and the President’s mobile number]. And that’s immensely troubling.\nNohl said that the SS7 vulnerability was well-known in some quarters, and that there was a reason it hasn’t yet been fixed.\nThe ability to intercept cellphone calls through the SS7 network is an open secret among the world’s intelligence agencies — -including ours — and they don’t necessarily want that hole plugged.\nLieu said that this was totally unacceptable.\nThe people who knew about this flaw and saying that should be fired. You cannot have 300-some million Americans – and really, right, the global citizenry – be at risk of having their phone conversations intercepted with a known flaw, simply because some intelligence agencies might get some data. That is not acceptable.\nWhile the court battle between Apple and the FBI is over, they will again face off in Congress tomorrow. Apple general counsel Bruce Sewell and FBI executive assistant director Amy Hess will testify on separate panels before House Energy and Commerce subcommittee. Separately, two members of the Senate Intelligence Committee have proposed a bill to force tech companies to decrypt devices for law enforcement, though one Senator has vowed to block the legislation with a filibuster.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.36484772511175834
    },
    "article_9": {
        "title": "[OT] Forget Apple vs. the FBI: WhatsApp Just Switched on Encryption for a Billion People",
        "body": "The bond seemed to stick. Soon, Marlinspike was helping to build end-to-end encryption across all of WhatsApp, alongside Acton and Koum and a small team of WhatsApp engineers. Acton says that they got \"lucky\" in meeting Marlinspike and that they probably wouldn't have rolled out full encryption if they hadn't. It's part of an intriguing casualness to the way Acton and Koum discuss their seemingly earthshaking undertaking—not to mention the way Marlinspike stays largely silent. They met. They had the means. And they built it. It would take about two years.\nMichael Friberg for WIRED\nAn Intensifying Debate\nThe encrypting of WhatsApp was supposed to be finished by the middle of January 2016. Koum and company wanted to unveil a completely encrypted service at the DLD tech media conference in Munich, where he was set to give a proverbial fireside chat. Germany is a country that puts an unusually high value on privacy, both digital and otherwise, and Koum felt the time was ripe to make WhatsApp's plans known to the world. Just recently, a Brazilian court had ordered a temporary shutdown of WhatsApp in the country after the company failed to turn over messages to the government that had been sent across a part of the service that was already encrypted. In Germany, Koum could make his counterpoint.\nBut by the middle of December, it was clear the project wouldn't be finished. The team was intent on encrypting everything on every kind of phone. \"The last piece was video,\" Koum says. \"You need to build for a situation where somebody on Android can send a video to an S40 user. Or somebody on a Blackberry can send to a Windows phone.\" So the company postponed the announcement. In Germany, Koum talked about WhatsApp's new business model instead.\nAs Koum sees it, slipping a backdoor into an encrypted service would defeat the purpose.\nIn the meantime, the debate over encryption has only grown more intense. On February 16, Apple CEO Tim Cook released an open letter refusing the court order to unlock a phone that belonged to one of the two shooters who killed 14 people and seriously injured another 22 during a December attack in San Bernardino, California. That day, Acton turned to Koum and said: \"Tim Cook is my hero.\" About two weeks later in Brazil, authorities arrested a Facebook vice president because WhatsApp wouldn't turn over messages after a court order. Apparently, the authorities didn't realize that the Facebook employee had nothing to do with WhatsApp—or that WhatsApp, thanks to end-to-end encryption, had no way of reading the messages. Two days later, WhatsApp joined Facebook and several other companies in filing an amicus brief in support of Apple in its fight against the FBI.\nClearly, WhatsApp has the support of its much larger parent company. Facebook declined to speak specifically for this story. But Koum, after the WhatsApp acquisition, became a member of the Facebook board. \"If they were not supportive of us, we wouldn’t be here today,\" he says. But this also wasn't something Facebook imposed on WhatsApp. This is a decision WhatsApp made on its own, before it was acquired. By the time Facebook paid billions of dollars for the company, the transformation was already under way.\nNo Backdoor\nMany lawmakers have called for companies like WhatsApp to equip their encryption schemes with a backdoor available only to law enforcement. There's even been talk of a law that requires these backdoors. But as Koum sees it, slipping a backdoor into an encrypted service would defeat the purpose: you might as well not encrypt it at all. A backdoor would just open the service to abuse by both government and hackers. Besides, if you did add a backdoor, or remove encryption from WhatsApp entirely, that wouldn't stop bad actors. They'd just go elsewhere. In the age of open source software, encryption tools are freely available to everyone. \"The encryption genie is out of the bottle,\" Koum says.\nIndeed, even some of those exploring legislation to require backdoors to encrypted digital services acknowledge that the issues in play aren't that simple. \"If we require our companies to build in a door, do we need to let China through the door? Or do we have to build doors for them when these services are used in their countries?\" asks Adam Schiff, the ranking Democrat on the House Intelligence Committee. \"And what does that mean in terms of stifling dissent in authoritarian countries that may use it for non-law enforcement purposes?\"",
        "sentiment": -0.3583805010198279
    },
    "article_10": {
        "title": "Apple mandates new Watch apps 'must' work without an iPhone",
        "body": "Apple mandates that new Watch apps 'must' work without an iPhone Starting June 1, non-native apps won't be approved for the App Store.\nApple's laying the law down: Watch apps must operate without an iPhone nearby. In a blog post , the company mandates that anything submitted for App Store approval from this June 1st forward has to be a native app running watchOS 2 . This should be a boon for anyone using the wearable during a run or workout where carrying a phone would be a hindrance. And ultimately, it'll result in higher quality applications that make full use of the device and what it's capable of rather than just being shoehorned to run on that OLED screen.\nAll products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission. All prices are correct at the time of publishing.",
        "sentiment": 0.1630565764175521
    },
    "article_11": {
        "title": "Police investigating death in conference room at Apple’s Cupertino Campus - 9to5mac",
        "body": "KTVU has reported that a law enforcement source stated an investigation has begun after a person was found dead in a conference room on Apple’s Cupertino campus. Information from any sources is extremely limited at this point, so we’ll withhold speculation until further confirmed reporting is released.\nMaureen Naylor of KTVU had tweeted at 9:10 AM PDT that a source indicated law-enforcement had begun an investigation after the person had been found. She also tweeted 19 minutes later that Santa Clara County’s Sheriff spokeswoman can’t confirm the death at this point, but more information is expected to be released later. Mat Keller of ABC7 News had shared some images of the sheriff’s vehicle on campus as well.\nSource: Law-enforcement investigating after person found dead on Apple's Cupertino campus in conference room. — Maureen Naylor (@MaureenKTVU) April 27, 2016\nSanta Clara Co Sheriff spokeswoman can't confirm death at this point but is headed to Apple & expects to have more info to release later. — Maureen Naylor (@MaureenKTVU) April 27, 2016\nSheriff investigation at #Apple headquarters in Cupertino. A body was found in a conference room. pic.twitter.com/HC7UBPWROM — Matt Keller (@MattKellerABC7) April 27, 2016\nAt this point in the ongoing situation, Apple is choosing not to comment.\nUpdate #1, 04/27/2016 10:52 AM PDT:\nTMZ has acquired audio from police scanner chatter pertaining to events around the incident. The audio is hard to make clear, but TMZ has the following:\nAccording to the sheriff’s dispatch call there was a female employee involved in an argument on the campus, and had sustained a head wound — possibly from a gun — before Apple security escorted her out of the building. As deputies were responding, they were unclear if there were multiple people involved. One portion of the dispatch exchange describes a body being found in a conference room, and that person had a gun. – TMZ\nUpdate #2, 04/27/2016 11:08 AM PDT:\nKeller is now reporting that the person found dead in the conference room was a man, and a gun was found nearby.\n#Breaking– Person found dead in conference room at #Apple Headquarters is a man. A gun was found nearby. pic.twitter.com/PKgnFy7MRh — Matt Keller (@MattKellerABC7) April 27, 2016\nUpdate #3, 04/27/2016 11:38 AM PDT:\nSanta Clara County’s Sheriff spokesperson has confirmed to news reporters that the person found dead in the conference room was indeed an Apple employee.\nSheriff spokesperson confirms person found dead in conference room was #Apple employee. No one else involved. pic.twitter.com/rLic0WGTo7 — Matt Keller (@MattKellerABC7) April 27, 2016\nUpdate #4, 04/27/2016 1:01 PM PDT:\nVideo of Santa Clara County’s Sheriff’s Department, Sergeant Andrea Urena addressing the press was posted by both KTVU and Mercury News.\nUpdate #5, 04/28/2016 4:52 AM PDT:\nKeller shared the following statement from Apple today on Twitter:\nWe are heartbroken by the tragic loss of a young and talented coworker. Our thoughts and deepest sympathies go out to his family and friends, including the many people he worked with here at Apple. We are working to support them however we can in this difficult time.\n(1/3) #Apple statement regarding employee death at Cupertino headquarters- \"We are heartbroken by the tragic loss of a young and talented… — Matt Keller (@MattKellerABC7) April 28, 2016\n(2/3) …coworker. Our thoughts and deepest sympathies go out to his family and friends, including the many people he worked with here at… — Matt Keller (@MattKellerABC7) April 28, 2016\n(3/3) …Apple. We are working to support them however we can in this difficult time.\" — Matt Keller (@MattKellerABC7) April 28, 2016\nUpdate #6, 04/28/2016 5:33 PM PDT:\n#Apple employee found dead in conference room at Cupertino headquarters identified as 25 yr old Santa Clara resident Edward Mackowiak. — Matt Keller (@MattKellerABC7) April 28, 2016\nMedical Examiner determined 25 yr old #Apple employee Edward Mackowiak's death was a suicide. — Matt Keller (@MattKellerABC7) April 29, 2016\nIf you’re struggling or looking to talk to someone, the National Suicide Prevention Lifeline is available at 1-800-273-8255. Visit the official site for alternative contact options and to look up local centers near you.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.33598036893333
    },
    "article_12": {
        "title": "The HTC 10 is the first Android device to ship with native AirPlay audio streaming support.",
        "body": "Android has featured the ability to stream to AirPlay devices like the Apple TV by means of third-party utilities for some time now, but no Android device has ever shipped with native AirPlay support in tow. That’s all changed with the announcement of the HTC 10, the first device to ship with native AirPlay support.\nSome of you may be wondering why this matters, especially since third-party apps and tools have allowed this for a long time? The fact is, native implementation, generally speaking, works better than third-party workarounds, and the presence of native AirPlay support is no different.\nWith as many Apple TVs and AirPlay speaker devices as there are in the wild, HTC has made a wise choice to officially license the use of the protocol natively from Apple. That means AirPlay support in the HTC 10 is legit, and not some sort of shady workaround frowned on by Apple.\nAirPlaying audio will also be extremely easy to pull off with minimal hoops to jump through. All you need to do is perform a three finger swipe-up gesture from anywhere on the interface, and HTC’s Connect overlay will appear. HTC Connect allows users to seamlessly stream to a variety of devices across a litany of protocols. It just so happens that the latest protocol to be supported is AirPlay.\nI know quite a few people who use Android smartphones but prefer the Apple TV over something like a Chromecast, and now the HTC 10 boasts a feature that will be quite appealing to those users. True, this won’t be a solution for those seeking to fling video to an Apple TV from the HTC 10, but it’s a nice start.\nBe sure to check out our hands-on look at the HTC 10 over at 9to5Google, for more details on HTC’s just-launched flagship endeavor.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.060970271627108254
    },
    "article_13": {
        "title": "FBI paid more than $1.3 million to break into San Bernardino iPhone",
        "body": "WASHINGTON (Reuters) - Federal Bureau of Investigation Director James Comey said on Thursday the agency paid more to get into the iPhone of one of the San Bernardino shooters than he will make in the remaining seven years and four months he has in his job.\nThe Apple logo is pictured at its flagship retail store in San Francisco, California January 27, 2014. REUTERS/Robert Galbraith\nAccording to figures from the FBI and the U.S. Office of Management and Budget, Comey’s annual salary as of January 2015 was $183,300. Without a raise or bonus, Comey will make $1.34 million over the remainder of his job.\nThat suggests the FBI paid the largest ever publicized fee for a hacking job, easily surpassing the $1 million paid by U.S. information security company Zerodium to break into phones.\nSpeaking at the Aspen Security Forum in London, Comey was asked by a moderator how much the FBI paid for the software that eventually broke into the iPhone.\n“A lot. More than I will make in the remainder of this job, which is seven years and four months for sure,” Comey said. “But it was, in my view, worth it.”\nThe Justice Department said in March it had unlocked the San Bernardino shooter's iPhone with the help of an unidentified third party and dropped its case against Apple Inc AAPL.O, ending a high-stakes legal clash but leaving the broader fight over encryption unresolved.\nComey said the FBI will be able to use software used on the San Bernardino phone on other 5C iPhones running IOS 9 software.\nThere are about 10 million 5C iPhones in use in the United States, according to estimates from research firm IHS Technology. Eighty-four percent of iOS devices overall are running iOS 9 software, according to Apple.\nThe FBI gained access to the iPhone used by Rizwan Farook, one of the shooters who killed 14 people in San Bernardino, California on Dec. 2.\nThe case raised the debate over whether technology companies’ encryption technologies protect privacy or endanger the public by blocking law enforcement access to information.\n(This version was officially corrected to change active U.S. 5C iPhone estimates to 10 million from 16 million in paragraph 8 after analyst IHS corrects figure.)",
        "sentiment": -0.03817487880587578
    },
    "article_14": {
        "title": "Apple reports Q2 earnings: Revenue drops, iPhone sales sink for first time ever",
        "body": "Apple’s second-quarter earnings report for fiscal 2016 is historic for all the wrong reasons. The iPhone has driven growth at a breakneck pace for nearly a decade now, and has helped Apple consistently post on-year sales and profit growth in every quarter. But in the March quarter this year, Apple’s revenue declined for the first time in 13 years as the pillar on which Apple has stood since 2007 finally began to crack. For the first time ever, Apple’s iPhone sales declined, dropping significantly in fiscal Q2 2016 compared to the same period a year ago.\nMUST SEE: 20 apps that hardcore iPhone fans can’t live without\nNo one was surprised on Tuesday afternoon when Apple reported declines in both revenue and iPhone units sales. The company’s second-quarter guidance issued alongside its record-breaking first quarter report called for revenue to fall between $50 billion and $53 billion last quarter, down from just over $58 billion in the fiscal second quarter last year.\nBut, about that first-quarter record…\nIn the fiscal first quarter of 2016, Apple managed to narrowly top the prior year’s profit, revenue and iPhone sales records — but it took a bit of craftiness to get the job done. I explained it in an article back in January.\nPent up demand for iPhones with larger displays sent holiday sales soaring when the iPhone 6 and iPhone 6 Plus were released back in 2014. In 2015 demand wasn’t quite as high, so Apple had to double the preorder period and launch the iPhone 6s and iPhone 6s Plus in China much earlier than it did the prior year in order to show iPhone sales growth.\nhttps://twitter.com/zacharye/status/643408535452274688\nEven then, Apple only managed to sell 2 million more iPhones in Q1 2016 than it did in Q1 2015.\nIt was good thinking and it worked well at the time, but iPhone demand was already slowing. By piling all those sales into the fiscal first quarter, Apple was left wide open to decline in the second quarter. And that’s exactly what happened.\nApple on Tuesday reported fiscal second-quarter earnings of $1.90 per share on revenue totaling $50.56 billion. Those figures compare to a profit of $2.33 per share and $58.01 billion in sales during the same quarter last year. Meanwhile, Wall Street was expecting EPS to come in at $2.00 on revenue totaling $51.97 billion.\nApple shares immediately fell more than 4.5% on the news.\nWhere the crown jewel of Apple’s product lineup is concerned, iPhone sales slowed in the second quarter just as we all knew they would. Analysts were expecting iPhone sales totaling 51.53 million units, and actual Q2 2016 sales came in at 51.2 million iPhones. In the second quarter last year, Apple sold 61.17 million iPhones.\nElsewhere in Apple’s lineup, iPad sales came in at 10.2 million units and Mac sales totaled 4 million units for the second quarter. Analysts were expecting sales to total 9.95 million iPads and 4.53 million Mac computers. iPad sales in the year-ago quarter were 12.62 million units, and 4.56 million Macs were sold during that period.\nHere is Apple’s guidance for the fiscal third quarter:\nrevenue between $41 billion and $43 billion\ngross margin between 37.5 percent and 38 percent\noperating expenses between $6 billion and $6.1 billion\nother income/(expense) of $300 million\ntax rate of 25.5 percent\nNow, despite all the doom and gloom you’ve been reading recently and all the doom and gloom to come following Tuesday’s report, this is hardly where the iPhone story turns south for good. Apple is set to launch completely redesigned iPhone 7 and iPhone 7 Plus handsets this September, and the company has even more exciting things coming down the road. In fact, an upcoming new generation of iPhones might change the game more than you can even imagine.\nApple’s iPhone business won’t continue to grow forever, but it’s certainly not finished yet.",
        "sentiment": -0.2528718718593674
    },
    "article_15": {
        "title": "Apple announces new Apple Music API",
        "body": "Today Apple announced a new Apple Music API via its Affiliate Program Newsletter. According to Apple, the API:\n…allows iOS apps to directly control Apple Music playback and more. We encourage affiliates to use the Apple Music API to provide a superior user experience by integrating music into their apps. With the Apple Music API you can: See if a user is currently an Apple Music member\nSee which country the user’s account is based in\nQueue up the next song or songs based on a song ID for playback\nInspect playlists already in My Music or create a new playlist with a title and description (see App Store Review Guidelines for limitations).\nThe announcement coincides with the introduction of a new Apple Music Best Practices for Apple Developers page that serves as a hub for developer and affiliate program resources related to Apple Music. The page includes:\nApp Review guidelines applicable to the Apple Music API, some of which are new.\nLinks to developer documentation for the Apple Music APIs.\nA summary of Apple Music identity guidelines regarding the use of the Apple Music name, logos, and related matters, with a link to the more comprehensive Apple Music Identity Guidelines.\nLinks to more information regarding the iTunes Affiliate Program.\nA link to the Apple Music Toolbox page for searching Apple Music in each of the 113 Apple Music countries by artist, song, album, playlist, Connect, curator, radio and music video, from which you can generate affiliate links.\nOne thing I’d like to see added to these tools is the ability to return search results for items like playlists using the iTunes Search API, which would allow developers to generate affiliate links to them programatically. Right now those links can only be generated from the web-based search tool in the Apple Music Toolbox. Nonetheless, it’s nice to see Apple Music being opened up to developers, and not surprising given the emphasis on services during Tuesday’s investor call.",
        "sentiment": 0.18582844075102073
    },
    "article_16": {
        "title": "Report: Apple reaches $2.6 billion agreement for Samsung to supply OLED panels starting in 2017",
        "body": "According to a new report from the Korean Herald, Samsung and Apple have reached a deal in which Samsung will supply around 100 million OLED display units to Apple beginning in 2017. The report comes as several other sources have stated that Apple plans to make the switch to OLED panels beginning next year.\nAs far as details go, the agreement between Apple and Samsung is reportedly worth around $2.59 billion and the two companies are expected to maintain the agreement for at least three years. Furthermore, the agreement is for 100 million 5.5-inch OLED displays. The report makes no mention of Samsung providing any 4.7-inch panels.\nUnder the deal, Samsung Display will supply around 100 million units of 5.5-inch panels annually, with the value being estimated at 3 trillion won ($2.59 billion). Samsung Display, an affiliate of Samsung Electronics Co., declined to confirm the deal, citing its privacy policy.\nSamsung Display declined to confirm the deal, citing its privacy policy.\nToday’s report comes as rumors regarding Apple’s future display plans have been picking up steam. A report last month stated that Apple would switch to OLED panels in the 5.5-inch iPhone next. While other reports have claimed Apple was aiming to use OLED technology by 2018 or 2019. With today’s report on a deal between Apple and Samsung, however, it’s looking more and more likely that we’ll see the first OLED iPhones in 2017, although nothing is for certain until Apple officially makes an announcement.\nLast month, KGI analyst Ming-Chi Kuo said that Apple would entirely revamp its iPhone lineup in 2017. Kuo said that Apple would switch to a device with a “completely new form factor design” with more narrow bezels and a “more comfortably grip” and an all-glass design like the iPhone 4/4s. The report also noted that Apple was considering a 5.8-inch model, as well as wireless charging.\nThe Apple Watch features an OLED display, which allows for much deeper blacks and improved viewing in bright sunlight conditions.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.0838728007963962
    },
    "article_17": {
        "title": "Google is said to be considering Swift as a ‘first class’ language for Android",
        "body": "TNW's former West Coast writer in the PNW (Portland, Oregon). Nate loves amplifying developers, and codes in Swift when he's not writing. If (show all) TNW's former West Coast writer in the PNW (Portland, Oregon). Nate loves amplifying developers, and codes in Swift when he's not writing. If you need to get in touch, Twitter is your best bet.\nAbout the time Swift was going open source, representatives for three major brands — Google, Facebook and Uber — were at a meeting in London discussing the new language. Sources tell The Next Web that Google is considering making Swift a “first class” language for Android, while Facebook and Uber are also looking to make Swift more central to their operations.\nGoogle’s Android operating system currently supports Java as its first-class language, and sources say Swift is not meant to replace Java, at least initially. While the ongoing litigation with Oracle is likely cause for concern, sources say Google considers Swift to have a broader “upside” than Java.\nSwift is also open source, which means Google could adopt it for Android without changing its own open source mobile structure.\nCould Google do it?\nBorn at Apple as a replacement to Objective C, Swift quickly found favor with developers as an easy-to-write language that shed much of the verbosity and clumsy parameters other languages have. It was introduced at WWDC 2014, and has major support from IBM as well as a variety of major apps like Lyft, Pixelmator and Vimeo that have all rebuilt iOS apps with Swift.\nSwift can’t be copy-pasted for any platform, though. Specifically, Android would need a runtime for Swift — and that’s just for starters.\nGoogle would also have to make its entire standard library Swift-ready, and support the language in APIs and SDKs. Some low-level Android APIs are C++, which Swift can not currently bridge to. Those would have to be re-written.\nSwift would also not be useful in bridging higher level APIs in Java; they’d have to be re-written as well.\nUsing Swift for Android is not impossible, though. Late last year, developer Romain Goyet toyed with Swift for Android — and had some success. While that project was completed well ahead of Swift being open source, it nonetheless proved that it can be done.\nThat project used the Android NDK, which allows other languages to be loosely implemented into Android. With an open source Swift and support from Google, Android apps wouldn’t require that toolkit.\nAll told, Google would have to effectively recreate its efforts with Java — for Swift. If the company is motivated enough, it’s very possible to do so without compromising on its open source values or ruffling any developer feathers along the way.\nKotlin\nJust reaching its potential, sources also claim Kotlin is being discussed as a first class language for Android.\nLike Swift, Kotlin is object oriented with a focus on safety. Unlike Swift, Kotlin works with Android Studio, Google’s IDE for Android development.\nUnfortunately, sources tell The Next Web that Google’s current mindset is that Kotlin is a bit too slow when compiling.\nBut, Kotlin is billed as a language that “works everywhere Java works,” and has “seamless” support for projects that mix it and Java.\nIt would be much less work on Google’s end to get Kotlin up and running for Android, but could be a tedious transition for developers.\nFacebook and Uber\nFacebook’s interest in Swift appears to be completely founded in technological advancement.\nA benefit of Swift is that it can serve as both a forward-facing language as well as a server-side one. For a product like Facebook, that’s beneficial; apps and servers can speak to one another seamlessly, and it potentially gives the company a wider scope to write APIs for services.\nAnd work may have already begun. A Github pull request in the Swift repository named ‘Port to Android’ was made by a Facebook employee. It’s not clear if his work was official Facebook business or not, though we have confirmed Facebook is already working with Swift internally — it’s just not known how thoroughly.\nUber’s road to Swift is probably a bit cleaner than either Google or Facebook. Though there are many moving parts to Uber’s service (app, server and API), it can use Lyft’s transition to Swift as an example.\nWhen Lyft migrated its iOS app to Swift, it was a ground-up remodel that took a lot of time and effort — but resulted in an app that’s lighter, leaner and easier to maintain. It’s not known how much (if any) of Lyft’s back-end uses Swift, but the company has been highly complimentary of Swift in its existing application.\nWhen could a move to Swift happen?\nThe short answer: not anytime soon. The reason? Android.\nBut Swift is quickly finding its way. Several studies suggest it’s one of the fastest growing languages around, and has blown up since going open source (GitHub tells The Next Web the language is currently its 11th most popular). Demand for developers who know Swift is also exploding, which could be all the indication these three companies need to at least explore using Swift more thoroughly.\nGoogle’s onboarding for Swift would be long; it essentially has to rewrite every Android service, app and API. Google would also have to spearhead Swift support for Android — which is still only being poked and prodded at by clever developers in the Swift community.\nIn a way, Google has already begun moving away from bits of Oracle-flavored Java. It’s now using the Open JDK for Android rather than the proprietary Java API, and may be considering a post-Java life altogether. Talks in London were said to be exploratory; Google is not yet pushing to move on from Java. While it would be a big undertaking, Swift is meant for speed and safety, and Swift’s roadmap suggests it won’t be quite as difficult to use it for other platforms in the future, specifically when it comes to C++.\nThough Kotlin is an alternative, it’s a very nascent language without the eager community Swift has.\nFacebook and Uber face similarly daunting tasks when it comes to using Swift throughout, but can –and should — wait for Google to shoulder the load with Android. If the use of Swift is going to be as deep as our sources indicate (that is, all companies want to be using it for server side and forward-facing use cases), Android support is integral.\nMoving to Swift for any of the companies also makes little sense unless it’s a thorough re-do, but it’s probably not quite as hard as it sounds. Services like Perfect prove that server-side Swift is ready, and it’s worth considering that Facebook’s engineers (perhaps from the Parse team) may already be working on this.\nIBM is also working to make Swift ready for server-side functions.\nBut don’t expect Google, Facebook or Uber to announce Swift-y plans anytime soon. Facebook and Google both have developer conferences on the horizon, and there’s no indication that Swift will play a major part at either.\nWe reached out to all three companies for comment on the information our sources brought forward. All three declined to comment. Google specifically pointed to its ongoing litigation with Oracle as reason not to participate in this article. Make of that what you will.",
        "sentiment": -0.18222612832019577
    },
    "article_18": {
        "title": "Siri announces WWDC 2016 will be held June 13th through June 17th in San Francisco",
        "body": "[UPDATE: Apple has confirmed what Siri told us earlier today. The company has now issued a press release in which it says that WWDC will be held from June 13th through June 17th in San Francisco. The same lottery process applies to getting tickets this year as in previous years. Developers can apply for tickets via the WWDC website now through Friday, April 22 at 10:00 a.m. PDT.\nIn a change from traditional years, the Monday keynote will be held at the Bill Graham Civic Auditorium, not Moscone West. All other conference sessions will take place at Moscone, though. The annual Bash will also be held at the Bill Graham Civic Auditorium.]\nIn an unusual chain of events, it appears Apple is announcing the WWDC dates through Siri. Although the Apple website has not been updated with any new info, Siri is proudly proclaiming that WWDC 2016 will indeed be held in San Francisco from June 13th to June 17th. Although Siri didn’t explicitly say, it is almost certain that WWDC will once again be held at Moscone West, simply because it’s the best choice of venue for an event like this in San Francisco. This is an unusual announcement nonetheless, it being the first time Apple has used Siri as the primary announcement vehicle for one of its events. WWDC is expected to feature the unveiling of iOS 10, OS X 10.12 and more …\nTo try this out for yourself, ask Siri: ‘When is WWDC?’. Siri will helpfully reveal the date and location. The Siri comment does not seem like a mere typo or mistake. Earlier in the day, Siri was saying ‘WWDC is not yet announced’ — it now seems to have been intentionally updated with information ahead of any official announcement on Apple’s website. Here’s what Siri was saying this morning.\nIf Apple follows tradition, it will announce the future of its software at the developer conference. This means it will demo iOS 10 for the first time as well as the operating system updates for Mac (potentially rebranded macOS?), tvOS for Apple TV and watchOS for Apple Watch. New hardware may also feature — it’s currently looking like new MacBooks are on the cards. WWDC is not normally the venue for new iOS hardware: iOS 10 will run on the iPhone 7, but the iPhone 7 hardware unveiling itself is usually scheduled for the fall (read: September) event.\nUnusual is an understatement for how this was announced; normally WWDC is announced on Apple’s website so developers can start signing up for tickets. We’ll post with more when the official unveiling happens, usually accompanied by the conference logo, but for now the bottom line is WWDC is happening June 13th to June 17th. What are you guys excited for? Let us know in the comments below.\nApple’s Worldwide Developers Conference Kicks Off June 13 in San Francisco Developers Can Apply for Tickets Now & Millions Worldwide Can Watch Sessions Streamed Live CUPERTINO, California — April 18, 2016 — Apple® today announced that it will hold its 27th annual Worldwide Developers Conference (WWDC), hosting the creative talent behind the world’s most innovative apps, from June 13 through 17 in San Francisco. At WWDC, Apple’s developer community comes together from all corners of the globe to learn about the future of Apple’s four software platforms — iOS, OS X®, watchOS® and tvOS™. Monday’s kickoff events, including the keynote address, will be held at the Bill Graham Civic Auditorium. The rest of the week’s conference sessions will take place at Moscone West. “With four innovative operating systems and a new, intuitive programming language powering over 1 billion devices worldwide, there has never been a more exciting time to bring our developer community together,” said Philip Schiller, Apple’s senior vice president of Worldwide Marketing. “WWDC 2016 is going to be a landmark event for developers who are coding in Swift, and building apps and products for iOS, OS X, watchOS and tvOS. We can’t wait for everyone to join us — in San Francisco or through the live stream.” Developers can apply for tickets via the WWDC website (developer.apple.com/wwdc/register/) now through Friday, April 22 at 10:00 a.m. PDT. Tickets will be issued to attendees through a random selection process, and developers will be notified on the status of their application by Monday, April 25 at 5:00 p.m. PDT. For the second consecutive year, there will be up to 350 WWDC Scholarships available, giving students and STEM organization members from around the world an opportunity to earn a ticket to meet and collaborate with some of the most talented developers of Apple’s ever-growing app ecosystem (developer.apple.com/wwdc/scholarships/). Additionally, this year, we will provide travel assistance to up to 125 scholarship recipients to ensure aspiring developers with financial limitations have an opportunity to participate. WWDC 2016 activities include: over 1,000 Apple engineers supporting more than 150 hands-on labs and events to provide developers with code-level assistance, insight into optimal development techniques and guidance on how they can make the most of iOS, OS X, watchOS and tvOS technologies in their apps;\naccess to the latest innovations, features and capabilities of iOS, OS X, watchOS and tvOS, and best practices for enhancing an app’s functionality, performance, quality and design;\nthe opportunity to connect with thousands of fellow iOS, OS X, watchOS and tvOS developers from around the world — last year, 80 percent of developers attended for their first time, and in total, more than 70 countries were represented;\na series of get-togethers for attendees focused on particular topics with special guest speakers and activities;\nengaging and inspirational lunchtime sessions with trailblazers and influencers from the worlds of technology, science and entertainment; and\nthe Apple Design Awards which recognize iPhone®, iPad®, Apple Watch®, Apple TV® and Mac® apps that demonstrate technical excellence, innovation and outstanding design. Worldwide Developers Conference sessions will be streamed live throughout the week via the WWDC website (developer.apple.com/wwdc/live/) and through the WWDC app, giving developers around the world access to the week’s news and events. Visit the Apple Worldwide Developers Conference 2016 website (developer.apple.com/wwdc/register/) to apply for a ticket, as well as for updates and more information. Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch and Apple TV. Apple’s four software platforms — iOS, OS X, watchOS and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay and iCloud. Apple’s 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.236896102912724
    },
    "article_19": {
        "title": "There is no model of Mac that Macrumors recommends you buy right now.",
        "body": "MacRumors\nBuyer's Guide\nThis page provides a product summary for each Apple model. The intent is to provide our best recommendations regarding current product cycles, and to provide a summary of currently available rumors for each model.\nThis page is based on rumors and speculation and we provide no guarantee to its accuracy.\n- 2022 iPhone Buyer's Guide\n- 2022 iPad Buyer's Guide\n- 2022 Apple Watch Buyer's Guide\n- Best AirPods Deals\n- Best HomePod Deals\n- Best Apple TV 4K Deals\n- Best MacBook Pro and MacBook Air Deals\n- Best iMac Deals\n- Best iPad Deals\n- Best iPhone Deals",
        "sentiment": -0.0344659760594368
    },
    "article_20": {
        "title": "Dual Camera Said to Be Exclusive to 5.5-Inch iPhone 7",
        "body": "Dual cameras will be exclusive to Apple's next-generation 5.5-inch iPhone, according to a new research note issued by respected KGI Securities analyst Ming-Chi Kuo.\nNew iPhone shipments to be capped by similar form factor as iPhone 6s & 6s Plus; top hardware upgrade is dual-camera (5.5-inch model only), though many competing models with dual-camera will launch soon, joining others already on the market; first impressions could underwhelm.\nRumors surrounding dual-camera iPhones have gained momentum since January, when Kuo said that Apple has both single- and dual-camera iPhone 7 Plus models in development. Recent reports have been unclear, however, about whether the 4.7-inch iPhone 7 will also have dual cameras.\nLeaks surrounding the rumored dual cameras have been limited to a blurry photo of the purported iPhone 7 Plus (or iPhone Pro?) and a possible dual-lens module appropriate for the 5.5-inch smartphone. Apple reportedly received dual-lens camera samples from suppliers for testing purposes in February.\nLinX Technology multi-aperture camera modules\nThe rumored camera improvements have been linked to Apple's acquisition of LinX Technology , which could lead to \"DSLR-quality\" photos on iPhones. LinX's multi-aperture cameras are also smaller sized than single-aperture cameras, meaning the iPhone 7 Plus could have a slightly less protruding camera lens\nLinX camera modules have a number of other benefits, including 3D depth mapping, better color accuracy and uniformity, ultra HDR, low noise levels, higher resolution, low costs, zero shutter lag, and a compact design that allows for edge-to-edge displays. A recent video demo provides a good overview of dual-camera technology.\nApple recently patented a dual-camera system consisting of one standard wide-angle lens, similar to what is found in the latest iPhones, and a second telephoto lens capable of capturing zoomed-in video and photos. In a recent video, we visualized what the interface could look like on future iOS devices.\n(Top Image: Cameraplex)",
        "sentiment": 0.16761426084364453
    },
    "article_21": {
        "title": "This developer installed Windows 95 on an Apple Watch",
        "body": "I installed Windows 95 on my Apple Watch\nWith a 520 MHz processor, 512 MB of RAM, and 8GB of internal storage, the Apple Watch packs a lot of computing horsepower into a very small package. On paper, its processor alone is about twenty-five times faster than the average 386, and 512 MB was the size of a hard drive in the mid nineties, not memory. As a result, I was feeling confident that the Apple Watch had the ability to run one of the most revered desktop operating systems Redmond has ever produced.\nWhat are you, nuts?\nPretty much. I was born in the nineties, and the first personal computer my family bought (a $3000 screamer with a 300 MHz Pentium II, 256 MB of RAM, and the optional Boston Acoustics speaker system) ran Windows 95. Also, this isn’t the first time I’ve installed an old operating system on a watch. Here’s a video of my Apple Watch running Mac OS 7.5.5:\nBut How?\nUnlike the above port of the Mini vMac emulator, the result here had to be interactive. That meant that Apple’s WatchKit SDK wasn’t good enough, since it doesn’t allow you to access user touch locations directly — it only lets you use Apple’s stock controls. Long story short, it’s possible to patch certain files within a WatchKit app to load your own application code rather than Apple’s. For more information, check out Steven Troughton-Smith’s excellent blog post on the subject.\nHere’s an outline of the steps involved:\nCopy symbols and headers from Xcode’s iphoneOS and iphoneSimulator platforms to the watchOS and watchSimulator platforms, respectively.\nBuild your “normal” UIKit-based iOS app inside a framework, rather than in your WatchKit extension.\nUse install_name_tool to point your WatchKit app’s _WatchKitStub/WK binary to your framework instead of SockPuppetGizmo. SockPuppetGizmo is the framework that (to my knowledge) runs WatchKit and interacts with normal WatchKit extensions that developers write.\nbinary to your framework instead of SockPuppetGizmo. SockPuppetGizmo is the framework that (to my knowledge) runs WatchKit and interacts with normal WatchKit extensions that developers write. Jury-rig the iOS port of the Bochs x86 emulator into your framework. “Easy!” “How hard can it be?” read: Pretty hard. In my case, Xcode crashed whenever I tried to use lldb. Your mileage may vary.\nCopy a Windows 95 disk image in to your app’s bundle, write the config file, and boot ‘er up.\n*Optional: hot glue a motor to the watch’s crown to keep it from falling asleep.\nWill It Blend?\nYes! Due to the fact that it is emulated (not virtualized), it takes about an hour to boot.\nWarranty: gone\nCan I Try?\nYep! The code is on GitHub. You’ll need to source the files that show up in red yourself — they aren’t redistributable.",
        "sentiment": 0.10920657327069956
    },
    "article_22": {
        "title": "Apple recovered 2,204 pounds of gold from broken iPhones last year",
        "body": "As if Apple needed the cash, the company has discovered a way to make tens of millions of dollars off of old, broken, unwanted iPhones.\nIn its annual environmental report released this week, Apple said it recovered 2,204 pounds (more than a ton) of gold from recycled iPhones, iPads and Macs last year. That's $40 million worth.\nGold is used in consumer electronics because it is highly averse to corrosion and an excellent conductor of electricity. Silver is actually the best conductor, but it corrodes easily. Copper is super-cheap, but it moves electrons too slowly for some of the most important computing tasks.\nOf the 90 million pounds of e-waste through its recycling programs, Apple said 61 million was in reusable materials. Gold made up a relatively trivial amount. But since gold is currently trading at more than $1,200 per troy ounce, it's among the most valuable materials it pulled from all those old gadgets.\nApple (AAPL) said it also collected 23 million pounds of steel; 13 million pounds of plastic; 12 million pounds of glass; 4.5 million pounds of aluminum; 3 million pounds of copper; and 6,600 pounds of silver.\nApple has been ramping up its recycling programs in recent years, boosted by its Apple Renew program that lets customers recycle any Apple device at an Apple Store.\nThe company also recently started using a new experimental line of robots dubbed Liam. They're designed to disassemble 1.2 million phones a year, sorting all their various components. Liam prototypes are operating in California and the Netherlands.\nApple says it reuses many of the materials it extracts from the recycled phones. That reduces the need to mine those metals and materials from the earth.",
        "sentiment": 0.2679291284875944
    },
    "article_23": {
        "title": "iTunes is 13 years old—and it’s still awful",
        "body": "On April 28, 2003, Apple started up a revolution.\nEnter the iTunes Music Store, unveiled with a proud flourish by a beaming Steve Jobs. It was a digital jukebox, a music distribution game-changer, a record store to end all record stores—and it did, in fact, kill off a great number of those. The addition of the online store to the iTunes media player (which debuted in 2001) completely altered the way people bought, sold, and made music around the globe.\nAdvertisement\nThis new iTunes store delivered content to impatient fans instantly. Its option to purchase individual songs made music insanely cheap. It proved so popular, it convinced even the most stubborn of artist holdouts to sign up. Sure, the record industry certainly had its gripes with the service, but listeners loved it. By 2013, Apple had sold 25 billion songs.\nSo why this?\nAdvertisement\nFor 13 years—15 if you count the two years the program was just a file-storing service—users have grumbled loudly about iTunes’ unwieldy interface, its bloated features, its inability to simply get better. Companies, however great, sometimes fail to improve their products; and iTunes has been Apple’s great big software mess-up. (Well, that and Maps.)\nThere’s one more thing\nIn 2003, Time magazine praised iTunes as a ”disarmingly simple concept” and the “coolest invention” of the year, neither of which would remain the case for long.\nThe iPod, the iPhone, the MacBook were all iconic pieces of technology when they debuted, and they’ve only grown sleeker with every iteration. With iTunes, we’re now on version 12—but aside from a flattened UI and a few touch-ups to the color palette, things look pretty similar to what they did in 2003.\nAdvertisement\nThat’s largely because, instead of trying to streamline the service over the years, Apple has opted to stuff an overwhelming number of new features—movies, television shows, podcasts, mobile apps, and most recently, Apple Music—into it. The company gave its designers “an impossible task: cramming way too much functionality into a single app,” says Marco Arment, the software developer behind Tumblr and Instapaper.\nAs a result, Arment says, the platform has turned into a ”toxic hellstew of unreliability.” The most widespread grouses about iTunes today include, but certainly aren’t limited to:\nIts space-sucking size. iTunes’ storage requirements go far beyond the size of the actual music files it hosts.\niTunes’ storage requirements go far beyond the size of the actual music files it hosts. Slowness. Thanks to its massive set of features, iTunes is jerky and inclined to lag\nThanks to its massive set of features, iTunes is jerky and Ugliness. From a design standpoint, the navigation of iTunes is unintuitive, perplexing, and downright unattractive. Its ubiquitous shade of lint-dull gray does not help.\nFrom a design standpoint, the navigation of iTunes is unintuitive, perplexing, and downright unattractive. Its ubiquitous shade of lint-dull gray does not help. Bloatware. iTunes updates tend to come with bulky extra components\niTunes updates tend to come with Lack of online or social integration. Of course, Apple did try, kind of—remember the disaster that was Ping\nOf course, Apple did try, kind of—remember the disaster that was A wonky back-end. Considering it’s meant to be a file management service, iTunes probably shouldn’t require so many articles\nConsidering it’s meant to be a file management service, iTunes probably shouldn’t require so many Music isn’t even its priority. iTunes is not really the music player it claims to be; it’s focused on selling apps, books, and other content. With so much attention on the store, Apple has shoved the improvement of actual music-related features to the side.\nHonestly, why bother anymore?\nWhile you’d think consistent years of hatred would be enough to spark change, the fact is that Apple has never felt an urgent need to whip iTunes into shape because it knows people will grudgingly use it no matter what. As long as people buy music and buy iPhones (and they are, at record rates), they have little choice but to store that music on iTunes.\nAdvertisement\nBut that’s now changing.\n“The money has moved from owning to listening, [so] the company is trying its hardest to make sure they can capture as much of that transitioning market as they can,” technology columnist John Patrick Pullen observed in June 2015, right after Apple revealed Apple Music, its subscription streaming service.\nThat service has proven an excellent gamble; Apple Music—only 10 months old—now already has 13 million paying subscribers. In 2011, App Store downloads overtook iTunes music downloads and the years since have seen iTunes’ music profits falling and falling. It’s a reflection of a certain inevitability: the industry is moving on.\nAt the same time, Apple is quietly shuttering key iTunes features. Its last iTunes update, from March 21, was only a single line long: “This update adds support for syncing iTunes with iPhone SE and iPad Pro.” (Editor’s note: That syncing could still use some work. The last time I tried to connect my iTunes music library to iCloud, it tried to upload to my entire music collection to my phone—2,000 songs at a time.)\nAdvertisement\nA recent report from the Recording Industry Association of America highlighted how streaming is currently the largest revenue-driver in the US music industry.\nApple, in its post-Jobs era, seems to have also given up on revamping its old products, choosing to follow current trends instead of pressing on its prior innovations. So perhaps the fate of iTunes is to be ignored until it dies, unloved, in the corner, long after people forget just how revolutionary it was.\nStreaming is now so accessible and convenient that it’s made the world grow tired of downloading and owning music—just like iTunes’ 99-cent song downloads years ago turned physical record stores into dusty mausoleums.",
        "sentiment": -0.4702690146863461
    },
    "article_24": {
        "title": "Nintendo Launching 'Animal Crossing' and 'Fire Emblem' on Smartphones This Fall",
        "body": "Nintendo of America has announced that it will release two more smartphone games, based on its popular, long-running franchises Animal Crossing and Fire Emblem, later this year, as part of the Japanese company's commitment to release five smartphone games by March 2017.\nNintendo fans are cautiously optimistic about the upcoming titles, which will not be direct ports of the console-based games but rather mobile-optimized spinoffs that could involve a series of in-app purchases. Nintendo declined to say whether the games will be free to download on the App Store.\nAnimal Crossing, based on a simulated world of animals, and Fire Emblem, a tactical RPG, are expected to be \"more accessible\" and \"connected\" versions of the traditional console-based games. The titles can currently be played on Nintendo 3DS, Wii U, and multiple other Nintendo platforms.\nAs for the former app, while making it more accessible in comparison to the Fire Emblem games for Nintendo’s dedicated gaming systems, Nintendo aims to offer the great value of a role-playing strategy game. Nintendo will design the latter game so that it will be connected with the world of Animal Crossing for dedicated gaming systems. By playing both Animal Crossing games, users will find increased enjoyment.\nNintendo's first iOS app Miitomo debuted on the App Store last month in partnership with Japanese developer DeNA. The social-based game allows players to create and customize avatars called \"Miis,\" chat with other players, play mini games to earn coins and tickets that can be used towards purchasing new outfits, and more.\nMiitomo is believed to be off to a good start for Nintendo, earning the struggling game maker an estimated $280,000 per week in in-app purchases revenue, but the company's most dedicated fans remain hopeful that it will eventually release smartphone games based on its most iconic franchises like Super Mario and Legend of Zelda.\nFor now, fans will have to make do with Animal Crossing and Fire Emblem.",
        "sentiment": 0.2429908194268743
    }
}