{
    "article_0": {
        "title": "Apple CEO Tim Cook demands Obama White House formally defend Americans' right to strong encryption",
        "body": "Jenna McLaughlin at The Intercept writes that Apple CEO Tim Cook \"lashed out at the high-level delegation of Obama administration officials who came calling on tech leaders in San Jose last week.\"\nCook is said to have criticized the Obama White House for a lack of leadership on the freedom to keep one's own private digital life private, as FBI and other law enforcement top brass condemn even basic forms of crypto and secure messaging as \"tools of terrorists.\"\nThe Apple CEO is reported to have demanded the Obama administration to issue a strong public statement defending the use of unbreakable encryption. That's pretty undeniably awesome, and those of us who believe in the right to encrypt need the most powerful allies we can get right now.\nSnip:\nThe White House should come out and say \"no backdoors,\" Cook said. That would mean overruling repeated requests from FBI Director James Comey and other administration officials that tech companies build some sort of special access for law enforcement into otherwise unbreakable encryption. Technologists agree that any such measure could be exploited by others. But Attorney General Loretta Lynch responded to Cook by speaking of the \"balance\" necessary between privacy and national security — a balance that continues to be debated within the administration. The exchange was described to The Intercept by two people who were briefed on the meeting, which the White House called to discuss a variety of counterterrorism issues with representatives from Apple, Facebook, Twitter, Cloudflare, Google, Drop Box, Microsoft, and LinkedIn.\nThank you, Tim Cook. [More at The Intercept]",
        "sentiment": -0.10452287681400776
    },
    "article_1": {
        "title": "iOS 9.3 Preview - Including Night Mode",
        "body": "Easily set up a Focus\nA new streamlined setup for Focus lets you select the apps and people you want to receive notifications from by either allowing them or silencing them. Connect your Lock Screen to your Focus so the look and feel of your iPhone match how you want to use it in the moment. With a swipe, you can go from your Personal Focus to your Work Focus with widgets showing upcoming meetings and to-do lists.",
        "sentiment": 0.7169937963287035
    },
    "article_2": {
        "title": "Apple’s iPhone 6S outperforms every Android phone in a major benchmark test",
        "body": "Benchmark and performance enthusiasts look forward to AnTuTu’s Global Top 10 Best Performance Smartphones each year, but it’s a little different this time around. Past reports only included Android phones, but thanks to AnTuTu 6.0, which was released last year as a cross-platform app, the iPhone can now be included in the test.\nUnfortunately for Android fans, the result wasn’t so good. To say the iPhone 6S obliterated the competition would be an understatement. The iPhone 6S came in first with a score of 132,620. The next phone in line, the Huawei Mate 8, scored only 92,746. If you’re doing the math, that means the iPhone 6S is about 42 percent faster.\nSamsung, Android’s most popular brand, performed far worse. It still came in at fourth place among the phones tested, though. The iPhone 6S was about 60 percent faster than both the Galaxy Note 5 and Galaxy S6 Edge Plus.\nEven last year’s iPhone 6 outperformed most other Android phones, as it placed sixth overall. It’s about 3 percent faster than the Google Nexus 6P, which became available only a few months ago.\nWhat’s most interesting about this data is the fact that Apple isn’t in a spec war like the one in which Android manufacturers find themselves. Companies that make Android phones continue to push the boundaries with octa-core processors and as much as 4GB of RAM. The competition among Android phones has heated up so much that companies like Samsung and Huawei are now manufacturing their own in-house processors.\nHowever, the iPhone 6S is rocking its own 64-bit dual-core A9 processor with only 2GB of RAM. Kudos have to be given to Apple on its ability to be so efficient with so little. The efficiency not only gives the iPhone more power, but it likely helps battery life as well, which is a good thing, seeing as iPhone battery life is notoriously short.\nAnTuTu tests only one device per model and averages 500 data samples for each phone. The company didn’t include the iPhone 6S Plus or the iPhone 6 Plus because there were no significant differences when compared to the iPhone 6S and iPhone 6. It’s unclear if that was also the case for the Samsung phone that was chosen for the test.\nAlthough the results are intriguing, it’s important to note that benchmark tests aren’t everything, and sometimes real-world performance is different.\n[amz_native_shopping asins=”B015E8W1RC,B018QCK1M0,B013WACF4S,B0147EVKCQ” linkid=”971a23970d2329a713bde1411bc7bd0a” title=”Recommended Smart Phones”]\nToday's tech news, curated and condensed for your inbox Subscribe Check your inbox! Please provide a valid email address to continue. This email address is currently on file. If you are not receiving newsletters, please check your spam folder. Sorry, an error occurred during subscription. Please try again later.\nEditors' Recommendations",
        "sentiment": -0.2516244753663029
    },
    "article_3": {
        "title": "Apple's new 'Music Memos' App",
        "body": "In Music Memos version 1.0.7, you can export your Music Memos recordings to your Voice Memos library. You need:\nAn iPhone with iOS 14 or later, or an iPad with iPadOS 14 or later\nVoice Memos and Music Memos version 1.0.7\nOpen Music Memos. When “Recording is moving to Voice Memos” appears, tap Export. It can take several minutes to export your recordings to Voice Memos depending on the size of your library.\nIf you don't want to export at this time, tap OK to dismiss the “Recording is moving to Voice Memos” window for seven days.\nOnce you've exported all your Music Memos recordings to Voice Memos, your recordings appear in Voice Memos in a folder titled “Music Memos.” If you encountered an error while exporting, you might need to free up space on your device or wait until your Music Memos recordings have finished updating from iCloud.\nIf you create new recordings with Music Memos, you'll need to copy them to Voice Memos to make sure you keep them.",
        "sentiment": -0.358776443451643
    },
    "article_4": {
        "title": "Adobe hires professional children's book illustrator to produce Bob Ross-esque \"The Joy of Sketching\" video series teaching drawing techniques using the iPad Pro",
        "body": "Famous television painter and instructor Bob Ross may have passed away in 1995, but Adobe has resurrected him for a series of tutorials on using Photoshop Sketch. The first in the four-part video series, titled “The Joy of Sketching,” is available now on YouTube, if the embedded video below doesn’t load.\nIn the video series, children’s book illustrator Chad Cameron channels his inner Bob Ross – afro, “happy little clouds,” and all. Cameron demonstrates how to use Adobe Photoshop Sketch, the iPad Pro, and the Apple Pencil to create a digital painting, in hopes of inspiring a new generation of creative artists.\nBob Ross Inc. loved working alongside Adobe on the project. Joan Kowalski, media director of Bob Ross Inc., pointed out that Adobe worked hard to ensure the video was an homage, not a parody, to Ross. “For example, they asked us about the brand of clothes he wore and the types of easels he used. It showed us they really cared.”\nThe first video was published Jan. 25, to celebrate the 25th anniversary of Ross’s series, “The Joy of Painting,” and covers the basics of Photoshop Sketch needed “to create a mighty little painting of your own.” With all of the jokes that have been made at Ross’s expense, it’s good to see Adobe taking his legacy and using it for what it was intended: to teach art to others.\nAdobe Photoshop Sketch is designed for iPad, and requires iOS 8.1 or later. It’s a free download on the App Store without ads, but it does include in-app purchases.",
        "sentiment": 0.3085769455020244
    },
    "article_5": {
        "title": "Good Guy Apple: \"Future operating systems like iOS8 and the current iOS9 are designed to be impenetrable by even Apple itself\"",
        "body": "A newly unsealed court transcript shows that Apple doesn’t just support its average customers’ right to encrypted communications: It even stands up to the government over meth dealers’ phones.\nThe transcript comes from an October 2015 hearing in the U.S. District Court for the Eastern District of New York, in which a judge asked Apple to explain why it had ignored U.S. prosecutors’ search warrants to unlock the phone of Jun Feng, who pled guilty to a conspiracy to attempt to distribute methamphetamines,and who was charged alongside six others.\nIt’s a unique case: Feng had an iPhone 5s, which comes loaded with Apple’s iOS7 operating system. In the past, that hadn’t been a major problem. As an official from the Department of Homeland Security had previously testified, law enforcement had a device to easily run through every possible passcode to unlock an iPhone. But Feng’s phone was configured to erase all its data if someone unsuccessfully tried 10 times in a row to unlock it.\nAt the time of the hearing, Apple seemed obstinate, warning in its publicly filed briefing that it wasn’t going to perform this task on future cases. “In most cases now and in the future, the government’s requested order would be substantially burdensome, as it would be impossible to perform,” lawyers for the company wrote. Future operating systems like iOS8 and the current iOS9 are designed to be impenetrable by even Apple itself, it said.\nThe unsealed arguments paint a more nuanced debate. Prosecutors noted that since 2008, Apple has received at least 70 warrants to help view the contents of a suspect’s phone. Those instances were a different kind of situation, Apple countered, as the government was instead asking for a technical service. Moreover, prosecution was for the first time pressuring Apple with the seldom-used All Writs Act, a law last updated in 1949.\nThat Apple protects users’ privacy is undoubtedly part of its business model. One U.S. attorney argued that it was “more concerned with public perception” than helping catch criminals. Around the time the transcript was taken, CEO Tim Cook was upping his comments on user privacy, declaring that the company would refuse to create backdoors into its encrypted messaging service.\n“Right now Apple is aware that customer data is under siege from a variety of different directions. Never has the privacy and security of customer data been as important as it is now,” Apple lawyer Marc Zwillinger said at the hearing. “A hypothetical consumer could think if Apple is not in the business of accessing my data and if Apple has built a system to prevent itself from accessing my data, why is it continuing to comply with orders that don’t have a clear lawful basis in doing so?”\nThough Feng’s case is settled, Apple still awaits the judge’s decision.\nRead the transcript of the hearing here:\nPhoto via Andy Rennie/Flickr (CC BY SA 2.0)",
        "sentiment": -0.26173829960171136
    },
    "article_6": {
        "title": "Apple Announces Record $1.1 Billion App Store Sales During Holiday Season",
        "body": "Apple today announced the 2015 holiday season was the \"biggest ever\" for the App Store, with customers spending a record-breaking $1.1 billion on apps and in-app purchases over a two-week period ending January 3, 2016.\nChristmas Day and New Year's Day both set single-day records, with customers spending over $144 million on January 1, 2016. Apple has now paid out nearly $40 billion to developers worldwide since the App Store launched in 2008.\nApple marketing chief Phil Schiller said App Store sales topped $20 billion in 2015:\n“The App Store had a holiday season for the record books. We are excited that our customers downloaded and enjoyed so many incredible apps for iPhone, iPad, Mac, Apple Watch and Apple TV, spending over $20 billion on the App Store last year alone,” said Philip Schiller, Apple’s senior vice president of Worldwide Marketing. “We're grateful to all the developers who have created the most innovative and exciting apps in the world for our customers. We can't wait for what's to come in 2016.”\nApple said it has now created 1.9 million jobs in the U.S., with over 1.4 million of those jobs attributable to app development and non-IT jobs supported by the app ecosystem. Apple's spend and investment with US-based suppliers also supports 361,000 jobs, and the company directly employs more than 76,000 people in the U.S., representing nearly two‑thirds of its worldwide team.\nApple created two new app ecosystems this year with the new Apple TV and Apple Watch, building upon its iOS and Mac storefronts. The company keeps 30% of App Store revenue, meaning it earned over $6 billion in 2015 after paying developers. There are now over 1.6 million apps on the App Store, according to MacRumors sister website AppShopper.",
        "sentiment": 0.5850460433090726
    },
    "article_7": {
        "title": "Response to Apple's announcement from F.lux",
        "body": "Apple announced this week that they’ve joined our fight to use technology to improve sleep.\nThere is a lot to be done. Indeed, workers on the “night shift” have nearly double the lifetime risk of cancer [1], and much of this is believed to be driven by exposure to bright light at the wrong times.\nApple’s involvement in fixing this problem is a big commitment and an important first step.\nWe’re proud that we are the original innovators and leaders in this area. In our continued work over the last seven years, we have learned how complicated people actually are. The next phase of f.lux is something we cannot wait to ship to the world.\nRather than suggest simple answers, our mission is to enable f.lux to advance the science, while providing customized solutions for each person. We intend to make f.lux better in every way than the app we designed back in 2009.\nToday we call on Apple to allow us to release f.lux on iOS, to open up access to the features announced this week, and to support our goal of furthering research in sleep and chronobiology.\nAs we continue to innovate and improve upon our ideas, we remain hopeful that we will have the opportunity to offer our best, new work to everyone who wants it. We’ve learned that people’s lives, biology, and everyday routines are incredibly, wonderfully different, and these differences must be embraced. There is not one right answer for everyone, so we are committed to making software that’s ever more adaptive and responsive to each individual’s needs.\nThank you for the words of support. We hope you’ll join us in our quest to understand how screens and light affect sleep and in turn, human health.\nWith love,\nMichael and Lorna\nPeople asked for references for the cancer claims above, so here is a brief list.",
        "sentiment": 0.6216745188285131
    },
    "article_8": {
        "title": "The iPhone isn’t dying, Wall Street is just crazy",
        "body": "“iPhone sales flatline.” – The Guardian, Forbes\n“End of an era?” – Phys.org\n“iPhone sales have finally stalled” – Gizmodo\nWith headlines like these, you might imagine that iPhone sales dropped dead at the end of 2015. You’d be wrong. Despite what you may read, the iPhone has not “flatlined,” and there is no evidence that this is the “end of an era.” More people bought iPhones from October to December than any three-month period in history — 74.8 million of them were sold. So if you hear someone saying that Apple’s “super-growth era” is over, think twice.\nExpectations are too high. Wall Street analysts and technology pundits are unhappy with Apple’s record sales of 74.8 million because it didn’t grow enough. The figure is only 0.5 percent higher than Apple’s record 2014 holiday sales of 74.5 million. Wall Street greedily wants faster growth, and the media is afraid that Apple’s iPhone gravy train may finally derail.\nThe iPhone is not dying.\nApple sold 231.5 million iPhones in 2015, 20 percent more than it’s ever sold before. And in 2016, there’s no reason to think it won’t sell a ton more. The iPhone 6S and 6S Plus didn’t dramatically increase the number of people who buy iPhones like the 6 and 6 Plus did last year, but Apple is still selling more iPhones than ever, and historically, this is a repeating trend.\nThe iPhone 5S suffered a similar lack of growth two years ago. When it came out in late 2013, it looked identical to the iPhone 5 except for one big feature: It came in gold. Anticipating the problem, Apple also tried to re-release the iPhone 5 with colorful plastic cases, calling it the 5C, but it barely made a dent in sales. Growth slowed to 6.7 percent during a year when global smartphone sales grew more than 40 percent.\niPhone sales growth cooled down so much with the iPhone 5S, that even I believed that the iPhone had peaked, and had nowhere to go but down. That’s what the data showed, after all. But I was wrong. Apple released two bigger, better iPhones and sales exploded again in 2014. Out of nowhere, sales climbed by 46 percent, doubling the global smartphone industry’s growth.\nAfter the 5S, even I claimed that the iPhone had peaked. I was wrong.\nThe new features of the iPhone 6S were especially invisible. New abilities like 3D Touch are neat, but app developers haven’t found many inspiring ways to use them yet. The new color, Rose Gold, hasn’t flown off the shelves, either.\nThen again, a lot of big players boarded the struggle bus in 2015. The market for smartphones only ticked ahead by 10 percent (an estimate, as full figures aren’t out yet), the lowest since the iPhone shook things up in 2008. LG shipped 60 million smartphones and Samsung also took a hit. It shipped 320 million smartphones, a 2 percent decline, despite pumping out more than 20 different phones in 2015 alone. Apple released two.\nFrom 2007 to 2011, Apple could do no wrong. No one could compete with what the iPhone offered, and because of it, Apple’s phone tended to double in sales every year, like clockwork. But times have changed. The world is full of Android phones that look almost identical to the iPhone, which is why Android growth tends to sputter and spurt. Apple continues to climb, but its trajectory is determined by the innovations it packs into each new phone, and how many new hands those innovations appeal to.\nLoudmouths can make all the doom and gloom predictions they want, and point to Tim Cook’s warning that iPhone sales will decline slightly (year over year), as evidence that it’s curtains for Apple; they’re shortsighted.\nUntil Tim Cook shows off the iPhone 7 this September, no one has an inkling of where iPhone sales are headed. Early rumors are already buzzing, and they don’t paint a picture of a stagnant company. There are hints that iPhone 7 will have a new design, OLED screen, dual rear cameras with optical zoom, a screen with a built-in fingerprint reader, wireless charging, no headphone jack (a head scratcher), a waterproof liquid metal unibody, wireless earbuds, more RAM, and a faster processor.\nThe iPhone is not dying. Its future is, as always, completely up to Apple.\nToday's tech news, curated and condensed for your inbox Subscribe Check your inbox! Please provide a valid email address to continue. This email address is currently on file. If you are not receiving newsletters, please check your spam folder. Sorry, an error occurred during subscription. Please try again later.\nEditors' Recommendations",
        "sentiment": -0.26971054467938693
    },
    "article_9": {
        "title": "This is what today’s popular websites look like on the 1st generation iPhone",
        "body": "This is what today’s popular websites look like on the 1st generation iPhone\nJanuary 9, 2016, marked 9 years since Steve Jobs announced the iPhone at the Macworld Expo. I can remember watching the keynote in amazement and realizing that the product being announced was going to change everything.\nToday, Apple is going to reinvent the phone — Steve Jobs\nI received a 1st generation iPhone as a birthday gift last year from a good friend of mine and I really haven’t done much with it. I started wondering if the phone…",
        "sentiment": 0.5900221181412538
    },
    "article_10": {
        "title": "Apple ends its free iTunes Radio service today",
        "body": "As anticipated, Apple discontinued the free, ad-supported version of iTunes Radio today. If you used the service to create your own radio stations and want to continue to do so, you'll need to join the paid, premium Apple Music service. Desktop and iOS users who try to access the service will instead be a redirected to an Apple Music signup screen. Similarly, if you've been filling in missing iTunes tracks with your own collection using Match, you'll be unable to do so without joining Apple Music.\nIf you still need free music, the only way to get if now from Apple now is via Beats 1. By keeping that separate from Apple Music, which has no ad-supported option, Apple has been able to offer exclusive content from artists like Taylor Swift and Pharrell . As a reminder, the service costs $10 a month, though there's a free, three-month trial available -- just don't forget to cancel it if you don't want to be billed automatically after the trial expires.",
        "sentiment": -0.24030745987381255
    },
    "article_11": {
        "title": "Apple Pay Is Coming To ATMs From Bank Of America And Wells Fargo",
        "body": "Both Bank Of America and Wells Fargo are working on integrating Apple Pay into their ATMs, according to a source familiar with the teams on the projects. Engineers at both companies have been placed on multi-month assignments to build the Apple Pay options. I’ve confirmed the identity of at least one engineer who publicly lists themselves as a Bank Of America employee.\nWells Fargo’s head of ATMs Jonathan Velline implied Apple Pay would come to its ATMs. He confirmed that “We’ve been working on the technology that allows us to hook to digital wallets, leveraging NFC on mobile phones to replace the card at the transaction at the ATM. Right now the wallet that we support is Android Pay.”\nVelline continued “But we’re also looking at lots of different mobile wallets and evaluating which ones are going to be appropriate for our customers. We’ll likely add more mobile wallets throughout the year. We recognize our customers are going to have lots of different types of wallets based on their device, based on their bank, based on their OS, and we’re going to continue to find the right balance of which wallets we’re going to support. Right now the initial launch is with Android Pay, but that doesn’t limit us from considering other mobile wallets.”\nWhen I pressed harder and asked if that meant Apple Pay would likely be one of those mobile wallets, he admitted with a laugh “I think that’s a good assessment.”\nWhen asked about whether its ATMs would work with Apple Pay, Bank Of America’s Consumer Banking Products press representative Betty Riess told me “We already have number of mobile wallet programs…” implying Apple Pay could join them.\nShe confirmed that Bank Of America is “currently developing a new cardless ATM solution. This solution will enable customers to leverage NFC (near field communication) technology on their smart phone in order to authenticate and complete transactions at a Bank of America ATM. We will roll out this capability in late February with associates at select ATMs in Silicon Valley, San Francisco, Charlotte, New York and Boston followed by a broader roll out to customers mid year.” The Charlotte Observer reported news of the cardless ATMs yesterday but didn’t specify that Apple Pay would be involved.\nRiess requested to double-check what she could say specifically about Apple Pay. When she called me back regarding the ATMs, she was more reserved, saying “At this point we’re not confirming which phones they’ll work with.” But the iPhone is by far the most popular phone in the U.S., so this all meshes with our source saying Bank Of America is working on Apple Pay for ATMs.\nApple also did not respond to a request for comment. Bank Of America and Wells Fargo competitor Chase recently announced it will be rolling out cardless ATMs this year.\nWhile it’s unclear exactly how Apple Pay at ATMs would work, it would likely allow people to withdraw money without needing their debit card or credit card. That could be especially useful if someone lost or forgot their wallet or card.\nUsers would likely tap their phone to the ATM’s NFC point, which would bring up the passcode or thumbprint verification screen on the phone. Once confirmed, users would be able to access some ATM functionality as if they’d inserted their card and entered their pin.\nWorking with Apple Pay could also save the banks money by protecting against fraud. It’s much easier to duplicate a credit card than an iPhone. Apple Pay can be set to require a fingerprint scan, which ATMs don’t offer. Apple Pay passcodes can also be long and complex, compared to the simple 4-digit pin codes used on debit cards.\nMost importantly, Apple Pay would thwart the use of card skimmers. These devices fit over the front of ATMs as a fake facade, and then steal the information from cards inserted into them. Switching to NFC and mobile phones would prevent this since there would be no card involved.\nThese anti-fraud incentives and consumer interest in the convenience of using NFC to withdraw money could spur banks to race to integrate Apple Pay.\n[Image Credit: Alex]",
        "sentiment": -0.0050164462337570805
    },
    "article_12": {
        "title": "AMD Just announced a 14nm FinFET Polaris GPU Architecture. This is the first die shrink for GPU's in 5 years, and these could end up in 2016 macs.",
        "body": "For much of the last month we have been discussing bits and pieces of AMD’s GPU plans for 2016. As part of the Radeon Technology Group’s formation last year, the leader and chief architect of the group, Raja Koduri, has set about to make his mark on AMD’s graphics technology. Along with consolidating all graphics matters under the RTG, Raja and the rest of the RTG have also set about to change how they interact with the public, with developers, and with their customers.\nOne of those changes – and the impetus for these recent articles – has been that the RTG wants to be more forthcoming about future product developments. Traditionally AMD always held their cards close to their chest about architectures, keeping them secret until the first products based on a new architecture launch (and even then sometimes not talking about matters in detail). With the RTG this is changing, and similar to competitors Intel and NVIDIA, the RTG wants to prepare developers and partners for new architectures sooner. As a result the RTG has been giving us a limited, high-level overview of their GPU plans for 2016.\nBack in December we started things off talking about RTG’s plans for display technologies – DisplayPort, HDMI, Freesync, and HDR – and how the company would be laying the necessary groundwork in future architectures to support their goals for higher resolution displays, more ubiquitous Freesync-over-HDMI, and the wider color spaces and higher contrast of HDR. The second of RTG’s presentations that we covered was focused on their software development plans, including Linux driver improvements and the consolidation of all of RTG’s various GPU libraries and SDKs under the GPUOpen banner, which will see these resources released on GitHub as open source projects.\nLast but not least among RTG’s presentations is without a doubt the most eagerly anticipated subject: the hardware. As RTG (and AMD before them) has commented on in the past couple of years, a new architecture is being developed for future RTG GPUs. Dubbed Polaris (the North Star), RTG’s new architecture will be at the heart of their 2016 GPUs, and is designed for what can now be called the current-generation FinFET processes. Polaris incorporates a number of new technologies, including a 4th generation Graphics Core Next design for the heart of the GPU, and of course the new display technologies that RTG revealed last month. Finally, the first Polaris GPUs should be available in mid-2016, or roughly 6 months from now.\nFirst Polaris GPU Is Up and Running\nBut before we dive into Polaris and RTG’s goals for the new architecture, let’s talk about the first Polaris GPUs. With the first products expected to launch in the middle of this year, to no surprise RTG has their first GPUs back from the fab and up & running. To that end – and I am sure many of you are eager to hear about – as part of their presentation RTG showed off the first Polaris GPU in action, however briefly.\nAs a quick preface here, while RTG demonstrated a Polaris based card in action we the press were not allowed to see the physical card or take pictures of the demonstration. Similarly, while Raja Koduri held up an unsoldered version of the GPU used in the demonstration, again we were not allowed to take any pictures. So while we can talk about what we saw, at this time it’s all we can do. I don’t think it’s unfair to say that RTG has had issues with leaks in the past, and while they wanted to confirm to the press that the GPU was real and the demonstration was real, they don’t want the public (or the competition) seeing the GPU before they’re ready to show it off. That said, I do know that RTG is at CES 2016 planning to recap Polaris as part of AMD’s overall presence, so we may yet see the GPU at CES after the embargo on this information has expired.\nIn any case, the GPU RTG showed off was a small GPU. And while Raja’s hand is hardly a scientifically accurate basis for size comparisons, if I had to guess I would wager it’s a bit smaller than RTG’s 28nm Cape Verde GPU or NVIDIA’s GK107 GPU, which is to say that it’s likely smaller than 120mm2. This is clearly meant to be RTG’s low-end GPU, and given the evolving state of FinFET yields, I wouldn’t be surprised if this was the very first GPU design they got back from Global Foundries as its size makes it comparable to current high-end FinFET-based SoCs. In that case, it could very well also be that it will be the first GPU we see in mid-2016, though that’s just supposition on my part.\nFor their brief demonstration, RTG set up a pair of otherwise identical Core i7 systems running Star Wars Battlefront. The first system contained an early engineering sample Polaris card, while the other system had a GeForce GTX 950 installed (specific model unknown). Both systems were running at 1080p Medium settings – about right for a GTX 950 on the X-Wing map RTG used – and generally hitting the 60fps V-sync limit.\nThe purpose of this demonstration for RTG was threefold: to showcase that a Polaris GPU was up and running, that the small Polaris GPU in question could offer performance comparable to GTX 950, and finally to show off the energy efficiency advantage of the small Polaris GPU over current 28nm GPUs. To that end RTG also plugged each system into a power meter to measure the total system power at the wall. In the live press demonstration we saw the Polaris system average 88.1W while the GTX 950 system averaged 150W. Meanwhile in RTG’s own official lab tests (and used in the slide above) they measured 86W and 140W respectively.\nKeeping in mind that this is wall power – PSU efficiency and the power consumption of other components is in play as well – the message RTG is trying to send is clear: that Polaris should be a very power efficient GPU family thanks to the combination of architecture and FinFET manufacturing. That RTG is measuring a 54W difference at the wall is definitely a bit surprising as GTX 950 averages under 100W to begin with, so even after accounting for PSU efficiency this implies that power consumption of the Polaris video card is about half that of the GTX 950. But as this is clearly a carefully arranged demo with a framerate cap and a chip still in early development, I wouldn’t read too much into it at this time.",
        "sentiment": -0.01392648286289639
    },
    "article_13": {
        "title": "Apple releases rare update for OS X 10.6 Snow Leopard",
        "body": "Apple is out with the second public beta version of the upcoming OS X 10.11.4 software update for Mac.\nThe release adds a secure, password-protected Notes, which sync with iOS 9.3, as well as support for viewing and sharing Live Photos over iMessage with the Messages app. Other focus areas include the iBooks and Photos apps, according to Apple.\nToday’s release follows the developer version of the same software update earlier this week.\nApple has also released a rare software update for Mac users still running OS X 10.6.\nThis update ensures future compatibility of the Mac App Store included with OS X Snow Leopard, and is recommended for all Snow Leopard users.\nThe update is called ‘Mac App Store Update for OS X Snow Leopard’ and is only a 3.5MB download from Apple’s support site. Snow Leopard was released in 2009. The Mac App Store was introduced in 2010 with OS X 10.6.6 as an update to Snow Leopard.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.07055881227521847
    },
    "article_14": {
        "title": "‘iPhone 5se’ likely to have faster A9/M9 chips &amp; always-on Siri, but still come with a 16GB capacity",
        "body": "Last week we reported that Apple is preparing to announce a new 4-inch iPhone dubbed the “iPhone 5se” as soon as mid-March. Our report noted that the new iPhone is essentially an upgraded iPhone 5s with a faster processor, Apple Pay, new camera features, and curved glass edges instead of sharp chamfers. Now, we have a few additional details about this new iPhone model. First, we are told that there are different prototypes of the device floating around Apple’s campus: some with the A8 and M8 chips that we discussed in our previous report, and some with the iPhone 6s’s A9 and M9 processors. We’ve now learned that the iPhone 5se is more likely to include variants of the A9 and M9 chips instead of the A8 and M8 lines…\nBecause the iPhone 7 will include a faster chip potentially known as the A10 processor, Apple likely does not want its new 4-inch iPhone to fall two processor generations behind in just six months. Another benefit of the M9 chip from the iPhone 6s is always-on Siri activation. This feature allows a user to say “Hey Siri” and launch Siri on their iPhone without the device being plugged in. Given the large performance leap, we are told that the “5se” will likely replace the iPhone 6 and iPhone 6 Plus in the iPhone lineup this fall when the iPhone 7 is introduced. This means that Apple’s fall 2016 iPhone lineup will likely be the iPhone 5se, iPhone 6s and 6s Plus, and the future iPhone 7 and 7 Plus (or what Apple ends up calling the next-generation devices).\nLastly, we are told that the 5se will also likely see another boost over the 5s: a higher capacity. While the new device will likely start at a 16GB capacity to match the 5s, the secondary, higher capacity is said to be doubled from 32GB to 64GB. The iPhone 5s from 2013 will be discontinued upon the release of the new 5se and we are told that the price points of the 5s will be assumed by the new model. Apple is currently planning to debut the new device during the week of March 14th either via an event or online announcement. Apple is also preparing new Apple Watch models with new band colors, materials, and partnerships while an iPad Air 3 is also in development, but it is not yet clear if the new iPad is ready for a launch.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.15588706982089207
    },
    "article_15": {
        "title": "AT&amp;T CEO calls for Congress to decide on encryption policy, says it’s not Tim Cook’s decision",
        "body": "AT&T CEO Randall Stephenson is the latest to weigh in on the issue of data encryption policy with the executive telling The Wall Street Journal that Apple CEO Tim Cook and other tech execs should leave the decision making on encryption policy up to Congress:\n“I don’t think it is Silicon Valley’s decision to make about whether encryption is the right thing to do. I understand Tim Cook’s decision, but I don’t think it’s his decision to make”… I personally think that this is an issue that should be decided by the American people and Congress, not by companies,” …The AT&T chief said his own company has been unfairly singled out in the debate over access to data. “It is silliness to say there’s some kind of conspiracy between the U.S. government and AT&T,” he said, adding that the company turns over information only when accompanied by a warrant or court order.\nThat statement follows a meeting among Cook, other Silicon Valley executives and White House officials last week to discuss topics related to encryption policies and government access to data.\nAnd that’s just the latest occasion in which Apple under Tim Cook’s leadership has voiced its opinion on the issue with the company becoming increasingly vocal about its stance on encryption and sharing user data with others.\nBut the issue is once again in the spotlight as it becomes a topic of interest during recent presidential debates. Tech companies and government access to data was one focus at the Democratic debate this week, and just days earlier Apple and Tim Cook were mentioned by name during the Republican presidential debate with candidates asked specifically about Cook’s position on keeping user data private from government.\nRecent legislation proposed in at least two states — New York and California — looks to ban iPhone sales if Apple won’t compromise on encryption, which shows you just how heated the debate has gotten.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.01780334934592247
    },
    "article_16": {
        "title": "Apple Releases iOS 9.2.1 With Bug Fixes, Security Updates",
        "body": "Apple today released iOS 9.2.1 to the public, marking the first update to iOS 9 since iOS 9.2 launched in December of 2015. iOS 9.2.1 has been in testing since December 16, with developers and public beta testers receiving a total of three betas before its public launch.\nToday's iOS 9.2.1 release is available as an over-the-air update to all iOS 9 users. A minor update, iOS 9.2.1 is the fifth update to iOS 9 in total, following the launches of iOS 9.0.1, iOS 9.0.2, iOS 9.1, and iOS 9.2.\niOS 9.2.1, as a 9.x.x update, is minor in scale, focusing mainly on under-the-hood performance improvements and bug fixes rather than outward-facing changes. According to Apple's release notes, the update includes security improvements and bug fixes, including a fix for a significant Mobile Device Management issue that affected enterprise customers.\nThis update contains security updates and bug fixes including a fix for an issue that could prevent the completion of app installation when using an MDM server.\niOS 9.2.1 will be followed by iOS 9.3, which has also been seeded to developers for testing purposes. Set to be released in the spring, iOS 9.3 is a major update that introduces a new Night Shift feature to cut down on blue light exposure during the evening for better sleep and brings new educational features.\niOS 9.3 also includes new Quick Actions for iPhone 6s users and it introduces updates for apps and features like Apple News, Notes, Health, Siri, CarPlay, and More.",
        "sentiment": 0.030968451988883317
    },
    "article_17": {
        "title": "Apple offering Photo merging app 'Union' for free download via Apple Store app (usually $2)",
        "body": "Apple is currently giving away free downloads of Pixite's Union app via its Apple Store app. Union is usually a $1.99 purchase.To get the app for free, first download and install the Apple Store app from here ● Choose the Featured tab at the bottom of the screen and scroll down to reveal the special offer.● Tap the Union icon then tap the greenat the bottom of the screen.● You will be brought to the App Store application. Tap thebutton at the top right of the screen.● The app will now begin to install.1. Load a background image, solid color, or transparent layer2. Load a foreground image, solid color, or shape3. Efficiently erase areas of the foreground image using Union’s palette of intuitive, user-friendly tools4. Adjust the position and size of the foreground image to reach desired composition5. Make color adjustments on the background and foreground so they blend seamlessly6. Save your work in full resolution and share your work with friendsAlso included in Union is Pixite Source, a free resource for professional quality images, textures, and overlays that you can use in your edits.",
        "sentiment": -0.1665651383144515
    },
    "article_18": {
        "title": "iPhone 7 Plus Said to Have 256GB Option and Larger 3,100 mAh Battery - Mac Rumors",
        "body": "Apple's next-generation iPhone 7 Plus may feature a 256GB storage option and larger 3,100 mAh battery as two differentiating features over the smaller iPhone 7, according to Chinese website MyDrivers [Google Translate].\nThe report does not specify if the iPhone 7 Plus will still have 16GB base storage, or if Apple will opt for larger storage options such as 32GB, 128GB and 256GB, compared to the iPhone 6s Plus lineup of 16GB, 64GB and 128GB models.\nThe claimed 3,100 mAh battery would be approximately 12.7% larger than the iPhone 6s Plus's 2,750 mAh battery, but the rumor is questionable following reports claiming the iPhone 7 and iPhone 7 Plus will be nearly as thin as the new iPod touch.\nThe report also corroborates previous rumors claiming the iPhone 7 and iPhone 7 Plus will retain 4.7-inch and 5.5-inch screen sizes respectively, but does not offer any other new details about the smartphones.\nChinese website MyDrivers, which earlier this week said the so-called \"iPhone 6c\" will have a 1,642 mAh battery and 2GB of RAM, has a mixed track record at reporting on Apple's upcoming product plans, so this rumor should be treated with caution until or unless other reports substantiate these claims.\nApple may remove the 3.5mm headphone jack on the iPhone 7 and iPhone 7 Plus in favor of an all-in-one Lightning connector, possibly helping the smartphones achieve between 6.0mm and 6.5mm thinness and a waterproof design. The devices may also have a faster TSMC-built A10 chip and Intel 7360 LTE modem and non-metallic casing with hidden antenna bands. iPhone 7 Plus models could have 3GB of RAM.\nRead more about the iPhone 7 Plus in our What's Coming From Apple in 2016 roundup.",
        "sentiment": -0.3318296894431114
    },
    "article_19": {
        "title": "Apple confirms that it is shutting down iAd on June 30th",
        "body": "iAds will still exist, but this tool for developers is going away.\nApple is shutting down iAd 'App Network' June 30th (updated) iAds will still exist, but this tool for developers is going away.\nEarlier this week, Buzzfeed reported that Apple was going to start phasing out its iAd advertising network -- rather than having an ad sales business, the company was rumored to automate things and let developers submit ads directly. While that still could happen, language in a message posted today from Apple to developers is more definitive: iAd is shutting down on June 30th .\nUpdate: Correction, the iAd program as a whole is not shutting down. What is happening, is that the similarly-named iAd App Network, which allows developers to advertise their own apps through iAds, is going away.\nAs of today, Apple won't be accepting new apps into the program, though the company says current campaigns can continue to run and earn revenue through that June 30th shutdown date. If you have an app that's already part of the network, you can continue creating campaigns using Apple's iAd Workbench, as well. As to what'll happen on June 30th beyond this shutdown, no one knows. If Buzzfeed's report is accurate, Apple will have some other, more automated system in place -- but if that's happening, it hasn't been announced yet.\n[Image credit: Justin Sullivan/Getty Images]",
        "sentiment": -0.4545755013823509
    },
    "article_20": {
        "title": "Apple axes free iTunes Radio service, directs listeners to Beats 1 instead",
        "body": "In an e-mail sent to users late Friday, Apple announced that it would be shutting down its ad-free iTunes Radio streaming service on January 28. Those who enjoyed the Pandora-like feature are instead being directed to Beats 1, the live radio station that Apple launched alongside Apple Music last year. Apple Music subscribers can continue to create iTunes Radio-like stations based on artists or songs, but they'll need to pay the standard $9.99-per-month membership fee to do so.\niTunes Match users will apparently be losing their ad-free version of iTunes Radio, too. The message to users of that service is clear: Apple Music offers similar song matching feature and ad-free iTunes Radio, so you should really consider using it instead of Match.\niTunes Radio was originally introduced in iOS 7 back in 2013. Its main perk was that songs played on your stations could easily be bought from the iTunes Store and added to your library to play whenever you wanted, but it was never meant to be an à la carte, unlimited music streaming service like the ones that Spotify, Rdio, Google, and others were already offering at the time. Apple Music is a better service that's more attuned to the way that many people are listening to their music these days, but anyone who likes the standalone ad-supported Radio service will need to pay for Apple Music or find an alternative.",
        "sentiment": -0.43635425076354295
    },
    "article_21": {
        "title": "TIL Macs have a built in wifi analyzer that can scan the signals in your area and suggest an ideal channel.",
        "body": "If you live in an apartment complex, you’ve probably noticed more than just the passive-aggressive network IDs that your neighbors use—very likely you’ve had problems with your wireless connections dropping out, or just not being as fast as you’d like. This often has to do with the Wi-Fi channels in your area.\nIf your wireless router is on the same Wi-Fi channel as a lot of your neighbors, you’ll experience a lot of interference with their networks—so it’s best to choose a different channel with fewer people on it. When you do, you’ll reduce that interference and improve your WI-Fi signal.\nThe first step, though, is finding out which channel is least congested in your area. These tools will help you identify which nearby networks are using which channels.\nNote that Wi-Fi channels overlap with nearby channels. Channels 1, 6, and 11 are the most frequently used for 2.4 GHz Wi-Fi, and these three are the only ones that don’t overlap with each other.\nWe previously recommended inSSIDer for this on Windows, but it’s become paid software. You probably don’t want to pay $20 just to figure out which Wi-Fi channel is ideal, so use a free tool instead.\nXirrus Wi-Fi Inspector is very powerful, but it’s a bit overkill for this. We liked NIrSoft’s WifiInfoView instead — its simple interface does the job and it doesn’t need any installation. Launch the tool, locate the Channel header, and click it to sort by Wi-Fi channel. Here, we can see that channel 6 looks a bit cluttered — we might want to switch to channel 1 instead.\nMac: Wireless Diagnostics\nBelieve it or not, macOS actually has this feature integrated. To access it, hold the Option key and click the Wi-Fi icon on the menu bar at the top of your screen. Select “Open Wireless Diagnostics.”\nIgnore the wizard that appears. Instead, click the Window menu and select Utilities.\nSelect the Wi-Fi Scan tab and click Scan Now. The “Best 2.4 GHz Channels” and “Best 5 GHz” Channels” fields will recommend the ideal Wi-Fi channels you should be using on your router.\nLinux: The iwlist Command\nYou could use a graphical app like Wifi Radar for this on Linux, but you’d have to install it first. Instead, you might as well just use the terminal. The command here is installed by default on Ubuntu and other popular Linux distributions, so it’s the fastest method. Don’t fear the terminal!\nOpen a Terminal and run the following command:\nsudo iwlist wlan0 scan | grep \\(Channel\nRead the output of the command to see which channels are the most congested and make your decision. In the screenshot below, channel 1 looks the least congested.\nRELATED: How To Get a Better Wireless Signal and Reduce Wireless Network Interference\nIf you want to search for Wi-Fi channels on your phone instead of your PC, the easiest-to-use application we’ve found is Wifi Analyzer on Android. Just install the free app from Google Play and launch it. You’ll see an overview of the wireless networks in your area and which channels they’re using.\nTap the View menu and select Channel rating. The app will display a list of Wi-Fi channels and a star rating — the one with the most stars in the best. The app will actually tell you which Wi-Fi channels are better for your Wi-Fi network, so you can go straight to your router’s web interface and choose the ideal one.\nUpdate: We’ve been informed you can do this with Apple’s own AirPort Utility application. Enable and use the “Wi-Fi Scanner” feature inside the app.\nRELATED: Jailbreaking Explained: What You Need to Know About Jailbreaking iPhones and iPads\nThis isn’t possible on iPhones and iPads. Apple restricts apps from accessing this Wi-Fi data directly from the hardware, so you can’t get an app like Android’s Wifi Analyzer on Apple’s App Store.\nIf you jailbreak, you can install an app like WiFi Explorer or WiFiFoFum from Cydia to get this functionality on your iPhone or iPad. These tools moved to Cydia after Apple booted them from the official App Store.\nYou probably wouldn’t want to go through the trouble of jailbreaking just for this, so use one of the other tools here instead.\nHow to Change Your Router’s Wi-Fi Channel\nRELATED: 10 Useful Options You Can Configure In Your Router's Web Interface\nOnce you’ve found the least congested channel, changing the channel your router uses should be simple. First, log into your router’s web interface in your web browser. Click over to the Wi-Fi settings page, locate the “Wi-Fi Channel” option, and choose your new Wi-Fi channel. This option may be on some sort of “Advanced Settings” page, too.\nRELATED: What's the Difference Between 2.4 and 5 GHz Wi-Fi (and Which Should I Use)?\nIf there are too many other nearby networks interfering with your signal, try getting a router that supports 5 GHz (like a “Dual Band” router). 5 GHz Wi-Fi channels are farther apart and won’t interfere with each other as much.",
        "sentiment": -0.2017339699247733
    },
    "article_22": {
        "title": "VMWare Fusion team laid off -- future of product uncertain",
        "body": "Updated February 2, 2016: Once you learn about our team and who we are, come take a trip down memory lane with us!\nYesterday morning, the Hosted UI team, responsible for VMware’s Workstation and Fusion products, woke up to find themselves out of a job. These products, despite being award-winning and profitable, are probably not long for this world.\nI was not directly affected, in this way at least, as I had already left VMware in 2013 to work on Review Board full-time. However, many of my closest friends were, and a product I spent 9 years of my life on may have seen its last feature.\nI could talk all day about how I think we got here, losing this amazing team and these fantastic products. I could point fingers and lash out at those I blame. I could talk about how furious this all makes me.\nInstead, I’m going to talk about the team and what we built — and I don’t just mean our products.\nLet me tell you about our team\nI began working in Hosted UI on August 23rd, 2004, as a bright-eyed 20 year old freshly dropped out of college. Back then, it was a small team full of amazingly bright and passionate people, working days and nights to build a product they believed in.\nThe culture at that time within VMware was just so fun and energizing. People wanted to be there, and were proud of their work. Features were brainstormed over games of foosball or DDR, designs discussed over free lunches and beer bashes. In the evenings, we’d order dinner in and watch Simpsons, or whatever was on.\nCompany culture changed over the years, becoming more corporate and stiff, but not Hosted UI. We’d work all day, with the occasional interruption for YouTube videos or some laughs, and at night we went out and had some more. Poker nights, movie nights, video game nights. Dinners out together, sometimes several times a week.\nMany people came and went over those years. The team changed, though, for a software company, a surprising number remained until the very end. Even those that left kept in touch, joining for poker nights or dinners here or there, coming to the dunkings (if you were getting married, you were going in the pond), birthday celebrations, and reunions. We formed alumni lists and kept in touch. We hung out on IRC outside of work.\nThrough deadlines and downtimes, stresses and celebrations, our team worked and played hard. We were dedicated, passionate, and if you’ll allow me, we were damn good at what we did.\nI left this team two years ago, but it hasn’t really felt that way. I still saw them almost every week. Our team didn’t have to be in the same building or even the same company to stay a team.\nHosted UI may no longer exist at VMware, but that’s really VMware’s loss. They lost one of the most dedicated teams they could ever hope for, the kind of team you can’t just hire again.\nWe built some amazing products\nWorkstation\nVMware Workstation was the first VMware product (back then, it was simply known as “VMware.”). At a time when dot-coms dominated the Super Bowl and Amazon was all about books, VMware Workstation was letting pioneers in the Linux world virtualize their Windows desktop so they could run Microsoft Office instead of StarOffice.\nThis product evolved over the years with over 15 major releases, and more features than I can count, running on every flavor of Linux and Windows. It did this without falling prey to the bloat of most long-running products, as we focused not only on making it a more powerful product but also a more usable product.\nWorkstation made it easy to run complex development and testing scenarios, creating and working with several virtual environments all at once across any number of host computers. It integrated your virtual desktops with your host desktop. It let you take snapshots at different moments in the lifetime of your VM, and jump between them at will. It helped you catch defects in your software through remote debugging and CPU/memory record/replay capabilities, it helped you test complex network setups with virtual LAN devices, and it worked as a powerful front-end for VMware’s Server, ESXi, and vSphere products. And, in the end, it also helped you simply run your Windows programs on Linux, your Linux programs on Windows, or whatever you wanted.\nInternally at VMware, Workstation was also seen as an indispensable product, helping other teams test features and devices that would eventually become selling points on the more high-end vSphere product releases. With Workstation’s ease-of-install and ease-of-use, people could get set up in minutes and get right to work.\nWe loved our product. This was our baby. We took input from marketing, management, sales, customers, and so on, but in the end, we were given a lot of creative liberty over the features and design. We were also given time to address technical debt, helping to get our codebase in shape for future challenges.\nI don’t know how many awards we received, but I think it was a lot. I do know that we had so many users who loved the product we poured our souls into. That meant a lot, and kept us motivated.\nIt was, let’s say, a challenge getting some parts of the company to really care about the product. Workstation made a lot of money, but not the hundreds of millions the company would have preferred. This, I believe, ultimately led to yesterday’s sad outcome… Still, I’m very proud of what we built.\nFusion\nWorkstation was a power user product built for Linux and Windows. In 2007, its sister product, Fusion for Mac, was released. This focused more on consumer usage, helping people run Office and other Windows apps on their Mac.\nAt the time, Apple had just moved to Intel processors, and were touting the ability to dual-boot between Windows and MacOS X, using a feature called Bootcamp. Fusion offered a better way by letting you run Windows and MacOS X at the same time. It was popular amongst students who needed to run Windows software for class on their shiny new MacBooks. It was popular amongst developers who needed to run or test Windows or Linux environments while on the go.\nFusion was a very different product in some ways than Workstation, but it was also very closely related. While it didn’t focus on many of the power user features that Workstation offered, it did take many of those features and reimagine them for more casual users. It also shared much of the core code that Workstation used, meaning that features could more easily be ported across and bugs fixed just once.\nFusion was a reimagining of what Workstation could have been, built for a different time and a different audience. Like Workstation, it was also built by a group of very loyal, dedicated, brilliant people, the Fusion segment of Hosted UI.\nWhile I never worked directly on Fusion, I did get to see features I built for Workstation make their way there, and watched as our users got to try them for the first time on the Mac. It wasn’t the product I devoted my time to, but it was one I loved, and one I still use today.\nAnd all the others\nOur small team has built quite a lot over the years. Along with Workstation and Fusion, we’ve also built:\nPlayer: A slimmed-down product for simply running and interacting with VMs, without all the UI of Workstation\nVMRC: Originally a browser plugin and an SDK for embedding virtual machines in your browser or other applications (which was transitioned to one of the teams behind ESX a couple years ago and reworked into a native VM console app launched from the browser)\nServer: A free product built from Workstation that offered remote VM hosting and management)\nWSX: A web-based service for running VMs natively in your browser from anywhere\nAppCatalyst: A developer-focused, API-driven development and testing service that works with Docker\nI’m pretty sure there’s more, but those are the highlights.\nThese, along with Workstation and Fusion, were built by a team typically no larger than about 20 people (at any given point in time).\nWe did good.\nTime for the next adventure\nVMware lost a lot of amazing people, and will be feeling that for some time to come, once they realize what they’ve done. It’s a shame. As for our team, well, I think everyone will do just fine. Some of the best companies in the Silicon Valley are full of ex-VMware members, many former Hosted UI, who would probably welcome the chance to work with their teammates again.\nWorkstation, Fusion, and our other products may survive in maintenance mode, or they may disappear. They may continue under a new team. It’s hard to say at this point what will happen. What I can say is that no matter what happens to them, they had an amazing run, and are something every one of us can be proud of the rest of our careers.\nAnd we can be proud of the team, the friendships, and the strong bonds we built, now and through our next adventures.\nUpdated 27-January-2016 at 23:31 PM: Wow, this went viral. As of right now, we’re looking at around 40,000 unique viewers. I wrote this as a tribute for our team, and am amazed by the reaction it provoked. Everyone who loved our products and reached out to us to show your love, thank you. It means so much to us. Keep them coming!\nI want to be clear that I have not worked there in years and do not have inside knowledge on what will happen to these products. I updated part of the post to make that a little more clear. VMware claims they’ll continue to exist, and I really hope that’s the case. I like to think what we built will continue to live on, and I hope VMware does it justice.",
        "sentiment": 0.5116964214377933
    },
    "article_23": {
        "title": "This is Microsoft’s iPhone keyboard",
        "body": "Microsoft is bringing its Windows Phone keyboard to iOS. The software giant is currently testing an early version of the keyboard internally, and will make it available to public testers soon. Sources familiar with Microsoft's plans have revealed to The Verge that the iOS keyboard includes a special one-handed mode.\nWhile the Windows 10 Mobile keyboard also has a one-handed mode, Microsoft's iOS version is different. The one-handed mode works on each side, allowing you to use either hand to swipe letters or type on the go. Microsoft's Windows 10 Mobile keyboard simply shifts to the side to create a compact keyboard, instead of the fanned key layout used in the iOS version.\nOther than the one-handed mode, the rest of Word Flow for iOS is very similar to the Windows Phone version. You can access word suggestions, emoji, and swipe letters (like Swype) to type out words. Microsoft is planning to bring Word Flow to iOS in the coming months, with an Android version expected later this year.\nThis is my next: The best keyboards for Android and iPhone",
        "sentiment": 0.14390448092793426
    },
    "article_24": {
        "title": "Steve Zadesky, the head of Apple's electric car project, has left Apple (xpost r/technology)",
        "body": "(Reuters) – Apple’s Steve Zadesky, who has been overseeing the company’s electric car project for the last two years, has said he is leaving the company, the Wall Street Journal reported on Friday, citing people familiar with the matter.\nZadesky, who previously worked with the iPod and iPhone teams, is leaving for personal reasons not related to his performance, the WSJ said.\nIt was not clear when the 16-year veteran would leave Apple, the Journal said. As of Friday afternoon his profile on LinkedIn still listed him as working at Apple.\nApple declined to comment.\nApple has never acknowledged it is looking into building an electric car, but the company has recruited dozens of auto experts, many from car makers like Ford or Mercedes-Benz.\nApple Chief Executive Tim Cook went to BMW’s headquarters in 2014, and senior Apple executives toured the carmaker’s Leipzig factory to learn how it manufactures the i3 electric car, sources familiar with the matter told Reuters.\nThe dialogue ended without conclusion because Apple, the world’s largest maker of electronic gadgets, appears to want to explore developing a passenger car on its own, one of the sources said.\nAlso, BMW, the world’s biggest seller of premium cars, is being cautious about sharing its manufacturing know-how because it wants to avoid becoming a mere supplier to a software or Internet giant.\nBut one of the sources said the exploratory talks between senior managers might be revived.\n(Reporting by Rama Venkat Raman in Bengaluru; Editing by Mary Milliken and Stephen R. Trousdale)",
        "sentiment": -0.1269345941953361
    }
}