{
    "article_0": {
        "title": "Apple Ordered To Pay €13bn In Irish Taxes",
        "body": "US technology giant Apple has been ordered to pay up to €13bn (£11bn) in back taxes to Ireland after a European probe.\nApple faces the record bill after the European Commission (EC) ruled that a special scheme to route profits through Ireland was illegal state aid.\nThe tech giant's tax arrangements enabled it to pay a tax rate of as little as 0.005% on its European profits in 2014, according to the probe.\nThat is just £50 in taxes on every £1m of profit.\n:: The Wider Impact Of Taking A Bite From Apple\nIreland's finance minister Michael Noonan said he disagreed \"profoundly\" with the decision and would seek Cabinet approval for an appeal.\nThe sum to be paid by Apple is 40 times bigger than any previous demand by the EC in such a case.\nIt could be reduced if other countries seek more taxes themselves from the US tech giant.\nCommissioner Margrethe Vestager said: \"Member states cannot give tax benefits to selected companies - this is illegal under EU state aid rules.\nAdvertisement\nImage: Starbucks has been ordered to pay £26m in the Netherlands after a tax crackdown\n\"The Commission's investigation concluded that Ireland granted illegal tax benefits to Apple, which enabled it to pay substantially less tax than other businesses over many years.\"\nThe probe found that Apple's profits were routed via Ireland to virtual head offices that had no employees, no premises and carried out no real activities.\nThese profits were not subject to tax in any country under provisions of Irish law that are no longer in force.\nIt meant that one subsidiary, Apple Sales International, paid a tax rate of just 1% in 2003, declining to 0.005% by 2014.\nPlease use Chrome browser for a more accessible video player 0:29 Apple's Tax Bill Over The Last Five Years\nApple chief executive Tim Cook said that the ruling would have a \"profound and harmful effect\" on investment and job creation in Europe and that the company paid all the taxes it owed in all the countries where it operated.\nChief financial officer Luca Maestri said the suggestion that Apple paid as little as £50 for every £1m in profit was \"a completely made-up number\".\nThe EC's tax crackdown on multinationals has prompted criticism in Washington, which accuses it of targeting US companies.\nOnline retailer Amazon and fast food giant McDonald's face probes over their tax arrangements in Luxembourg while coffee chain Starbucks has been ordered to pay up to €30m (£26m) in the Netherlands.",
        "sentiment": -0.6972989898058586
    },
    "article_1": {
        "title": "Apple sends out invite for September 7 iPhone event",
        "body": "Apple on Monday sent out an invitation for a special event to be held on September 7 at 10:00 am. This year’s event will be held at the Bill Graham Civic Auditorium in San Francisco, California. I will be at the event and will bring you all the news as it happens.\nThe September event has been focused on the new iPhone for a number of years now, so it stands to reason that this event will be all about the next generation device.\nThere has been speculation that new Macs will also be announced at this event, but I don’t think so. I’ve previously outlined my reasoning for thinking the company will not introduce Macs in September.",
        "sentiment": 0.4049813208791117
    },
    "article_2": {
        "title": "T-Mobile shifting entirely to unlimited data in new bid to shake up industry",
        "body": "T-Mobile will shift to a single wireless plan offering unlimited data — a surprise move that the company’s CEO, John Legere, says he doesn’t believe rivals Verizon and AT&T will be able to match.\nLegere announced the new plan, “T-Mobile One,” in a video this morning. Under the new plan, the Bellevue, Wash.-based wireless company will charge $70/month for the first line, $50/month for the second, and $20/month for additional lines up to eight, if the customer has auto-pay enabled. That averages to $40/month for a family of four, the company notes.\nThe plan includes unlimited talk, texting and 4G LTE smartphone data.\n“I declare that the era of the data plan is over,” says Legere in the video announcing the “Un-carrier 12” initiative. “We are completely destroying the whole concept of a data plan, it’s gone. We have one single offer that banishes data buckets forever.”\nThe new T-Mobile One plan begins on Sept. 6. The company says existing T-Mobile customers will be able to stay with their current plans or shift to the new T-Mobile One unlimited plan.\nWhether the new initiative is a deal for T-Mobile’s customers depends on how much data they use. Under the company’s existing Simple Choice plan, which comes with data limits, a customer pays $95/month for the first line of unlimited data. A plan with 6GB of data costs $65/month, and one with 2GB of data costs $50/month.\nBy setting a higher entry-level price of $70/month, the new plan is a risk for T-Mobile. Financial analysts homed in on that risk in their questions for executives, asking if the move could reduce the company’s additions of postpaid subscribers, who pay at the end of a billing period, have better credit than their prepaid peers, and are generally considered more valuable customers.\nHowever, T-Mobile executives said the majority of the company’s postpaid customer base is on family plans, making the $40/month average for a four-line plan the more relevant cost.\n“Let’s not get too mathematical about it,” said Mike Sievert, the company’s chief operating officer, addressing questions on that topic during a conference call this morning with analysts and reporters. “This is the single most consistent thing our customers have ever asked for. Over 1 million times in social media, they’ve said, ‘Could you just set my data free?’ ”\n[Related: Sprint CEO calls T-Mobile CEO a ‘con artist,’ accuses rival of copying new unlimited data plan]\nT-Mobile says in a news release, “As with T-Mobile Simple Choice, those using the most data, the highest 3% – currently people using more than 26 GB of high-speed data per month – may see their data traffic prioritized behind other users once they cross that threshold during their billing month. As a result, they may notice relatively slower speeds but only at specific times and places that may experience high network demand or congestion.”\nThe new T-Mobile One plan will come with unlimited mobile hotspot data, letting subscribers use their phone to connect a computer or other device to the network, but at 2G speeds. Speaking on the conference call this morning, T-Mobile executives said a premium option will be available with a higher-speed hotspot. Update: T-Mobile says the premium hotspot option will cost $15/month extra for 5GB of high-speed data.\nWireless video will stream at 480p standard definition, and the company will charge a $25/month premium for an “HD add-on” providing higher-definition video streaming.\nSpurred by the arrival of Legere as CEO in 2012, T-Mobile’s “Un-carrier” announcements over the past few years have helped the company add more than 1 million net customers for 13 straight quarters, or more than three years.\nThe company’s past Un-carrier moves have included unbundling the cost of the phone from the wireless plan, paying customers’ fees when they switch from another carrier, no-extra-charge roaming in Canada and Mexico, the ability to stream video and music without counting against data caps, the T-Mobile Tuesdays loyalty program, issuing company shares to subscribers, and other initiatives.",
        "sentiment": -0.4900751668831398
    },
    "article_3": {
        "title": "Apple sells more iPads to businesses than consumers",
        "body": "While Apple's iPad sales continue to decline overall, the tablet is surging in demand from an unlikely source. The New York Times reports that nearly half of all iPad sales are to corporations and governments, with high-end iPad sales to business customers particularly strong. \"Apple is stronger in the enterprise market with its devices than it is with consumers,\" says Forrester analyst Frank Gillet, in a statement to the Times.\nThe boost from businesses and governments would have seemed highly unlikely six years ago when the iPad was originally launched, but Apple has been keen to woo businesses over to its mobile tablet in recent years. Apple teamed up with IBM to launch a range of business-focused iOS apps back in December 2014, and the company has also been working with Cisco and SAP to ensure iPads work well in enterprises.\nApple even teamed up with Microsoft to make the iPad Pro a success. During the tablet's launch, Microsoft's Office chief, Kirk Koenigsbauer, jumped on stage to demonstrate Office for iPad Pro. Microsoft has consistently tweaked its Office software for the iPad Pro ever since to make it more powerful, and the productivity suite even features in Apple's latest iPad Pro commercial. Apple wants everyone to believe that the iPad Pro is a real computer capable of real work, and it's clear that businesses are adopting it that way for their mobile computing needs.\nApple's success in the enterprise is unusual\nApple's fresh success in the enterprise is unusual for the company. Microsoft has typically dominated desktop computing inside businesses, and Steve Jobs always focused Apple on building products that consumers would love. Jobs even called IBM's best customers an \"orifice,\" and famously gave IBM the finger in a classic photo during the ‘80s era when Apple competed aggressively with IBM. Apple even aired a commercial depicting IBM as Big Brother from the George Orwell novel.",
        "sentiment": 0.5002260968948786
    },
    "article_4": {
        "title": "Tim Cook completes 5 years at Apple as CEO",
        "body": "Today marks the fifth anniversary since Tim Cook was named Apple CEO on August 24, 2011, the same day that late co-founder Steve Jobs stepped down as chief executive for the final time and recommended the board of directors appoint Cook as his permanent successor.\nUpon reaching the five-year mark, Cook has today unlocked previously awarded stock bonuses currently worth over $100 million. The bonuses are tied to both his tenure and Apple's performance under his leadership, including its total shareholder return relative to the S&P 500 index.\nCook's bonus includes 700,000 tenure-based restricted stock units that vested today as part of a larger compensation package of over 4.7 million shares awarded on August 24, 2011, in addition to his first of six annual installments of 280,000 tenure-based restricted stock units that vested today. The combined 980,000 shares are valued at nearly $106.7 million based on AAPL's closing price of $108.85 on Tuesday.\nCook's bonus could be even higher if Apple's total shareholder return is in the middle third or top third relative to other companies in the S&P 500 from August 25, 2013 through August 24, 2016. He will receive another 140,000 RSUs for middle third performance, or 280,000 RSUs for top third performance. AAPL has risen around 52% since August 25, 2013, while the S&P 500 has risen around 32% in the same time period, making at least a middle third finish a strong possibility.\nA restricted stock unit, or RSU, is a form of compensation valued in terms of company stock, but the stock is not issued at the time of the grant. Instead, the recipient gets shares of stock at a later date, generally only if they are still employed by the company. Cook personally requested that his award be modified to adhere to a more performance-based compensation system in 2013. Another 700,000 of his RSUs are scheduled to vest on August 24, 2021, plus 280,000 RSUs each August 24 through 2021.\nCook's net worth, assuming he remains with the company through August 24, 2021 and meets performance targets, is estimated to be over $500 million based on his current stock options and RSUs awarded. He has previously pledged to donate the vast majority of his wealth, including stock bonuses like these, to charities in his lifetime. In May 2015, for example, Cook donated approximately 50,000 shares of Apple stock, then worth approximately $6.5 million, to undisclosed charities.\nCook has overseen the launch of the Apple Watch, MacBook Pro with Retina display, ultra-thin 12-inch MacBook, iPad Pro, several iPhone and iPad models, Apple Maps, Apple Music, Apple Pay, Siri, and many other products and services since taking over the reigns in 2011. Apple became the world's most valuable company in 2012 under his leadership, and it continues to hold that title today. Apple stock has risen over 132% since Cook was appointed as CEO five years ago.\nUpdate: Cook has netted another 280,000 shares of Apple stock, as the company returned 61% during the past three years, placing it in the top-performing third of the S&P 500 index, according to data compiled by Bloomberg. The additional shares were valued at approximately $30 million based on AAPL's closing price of $108.03 on Wednesday.",
        "sentiment": 0.1694603618234396
    },
    "article_5": {
        "title": "Apple Watch drops below $200 in the US ahead of Apple Watch 2 unveiling",
        "body": "Update: Best Buy looks to be sold out in most areas.\nApple Watch prices have been in a relative freefall in recent months with the oft-rumored upgrade expected in the coming weeks. However, we aren’t expecting a sea change upgrade this time around. Three weeks ago, a KGI report noted that the new Apple Watch 2 upgrade would include GPS, better waterproofing and improved performance but retain the same design. Another report last week reaffirmed those claims.\nA launch alongside the iPhone 7 next month seems obvious. Apple, therefore, is likely in a hurry to clear current inventory (indeed shortages are already being seen) ahead of the launch and that takes the form of a $199 price tag on the base model Apple Watch Sport 38mm Space Gray Aluminum Case…\nAs 9to5Toys notes, a new Apple Watch hit the $199.oo price point last night at Best Buy, marking a new milestone in the pricing. Apple and other retailers almost always price match (but it is easiest to get at online at Best Buy’s ebay storefront) so effectively the price of the Apple Watch now starts at $199 at retail in the US. Open Box models start at $180 and there are a wide variety of options including 42mm models.\nThe price is $100 off of Apple’s retail price which was reduced by $50 earlier this year from its original $349 base launch price.\nI would guess that even after the update, the original Apple Watch will still sell for around $200 so if you have been waiting on a $200 Apple Watch, I think it is still a safe time to buy. At $200, Apple Watch competes well with other fitness bands and you get so much more, especially with watchOS 3 waiting in the wings.\nSubscribe to our YouTube channel for more hands-on videos and reviews\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.08483843455712001
    },
    "article_6": {
        "title": "Tim Cook, the interview: Running Apple ‘is sort of a lonely job’",
        "body": "CEO Tim Cook says Apple has tried to be more transparent under his watch. Except for one thing: “We try to be as secretive as we’ve always been on products, although it’s increasingly difficult to do that.” (Andrew Burton/For The Washington Post)\nOn a sleek white coffee table in Apple CEO Tim Cook’s fourth-floor office in late July, beneath framed posters of Robert F. Kennedy, the Rev. Martin Luther King Jr. and Jackie Robinson, a rose gold iPhone 6s sits in its original box. Earlier that morning, Cook had stood in front of employees at Apple headquarters and held up the phone, which a staffer had hand-delivered from a store in Beijing to commemorate a notable occasion: Apple had sold its billionth iPhone.\nThat celebratory milestone — Cook laughs when asked by a reporter if he’ll stop counting, as McDonald’s did with its hamburgers — aptly coincides with another big moment for the technology giant’s chief executive. A few weeks later, Cook would mark the fifth anniversary of what has been the most closely watched transition of power in corporate history: On Aug. 24, 2011, just six weeks before his death, Apple’s iconic founder, Steve Jobs, permanently handed his chief operating officer the reins. “It’s been a blur in a lot of ways,” says Cook, who had filled in for Jobs during medical leaves. “It feels like it was yesterday in some respects.”\nIt is fitting that these two milestones arrive so close together. That’s because the iPhone, launched by Jobs, has been the biggest driver of Apple’s massive growth during Cook’s tenure. It led the company to soaring valuations and accounted for nearly two-thirds of Apple’s revenue in the past year. Just the tally on iPhone sales, almost $141 billion over the past four quarters, is more than the annual sales figures of Cisco, Disney and Nike — combined.\nBut the iPhone has been a source of recent disappointment, too. In its most recent quarter, iPhone sales fell 23 percent from a year ago, contributing to a 14.6 percent drop in overall revenue. It was Apple’s second straight quarterly drop in sales after 13 years of growth.\nJust after Apple disclosed those results, Cook sat down with The Washington Post to discuss his first five years in one of corporate America’s most glaring spotlights. In two sprawling and self-reflective interviews — one in his office and another by phone just before he left for vacation in Yellowstone and Grand Teton national parks — Cook described why the visibility of the job has been “shocking,” how he’s learned to deal with the scrutiny, and who he’s turned to for advice at pivotal moments (Warren Buffett, on his decision to return cash to shareholders, and Anderson Cooper about publicly disclosing he is gay).\nHe spoke in candid terms about the mistakes he’s made on the way, such as his first hire to run Apple’s retail stores (“that was clearly a screw-up”). He fiercely defended Apple’s tax policies. He touched on succession planning and the importance of grooming internal candidates. He was at his most spirited when talking about privacy and the long-term future of Apple and the iPhone — calling Apple’s big presence in the smartphone industry “a privilege, not a problem” — and quieted considerably when talking about Jobs’s memory. “I know this sounds probably bizarre at this point,” he said, “but I had convinced myself that he would bounce.”\nCook, 55, chooses his words carefully, taking long pauses and speaking with a slight Alabama drawl. Though he has favorite phrases — many things are “deep,” and Apple’s mission is always its “North Star” — he eschews the jargon many CEOs use. And while he’s quick to trumpet Apple, he is also unassuming, quickly noting, after saying his job can be “lonely,” that “I’m not looking for any sympathy. CEOs don’t need any sympathy.”\nThat reflects how Cook’s imprint on Apple has often been described — making it more systematic, more transparent, more team-oriented, more humble. He has engaged on social issues more than most CEOs, writing op-eds on legislation that limits gay rights and making the extraordinary decision earlier this year to oppose the FBI’s request to unlock the San Bernardino killer’s phone.\nAs CEO, he gets high marks for managing the company’s growth, keeping margins high and expanding further into markets such as China (Apple had four retail stores in China five years ago. Today it has 41.) He has pushed into the enterprise market, grown Apple’s product lineup and positioned Apple to make more money off the devices it’s already sold: Its services business, which includes things like iTunes, iCloud and a mobile payments service, is projected to be the size of a Fortune 100 business next year — all on its own. Apple remains the most valuable and most profitable company in the S&P 500 index.\nYet as the company deals with declining sales in its major device categories and in markets like China, critics and some investors have fretted about Apple’s innovation mojo under Cook. The first all-new device during his tenure, the Apple Watch, is not yet a mega hit. The iPhone juggernaut faces a saturated smartphone market, growing competition from low-cost start-ups and longer upgrade windows from consumers. Rumored big concepts behind the curtain — such as a reported car project — appear to be years away.\nSome analysts say such impatience is shortsighted, and that the long-term potential for things like services, augmented reality and even a possible car could ultimately transform the way Cook’s tenure is viewed. “Investors are so finicky that they lose track of the big picture,” says Gene Munster, an analyst at Piper Jaffray who covers Apple. “I think the wisdom and legacy of Tim Cook is going to be determined by what happens in the next five years.”\nIn the conversation below, Cook looks back as well as ahead at those next five years — hinting at augmented reality but refusing to comment about a car project, saying Apple believes people love a surprise. It has been edited for length and clarity.\nApple CEO Tim Cook talks about when it's important to seek out advice, and who he turns to when he does. (Jorge Ribas/The Washington Post)\nYour first day in this job, you sent a memo to employees that said, “I want you to be confident that Apple is not going to change.” Five years later, it has to have changed. What qualities of Apple are immutable, in your view?\nThe DNA of the company is really what I was talking about there. The North Star has always been the same, which for us, is about making insanely great products that really change the world in some way — enrich people’s lives. And so our reason for being hasn’t changed.\nOther things do change. But that’s the thread that ties everyone together.\nAnd what has changed?\nThe obvious things are we have more employees. The company is four times larger [by revenue since 2010]. We’ve broadened the iPhone lineup. That was a really key decision and I think a very good one. We’ve gone into the Apple Watch business, which has gotten us into wellness and in health. We keep pulling that string to see where that takes us. Lots of core technology work has been done.\nAre there ways the culture has evolved?\nWe have stepped up our social responsibility. We have talked about things and been more transparent about what we’re doing — not on products: We try to be as secretive as we’ve always been on products, although it’s increasingly difficult to do that.\nThe real test is: Are you creating a ripple that helps other people as well? An example of that is the environmental work. We’ve had environmental work going on at Apple for decades, but we didn’t talk about it, and we didn’t set aspirational kind of objectives. We used the same philosophy we do with our products, which is you unveil them when you’ve finished. But we stepped back and re-evaluated that and said, “You know, if we wait until you do that, we’re not helping anyone else get there, too.”\nYou’ve said you don’t want to be a traditional CEO. What do you mean by that?\nI think of a traditional CEO as being divorced from customers. A lot of consumer company CEOs — they’re not really interacting with consumers.\nI also think that the traditional CEO believes his or her job is the profit and loss, is the revenue statement, the income and expense, the balance sheet. Those are important, but I don’t think they’re all that’s important. There’s an incredible responsibility to the employees of the company, to the communities and the countries that the company operates in, to people who assemble its products, to developers, to the whole ecosystem of the company. And so I have a maybe nontraditional view there. I get criticized for it some, I recognize. But I’ve never wanted to be the stereotypical CEO. I don’t think I’d be very good at it, honestly. And I don’t think for Apple that would in the long run be good for the company. If you care about long-term shareholder return, all of these other things are really critical.\nTim Cook holds up the billionth iPhone sold as he shares the news with employees at Apple headquarters in July 2016. (Apple/Apple)\nYou’ve got the billionth iPhone on the table here. One thing that has changed is that in 2011 about 44 percent of the company’s sales came from iPhone. Now it’s close to two-thirds. How can Apple move forward when so much of its business is tied up in the iPhone and an industry that’s cooling off?\nThis is actually a privilege, not a problem. Think about this: What other products do you know where the ratio of people to the product, for a consumer electronics product, will be one-to-one over the long haul? I don’t think there is another one.\nMeaning?\nThe global sales of PCs each year are about 275 million right now. That number’s been declining. The global market for smartphones is 1.4 billion. Over time, I’m convinced every person in the world will have a smartphone. That may take a while, and they won’t all have iPhones. But it is the greatest market on Earth from a consumer electronics point of view.\nLook at the core technologies that make up the smartphone today and look at the ones that will be dominant in smartphones of the future — like AI. AI will make this product even more essential to you. It will become even a better assistant than it is today. So where you probably aren’t leaving home without it today — you’re really going to be connected to it in the future.\nThat level of performance is going to skyrocket. And there is nothing that’s going to replace it in the short term or in the intermediate term, either.\nI realize that the people who are focused on this 90-day clock say, “Oh, my God, the smartphone industry only grew by 1 percent or decreased by 6 percent.” You know, the global economy’s not that great right now. But if you’re in it for the long haul, this is the best market on earth.\nSo to those who ask where’s the next big, world-changing category for Apple — it’s sitting on this $231.5 billion pile of cash — are you saying there’s nothing like the smartphone?\nTechnology is one of these industries where every week there’s a new shiny object that people are skating to. Netbooks — look back, everybody was writing like netbooks were this unbelievable thing, everyone was asking us, “Why aren’t you making one?” Same thing with the PDA. Remember what happened with the PDA? Up and down. It was like the hula hoop. Technology is full of those.\nI’m not saying we’re not going to do anything else. I’m saying this is still an unbelievable product category to be in, and not just for this quarter, year or for years. So I would not want anybody to think this, oh, this “better days are behind us” thing.\nSome analysts have said that.\nAnd it doesn’t bother me. Because honestly, they were saying that about Apple in 2001. They were saying it in 2005. They were saying it in 2007 — this stupid iPhone, whoever dreamed up this thing? Then they were saying that we peaked in 2010, then it was 2011. We got to $60 billion [in revenue], and they said you can’t grow any more from this. Well, last year we were $230 billion. And, yes, we’re coming down some this year. Every year isn’t an up, you know. I’ve heard all of it before. And I don’t subscribe to it because it’s traditional thinking in a lot of ways: You can’t get large because you are large.\nHow do you make the case that Apple is still a long-term growth company?\nIn today’s products we have services [iCloud, App Store, Apple Pay and the like], which over the last 12 months grew about $4 billion to over $23 billion [in sales]. Next year we’ve said it’s going to be a Fortune 100 company in size.\nWhat else? IPad. The iPad Pro. What we saw in this past quarter is that about half of the people who are buying one are using it at work. We have an enormous opportunity in enterprise. Last year we did $25 billion or so in it around the world. We’re collaborating much better with key partners because it’s important, if you’re making a decision to use our products or anybody’s products in the enterprise, that they work well together. And so we’re working with Cisco because they’re incredible with the network infrastructure. We’re working with IBM, who’s written a number of apps. We’re working with SAP because they own the back of the house, in terms of the processing. They own three-quarters of the world’s transactions, in terms of it running on their products.\nAnd then, of course, the markets. We have done fairly well in China. India is fast-growing, but our base there is smaller. One of the big things that has held India back is the cellular infrastructure. They have two major carriers putting in a lot of investment to bring 4G. You can imagine if you didn’t have 4G today. You can’t enjoy video on a 3G. Periodically you can, but not consistently. This is a game changer.\nAnd so I look at it and say: markets? Enterprise — huge. Geographies? India is one I’ve talked about, but there are others. Products? We purposely don’t talk about that one. But you can imagine. Step back and say what’s Apple so great at? Apple is the only company that can take hardware, software and services and integrate those into an experience that’s an “aha” for the customer. You can take that and apply to markets that we’re not in today. There’s not a limitation that we can only do that in the smartphone area or in the tablet or Mac or watch area.\nDo you feel any frustration with investor impatience?\nWe welcome all investors, regardless of whether their horizon is short or long. But we try to be very clear that we are making our decisions based on long term. I think for investors that are focused on the long term, if you look at how we’ve done in the past five years, our total shareholder return is over 100 percent. That’s a pretty good number. And I think most people that have been in the stock for that period of time are probably pretty happy.\nTim Cook and Steve Jobs worked closely together for years. “Steve’s not replaceable,” Cook says. (Kimberly White/REUTERS)\nYou succeeded one of the icons of American business. What does it feel like to step into those shoes?\nTo me, Steve’s not replaceable. By anyone. [Voice softens] He was an original of a species. I never viewed that as my role. I think it would have been a treacherous thing if I would have tried to do it. When I first took the job as CEO, I actually thought that Steve would be here for a long time. Because he was going to be chairman, work a bit less after he came back up the health curve. So I went into it with one thought, and then weeks later — six weeks later, whatever —\nQuickly.\nIt was very quickly. [The day he died] was sort of the worst day ever. I just — I had really convinced myself. I know this sounds probably bizarre at this point, but I had convinced myself that he would bounce, because he always did.\nWhat did you think you knew about leading Apple that turned out to be wrong?\nThere’s nothing like sitting in the chair, so to speak. I was reminded that customers have a really deep love for the company. I started just getting an avalanche of customer mail. I don’t mean complaints. Email. Positive. Negative. Points of view. Not the ‘hey, this broke, I’m mad.’ Largely not that kind of stuff. Things much deeper than that. Moved by how they were treated in a store. Lots of people have written me about FaceTime and how they could be near their mother’s or father’s bedside before they died only because of it.\nApple CEO Tim Cook describes how co-founder and former CEO Steve Jobs acted as cover for Apple, taking both praise and blame for the company. (Jorge Ribas/The Washington Post)\nBut what about in terms of running the company?\nI learned that the scrutiny was much higher than I thought. Media interest and scrutiny — social networking was taking off at that time — and so a lot of the “love,” so to speak, and interest from customers, I think, transfers to media interest as well. And so there’s a lot of visibility on the company. We can do very few things without it being reported somewhere.\nYou and Alan Greenspan or Janet Yellen would probably have a lot to talk about. It seems like every word you say is scrutinized. How do you get used to that?\nYou don’t. You’re both praised and criticized, and the extremes are wide — very wide. And that can happen all in a day. You build up — my skin got materially thicker after August 2011. And I don’t mean in a bad way. I don’t mean that I’m callous and don’t care. I think I’m a bit better today about compartmentalizing things and not taking everything so personally.\nThat was just downright shocking to me, honestly. I thought the visibility went with Steve, not the company. And so I thought with a different CEO, with me, that would instantly change. It didn’t.\n“I think every generation has the responsibility to enlarge the meaning of human rights,” Tim Cook says. “I do view that a CEO today of Apple should participate in the national discussion on these type of issues.” (Andrew Burton/For The Washington Post)\nYou’ve been more outspoken on social issues than any other CEO of a company your size. Do you think companies have a responsibility to publicly take on such issues as civil rights and climate change?\nI think everybody has to make their own decision about it. Maybe there are compelling reasons why some people want to be silent. I think for us, though — for a company that’s all about empowering people through our products, and being a collection of people whose goal in life is to change the world for the better — it doesn’t sit right with me that you have that kind of focus, but you’re not making sure your carbon footprint isn’t poisoning the place. Or that you’re not evangelizing moving human rights forward. I think every generation has the responsibility to enlarge the meaning of human rights.\nI do view that a CEO today of Apple should participate in the national discussion on these type of issues.\nWho were you thinking about when you decided to write the op-ed where you publicly came out as gay?\nI was thinking about kids. I was getting notes from kids who knew I was gay, or assumed I was, because of something they had read on the Web. And they were kids who were distraught. Some had been pushed out by their families. They thought they couldn’t achieve anything. They couldn’t do anything. They were seeing the national discourse around it and feeling isolated and depressed. And I just thought — I’ve got to do something.\nAnd you speaking out would do what?\nI thought it would minimally say you can do pretty good in this world and be gay. That it’s not a limiter. It’s okay to be. That it’s okay to be honest about it. I figured if I could help one person, it would be worth it.\nIt had been planned for quite a long time. It was not something that was done in a moment, by any means. It was probably a year. Just thinking through what to say, how to say it, where to say it, how to do that in a way that advanced what I was trying to do.\nI wanted it to be in a business [publication]. That’s what I know, that’s who I am. There was a lot of work there. I visited people. I talked to Anderson Cooper at length — multiple times. Because I thought that the way that he handled his announcement was really classy. I was getting advice from people who I thought were really great people who had really deeply thought about it.\nThere are few jobs in corporate America that have the same scope, breadth and size as yours. Geopolitics. National security. Consumer retail. Global supply chains. The entertainment industry. It’s mind-boggling. Where do you turn to for advice?\nWhoever I think can help me. When I was going through [the question of] what should we do on returning cash to shareholders, I thought who could really give us great advice here? Who wouldn’t have a bias? So I called up Warren Buffett. I thought he’s the natural person, and so I try to go through that process on everyone. That doesn’t mean I always do what they say. But I think it’s incumbent on a CEO to not just listen to points of view but to actually solicit them. Because I think, if not, you quickly become insular. And you’re sort of living in the echo chamber.\nWarren Buffett offered advice on returning money to shareholders when Tim Cook turned to him. (John Peterson/AP)\nIt took about a year of planning and long conversations with Anderson Cooper before Tim Cook came out publicly as gay — the first Fortune 500 CEO to do so. (Charles Sykes/AP)\nWho else?\nFor the hearing [in 2013 before the U.S. Senate’s Permanent Subcommittee on Investigations about Apple’s tax practices], I’ve never testified in front of Congress before. So I called up [Goldman Sachs CEO] Lloyd Blankfein, because I looked back to say who’s done this before? I knew Lloyd and thought he’d be honest with me. He gave me great advice. I called up President Clinton. He knows a lot about the politics. I’d not met him through a political connection. I’d met him through the foundation. And he was great. I went to Laurene, Steve’s wife. Laurene has the lens of knowing me and deeply understanding Apple.\nAnd so, obviously, I get a lot of advice internal to Apple. But I think it’s important on these things that are also new to the company to solicit some people outside, even if you conclude to not do what they say.\nWith the fight with the FBI, did you have any idea what you were getting into?\nWe knew it was going to be very, very difficult. And that the cards were stacked against us. But we spent a lot of time on “what is right here?” People who were really key on this decision are folks like [senior vice president of software engineering] Craig Federighi. This at its heart is a deep, deep technical question. You first have to understand that to do anything else.\nThe lightbulb went off, and it became clear what was right when we did the first piece of work: Could we create a tool to unlock the phone? After a few days, we had determined yes, we could. Then the question was, ethically, should we? We thought, you know, that depends on whether we could contain it or not. Other people were involved in this, too — deep security experts and so forth, and it was apparent from those discussions that we couldn’t be assured.\nThe risk of what happens if it got out, we felt, could be incredibly terrible for public safety.\nWe knew the positioning on the outside would not be public safety. It would be security vs. privacy — security should win. But we went through the deep, deep, deep discussions on that. It became clear that the trade-off, so to speak, was essentially putting hundreds of millions of people at risk for a phone that may or may not have anything on it, and that likely didn’t, because of other things that we knew about. We thought this actually is a clear decision. A hard one, but a clear one. Then it became more of a matter of how do we explain this. Because this is not easy. You can imagine. You just hear: locked phone. Terrorist. People dead. Why aren’t you unlocking this?\nDid the FBI fight change how you view the mandate of your job?\nCustomers should have an expectation that they shouldn’t need a PhD in computer science to protect themselves. So I think they depend on us to do some things on their behalf. So with that responsibility comes an obligation to stand up. And, in this case, it was unbelievably uncomfortable and not something that we wished for, wanted — we didn’t even think it was right. Honestly? I was shocked that they would even ask for this. That was the thing that was so disappointing that I think everybody lost in the whole thing. There are 200-plus other countries in the world. Zero of them had ever asked this.\nYou’ve talked about privacy being part of Apple’s values. How personal is it for you? You’re known as a very private person. You grew up gay in a red state. Did those early years have an impact on how you lead Apple and on your public stances about privacy?\nUndoubtedly, your childhood and your upbringing is a constant across your life in terms of the things you learn and your point of view.\nBut in terms of privacy, I wouldn’t link the two. There’s a broader thing in play. Privacy, in my point of view, is a civil liberty that our Founding Fathers thought of a long time ago and concluded it was an essential part of what it was to be an American. Sort of on the level, if you will, with freedom of speech, freedom of the press. The other thing is how all this data sits out there in different places. I do worry about people not really understanding deeply about what kinds of things are out there about them. So it’s really both of those — not really the growing up in the South.\nBack in 2009, you said, “We believe in saying no to thousands of projects.” Name one product or project in the past five years you have put on the shelf.\n[Laughs]. I don’t know if I want to do that, because it gives competition some heads-up about things. But be assured that we have. More than one. Because the wonderful thing about Apple is there are many ideas about doing things. We have resources to do a few, but you can only do a few things deep and well, and so you have to say no and have debates about what things are in versus out. So more than one big thing has left the page.\nA week after launching the iPhone 5, Tim Cook apologized for Apple Maps, a software app included on the new phone that was met with widespread complaints. A month later, Cook pushed out software executive Scott Forstall and retail chief John Browett. (Justin Sullivan/Getty Images)\nWhen you look back, are there mistakes you’ve made that you’ve learned something from?\nMaps was a mistake. Today we have a product we’re proud of. But we had the self-honesty to admit this wasn’t our finest hour and the courage to choose another way of doing it. That’s important. It’s the only way an organization learns. The classic big-company mistake is to not admit their mistake. They double down on them. Their pride or ego is so large that they can’t say we did something wrong. And I think the faster you do that, the better — change gears to something else. If you’re honest, people will give you the benefit of the doubt. But if you have your head stuck in the sand and you just keep doing it, I think you lose your employees and your customers as well.\nWhat else?\nI hired the wrong person for retail [former Dixons CEO John Browett] initially. That was clearly a screw-up. I’m not saying anything bad about him. He didn’t fit here culturally is a good way to describe it. We all talked to him, and I made the final decision, and it was wrong. We fairly quickly recognized it and made a change. And I’m proud we did that. A lot of companies would have said, “Oh, he hasn’t been here very long.” But when you’re looking at more time with [then] 50,000 people in retail — that’s a lot of people that you’re affecting in the wrong way. That was a mistake. I probably have a long list.\nThe adage that it’s lonely — the CEO job is lonely — is accurate in a lot of ways. I’m not looking for any sympathy. You have to recognize that you have blind spots. We all do. Blind spots move, and you want to not just have really bright people around you, but people who will push on you and people to bring out the best in you. People that amplify whatever you’re good at. And then also the people who plug the parts that you’re not and may never be.\nWhat are you reading?\nI have two books going right now: One is the Bobby Kennedy book [“Bobby Kennedy: The Making of a Liberal Icon,” by Larry Tye] that just came out. The other is quite an old book. It’s a Gandhi book [“Mohandas K. Gandhi, Autobiography: The Story of My Experiments With Truth”] that I got interested in because we went to the Gandhi museum when we were in India recently. I tend to like nonfiction and particularly reading about people and how they lived and how they fought, and what motivated them and their philosophy and so forth.\nWhen Steve handed you the reins, he said Apple had never had an orderly transition of CEO, and he wanted that to happen. What are you doing now to make sure the next transition, whenever it happens, is orderly?\nAt the end of every board meeting, I discuss succession with the board because I might step off the wrong curb or something. We have the good discipline to do that. Then my role is to make sure that the board has great candidates to pick from internally. And I take that role extremely seriously. Look around at the great people I get to work with — there’s some really just superb talent in the company.\nApple paid $3 billion for Beats in its largest acquisition ever. (Adam Berry/Getty Images For Apple)\nYou’ve made more acquisitions at Apple, including the purchase of Beats, which was its largest ever, at $3 billion. At its current size, does Apple need big acquisitions like that to grow?\nDo we need them? No. But we always are looking for companies that have really talented people and great intellectual property, and when we find them we do acquire them. To put that into context, we’ve acquired 15 to 20 companies a year for the last four years.\nDo you think there will be more at that size going forward?\nI think we’ll continue to acquire companies. If you’re asking me would we do another one the size of Beats —\nOr bigger? You certainly could.\nWe clearly are capable of doing it both from a management-depth point of view and a financial point of view. But we’d only do it if it were great for Apple strategically. We don’t acquire for revenue. So the essential for us is the talent and/or [intellectual property]. Those are the things that we optimize around. Now with Beats, we also got revenue. But it wasn’t the purpose of it. The purpose was that we were going into streaming — we’d already made a decision to do that. And we looked around at people who might be able to help us.\nI think we got Apple Music out probably a little sooner than we would have otherwise. It’s infused some great talent on the team.\nHow do you think about content being part of that services business going forward?\nWe are producing radio shows for Beats. We are producing some original content on video. We started that with a concert kind of video with Taylor Swift. We’ve got “Planet of the Apps,” kind of a cool show. We’ve got a few things that are focused on Apple Music. We do view that the future of TV is apps. And if there’s a way we can be a catalyst into that happening faster or better, then that would interest us in content.\nCustomers look at iPhone 6, iPhone 6 Plus and iPhone SE mobile phones in an Apple Store in Beijing. (HOW HWEE YOUNG/EPA)\nSales in greater China were down 33 percent in the most recent quarter. Low-cost competitors like Huawei are getting into building premium phones. Let’s talk about China. How much are you worried about competitive and regulatory threats there?\nWe make our investment decisions based on long term. We have to report every 90 days because that’s the rules, but it’s not how we run the company. So as I look in the long term, I think China is an unbelievable market — not only from a demand point of view and the revenue potential there, but also as a great source of talent. We have over a million and a half developers there. The reach is unbelievable. There are, sort of, speed bumps now with the economy. In a year-ago quarter, we were up 112 percent. So I think you have to back up and put it in perspective. If you look at it over a two-year basis, we were up over 50 percent in the quarter.\nWe were talking about getting advice from people before your first testimony on Capitol Hill. That hearing focused on the corporate taxes Apple pays. Apple is now awaiting a European Union ruling on whether you owe billions in back taxes, and corporate tax reform is a big election-year issue. Does either a Trump or a Clinton campaign give you or the company any hope that there could be corporate tax reform anytime soon?\nI think it’s in the best interest of the U.S. to have corporate tax reform, regardless of which political party is in charge of the White House. Because if you look at it, the U.S. rules today are that international companies like us and many others can keep their earnings that they earn overseas overseas, and then when they bring them back it triggers the tax liability.\nWhat I’ve always felt should happen is that every dollar should be taxed immediately with no deferral. But as a consequence of doing that, you should have free flow of capital. What would happen is if a system like that were put in place, it should have more investment going into the United States. We’re the only major country in the world that has a system like this. It’s not good for the U.S., it’s not good for the economy, it’s not good for jobs, it’s not good for investments.\nI think there’s wide agreement to that in both parties, by the way. There’s a difference of view with different people about how to fix it, but I think everybody agrees the current system isn’t working. So I’m optimistic that, in 2017, there will be some sort of corporate tax reform. The U.S. needs to invest more in infrastructure — so what would be great is, if they take the tax proceeds of a corporate tax reform and invest it in infrastructure and roads and bridges and airports.\nWhat do you say in response to Nobel economist Joseph Stiglitz’s comments on Bloomberg [television], where he called Apple’s profit reporting in Ireland a “fraud”?\nI didn’t hear it. But if anybody said that, they don’t know what they’re talking about. Let me explain what goes on with our international taxes. The money that’s in Ireland that he’s probably referring to is money that is subject to U.S. taxes. The tax law right now says we can keep that in Ireland or we can bring it back. And when we bring it back, we will pay 35 percent federal tax and then a weighted average across the states that we’re in, which is about 5 percent, so think of it as 40 percent. We’ve said at 40 percent, we’re not going to bring it back until there’s a fair rate. There’s no debate about it. Is that legal to do or not legal to do? It is legal to do. It is the current tax law. It’s not a matter of being patriotic or not patriotic. It doesn’t go that the more you pay, the more patriotic you are.\nAnd so what we’ve said — we think it’s fine for us to pay more, because right now we’re paying nothing on that and we leave it over there. But we — like many, many other companies do — wait for the money to come back.\nIn the meantime, it’s important to look at what we do pay. Our marginal rate, our effective rate in the U.S. is over 30 percent. We are the largest taxpayer in the United States. And so we’re not a tax dodger. We pay our share and then some. We don’t have these big loopholes that other people talk about. The only kind of major tax credit that we get is the R&D tax credit, which is available to all companies in the United States. That’s important to know. The second thing I would point out is we have money internationally because we have two-thirds of our business there. So we earn money internationally.\nHow long are you willing to keep unrepatriated income overseas?\nHonestly, I believe the legislature and the administration will agree that it’s in the best interest of the country and the economy to have tax reform. So I don’t think I have to make that decision. I’m optimistic that it will take place next year.\nTim Cook appeared before the Senate Permanent Subcommittee on Investigations to discuss Apple’s tax practices. (Andrew Harrer/Bloomberg)\nDo you feel picked on by the E.U.?\nYou know, they haven’t ruled yet. I don’t know how they will rule. I hope that we get a fair hearing. If we don’t, then we would obviously appeal it.\nIt’s important for everyone to understand that the allegation made in the E.U. is that Ireland gave us a special deal. Ireland denies that. The structure we have was applicable to everybody — it wasn’t something that was done unique to Apple. It was their law.\nAnd the basic controversy at the root of this is, people really aren’t arguing that Apple should pay more taxes. They’re arguing about who they should be paid to. And so there’s a tug of war going on between the countries of how you allocate profits.\nLet’s jump to Apple’s future. You made some statements in the earnings call about artificial intelligence that got a lot of attention. Can Apple catch up with the AI efforts from companies like Facebook, Google and Amazon?\nLet me take exception to your question. Your question seems to imply that we’re behind.\nLet’s take a look at that. We’ve been shipping Siri since 2011, and Siri is with you all of the time. Which I think most people would want an assistant with them all the time, whether they’re at work or at home or in between or on the soccer field. You don’t think of your to-do list, so to speak, only when you’re in your kitchen. And the breadth of Siri is unbelievable. Increasingly, Siri understands things obviously without having to memorize certain ways to say things. The prediction of Siri is going way up. What we’ve done with AI is focus on things that will help the customer. And we announced in June that we’re opening Siri to third parties, so third-party developers can now use Siri. So a simple example with that, whatever kind of ride-sharing app you might use, Uber or Lyft in the United States, you could just — using your voice — order the car. So third-party developers are writing tons of those that will be available to the public in the fall. And that’s how we’re broadening Siri in a huge way.\nBut there are other things in there, like if you’re typing in mail, the prediction capability of the next word or next phrase that you will use has just — Siri has gotten a lot smarter about that. The simple things, like do you drive to the airport? I haven’t done that in a little while, but when I did, I always forgot where I put my car.\nI just take a picture of the sign on the wall.\nBut you don’t even have to do that anymore because Siri will know where you parked. And so things like this really make a difference to people — we do all of that while protecting your privacy. Instead of passing all that information to the cloud, where we’re maintaining it all, we do a lot of it on the device itself. So you’re in control of your own data.\nDo you have a concern about privacy as you push into AI?\nNo. I think that talented people can come up with fantastic ways of using AI without violating privacy. There’s a new technology called differential privacy which essentially looks at large data sets to predict user behaviors and requests without going to the precise individual, which might violate privacy.\nNow there are some things that we do look at — like if you buy songs, it’s a reasonable expectation that we know what songs you buy because you buy them from us. And we use that information with machine learning to recommend other songs you might like.\nWhat about augmented or virtual reality?\nI think AR [augmented reality] is extremely interesting and sort of a core technology. So, yes, it’s something we’re doing a lot of things on behind that curtain that we talked about. [Laughs.]\nYou mentioned earlier about how much more difficult it is to keep things secret. There’s been a number of reports about Apple’s car project — the people who are being hired or moved into place to lead it. It gets enough attention that it almost seems like an open secret. Why not say something about it?\nI can’t answer a question about something we haven’t announced. [Laughs.]\nBut there’s just constant attention about it. Is it tempting to share any kind of details?\nWe’ve always viewed that people love surprises. We don’t have enough anymore in our lives.\nSometimes it seems like Silicon Valley companies are all blending together — everyone’s converging on the same big race. Self-driving cars, AI, Google is reportedly building a smartphone. In a tech industry where companies are trying to be “all things to all people,” how does Apple’s longtime philosophy of simplicity, and being very focused, move it forward?\nIt’s as important as it ever was. We’re a bit larger today, so we can do a bit more than we could do 10 years ago or even five years ago. But we still have, for our size, an extremely focused product line. You can literally put every product we make on this table. That really is an indication of how focused it is. I think that’s a good thing. Regardless of who you are, there’s only so many things that you can do at a very high-quality and deep, deep level — personally and in business. And so we’re not going to change that. That’s core to our model and way of thinking.\nApple has really ramped up spending in research and development. One analyst noted your [incremental] R&D is now greater than the 14 largest automakers, combined. What’s the most exciting technology out there to you right now?\nThat one I don’t want to answer, because it would give too much of an insight into the things we’re doing. But we have ramped up R&D because we are heavily investing in the future — both in current product lines and things that aren’t visible as well, including in services. In due time, some of those things will be visible. But there will always be other things that will replace those things that are invisible.\nAny final reflections on your tenure? Moments that stuck out at you?\nI’ve got the best job in the world. I think about my day and weeks and months and years — I put them in three buckets: people, strategy and execution. I sort of move between those on a daily basis as to where I put my time. I always think the most important one of those is people. If you don’t get that one right, it doesn’t matter what kind of energy you have in the other two — it’s not enough.",
        "sentiment": 0.053255242944103894
    },
    "article_7": {
        "title": "New leak suggests Apple will finally kill 16GB iPhones",
        "body": "The 16GB iPhone option nobody wants could finally die this year. According to a new leak, Apple’s upcoming iPhone 7 series will ship with 32GB of space as standard, while power users with plenty of cash will be able to get as much as 256GB.\nNo one who owns a 16GB iPhone chose that model because it’s all the storage they wanted; they chose it because it was the cheapest iPhone. And now they spend their precious time deleting photos and videos to make room for more photos and videos.\nBut it looks like Apple’s going to finally put an end to one of the most common first-world problems this year. A leaked storage specification sheet obtained by leaker The Malignant suggests the iPhone 7 will come with at least 32GB of storage.\nIt appears the 64GB option will also die and the 128GB option will become the mid-tier, while a new 256GB option will be made available for those who love to carry all the music and videos they’ll ever need on the go.\nToshiba will supply some of those flash chips, according to the leak — though Apple could well be using other suppliers as well.\nThis news will be music to the ears of almost every iPhone fan — particularly those who can’t spend the extra $100 on a mid-tier device. We’ve been calling for the death of 16GB devices for years, and it looks like it’s finally going to happen.\nThat’s if this leak is genuine, of course.",
        "sentiment": -0.18025516684759746
    },
    "article_8": {
        "title": "Pictures of ‘iPhone 7 Plus’ in Gorgeous New Blue Colour Hit the Web",
        "body": "A new set of leaked images shows the alleged ‘iPhone 7 Plus’ as you’ve never seen before. Yes, that’s correct as a Twitter user (@the_malignant) who has shared various similar leaks concerning the 2016 iPhone and other devices, and Chinese website iFeng, have posted new images on the web showing the device from various angles complete with comparisons with current iPhone models (via BGR).\nAs you can see above, the all new blue ‘iPhone 7 Plus’ looks pretty amazing, and has all the design markings we expect i.e. the single-band rear antenna lines and a protruding dual-lens camera are there. The shots below also clearly show the absence of the 3.5mm headphone jack, with the port being replaced by a speaker grille.\nWhat’s even more interesting is the fact that the device is turned on, although Siri seems to have been replaced by Voice Control.\n“The device appears to be running a version of iOS 10, although the person who took the photos does not reveal any details about it. The phone likely comes from China considering that language seems to be set to Chinese, and has elements that iOS 10 beta testers will instantly recognize include the new widgets on the search screen, as well as a wallpaper that’s included in Apple’s list of default wallpapers for iOS 10”.\nWhile there is no way to authenticate these images, they sure look pretty darn real. Take a look at some more and share your thoughts with us in the comments section.",
        "sentiment": -0.08768658381369379
    },
    "article_9": {
        "title": "Apple, AT&amp;T, Google and others working with FCC to combat robocall phone spam",
        "body": "AT&T chairman Randall Stephenson will soon announce that a consortium of 33 companies, including Apple, AT&T, Google and Comcast are joining the FCC in an effort to crack down on phone call spam made by robots, according to Reuters. In the inaugural “Robocall Strike Force” meeting, the companies will announce their initial plans on how to stop US phone owners from receiving advertorial spam run by automated machines …\nThe AT&T CEO said the 33 companies, which includes tech smartphone giants Apple and Google, will work on solutions to present a concrete plan by October 19 in a couple of months time.\nRight now, there are no details on what methods the companies have in mind to combat the spam phone calls, or what role Apple will play. There is a possibility Apple could add technology into iOS that can detect robotic spam callers before the user picks up the phone.\nAlthough a plan is to be expected by October 19, a prospective date for implementation of the scheme is even more fuzzy.\nAT&T chairman and CEO Randall Stephenson will make the announcement at the first “Robocall Strike Force” meeting at the FCC later on Friday, the company said. FCC chairman Tom Wheeler in July wrote major companies about robocalls. The strike force will report to the commission by Oct. 19 on “concrete plans to accelerate the development and adoption of new tools and solutions,” Stephenson said.\n“Accelerate the development and adoption” gives no promises about when such changes could come into effect, likely taking many months or years for 33 companies to coordinate with each other. At this stage, it’s not even clear how the stakeholders would achieve such a feat: just like email spam, combatting phone spam is a cat and mouse game.\nIn iOS 10, Apple has already started along this path with a new extension point for third-party app developers that lets the phone flag up known marketers. At WWDC, Apple advertised this feature in the context of the Chinese region (where phone spam is also very high) but it works worldwide. This is what Craig Federighi is demoing at the keynote in the image above.\nPhone adds integration for third-party VoIP calls, voicemail transcription and a new caller ID extension for spam alerts.\nHowever, Apple has not announced any plans to provide this data itself as of yet. If customers want to take advantage of the new iOS 10 feature, they will have to download third-party apps that offer the underlying database and provide integration with the system. iOS 10 is expected to launch next month in September.\nWe’ll bring more details to follow on Apple’s telephone spam efforts as they are announced.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.05057878508454278
    },
    "article_10": {
        "title": "Apple Pay is coming to Chick-Fil-A on Friday",
        "body": "As Apple Pay continues to expand to more banks in the United States and around the world, it’s slowly coming to more retail locations, as well. Next on the docket for Apple Pay support appears to be Chick-Fil-A, according to a tweet from the restaurant chain.\nLast year, it was reported that Apple Pay support was coming to Chick-Fil-A locations around the country, but the rollout never fully began, though a handful of users have been able to use the service sporadically. According to today’s tweet, however, Apple Pay will be accepted at all Chick-Fil-A locations as of this Friday, August 19th. The mobile payment platform will be supported in-store and in the drive thru.\nChick-Fil-A’s adoption of Apple Pay comes after the company has experimented with QR-based solutions in the past. Those solutions ultimately failed, according to employees, much like other QR-based offerings we’ve seen. Chick-Fil-A has, however, supported Apple Pay in its recently revamped app on iOS.\nApple keeps a list of retailers that support Apple Pay on its website, though it has not yet been updated to acknowledge Chick-Fil-A’s support. The fast-food chain is still listed as “coming soon” on Apple’s website as of now. Other entities listed as coming soon including Forever 21, Johnny Rockets, T-Mobile, and L.L. Bean.\nSome retailers, however, continue to resist Apple Pay. Just last week, CVS announced their own “CVS Pay” QR code-based mobile payments solution. Walmart also resists Apple Pay, instead opting for its own QR solution, Walmart Pay.\nAs is usually the case with Apple Pay rollouts in national chains, some users have already reported being able to use the service at their local Chick-Fil-A. The full rollout, however, should be completed by this Friday, August 19th. Let us know in the comments of your experience using Apple Pay in Chick-Fil-A locations in the comments!\n@loneswords Yes, as of August 19th, Apple Pay and Android Pay are available for payment both in-restaurant and in the Drive Thru. — Chick-fil-A, Inc. (@ChickfilA) August 17, 2016\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.12802776345051825
    },
    "article_11": {
        "title": "New Report Confirms 'iPhone 7' and 'iPhone 7 Plus' Names, Effectively Ending 'iPhone 7 Pro' Rumors",
        "body": "The assumed names of this year's iPhone lineup -- \"iPhone 7\" and \"iPhone 7 Plus\" -- have been confirmed by \"reliable sources\" speaking with Japanese site Mac Otakara . The sources said that Apple is following this name scheme to avoid confusion of having back-to-back iPhones with \"S\" in the name, even though the iPhone 7 will largely be a minor update over the iPhone 6s.The new report nixes the chance for an additional third tier \"iPhone 7 Pro,\" which was a rumored dual-lens alternative to the single-lens \"iPhone 7 Plus\" early in the rumor cycle . The less-powerful camera option was said to be created by Apple as a fallback in case the dual-lens technology didn't pan out. Now that everything seems to be going well for the company in this area, and mockups have repeatedly shown a dual-lens camera enclosure, it makes sense for Apple to revert to the well-known \"Plus\" moniker for its next-generation 5.5-inch dual-lens iPhone, and drop any reference to \"Pro\" altogether.Otherwise,reiterates on the expected rumors of the iPhone 7: there won't be a 3.5 mm headphone jack, it will house an A10 chip, and it will introduce a new flush, capacitive Home Button in lieu of the traditional physical switch. That last aspect of the new iPhone has been a bit more up in the air in the weeks ahead of the September launch, since it's hard to fully decipher whether recent image mockups confirm one way or the other if the Home Button is pressure-sensitive or not.It's believed that the iPhone 7 and iPhone 7 Plus will be revealed at an Apple event on September 7, with pre-orders beginning two days later on September 9. A recent leak from AT&T has pushed back the reported launch of the new iPhone, however, suggesting that Apple could be preparing a wide release on September 23 , although the original rumor of September 16 is also still a viable option.Article Link: New Report Confirms 'iPhone 7' and 'iPhone 7 Plus' Names, Effectively Ending 'iPhone 7 Pro' Rumors",
        "sentiment": -0.03684577175105611
    },
    "article_12": {
        "title": "Apple issues iOS 10 beta 4 for iPhone, iPad, and iPod touch",
        "body": "Apple has released iOS 10 beta 4 for developers to test on iPhone, iPad, and iPod touch. iOS 10 brings a refreshed look to Apple Music and News plus loads of new features to the platform. The software update will be ready for everyone later this fall, and we’ll dig through the fourth developer version of the iOS 10 beta below.\nIf you’re already testing iOS 10 beta on your iPhone or iPad, head to the Software Update section of the Settings app to find the OTA update. If you’re a registered developer deciding to start testing iOS 10 with beta 4, head over to the Apple’s developer page to install the beta profile. For non-developers, Apple is currently testing iOS 10 through the public beta program which usually receives updates a couple of days after developers.\niOS 10 includes loads of new features and changes including redesigned Music and News apps, the first Home app for HomeKit, a redesigned Lock screen and Home screen experience for widgets, tons of iMessage features in Messages, and much more.\niOS 10 beta 3, which was released on July 18th, included several new changes including a new Taptic Engine behavior when manually locking new iPhones, changes to Health and Activity apps, an App Support setting for Siri, and more.\nCatch up on our full coverage with our iOS 10 guide. We’ll dig through the latest iOS 10 beta and update with notable changes. As always, shout in the comments, mention us on @9to5mac, or email tips@9to5mac.com with changes you discover as well.\nHere’s the update:\nNew Control Center splash page\nNo new wallpapers (yet) but several removed + iOS 8 stock wallpaper returns\nHealth app videos are still placeholder images (tweaked colors and layout)\nFolder animations are sped up\n🚨🚨🚨Redesigned emoji characters with more diversity🚨🚨🚨\nTaptic Engine vibration when manually locking phone is gone\nDate section widget returns to iOS 10\n@apollozac artist page finally links to Apple Music in iOS10 Beta 4 pic.twitter.com/k57HQusfc8 — Christoph (@saudumm) August 1, 2016\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.16222670937090047
    },
    "article_13": {
        "title": "Apple Drops 'Store' From Apple Store Branding",
        "body": "Apple appears to be making a slight branding change to its retail business, dropping the \"Store\" moniker when referring to its Apple Store locations. Apple has already made the change online, and all of its store pages now refer to stores by names like \"Apple Union Square\" or \"Apple Valley Fair\" or \"Apple The Grove,\" instead of \"Apple Store, Valley Fair\" or \"Apple Store, The Grove.\"\nIt's a change that appears to have started rolling out with the launch of the newer Apple Stores, like the Union Square location in San Francisco. Apple has always referred to that store as just Apple Union Square, and over the course of the last few days, the company has updated all of its retail store webpages to remove the \"Store\" branding. What was once \"Apple Store, Fifth Avenue,\" for example, is now just \"Apple Fifth Avenue.\"\nThe new website for The Grove Apple Store\nAn archived page for the Fifth Avenue Apple Store has the older branding as of August 12, suggesting this is a fairly recent change to Apple's retail plan.\nThe old website for The Grove Apple Store\nApple also recently sent out a memo to its retail employees, letting them know that the \"Store\" branding is gradually being dropped from both retail locations and online. While Apple told employees the change will be gradual and will start with new stores, pages for almost all stores have been updated to remove the \"Store\" titling.\nThe decision to remove the \"Store\" portion of Apple's line of retail locations likely has to do with efforts to turn newer stores into more than just simple stores, positioning them as gathering places for their communities. Apple Union Square, for example, features an outdoor plaza with regular acoustic performances and a 6K video wall with seating called \"The Forum,\" aimed at allowing artists, photographers, and musicians to inspire and educate customers through year-round programs, events, and classes.",
        "sentiment": -0.4162883561104536
    },
    "article_14": {
        "title": "New Leaked Images Show Black Version of 5.5-inch iPhone 7",
        "body": "A few new images appear to show a 5.5-inch iPhone 7 with a dual camera setup, Smart Connector pins at the back, and a new black colour.\nIf we stick to the original theory of three iPhone 7 models, the alleged “Plus” and “Pro” being of the 5.5-inch variety, then this would definitely be the highest tier device in the mix. However, given the latest rumours there appeared to be only two versions of the handset, the larger version with dual cameras but no Smart Connector.\nIn light of this, it seems better to concentrate on the photos themselves and what they do appear to showcase with confidence, whether they are legitimate or not. Although the unit shown in the images is probably a dummy unit. This is not the first time we are hearing about the possibility of a black color option, as well as other new finishes, like a midnight blue.\nThe black colour on the iPhone looks incredibly stylish, complete with little details like the shade of the antenna bands. Another thing we can clearly see is the absence of a 3.5mm jack on the bottom of the unit and a total of two speakers.\n[via Feng (CN)]",
        "sentiment": -0.5541375791653991
    },
    "article_15": {
        "title": "This gadget levitates your apple watch while wirelessly charging it",
        "body": "LIFT is a new anti gravity charger for the Apple Watch and Pebble that actually levitates your smartwatch into the air while charging it wirelessly.The main charging unit incorporates an internal battery giving you two full charges for your smartwatch while on the go. It can even give an emergency charge to your smartphone.The Lift base can also wirelessly charge a compatible phone. Just place your phone over the induction pad and let it power up.When not charging your watch, you can replace the charging unit with the Orb, a wireless smart lamp. Place the Orb over the charging base and it will float and light up the space around you. The Orb also comes with an built-in battery, which allows you to wirelessly spread light wherever you choose. It magnetically attaches to any metal surface, so you can spread Orbs all around the house and create beautiful ambient light sources indoors or outdoors.LIFT has surpassed its funding goal on Kickstarter and is available for a pledge of $199 in white or black. The LIFT Pro charging station lets you charge your iPhone, iPad, and Apple Watch for an early bird pledge of $199. If you want the Orb and smartwatch charger you're looking at an early bird pledge of $219.More details at the link below...",
        "sentiment": 0.4748394712805748
    },
    "article_16": {
        "title": "The NSA hack proves Apple was right to fight the FBI",
        "body": "Tim Cook\nAfter the unprecedented breach of hacking tools and exploits stolen from the US National Security Agency's elite hacking unit, some privacy advocates see it as clear vindication of Apple in its fight with the FBI earlier this year.\nThis content is not available due to your privacy preferences. Update your settings here to see it.\n\"The component of the government that is supposed to be absolutely best at keeping secrets didn't manage to keep this secret effectively,\" Nate Cardozo, a senior staff attorney with the Electronic Frontier Foundation, told Business Insider.\nIn February, a judge ordered Apple to help the FBI unlock an iPhone that was used by Syed Rizwan Farook, one of two attackers who killed 14 people in a December terrorist attack in San Bernardino, California. That order set off a vigorous debate between law-enforcement officials seeking evidence and technologists worried over broader implications for personal privacy.\nWhile the company's legal team fought the order, Apple CEO Tim Cook published a letter arguing against being forced to build a so-called backdoor that would subvert the encryption that not only kept the shooter's phone secure, but also the smartphones of millions of other Apple users.\nMost in the technology community rallied around Apple at the time, arguing that weakened encryption might help government investigators, but it would also make customers vulnerable to hackers.\nNow, with a massive top-secret archive of some of the NSA's own exploits having been leaked online, it appears they were right.\nNSA headquarters\n\"The NSA's stance on vulnerabilities seems to be based on the premise that secrets will never get out. That no one will ever discover the same bug. That no one will ever use the same bug. That there will never be a leak,\" Cardozo said. \"We know for a fact, that at least in this case, that's not true.\"\nThe government eventually backed down from its fight with Apple in late March, after investigators said they were able to unlock the shooter's phone with the \"a assistance of a third party.\" It never disclosed who that was or how it broke into the phone.\nStory continues\nExactly how the FBI got into the phone is yet another case where the government is holding on to \"zero days,\" or software exploits that are completely unknown to companies and users. These exploits, when found, are typically disclosed to vendors so they can fix the problem, used by hackers to break into systems more easily, or sold on the black market.\nBut Cardozo believes the FBI's exploit of the San Bernardino shooter's iPhone 5C, its still unknown exploit of the Tor web browser in another case, and NSA's apparent hoarding of exploits that have now been made public, raises a larger issue around the legalities of government hacking.\n\"When the government finds, creates, or discovers a vulnerability in a system, there are essentially two things they can do: They can disclose it, or they can use it,\" he said. \"But the rules around that are completely broken.\"\nThere are some guidelines around how the government is supposed to deal with vulnerabilities in what is called the Vulnerabilities Equities Process, a framework that is supposed to outline how and when it would make sense to disclose a vulnerability to an affected company if the larger security risk is greater than the reward it could yield.\nBut the VEP is just nonbinding guidance created by the Obama administration — not an executive order or law — that has no legal standing.\n\"We need rules, and right now there aren't any,\" Cardozo said. \"Or at least none that work.\"\nNOW WATCH: There’s a glaring security problem with those new credit card chips\nMore From Business Insider",
        "sentiment": -0.4570158166438341
    },
    "article_17": {
        "title": "Apple Seeds Fifth Beta of iOS 10 to Developers",
        "body": "Apple today seeded the fifth beta of iOS 10 to developers for testing purposes, one week after seeding the fourth beta and approximately two months after first unveiling the new operating system at its 2016 Worldwide Developers Conference.\niOS 10 beta 5 is available as an over-the-air download to those who installed the first four betas or the beta configuration profile and it's available for direct download via Apple's Developer Center.\niOS 10 is a major iOS update with a ton of new features and design tweaks, including a new Lock screen experience with 3D Touch-enabled notifications, a more easily accessible camera, a redesigned Control Center, and a new widgets screen. According to Apple, iOS 10 is the company's biggest iOS update ever released.\nThe Messages app in iOS 10 has been overhauled with features that include background animations, bubble effects, Digital Touch, handwritten notes, Tapback replies, predictive emoji, and a dedicated App Store, and Photos has gained new facial and object recognition capabilities along with a Memories feature for rediscovering forgotten moments.\nOver the beta testing period, Apple is tweaking the features introduced in iOS 10 to refine them ahead of the public release of the operating system. In iOS 10 beta 4, Apple introduced new emoji characters and a redesigned look for many existing emoji, a Control Center intro, new Accessibility features, changes to the Notification Center, and more. New changes found in the fifth iOS 10 beta will be listed below.\niOS 10 is currently available to developers and public beta testers, with a full public release planned for the fall. For full details on iOS 10, make sure to check out our iOS 10 roundup. To see what's new in iOS 10 beta 5, head over to our tidbits post where we've rounded up some of the most notable changes.",
        "sentiment": 0.1883140435780991
    },
    "article_18": {
        "title": "Mossberg: The post-Jobs Apple has soared financially, but lacks a breakthrough product",
        "body": "Welcome to Mossberg, a weekly commentary and reviews column on The Verge and Recode by veteran tech journalist Walt Mossberg, now an Executive Editor at The Verge and Editor at Large of Recode.\nFive years ago last week, the legendary Steve Jobs stepped down as Apple’s CEO after an amazing 14-year run that took the technology company from the edge of disaster to the heights of glory. He personally selected his COO, Tim Cook, as the new CEO, and passed away six weeks later.\nSo, how has Apple changed in the first five years of the Tim Cook era? How is it different than at the peak of the Jobs era?\nThe short answer is that the company has surged financially to heights Jobs likely never dreamed of. It has also refined its popular product line and retained most of its senior talent.\nBut Cook’s Apple has yet to produce the kind of new, game-changing product Jobs was famous for launching. Or, if it has, we don’t know it yet.\nHowever, hard as it may be to believe, five years may be too short a time in which to judge the Cook era. But with a new iPhone launch expected next week, it’s worth looking back on how the company has changed in the past five years.\nDollars and Sales\nAs a longtime product reviewer, I’m less interested in any company’s financials than I am in its products. But the financials can’t be ignored. You’ll find a very good summary giving a sense of Cook’s reign in this five-chart post by Recode editor-in-chief Dan Frommer.\nthis summer Apple sold its billionth iPhone\nBut there are some notable highlights. Over his five-year tenure as CEO, Cook has roughly doubled Apple’s revenues and profits to an astounding $234 billion and $53 billion, respectively. Recent quarters have shown a rare downward trend, but the five-year pattern is still impressive. And this summer Apple sold its billionth iPhone, less than a decade after its introduction. That’s fewer units than all Android phones combined, but phenomenal for a single, premium product line. In just one quarter last December, iPhone sales exceeded the annual total for Jobs’s entire last year in fiscal 2011. But, again, sales have recently been declining.\nEvolving products\nCook has evolved Apple’s core products in ways we don’t know whether Jobs would have done, with considerable success. In 2014, he launched two models of the iPhone 6, one of which matched the large screen size of Samsung’s phones. It was well done, and sales soared. Last year slightly revised 6S models in the same sizes also sold well, but Apple followed up with an unconventional move in the iPhone SE, a reworking of the smaller iPhone 5S with modern internals that proved surprisingly popular.\nCook has evolved Apple’s core products with considerable success\nCook also introduced a huge 13-inch iPad Pro, with a snap-on physical keyboard, which Jobs thought unnecessary, and a stylus, which Jobs mocked and hated, even scorning the idea during the original iPhone launch. This year, Cook followed up with a smaller iPad Pro. The iPad Pro is doing well in the enterprise market, but it doesn’t appear to have yet reversed overall falling iPad sales.\nCook has also launched a beefed-up, app-based, Apple TV, which finds itself in a crowded, confusing market of set-top boxes and so-called smart TVs. But it’s only a remnant of a major TV product, replete with a new programming service, that the company had long been hoping to provide. The new Apple TV is ambitious, but lags in sales behind Roku and Amazon devices, partly due to its high price of $149 for the base model, and $199 for a model with more memory.\nNew Products\nWhen Jobs was CEO, he dazzled the tech world by running the table with a string of new products that other companies scrambled to match: the iMac, the iPod, the iPhone, the MacBook Air, and the iPad. That’s a hard act to follow, and Apple has struggled to do so in the last five years.\nCook’s biggest hardware bet, the Apple Watch, which began shipping last year, dominates the tiny global market for smartwatches, but has yet to become either the tech must-have or the popular fashion accessory it was meant to be. A new model may appear as soon as next week, with a completely revised user interface, which is in effect an admission that the initial interface wasn’t good enough.\nMeanwhile, the Mac lineup has stagnated, with some models approaching years without an update. The only new Mac introduced recently is the MacBook, which offers a vision of the future, but is costly, slow, requires adapters to work with its forward-looking single USB-C port, and has an odd, flat keyboard I find uncomfortable. Updates to the MacBook Air and MacBook Pro are reported to be in the works, however.\nthe Mac lineup has stagnated\nApple Pay, a contactless payment system for recent iPhones and the Apple Watch, is making steady progress, but it depends on external factors, like merchant acceptance.\nApple Music, the company’s new streaming service based on its acquisition of Beats, is being overhauled in iOS 10 — at least in terms of its user interface — because it was lambasted for complexity and errors.\n3D Touch, a new navigation tool that detects pressure on the iPhone screen to perform quick actions and peer into items like emails without opening them, hasn’t gained wide acceptance. It’s in some apps, but it’s still too hard to discover, missing on the iPads, and absent on Apple’s surprisingly popular iPhone SE.\nMitigating Factors\nBut there are some major mitigating factors. First, the global economy is in the slowest economic recovery anyone can recall. Second, Cook is having to compete with a much more polished Android and a much more polished line of Samsung phones than Jobs ever did. The smartphone market in developed countries seems saturated. PC and tablet replacement cycles are longer.\nJobs’ successes didn’t happen overnight\nFinally, it’s crucial to remember that Jobs’ successes didn’t happen overnight. While it was introduced in 2001, the iPod didn’t really take off big time until 2004–2005. And it took a few years from its 2007 launch for the iPhone to begin hitting double digit quarterly unit sales. So the jury is out on the Apple Watch.\nExpanding Markets\nCook’s real innovation may lie in his efforts to broaden the company’s markets. He has worked tirelessly to grow Apple’s presence in China, even in the face of some great native Chinese phones. And, in a move Jobs would likely have scorned, he has partnered with enterprise companies like IBM, Cisco, and Box to sell vastly more Apple devices into big companies by creating specialized apps and tools for them. This effort especially focuses on the iPad, whose consumer sales have been crumbling.\nBut, again, it’s much too soon to know if these bets will be winners or losers in the long run.\nPrivacy and Security\nCook has shown a big commitment to both privacy and security by encrypting most iPhone data end-to-end and in a way that even Apple can't decrypt it. And he showed real guts earlier this year by refusing an FBI demand that he weaken that encryption to help the Bureau search a dead suspect’s phone. He argued any software Apple built to do that would likely fall into the hands of bad actors and be sought by dictatorships worldwide.\nJobs was personally committed to privacy and security, and though we can’t know if he would have put the company on the line in this fight, Cook was firm in protecting the values of the company.\nWhat’s next\nWith iPhone and company sales falling in recent quarters, and likely to do so again, Apple needs the all-new product breakthrough that has eluded Cook — sooner rather than later. The company is seriously working on augmented reality, though I don’t know details. Like everyone else, it’s toiling away on artificial intelligence and machine learning, though it’s focused more on building smarts into individual devices rather than in the cloud, like most of its competition. And it continues to work on automotive technology, though it isn’t clear whether that means an entire car.\nRight now, Apple just needs an exciting new iPhone\nBut all of those potential payoffs are a way off. Right now, Apple just needs an exciting new iPhone. After I saw Samsung’s gorgeous new Galaxy S7 in March, I wrote a column calling for the next iPhone to be \"spectacular.\" Based on rumors, that much oomph may not be in the offing until 2017.",
        "sentiment": -0.040627070921747124
    },
    "article_19": {
        "title": "MacBook Pro with new 'touchscreen strip' won't appear at September 7th iPhone event, says Bloomberg",
        "body": "Apple is preparing a big update to its MacBook Pro line of laptops. KGI Securities analyst Ming-chi Kuo first revealed that Apple is planning to replace the function keys on the MacBook Pro with an OLED touch bar, and now Bloomberg's Mark Gurman is confirming the initial reports. The new MacBook Pros are said to be slightly thinner than current models, with a slightly wider trackpad and an option for AMD Polaris graphics in at least one model.\nBloomberg says that Apple isn't planning to unveil the new MacBook Pros at an event on September 7th, where it's expected to launch a new iPhone and additional Apple Watch models. Apple is also expected to include USB Type-C on the new MacBook Pro, alongside a Touch ID fingerprint reader. \"Apple has tested versions of the upcoming laptops that integrate the scanner beside the new function key display,\" explains Bloomberg's Gurman. Apple is also rumored to be considering gray, gold, and silver color options for the new MacBook Pro.\nMockup of the new MacBook Pro OLED touch strip by Martin Hajek\nThe most intriguing addition to the MacBook Pro is the secondary display above the keyboard. Designed to replace the function keys, Bloomberg reports that it will be a strip-like screen that shows functions on a task-by-task basis and will simplify keyboard shortcuts. The panel could show media controls when iTunes is open, or cut and paste commands when Microsoft Word is running.\nApple has been widely criticized for still selling a four-year-old MacBook Pro model without a Retina display. Mac fans have been waiting anxiously for a MacBook Pro refresh, and the current Retina MacBook Pro is more than 440 days into its cycle, despite refreshes usually appearing every 268 days on average in the past. Apple has not yet announced an official date for its iPhone event (rumored for September 7th), and it's possible the company could now refresh its MacBook Pro line without an onstage event.",
        "sentiment": -0.08305583536051787
    },
    "article_20": {
        "title": "Apple's 2017 iPhone will reportedly get rid of iconic home button",
        "body": "We're just one month out from a new iPhone release, but news of next year's model can't seem to stop seeping out. According to Bloomberg, the 2017 iPhone will no longer contain the iconic home button Apple fans have grown accustomed to over the last decade. The news pairs well with other reports of next year's iPhone, which will mark the device's 10th anniversary, using OLED display technology. That would allow the entire front of the device to \"appear like a single sheet of glass,\" according to sources cited by The Wall Street Journal in June.\nThat's not the only big change rumored for the 2017 iPhone. Nikkei Asian Review reported earlier this week that Apple may introduce a third, premium smartphone next year with a curved display not unlike Samsung's Galaxy S7 Edge. In fact, the report states Samsung may even be the supplier for these curved OLED displays.\nFor those wondering what will change with the upcoming iPhone 7, the device is said to remove the headphone jack in favor of the Lightning port, contain two rear cameras, and a memory boost to 3GB of RAM, according to separate report from Bloomberg. It will also contain a pressure-sensitive home button that relies on the same type of vibrating haptic feedback used in the Apple Watch and the trackpad of the new Apple MacBook.",
        "sentiment": -0.156040723539061
    },
    "article_21": {
        "title": "Leaked ‘iPhone 7 Plus’ packaging indicates Lightning EarPods and Lightning 3.5mm headphone jack adaptor bundled in the box",
        "body": "An interesting image is making the rounds today: a photograph of a purported packaging insert for Apple’s upcoming new phone. If the photo is to be believed, Apple will indeed be calling its larger new phone the ‘iPhone 7 Plus’, with the ‘iPhone 7’ name being taken by the 4.7 inch sibling.\nIt also indicates that Apple will be bundling Lightning EarPods in the box with every iPhone 7, as a consequence of the missing 3.5mm headphone jack. More interestingly, the leak suggests Apple will also be including a Lightning to 3.5mm Headphone Jack adaptor as a bundled accessory.\nFull photo of the pamphlet after the jump …\nMany were expecting Apple to make an adapter to allow customers to use existing earbuds and headphones with the new iPhone (which will not include an analogue 3.5mm jack in the hardware) but Apple’s usual trend is to sell these adaptors as separate purchases.\nTaking this leaked packaging as legitimate, iPhone 7 owners will be able to connect their existing 3.5mm headphones without spending any additional money as the necessary adapter will be included in the same box as the phone itself. A pleasant change for a company with a reputation for selling pricey dongles and adaptors as extras.\nOther tidbits include the way the EarPods are described: ‘EarPods with Lightning Connector’. This suggests that the headphones themselves will be identical aside from a change of ports. Apple has trademarked the ‘AirPods’ name for wireless headphones but these will be additional accessories (pricing unknown) and not bundled. The pamphlet also shows the 256 GB storage designation mirroring previous rumors.\nThe pamphlet includes the usual legal terms you would expect to see on an Apple product sheet and appears quite convincing. Unfortunately, it is quite easy to fake an image like this so it’s hard to say for sure if this is real. Packaging leaks have often turned up correct in the past with the Touch ID fingerprint sensor branding leaking out ahead of Apple’s official unveiling of the iPhone 5s in 2013.\nWe’ll know for sure next week, as Apple has announced a media press event for Wednesday, September 7. The company is expected to unveil its new iPhone 7 flagship lineup as well as the Apple Watch 2. New Macs are in the works but most sources are downplaying any appearance of Mac hardware at next week’s presentation. 9to5Mac will be bringing live coverage of all the announces so stay tuned.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.12943205104675143
    },
    "article_22": {
        "title": "You can finally buy a rainbow Pride Apple Watch band just like Apple’s exclusive employee bands",
        "body": "A little more than a month ago Apple gave a limited-edition rainbow colored Apple Watch band to its employees who marched in San Fransisco’s LGBT Pride parade. With no official release in sight and no worthy alternatives on the market, it seemed the only way to get your hands on one was to pay insane eBay prices. But that’s all changed this morning. Clockwork Synergy, a watch accessory maker based in Maryland, has just launched a Pride version of its Classic NATO Apple Watch band featuring a rainbow design that looks nearly identical to the one Apple gifted its employees. What’s more, both bands are made of nylon.\nClockwork Synergy’s Pride band is available in 38mm/42mm with 2 buckle and 7 adapter color options so you can customize it to fit your style. Its 11 adjustability holes should fit “most wrist sizes.” Better yet, the band is covered under a 1-year warranty in case you happen to run into any issues.\nThe Clockwork Synergy Pride 2-Piece Classic NATO Bands for Apple Watch are priced at $24.95, but if you use coupon code 9to5mac20 at checkout you’ll knock $4.99 off your order. That brings your total down to just $19.96 with free shipping.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2953815907239914
    },
    "article_23": {
        "title": "Don’t buy anything Apple-related right now (everything is changing)",
        "body": "TNW's former West Coast writer in the PNW (Portland, Oregon). Nate loves amplifying developers, and codes in Swift when he's not writing. If (show all) TNW's former West Coast writer in the PNW (Portland, Oregon). Nate loves amplifying developers, and codes in Swift when he's not writing. If you need to get in touch, Twitter is your best bet.\nAs we head into September, a lot of things in the Apple hardware ecosystem will change — and that’s why buying anything to do with Apple right now is a huge mistake.\nDon’t buy cases (okay, maybe one or two if you’re sure about the iPhone 7). Or accessories. Definitely don’t buy cables.\nWhy? USB-C.\nWith the MacBook, Apple started its slow changeover to USB-C. There’s even a USB-C to Lightning cable, which I once posited (correctly, it seems) was a harbinger of things to come.\nThe new MacBook Pros, which are long overdue, are also rumored to go the USB-C route. If that’s accurate, and we’d have to believe it is, it changes quite a bit for the average consumer.\nAt that point, Apple is basically turning its entire ecosystem over to USB-C and Lightning. It’s awesome — I’m excited. But I still caution everyone not to buy anything Apple-related yet.\nApple switching to USB-C probably affects everything\nAccessory makers have also been slowly migrating to USB-C connectivity. Aukey, which makes great battery packs and other accessories (the best around, in my view), has been switching to USB-C for some time, marketing their stuff to Android device owners.\nBut that means nothing to iPhone and iPad users; Apple’s own USB-C to Lightning cable is seen as a niche product for MacBook owners, but it’s really the future.\nOnce Apple goes all-in on USB-C with new portable computer hardware, expect it to also change its chargers and such to USB-C — again, just like the MacBook.\nThe incoming iPhones will probably utilize USB-C to Lightning connectivity for chargers, too. From there, we should expect peripheral manufacturers to ease away (or run) from the ‘standard’ USB connection.\nThis applies to every one of us. Even if you don’t think you’ll be upgrading your phone for a year or so, buying peripherals or cables is a short-term bet that just won’t pay off; don’t do it unless it’s critical.\nThat’s not to say everything will stop working once USB-C is the standard, but finding quality USB stuff will be harder.\nJust save a few bucks and bide your time\nApple is expected to announce new iPhones on September 7, and have them in stores a week or so later. If you’re planning to upgrade, sit tight on accessorizing — especially when it comes to wired earbuds.\nThis is especially true if you’re also planning to buy a new MacBook Pro. Unless you want to tote around a bunch of cables with disparate connection points, just chill out for a bit.\nIn six months’ time, everything you want will be USB-C. Excited as we may be for what’s next, remember that Apple sets the tone, and some companies need a bit of time — but once Apple makes a change, they usually scramble to catch up.",
        "sentiment": 0.07966001670468938
    },
    "article_24": {
        "title": "Apple should stop selling four-year-old computers",
        "body": "For longtime Mac users, MacRumors’ Buyer’s Guide is an online institution. The publication catalogs the release dates of each major Apple product line and contrasts them against the company’s usually predictable timeframe for updates, ultimately delivering a verdict on whether it’s better to buy now or wait. It’s a hugely useful resource that I’ve often pointed people to when asked for recommendations on laptop purchases.\nMacRumors lists almost every Mac as \"Don't Buy\"\nBut right now, the Mac section of the guide makes for depressing reading. Apart from the 12-inch MacBook, which was refreshed in April, every single Mac line from the mini to the Pro is designated as \"Don’t Buy\" because of how long it’s been since Apple updated them.\nThe Retina MacBook Pro is 442 days into its current cycle, despite refreshes coming every 268 days on average in the past. The Mac mini has gone 657 days since its last update, which was controversial in itself since Apple removed quad-core options and made the product harder to upgrade after purchase. And the Mac Pro, released in December 2013 following much \"Can’t innovate any more, my ass\"-fueled fanfare? It hasn’t received a single update since then. \"This is without a doubt the future of the pro desktop,\" Phil Schiller said when announcing the Mac Pro on stage that year. Did he mean that this was the precise model Apple expects professional users to use literally forever?\nApple iterates quickly and consistently in mobile because the rate of technological progress is so much more dramatic in that arena. The company does amazing work to keep its iPhones and iPads ahead of competitors, performance-wise. Simple Intel processor upgrades are less important to laptops these days, however, and I’m finding this 2012 MacBook Pro fine to work from right now — faster than my 2015 MacBook, at least, which is enough for my needs.\nBut that doesn’t mean it isn’t unconscionable for Apple to continue to sell outdated products to people who may not know any better. Is the company really saving that much money by using 2012 processors and 4GB of RAM as standard? Even an update to Intel’s Haswell chips from 2013 would have brought huge battery life improvements. Apple is bound by the whims of its suppliers to a certain extent, and it may not always make sense for the company to upgrade its products with every single new chip or GPU that comes out. But there’s a certain point at which it just starts to look like absentmindedness, and many Mac computers are well past that point now.\nthere’s a certain point at which it just starts to look like absentmindedness\nIf Apple needs to keep the non-Retina MacBook Pro around for certain users who really need a DVD drive, fine; I happen to like the chunky old design, and it’s good to have a Mac laptop in the lineup where you can still upgrade the RAM and storage. But there’s no excuse for selling four-year-old hardware for $1,099. (Yes, Apple charitably dropped the price by one hundred whole dollars two years ago.) The 2012 MacBook Pro still runs okay today, but not that okay.\nThe issue pervades almost the entire Mac line. Professionals really do care about performance, so the nearly three-year wait for a new Mac Pro is exasperating to many — not least Oculus founder Palmer Luckey, who says he’d like to support the Mac \"when Apple makes a good computer\" with modern GPUs. The Mac mini is similarly losing its relevance in the desktop space; I’d actually like to buy one soon, but I’d feel like an idiot. And it’s understandable not to update the MacBook Air with a Retina display given the shift to the new MacBook, but to continually ship it with an awful TN panel? The Air’s screen was subpar in 2012, which is why I got the bulkier but IPS-equipped Pro back then in the first place. Apple should be embarrassed to have it in its stores today.\nSigns point to a major MacBook Pro update coming later in the year, but nothing short of a complete overhaul for the entire Mac line will suffice. People that buy Apple products do so because they want the best; in hardware terms, at least, it’s hard to argue that most people buying a Mac today will be getting that. If Apple doesn’t want to keep its products reasonably current, that’s its prerogative. But if that truly is the case, maybe it shouldn’t sell them at all.",
        "sentiment": -0.20382631942629814
    }
}