{
    "article_0": {
        "title": "More than 90% of ‘genuine’ Apple chargers and cables sold on Amazon are fake, says Apple",
        "body": "Update 2: Amazon is reportedly working on a new Brand Central program to help protect brands from knock-offs. CNET says that few details are yet available, but one of those involved in a pilot scheme said that Amazon’s approach to dealing with counterfeit products has undergone ‘a sea change.’\nUpdate 1: Amazon commented:\nThere’s no shortage of third-party chargers and cables sold for Apple equipment, some of them claiming to be the genuine article, but Apple has found that even Amazon has been selling counterfeit products labelled as the real thing. The products concerned were sold by Amazon directly, and not by a third-party Marketplace seller.\nThe items have now been removed from sale, and Apple is suing the company that made them …\nPatently Apple reports that Apple has filed a trademark infringement case against Mobile Star LLC, which Amazon named as the primary supplier of the counterfeit products. Apple said that Mobile Star was not only illegally using its trademark, but that the fake chargers had not passed safety tests and posed a risk to consumers.\nApple recently purchased a number of Apple power adapters and charging and syncing cables (collectively “power products”) that were directly sold by Amazon.com – not a third party seller – and determined that they were counterfeit. Amazon.com informed Apple that Mobile Star was its source for the majority of these counterfeit Apple products […] Counterfeit power products, such as those supplied by Mobile Star, pose an immediate threat to consumer safety because, unlike genuine Apple products, they are not subjected to industry-standard consumer safety testing and are poorly constructed with inferior or missing components, flawed design, and inadequate electrical insulation. These counterfeits have the potential to overheat, catch fire, and deliver a deadly electric shock to consumers while in normal use.\nThe situation, says Apple, is even worse where third-party sellers are concerned. While the ‘Fulfillment by Amazon’ tag gives buyers confidence that purchased products will be delivered, it gives no assurance that the items are genuine. Indeed, the lawsuit alleges, the vast majority of them are not.\nOver the last nine months, Apple, as part of its ongoing brand protection efforts, has purchased well over 100 iPhone devices, Apple power products, and Lightning cables sold as genuine by sellers on Amazon.com and delivered through Amazon’s “Fulfillment by Amazon” program. Apple’s internal examination and testing for these products revealed almost 90% of these products are counterfeit.\nApple argues that its own reputation is damaged when consumers buy what they believe to be genuine products which then fail to perform as they should, or which prove to be dangerous. The company is seeking an injunction against Mobile Star selling fake products, destruction of all counterfeit items and damages of $2M per product type.\nAmazon responded, stating that the company ‘has zero tolerance for the sale of counterfeits on our site. We work closely with manufacturers and brands, and pursue wrongdoers aggressively.’\nGiven the number of fake Apple products available, we always urge caution where the price is significantly lower than the official price. This is especially true in the case of MagSafe power supplies, where any price lower than available from authorized resellers is an immediate warning flag.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.48862705743786966
    },
    "article_1": {
        "title": "Microsoft Announces iMac Competitor: Surface Studio",
        "body": "Microsoft's Surface family has officially expanded to include the desktop. The company just announced the Surface Studio at today's event in New York City. It will be available \"in limited quantities\" this holiday for $2,999, $3,499, or $4,199, depending on hardware options. Preorders begin today, and the Studio will also be showcased in Microsoft retail stores ahead of its release. \"We totally believe that Surface changes the way you produce, the way you create, the way you learn,\" said Panos Panay, who leads Microsoft's devices team. \"The product I'm going to show you is all of that — but it's one step further. It's going to seem familiar, but it's going to feel different.\"\nHe then unveiled the Studio, with an all-in-one form factor touted as having the \"world's thinnest LCD monitor ever built\" at 12.5mm. That touchscreen display is contained in a forged aluminum enclosure and measures 28 inches across. The display outputs 13.5 million pixels, according to Panay, which is 63 percent more than a 4K television. \"It's got the best screen in its class,\" Panay said.\nThe Surface Studio supports expanded color output – critical for photographers, videographers, and designers. Microsoft refers to this as \"TrueColor.\" The display has a 3:2 aspect ratio with 192 pixels per inch. It's powered by Intel's 6th generation processors and, graphics-wise, has an Nvidia GTX 980M GPU in the premium model, with a 965M in the lower-priced configurations. The Studio's hinge allows for the display to be adjusted to a 20-degree orientation that's convenient for drawing or marking up Word documents. \"These chrome arms were meant to completely fade into the background,\" said Panay.\nThe Studio supports a variety of peripherals including the Surface Pen and a new radial accessory, the Surface Dial, that can be placed directly on the Studio to trigger menus and other features like adjusting volume, screen brightness, or scrolling through a document. There's also built-in palm rejection for the touchscreen, allowing users to avoid false inputs and interact with the Studio comfortably. Its base has numerous connectivity options: audio, SD card, Mini DisplayPort, ethernet, and 4 USB 3.0 ports. There's also a built in microphone array, making it easy to activate Cortana, the built-in Windows 10 assistant, from across the room.\nMicrosoft's main push with the Surface Studio is all about creativity, with a huge focus on 3D. Its unveiling comes alongside the announcement of the Windows 10 Creators Update. The Creators Update aims to make creating 3D content quick and easy for the company's millions of Windows 10 users. It'll include the biggest-ever update to the classic Paint app, now called Paint 3D, and more updates are on the way — including for apps in the Office suite. \"Over the next year, you will see us integrate 3D across our most popular Microsoft applications,\" said Megan Saunders.\nMicrosoft's hardware division is ramping up its direct competition with numerous Windows PC vendors. It's also taking on Apple's iMac, a popular desktop option among creative professionals. Apple is expected to update the iMac line sometime in the coming months. \"Every now and then in pursuing our mission, we see the opportunity to create a new category of device,\" said Microsoft's Windows VP Terry Myerson. \"We seize these moments to create something so much more than a product.\" The full specs for Surface Studio are as follows:\nDisplay: 28-inch 4500 x 3000 PixelSense LCD (192 PPI), 3:2 aspect ratio, Adobe sRGB and DCI-P color settings, 10-point multitouch\nProcessor: sixth-generation Intel Core i5 or Core i7\nStorage: 1TB or 2TB hybrid drive\nMemory: 8GB, 16GB, or 32GB of RAM\nGraphics: GeForce GTX 965M 2GB (in Core i5 Studio) or GTX 980M 4GB (in Core i7 Studio)\nI/O: 4 USB 3.0 (one high power), 3.5mm headphone jack, SD card slot, Ethernet, Mini DisplayPort\nWireless: 802.11ac Wi-Fi, Bluetooth 4.0\nCameras: 5MP front camera with Windows Hello support, 1080p video rear camera\nSound: Stereo 2.1 Dolby audio\nPrevious Next\n1 / 16\nSee all of the Microsoft news right here!",
        "sentiment": 0.3805538665619679
    },
    "article_2": {
        "title": "Apple October 27th Event Official",
        "body": "Apple is making it official: the company will hold a major product unveiling on October 27 where new Macs are expected to debut. The event will take place on Apple’s campus, likely marking the last one before Apple Campus 2 is open for business.\nThe event is somewhat of a surprise as Apple opted not to hold two fall events last year and all signs pointed to the iPhone 7 event last month being the last before Apple moves into its new campus next year. Mac hardware is due for a refresh, however, and recent reports have insisted Apple is planning to unveil its new computing hardware in October. Recode first reported the date for the event before it went official.\nAs for what we expect, the whole Mac lineup is due for a refresh aside from the 12-inch Retina MacBook which saw its second version earlier this year. That includes MacBook Airs if the line moves forward, MacBook Pros which are expected to get a significant redesign, iMac desktops, Mac mini desktops, and Mac Pro desktops.\nWhile some Macs are older than others, not all Macs are expected to be refreshed or overhauled at the upcoming event. Mac minis and Mac Pros for example will likely not see a change although it’s possible considering how long the current models have been available (especially in the case of the Mac Pro).\nApple may also introduce a new monitor solution after discontinuing its Thunderbolt Display earlier this year. Mac users have wanted a standalone Retina display like that of the iMac desktop line. Apple’s recent standalone displays have featured 27-inch monitors which would suggest a 5K screen that could be quite pricey. Apple’s AirPort networking hardware could also see a refresh based on shelf life.\nRead 9to5Mac‘s full roundup of what to expect at Apple’s October 27 event here and tell us what you plan to purchase here. Apple is also set to reveal their latest quarterly earnings results two days before the event.\nApple Mac invites are out! Next Thursday will be my MacBook Air’s last day trip to Cupertino FOREVER! pic.twitter.com/w0T5YxswMC — Joanna Stern (@JoannaStern) October 19, 2016\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.09557785317301751
    },
    "article_3": {
        "title": "Former NSA staffer demonstrates Mac malware that can tap into live webcam and mic feeds",
        "body": "Security researcher and former NSA staffer Patrick Wardle is this afternoon demonstrating a way for Mac malware to tap into live feeds from the built-in webcam and microphone. His presentation is being delivered at the Virus Bulletin conference in Denver later today.\nAlthough any unauthorized access to the webcam will light the green LED – a firmware-level protection that is exceedingly difficult to bypass – Wardle’s presentation shows how a malicious app can tap into the outgoing feed of an existing webcam session, like a FaceTime or Skype call, where the light would already be on …\nWardle was the researcher who previously uncovered a way for malware to bypass Gatekeeper protection to run unsigned apps, as well as pointing out a flaw in Apple’s fix for the Rootpipe vulnerability that allowed an attacker with local access to a Mac to escalate their privileges to root.\nThe paper is entitled Getting Duped: Piggybacking on Webcam Streams for Surreptitious Recordings.\nAfter examining various ‘webcam-aware’ OS X malware samples, the research will show a new ‘attack’ that would allow such malware to stealthily monitor the system for legitimate user-initiated video sessions, then surreptitious piggyback into this in order to covertly record the session. As there are no visible indications of this malicious activity (as the LED light is already on), the malware can record both audio and video without fear of detection.\nWardle has created an app that monitors webcam and microphone activity, and will alert you when a new process accesses either. A pop-up will alert you, advise the name of the process and ask whether you want to allow or block access.\nThe app, called Oversight, is a free download from Wardle’s website, objective-see.com.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.5257698609917001
    },
    "article_4": {
        "title": "Images of New MacBook Pro With Magic Toolbar Leaked in macOS Sierra 10.12.1",
        "body": "macOS Sierra 10.12.1, released yesterday, includes hidden Apple Pay images that depict the brand new MacBook Pro with an OLED touch panel that's set to be announced by Apple on Thursday, October 27.\nIn addition to confirming that such a product is in the works, the images give us our first full look at the redesigned MacBook Pro ahead of its launch. An OLED touch panel is located on top of the keyboard, where the function keys would normally be placed, and it very clearly supports Touch ID, as it is seen used with Apple Pay.\nAs has been rumored, the touch panel, which may be called the \"Magic Toolbar,\" appears to be contextual, changing based on what's on the screen. In the images, Apple Pay dialog is depicted, asking a customer to confirm a purchase with a finger on the panel. It appears Touch ID is built into a nearly-invisible power button located next to the display.\nAside from the OLED touch panel, the new MacBook Pro looks similar in design to the existing models. It looks like the 13-inch MacBook Pro is used in the images, suggesting the machine will gain speakers located at the side of the keyboard.\nThickness can't be determined from the orientation of the MacBook Pro in the images, but rumors suggest the new machine is thinner and lighter weight than existing models. A redesigned hinge can be seen in the images, suggesting it is indeed quite a bit thinner. Also visible are much flatter keys, similar in design to the keys of the Retina MacBook, which use a new butterfly mechanism.\nPorts are not visible, but based on past part leaks, we're expecting four USB-C ports and a headphone jack, with the HDMI port, MagSafe port, and SD card slot being eliminated.\nApple will announce the new MacBook Pro on Thursday, October 27 at 10:00 a.m. A new MacBook Air model is also expected, and new iMacs are a possibility. MacRumors will provide live coverage of the event both on MacRumors.com and on the MacRumorsLive Twitter account.\n(Thanks, Richard!)",
        "sentiment": -0.10286280487974485
    },
    "article_5": {
        "title": "Apple's October 27th event is reportedly all about laptops",
        "body": "We hope you weren't expecting a new iMac or Mac Pro at Apple's \"Hello Again\" event... you might be disappointed. KGI Securities analyst Ming-Chi Kuo (who has a mostly good track record for Apple rumors) now expects that the October 27th media gathering will focus solely on MacBooks. The highlight would be a long-rumored MacBook Pro redesign with USB-C ports and OLED touch strips. They would use Intel's Skylake-based processors, he says (what, no Kaby Lake?), but they'd get longer battery life, up to a 2TB solid-state drive and a possible \"MagSafe-like\" power adapter from either Apple or a third party.\nAnd those rumors of a refreshed MacBook Air? They're on the right track, if you ask Kuo, but it's not clear that you'll get the same ultraportable with a few tweaks. He simply says that there will be a \"13-inch MacBook\" -- it could be a slightly larger, hopefully more capable version of the 12-inch MacBook you've known since 2015. While there could be a spruced-up Air (particularly if Apple wants to court the sub-$1,000 crowd), it seems unlikely that Apple would reserve stage time for an update minor enough that it could be covered by a press release.\nEveryone else would have to be patient. Kuo believes that new iMacs and a stand-alone 5K display are in the cards, but not until closer to the middle of 2017. There's no mention of Mac mini or Mac Pro updates, either, although those could conceivably arrive without taking up any event time. Whatever happens, the absence of desktops would make sense. Intel isn't releasing desktop Kaby Lake processors until January -- Apple can't use chips that aren't ready yet. If MacBooks are all you see, though, it'll still show that Apple hasn't forgotten its original business.",
        "sentiment": -0.38575667068362235
    },
    "article_6": {
        "title": "Apple Releases iOS 10.1 With New Portrait Mode for iPhone 7 Plus",
        "body": "Apple today released iOS 10.1 to the public, marking the first major update to the iOS 10 operating system that launched on September 13. In testing since September 21, iOS 10.1 saw Apple release five betas to developers and public beta testers before its public debut.\nToday's iOS 10.1 update is available as a free over-the-air update for all iOS 10 users. It is the third update to iOS 10, following iOS 10.0.3, a minor bug fix update.\niOS 10.1 introduces a new \"Portrait\" mode, designed to take advantage of the two cameras included in the iPhone 7 Plus, released in September. Portrait mode uses the wide-angle and telephoto lenses in the iPhone 7 Plus to create shallow depth of field portrait photos with blurred backgrounds.\nTo achieve the blurred look, the image signal processor in the device uses the wide-angle camera to create a depth map while the telephoto captures an image, dissecting the different layers of the photo to decide what to blur with an artful \"bokeh\" effect. It works on people, pets, and objects, but it does require good lighting to achieve the proper results.\nThe update also offers a long list of bug fixes and other under-the-hood improvements to address many problems that have been uncovered since iOS 10 was released, and it also brings Transit directions to Japan for the first time.\nThere have been some tweaks to the Messages app. It's now possible to play Bubble and Screen effects in Messages with Reduce Motion enabled, something that wasn't previously possible. There's also a new option to replay Bubble and Screen effects. A full list of changes is available below:\nCamera and Photos\n- Introduces Portrait Camera for iPhone 7 Plus that creates a depth effect that keeps your subject sharp while creating a beautifully blurred background (beta)\n- People names in the Photos app are saved in iCloud backups\n- Improved the display of wide color gamut photos in the grid views of the Photos app\n- Fixes an issue where opening the Camera app would show a blurred or flashing screen for some users\n- Fixes an issue that caused Photos to quit for some users when turning on iCloud Photo Library Maps\n- Transit support for every major train, subway, ferry, and national bus line, as well as local bus systems for Tokyo, Osaka, and Nagoya\n- Sign-based transit navigation including layouts of all underground structures and walkways that connect large transit stations\n- Transit fare comparison when viewing alternative transit routes Messages\n- New option to replay bubble and full screen effects\n- Messages effects can play with Reduce Motion enabled\n- Fixes an issue that could lead to contact names appearing incorrectly in Messages\n- Addresses an issue where Messages could open to a white screen\n- Addresses an issue that could prevent the report junk option from displaying with unknown senders\n- Fixes an issue where videos captured and sent in the Messages app could be missing audio Apple Watch\n- Adds distance and average pace to workout summaries in the Activity app for outdoor wheelchair run pace and outdoor wheelchair walk pace\n- Fixes issues that may have prevented Music playlists from syncing to Apple Watch\n- Addresses an issue that was preventing invitations and data to appear in Activity Sharing\n- Fixes an issue that was allowing Activity Sharing to update over cellular when manually disabled\n- Resolves an issue that was causing some third-party apps to crash when inputting text Other improvements and fixes\n- Improves Bluetooth connectivity with 3rd party accessories\n- Improves AirPlay Mirroring performance when waking a device from sleep\n- Fixes an issue where playback would not work for iTunes purchased content when the \"Show iTunes Purchases\" setting is turned off\n- Fixes an issue where certain selfie apps and face filters used with the FaceTime HD camera on iPhone 7 and iPhone 7 Plus did not display a live preview\n- Fixes an issue in Health where individual strokes are converted to separate characters when using the Chinese handwriting keyboard\n- Improves performance of sharing websites from Safari to Messages\n- Fixes an issue in Safari that caused web previews in tab view to not display correctly\n- Fixes an issue that caused certain Mail messages to be reformatted with very small text\n- Fixes an issue that caused some HTML email to be formatted incorrectly\n- Fixes an issue that in some cases caused the search field to disappear in Mail\n- Fixes an issue that could prevent Today View Widgets from updating when launched\n- Fixes an issue where Weather widget sometimes failed to load data\n- Fixes an issue on iPhone 7 where Home Button click settings would not appear in search results\n- Fixes an issue that prevented spam alert extensions from blocking calls\n- Resolves an issue that could prevent alarm sounds from going off\n- Fixes an issue where audio playback via Bluetooth would cause the Taptic engine to stop providing feedback for some users\n- Resolves an issue preventing some users from restoring from iCloud Backup\niOS 10 has been described by Apple as the \"biggest release ever\" for iOS users, with features that include a redesigned Lock screen, a Siri SDK to allow third-party apps to integrate with Siri, and a completely overhauled Messages app with stickers, a full App Store, Digital Touch, Bubble Effects, and more.\nUpdate: Today's update also fixes pairing issues some Android Wear users were having with the iPhone 7 and 7 Plus.",
        "sentiment": 0.013766852766275406
    },
    "article_7": {
        "title": "Apple: Dash developer had two accounts, 25 apps, and almost a thousand fraudulent reviews",
        "body": "Dash, a popular developer tool for offline documentation reading and code snippet handling, was recently removed from the App Store. Moreover, the developer account was terminated. In a statement to iMore, Apple explained:\n\"Almost 1,000 fraudulent reviews were detected across two accounts and 25 apps for this developer so we removed their apps and accounts from the App Store,\" an Apple spokesperson told iMore. \"Warning was given in advance of the termination and attempts were made to resolve the issue with the developer but they were unsuccessful. We will terminate developer accounts for ratings and review fraud, including actions designed to hurt other developers. This is a responsibility that we take very seriously, on behalf of all of our customers and developers.\"\nMy understanding is that the reviews included fraudulent positive reviews for their own apps and negative reviews for competing apps. That's something the App Store simply can't ignore.\nDidn't the developer claim they'd never engaged in review fraud?\nYes, from the Kapeli blog:\nEarlier today, Apple cancelled my developer account and has removed Dash from the App Store.Update: Apple contacted me and told me they found evidence of App Store review manipulation. This is something I've never done.Apple's decision is final and can't be appealed.\nSee also the update, above.\nCould this be some one-off error or just some big mistake?\nApple clearly doesn't think so. In situations like this, the App Store team communicates with the developer both prior to any app being removed, and after any app has been removed.\nThat's following an in-depth investigation by the App Store fraud team, sometimes spanning months or even years. They look for patterns of suspicious activity over time and only act once they're convinced of wrong-doing\nIt's not something they take lightly, but something they believe is essential to maintaining the integrity of the system.\nIs there really \"no appeal\"?\nApple's not a court of law, so \"no appeal\" isn't really something that makes sense. There have been numerous cases where Apple has reassessed and reversed decisions in the past, and no doubt there will be again.\nThey're human beings behind the desks. Given that Apple \"often\" terminates the accounts and removes the apps of bad actors, and it seldom makes headlines, my guess is that their error rate is extremely low. Likewise, if this happens as often as it sounds like it does, the procedure probably allows for few false positives.\nIt also seems like developers are given every chance to make things right in these situations: Get clean slates or open new accounts, make sure they're squeaky-clean, and go on about their business.\nCouldn't a bad actor frame another developer for review fraud?\nThis concept — that one bad developer could arrange for false reviews for a competing developer and get them banned from the App Store as a result — has been generating a lot of stress in the community.\nMy understanding is that the chances of that happening are virtually zero.\nThe iTunes fraud team follows these kinds of situations over time — weeks, months, and years — and iTunes is in contact with the developer before any action is taken. Even then, it sounds like every developer is given every benefit of every doubt, both before and after removal.\nWhy isn't Apple more transparent about the process?\nMy guess is that Apple was hoping to work this out with the developer and not have to resort to making a public statement.\nAs to the process itself, fraud detection doesn't work if the fraudsters know what you're trying to detect.\nBut Apple's sure they're right about this?\nThat's absolutely what it sounds like.\nAccording to 9to5Mac, Apple's head of App Store, Phil Schiller, said just that in response to an email:\nI am told this app was removed due to repeated fraudulent activity.We often terminate developer accounts for ratings and review fraud, including actions designed to hurt other developers. This is a responsibility that we take very seriously, on behalf of all of our customers and developers.\nThat kind of email doesn't get sent, to anybody, nor does the statement up top get issued, without everything being triple checked. At a minimum.\nSo, what's the takeaway here?\nAbsent information from Apple, and in the face of denials from the developer, the community couldn't understand what was happening or why.\nSome might think Apple deserves the benefit of the doubt, but what Apple — and any platform owner — deserves is the benefit of scrutiny.\nApp Store has to be a place where developers feel protected, both from and by Apple.\nIn this case, many theories were proposed, including that the developer might have had multiple accounts. That's what seems to be the case.\nApple has put their cards on the table. Now it's the developer's turn. The community deserves the best from everyone.\nThere is! Since the original story was published, the second developer account and the rest of the apps have been identified. They can be seen listed, in at least one case alongside Dash, on App Shopper and Software\nDid the developer respond?\nYup! Kapeli, has issued a follow-up statement:\nWhat I've done: 3-4 years ago I helped a relative get started by paying for her Apple's Developer Program Membership using my credit card. I also handed her test hardware that I no longer needed. From then on those accounts were linked in the eyes of Apple. Once that account was involved with review manipulation, my account was closed.I was not aware my account was linked to another until Apple contacted me Friday, 2 days after closing my account. I was never notified of any kind of wrongdoing before my account was terminated.\nThis has all caused community sentiment to ricochet back and forth between the two. That's because the internet is terrible at nuance. Understanding that two things might both be true at the same time, or that two things might both be wrong at same time seems next to impossible. It requires perspective taking, and that's hard.\nSo, a case of \"Apple Said\" / \"Developer Said\"?\nApple firmly believes two accounts, linked together by common credit card, bank account, developer ID login, and bundle ID, committed ongoing review fraud on the App Store and, despite doing everything they could to settle the matter in a way that gave the developer every benefit of the doubt, they were stonewalled until they felt they had no other choice than to release a statement.\nThe developers believes that, despite having set up the second account, he bears no responsibility for how that account was used, never heard from Apple before his primary account was suspended, went public with his frustration, was working on a blog post to get back on the App Store, and was then blindsided by Apple going public with a statement, and so released a second statement plus a recording of a conversation with World Wide Developer Relations.\nThat phone call, though!\nIndeed. The phone call posted by the developer is problematic for both sides. Taken one way, the rep was admitting no one contacted the developer and was trying to get them to absolve Apple of guilt in an attempt to cover their ass and cover up a mistake.\nTaken another way, the rep was doing everything possible to try and deescalate the situation and help a developer who would take no responsibility help himself back onto the App Store.\nThe rep could very easily have responded with: \"Your card, your bank, your ID, your bundle — claiming zero responsibility is absurd, enjoy your revocation,\" and then deserved much of the scorn thrown his way.\nThe dev could very easily have responded with: \"Ugh, my cousin. I'll have a word and make sure it stops, and that my name gets off that account!\" and he might already be back on the store.\nIt sounds like Apple believes beyond a reasonable doubt that their actions were justified, and the developer feels that he absolutely bears no responsibility for the second account.\nSo, Apple's right, the developer's right, or they're both right but neither can see it from the other's perspective.\nHow did it all fall apart?\nThat's what's less understandable. Who's idea was the blog post? The developer says Apple's, but I've heard the opposite as well. If Apple was really working to get this swept under the rug, why would they want a blog post? If they wanted a blog post, why would they go to the press?\nIf the developer sent the blog post draft, why wasn't that the end of it? And if the developer was willing to post the phone call, why not post the blog to show it was written and what it contained?\nThe part I keep coming back to though, is this, from Kapeli:\nI did nothing wrong.\nEverything else aside, an App Store account that's tied to the same credit card, bank account, Apple ID, and bundle ID committing fraud to the degree that it gets shut down requires at least several major things being done wrong.\nSo who should we believe?\nUnfortunately, when all you want to do is save face, no one can save the situation. I could guess what happened here, and quote Marcellus Wallace on pride, but that's all it would be — a guess.\nHere's hoping Dash, absent the other account, still gets back on the App Store. Forget Apple or the developers, it's what's best for their shared customers.",
        "sentiment": -0.4151703454554081
    },
    "article_8": {
        "title": "Report: New MacBook Pros still coming this month w/ USB-C &amp; no MagSafe, 11-inch Air to be discontinued",
        "body": "Just as doubt was beginning to surround whether or not Apple was still on track to release new MacBook Pros this month, a new report from Macotakara this evening brings some reassurance. The report claims that Apple will still announce and release a new lineup of MacBook Pros this month, and offers up some details…\nAccording to the report, which cites a “reliable Chinese supplier,” Apple plans to both announce the new MacBook Pro this month, as well as to ship it to retailers. Like has been rumored in the past, the new MacBook Pros are expected to feature support for USB-C and Thunderbolt 3. As for other ports, though, Apple is said to be ditching support for traditional USB ports, as well as for MagSafe and Thunderbolt 2.\nFurthermore, this evening’s report claims that Apple plans to discontinue the 11-inch MacBook Air model, though it will keep the 13-inch model on the market. There has been doubt surrounding the fate of the MacBook Air lineup since the introduction of the 12-inch MacBook, but Apple reportedly wants to simply direct its attention to the 13-inch Air, not the 11-inch variant. The 11-inch MacBook Air is expected to be discontinued when the new MacBook Pros are announced.\nSpecific dates are still up in the air as far as announcement and release, but they are still on track to happen this month. In addition to the port changes, Apple is also expected to introduce an OLED touch bar with the new MacBook Pros, as well as bring a thinner design.\nThe MacBook Pro lineup is long overdue for an update so the announcement will surely be met with fanfare from users (myself included). An October date has been rumored for awhile, but as we progressed later into the month, some were starting to speculate that Apple had pushed the release into 2017.\nWhen Apple does announce a date for an event, we’ll have that news for you as soon as it happens. While anything is possible, the date of October 27th has been rumored in the past. Nevertheless, we should expect an invite to go out sooner rather than later…\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.11126649715006351
    },
    "article_9": {
        "title": "Civilization VI comes to the Mac just three days after its PC release, available on Steam for $60",
        "body": "There’s a certain stigma that surrounds Mac gaming, but Aspyr today is proving that stigma wrong. The company announced this evening that Civilization VI is now available for the Mac, just three days after its release on the PC. Civilization VI is the latest installment in Sid Meier’s popular Civilization series and builds upon the improvements in Civilization V and its expansions.\nCivilization VI was designed by the same team that made the previous iteration of the hit game and features gameplay that fans will recognize from the start. Aspyr says that many improvements come with the new version of Civilization, inlacing ones to AI empire building, multiplayer, and much more:\nCivilization VI offers new ways to engage with your world: cities now physically expand across the map, active research in technology and culture unlocks new potential, and competing leaders will pursue their own agendas based on their historical traits as you race for one of five ways to achieve victory in the game.\nAs you would expect, Aspyr has laid out some system requirements to get the best experience when playing Civilization VI, including an Intel Core i5 2.7GHz processor paired with 6GB of RAM and 15GB of storage space. In terms of graphics power, Aspyr recommends at least a Radeon HD 6790, Nvidia GeForce 775M, or Intel Iris Pro graphics card with 1GB VRam.\nCurrently, Civilization VI is available exclusively on Steam, but Aspyr says it plans to bring the game to the Mac App Store “soon.”\nIn the meantime, the standard version of Civilization VI can be had on Steam for $59.99, while a Digital Deluxe version is also listed for $79.99.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.29986293241381645
    },
    "article_10": {
        "title": "Apple removing security tethers from iPhone display models in store",
        "body": "Apple revamped its retail stores last year by removing iPad smart signage and demoting iPod display models to side shelves, and now the company has another move up its sleeves in a push towards simplicity.\niPhone display models docked with only Lightning charging cables in Toronto\nOver the past few months, Apple has removed security tethers from iPhone display models at some of its retail stores, including its Yorkdale location in Toronto, Canada and redesigned Regent Street store in London, England.\nMacRumors has learned of at least two other stores in the United Kingdom where the security tethers, which activate audible alarms when disconnected, have been removed, and it appears likely the change will be phased in at other locations.\nThe courageous move effectively allows customers to walk into an Apple retail store, pick up an iPhone display model, and walk out with the device without paying, but Apple evidently feels the untethered experience is worth the risk.\niPhone display models with security tethers (Image: Mirror.co.uk\nApple says this is to allow people to hold them properly, try cases on them and even see how they feel in your pocket. It's a bold move, especially given the lack of visible security in the building. We couldn't spot a single CCTV camera, although any phone taken out of the store will set off an alarm. If not returned, the phones will also be rendered unusable.\nAs CNET explains, Apple wants customers to be able to hold an iPhone properly, try out cases, and even pocket the device:\nThe customers who do attempt to steal iPhone display models, if not caught by security or CCTV cameras where installed, will walk away with unusable devices, as Apple will place them into Lost Mode remotely using Find My iPhone.\nApple continues to use security tethers on larger products such as MacBook and iPad display models.\n(Thanks, Peter!)",
        "sentiment": 0.13413082937208506
    },
    "article_11": {
        "title": "The iPhone 7 and iPhone 7 Plus Review: Iterating on a Flagship",
        "body": "The iPhone 6 was a runaway success by any measure. The A8 SoC may have been built on a temperamental 20nm process – something that dogged all other phone vendors – but for Apple it didn’t matter. The iPhone 6 was the first iPhone generation with a phablet variant. By all metrics it was a resounding success as it capitalized on this pent-up demand for larger iPhones.\nThe iPhone 6s continued this success, and in a year of disappointing launches due to the weak showing of the widely used Snapdragon 808 and 810, the 6s and 6s Plus looked particularly good as the competition really couldn’t measure up. There were a lot of Android devices that performed better than the iPhone 6s/6s Plus in some particular area – a better camera or longer battery life, for example – but taken as a whole the iPhones 6s were just clearly superior devices. If nothing else, they hit that particular balance between features and performance that a lot of users were looking for.\nMeanwhile, the addition of 3D Touch was the sort of refinement to the user experience that still remains exclusive to the iPhone. Other OEMs have implemented some form of force sensing, but the implementation is not really executed in a way to improve user experience in a noticeable way. Adoption remained weak as well, with no real widespread support in the ecosystem for such features.\nThat said, the iPhone doesn't exist in a vacuum on its own. Even in the high-end market segment Apple limits themselves to, they have a loyal opposition, and that opposition is of course Samsung. Looking at the state of affairs there, relative to the iPhone 6s the Galaxy S6 had a better camera for still images, but it was obvious that it couldn’t freeze motion as well. The phone itself felt like a brick despite its 6.8mm thickness due to the relatively enormous battery. Despite the larger battery, battery life on LTE just wasn’t where it needed to be. The Galaxy Note5 was in many ways a similar story, which isn't too surprising as the Note has moved closer and closer to being a phablet-version of the Galaxy S.\nBut, as the story goes, Apple's competition has improved and advanced. The Galaxy S6 gave way to the even better Galaxy S7, HTC finally found their groove with the HTC 10, and OnePlus's 3 is their best showing yet. The competition is getting better, and with the iPhone 7, Apple can no longer rely on weak competition or pent-up demand for some major feature. The iPhone 7 must stand by its merits against this increasingly stiff competition.\nIt’s interesting to write a review like this, because for better or worse, I didn't have serious exposure to the iPhone from the beginning. When the first iPhone launched in 2007, I was in school and still used a flip phone that spent most of its time functioning as an alarm and a timer and not much else. My first exposure to the iPhone was the 3GS a few years later, which left a fairly poor taste in my mouth as it just didn’t feel all that functional. The iPhone 4 was miles better, but even then it felt like the experience was constrained. Something as simple as turn by turn navigation which I took for a given on Android devices like the Galaxy S1/Captivate and the Desire HD/Inspire 4G were basically absent on iOS unless you were willing to pay a significant amount of money for a third party application. The default maps application didn’t offer that kind of functionality and Google Maps was completely absent, as was YouTube. For better or worse, for years after this initial brush with iOS I stuck with Android devices. It wasn’t until iOS 8 and the iPhone 5s that I really started doing any kind of examination of iOS devices again.\nReviews are normally no place to be discussing one's life story, because realistically no one reading this review really cares about the person writing this review. But the perspective here matters when considering the approach I've taken to this review. I’ve spent the past two years using the iPhone 6 as a secondary phone so I’m increasingly aware of how iOS works, but even as good as the iPhone 6/6s series were, Android devices remain my daily driver for familiarity reasons. It’s easy to overlook flaws in Android devices if you never actually have to use them as a daily driver, so this review attempts to avoid the common issue of a double standard for reviews between Android and iOS devices. With that said, we can move on to the basic specs.\nApple iPhone 7 and 7 Plus Apple iPhone 7 Apple iPhone 7 Plus Apple iPhone 6s Apple iPhone 6s Plus SoC Apple A10 Fusion\n2 x 2.3 GHz Hurricane\n2x little cores Apple A9\n2 x 1.85GHz Apple Twister GPU 6 Core PowerVR GPU PowerVR GT7600 Display 4.7-inch 1334 x 750 IPS LCD, DCI-P3 5.5-inch 1920 x 1080 IPS LCD, DCI-P3 4.7-inch 1334 x 750 IPS LCD, sRGB 5.5-inch 1920 x 1080 IPS LCD, sRGB Size / Mass 138.3 x 67.1 x 7.1 mm, 138 grams 158.2 x 77.9 x 7.3 mm, 188 grams 138.3 x 67.1 x 7.1 mm, 143 grams 158.2 x 77.9 x 7.3mm, 192 grams Battery 1960 mAh\n(7.55Whr) 2900 mAh\n(11.17Whr) 1715 mAh\n(6.6Whr) 2750 mAh\n(10.59Whr) Rear Cameras 12MP ƒ/1.8\nOIS, Wide Color Gamut, Quad LED True Tone Flash 12MP ƒ/1.8 wide angle,\nOIS, Wide Color Gamut, Quad LED True Tone Flash\n12MP ƒ/2.8 telephoto,\n2x optical zoom, Wide Color Gamut, Quad LED True Tone Flash 12MP with 1.22µm pixels + True Tone Flash 12MP with 1.22µm pixels + True Tone Flash + OIS Front Camera 7MP ƒ/2.2, Wide Color Gamut, Retina Flash 7MP ƒ/2.2, Wide Color Gamut, Retina Flash 5MP F/2.2 +\nRetina Flash 5MP F/2.2 +\nRetina Flash Storage 32GB/128GB/256GB 16GB/64GB/128GB (Launch)\n32GB/128GB (Refresh) I/O Apple Lightning connector Apple Lightning connector, 3.5mm headset WiFi 2.4/5GHz 2x2 802.11a/b/g/n/ac, BT 4.2, NFC 2.4/5GHz 2x2 802.11a/b/g/n/ac, BT 4.2, NFC Launch Price $649/749/849 32/128/256GB $769/869/969 32/128/256GB $649/749/849 16/64/128GB $749/849/949 16GB/64/128GB\nLooking at the basics, the iPhone 7 and 7 Plus bring at least a few new things to the table that we haven't seen from Apple before, such as their first SoC with heterogeneous CPU cores. The iPhone 7 Plus brings a second camera with a full-frame equivalent focal length of 56mm, which isn't really a unique idea but does represent a unique execution, as the G5's second camera has an even shorter focal length. There's some irony here as Corephotonics and Qualcomm have been demonstrating almost the same implementation as what we see in the iPhone 7 Plus, but Apple is the first to market here. IP67 means the iPhone is impervious to dust and is capable of sustaining 1 m of water depth for at least 30 minutes, but water damage is never covered by warranty so you shouldn't push your luck here. Other changes here are more subtle such as the quad LED flash with PWM compensation, stereo speakers, and doubling the storage for all models relative to the 6s last year.\nFinally, on a quick housekeeping note before we get started, I want to mention that we’ve changed our review format a bit this year compared to past reviews. Because our analysis on a few deep-dive items is going to take a bit longer – both the new low power CPU cores of the A10 Fusion SoC and wide color gamut of the new cameras present us with some particularly interesting scenarios – rather than hold everything back we’ve split things up. Today’s review of the iPhone 7 is just that, a review of the phone. Meanwhile we’ll be publishing a deep dive article later this month on A10, Hurricane, A10’s GPU, wide color gamut photography, and the rest of those fine architectural details that we like to dig into.\nDesign\nTo start the examination of the iPhone 7 and 7 Plus beyond bullet points on a spec sheet, we can look at the design of the iPhone 7. It’s easy to take a potshot here and claim that the iPhone 7 and iPhone 6 have identical designs, but the design is different enough that you can identify either the iPhone 7 or 7 Plus from a distance if you can see the camera or back cover in general. However, if you can only see the front of the phone it’s not going to be easy to tell the iPhone 6 and 7 apart. Just about the only differentiating feature here is that the new earpiece is now slightly wider. We seem to receive requests for continued comparison of design details, and here the iPhone doesn’t have any obvious issues. The ambient light sensor appears to bisect the earpiece, while the front-facing camera is lined up with the earpiece.\nWhat is noticeable if you use the phone is the new solid state home button. While there is a new Taptic Engine to enable this home button, it does take getting used to as the home button is not a one-to-one replica of a physical home button as far as the haptic sensation goes. The Taptic Engine manages to create a facsimile of what a home button should feel like but unlike a real button it doesn't actually depress so it isn't quite as accurate as something like the Macbook trackpad in replicating the feel of a real button.\nFrom there, the iPhone 7 and 7 Plus see some notable changes to the back and sides of the phone. While the buttons, downward firing speaker, and Lightning port remain in the same place, the 3.5mm jack has been removed. There’s been a lot of discussion here but after trying some pre-production AirPods I think it’s fairly safe to say that wireless is the future for any kind of mobile device, but the execution itself requires closer examination here that doesn’t necessarily fit into this part of the review. The one notable change here is to the SIM tray, which appears to have some kind of gasket to seal it against water and dust ingress.\nLooking at the back of the phone you really see most of the design changes. I’ve noticed a lot of people seem to believe that there's nothing notably different about this kind of back cover design, but it seems that a lot of this boils down to some similarities in shape and the use of aluminum. I would argue that aluminum alone doesn't define industrial design, as the One M7 and iPhone in all iterations don't really share much in common. Similarly, I would argue that the Honor 8 and Galaxy Note7 don't share a lot in industrial design just because both use tempered glass back covers along with an aluminum frame. Of course, if material changes are the only thing that matter then the jet black variant of both the iPhone 7 and 7 Plus have a notably different design for this color variant alone, which has a glossy anodized finish instead of a sand-blasted one.\nPutting aside discussions of materials, the iPhone 7 and 7 Plus both have distinctive changes to the antenna lines and the camera hump. While the iPhone 6 and 6s really tried to avoid showing a camera hump at all, the iPhone 7 and 7 Plus have distinct designs that highlight its presence even if the profile of the hump has been changed to make the difference in thickness less dramatic. The iPhone 7 also has a noticeably larger cover lens, but this isn't all that noticeable unless you have the iPhone 6 and 7 side by side. The iPhone 7 Plus on the other hand has a distinctly different camera design as the dual cameras are very obviously a point of differentiation compared to the iPhone 6 and 6s Plus.\nThe other noticeable difference is how the back cover integrates the external antennas. The use of parts of an aluminum unibody as an antenna isn't a new idea and dates as far back as the iPhone 4. However, the polycarbonate lines that help to separate the antenna from the rest of the back cover have been moved around to make them less noticeable. The jet black variant has especially close color and texture matching, which makes the antenna lines basically invisible. It's interesting to see how various OEMs have attempted to avoid or not avoid the issue of hiding these antenna lines, as Apple's approach here is fairly unique as far as I can tell. The jet black variant also helps to make the entire phone look like a monolith. The in-hand feel is distinguished in the sense that it's glossy all around instead of the traditional matte finish that is used in aluminum unibodies but really it almost just feels as if it's made of glass and is very smudge-prone even with the oleophobic coating and can easily scratch compared to something like glass.\nApple has also made new leather cases to fit the iPhone 7 and 7 Plus. The general design and feel isn't changed significantly, but the buttons are now made out of aluminum which improves the feel of them significantly to the extent that I don't feel like I'm losing anything in feel relative to the naked phone. This helps to differentiate them relative to third party cases, particularly as the cost is generally much higher than the average case you might find on Amazon. In general the design is also well executed for a slim case as the camera hump isn't exposed and the display is recessed a bit to avoid direct contact in a drop.\nOverall, the design of the iPhone 7 and 7 Plus is mostly an evolution of the iPhone 6's design, but it changes enough things that it doesn't necessarily feel like it's the same exact thing. I would say that it isn't quite as dramatic as the change from the One M9 to the HTC 10 but it is more noticeable than something like the change from the S6 edge+ to the Note7. The in-hand feel remains good and there are no noticeable problems there. I don't think that the design is especially notable at this point, but there are only so many ways to make a phone.",
        "sentiment": -0.009984271600842476
    },
    "article_12": {
        "title": "iPhone 7 handily outperforms Google Pixel in early benchmarks",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nThe Google Pixel phone officially revealed on Tuesday wasn't a well-kept a secret prior to release, and as a result there are a large number of benchmarks available. They show the phone's raw performance lags far behind that of the iPhone 7, and is even defeated in single-core performance by the iPhone 6s and iPhone SE.\nEarly benchmarks for the Pixel and Pixel XL phones in Geekbench 4 have come in at around 4100 for multiple core performance, and 1580 for single core, consistent with the earliest numbers claimed to be for the phone from mid-September.\nIn contrast, the Apple iPhone 7 link textmultiple core score is around 5600 regardless of model, with a single core score of around 3430.\nFor comparison, the iPhone 6s Plus has a multiple core benchmark of 4106, and a single core rating of 2508.\nThe processor in the Pixel XL is said to be running at the lower of the two speeds indicated by Google's technical specifications. However, the clock speed for the iPhone 7 was misidentified early on as well as a lower frequency than it actually peaks, so the benchmarks are thought to be accurate.\nIf the benchmarks are in fact measuring the slower of the two processors, a mathematical correction of the benchmarks in accordance with the faster processor still has the iPhone 7 beating the Pixel handily in both single and multiple core measurements.\nWhile benchmarks aren't a perfect representation of day-to-day speed, nor do they measure user interface elements well, they are useful for comparison of the raw processing power between two pieces of computing hardware.\nBoth models of the Google Pixel revealed on Tuesday use a Snapdragon 821 CPU with two cores running at 2.15GHz, and two running at 1.6 GHz. The phone has 4 gigabytes of application RAM.",
        "sentiment": 0.011800851672887802
    },
    "article_13": {
        "title": "Apple Now Lets iOS Developers Distribute Promo Codes For In-App Purchases",
        "body": "After allowing promo codes for paid apps, Apple now makes promo codes for in-app purchases available too.\nOn Friday, Oct. 28, Apple announced that developers can now give away in-app purchases promo codes from iTune Connect to press and influencers. The promo codes allow developers to grant early access to their app's in-app purchases, which is a good promotional scheme.\nHowever, there is a limit. Developers will only be able to hand out a hundred promo codes for every in-app purchase item and a thousand for every app. This will reset every Jan. 1 and July 1, according to Apple's FAQ page.\nPromo codes will only be valid for 28 days, starting from the day on which they were generated.\nHow Developers Can Request Promo Codes\nDevelopers can request promo codes from the Features section of \"My Apps.\" An admin, app manager or marketer role is required to put forth requests.\nMoreover, promo codes for the latest app versions can also be requested provided that it was approved by Apple and carries the \"Pending Developer Release\" or \"Ready for Sale\" status.\nPromo Codes For Auto-Renewable Subscriptions\nApple is also granting promo codes for auto-renewable subscriptions, which customers can use as long as they're not current subscribers. Using promo codes, even for auto-renewable subscriptions, won't automatically prompt a renewal, which is a good thing for those who are handed out codes.\nDevelopers should bear in mind, though, that when subscriptions are availed of through promo codes, they will not count for the one year of paid service that entitles developers to collect 85 percent of the subscription price.\nNote that Apple introduced a new business model earlier this year in which developers could take 85 percent of the subscription revenue granted that a subscriber racks up a year of paid service, which is 15 percentage points higher than the previous 70/30 split between the developer and Apple. Of course, applicable taxes are deducted.\nHow To Redeem Promo Codes\nSubscribers can redeem promo codes using a number of devices. For Mac and PC, they need to head over to the iTunes Store, click on \"Redeem,\" enter their credentials and input the code thereafter.\nThose using an iPhone, iPad or iPod touch need to access the \"Featured\" section after opening the App store. From there, they need to scroll down to the bottom and find \"Redeem.\" It will require the user's credentials before the promo code can be entered.\n\"For in-app purchase promo codes, the app will automatically download if the app is free and not currently installed on the customer's device. If the app is paid, customers will need to download the app in order to redeem the in-app purchase,\" says Apple.\nⓒ 2022 TECHTIMES.com All rights reserved. Do not reproduce without permission.",
        "sentiment": -0.24716844282542857
    },
    "article_14": {
        "title": "Why Tim Cook is Steve Ballmer",
        "body": "What happens to a company when a visionary CEO is gone? Most often, innovation dies and the company coasts for years on momentum and its brand. Rarely does it regain its former glory.\nHere’s why.\nMicrosoft entered the 21st century as the dominant software provider for anyone who interacted with a computing device. 16 years later, it’s just another software company.\nAfter running Microsoft for 25 years, Bill Gates handed the reins of CEO to Steve Ballmer in January 2000. Ballmer went on to run Microsoft for the next 14 years. If you think the job of a CEO is to increase sales, then Ballmer did a spectacular job. He tripled Microsoft’s sales to $78 billion, and profits more than doubled from $9 billion to $22 billion. The launch of the Xbox and Kinect, and the acquisitions of Skype and Yammer happened on his shift. If the Microsoft board was managing for quarter to quarter or even year to year revenue growth, Ballmer was as good as it gets as a CEO. But if the purpose of the company is long-term survival, then you could make a much better argument that he was a failure as a CEO, as he optimized short-term gains by squandering long-term opportunities.\nHow to Miss the Boat – Five Times\nDespite Microsoft’s remarkable financial performance, Ballmer failed to understand and execute on the five most important technology trends of the 21st century: in search – losing to Google; in smartphones – losing to Apple; in mobile operating systems – losing to Google/Apple; in media – losing to Apple/Netflix; and in the cloud – losing to Amazon. Microsoft left the 20th century owning over 95 percent of the operating systems that ran on computers (almost all on desktops). Fifteen years and 2 billion smartphones shipped in the 21st century and Microsoft’s mobile OS share is 1 percent. These misses weren’t in some tangential markets – search, mobile, and the cloud were directly where Microsoft users were heading. Yet a very smart CEO missed all of these. Why?\nExecution and Organization of Core Businesses\nIt wasn’t that Microsoft didn’t have smart engineers working on search, media, mobile, and cloud. They had lots of these projects. The problem was that Ballmer organized the company around execution of its current strengths – Windows and Office businesses. Projects not directly related to those activities never got serious management attention and/or resources.\nFor Microsoft to have tackled the areas it missed – cloud, music, mobile, apps – would have required an organizational transformation to a services company. Services (cloud, ads, music) have a very different business model. They are hard to do in a company that excels at products.\nBallmer and Microsoft failed because the CEO was a world-class executor (a Harvard grad and world-class salesman) of an existing business model trying to manage in a world of increasing change and disruption. Microsoft executed its 20th-century business model extremely well, but it missed the new and more important ones. The result? Great short-term gains, but less compelling long-term prospects.\nIn 2014, Microsoft finally announced that Ballmer would retire, and in early 2014, Satya Nadella took charge. Nadella got Microsoft organized around mobile and the cloud (Azure), freed the Office and Azure teams from Windows, killed the phone business and got a major release of Windows out without the usual trauma. And he is moving the company into augmented reality and conversational AI. While Microsoft will likely never regain the market dominance it had in the 20th century, (its business model continues to be extremely profitable), Nadella likely saved the company from irrelevance.\nWhat’s Missing?\nVisionary CEOs are not “just” great at assuring world-class execution of a tested and successful business model, they are also world-class innovators. Visionary CEOs are product and business model centric and extremely customer focused.\nThe best are agile and know how to pivot – make a substantive change to the business model while or before their market has shifted. The very best of them shape markets – they know how to create new markets by seeing opportunities before anyone else. They remain entrepreneurs.\nOne of the best examples of a visionary CEO is Steve Jobs, who transformed Apple from a niche computer company into the most profitable company in the world. Between 2001 and 2008, Jobs reinvented the company three times. Each transformation – from a new computer distribution channel, Apple Stores, to disrupting the music business with iPod and iTunes in 2001 to the iPhone in 2007 and the App store in 2008 – drove revenues and profits to new heights.\nThese were not just product transitions but radical business model transitions – new channels, new customers, and new markets – and new emphasis on different parts of the organization (design became more important than the hardware itself, and new executives became more important than the current ones).\nVisionary CEOs don’t need someone else to demo the company’s key products for them. They deeply understand products, and they have their own coherent and consistent vision of where the industry/business models and customers are today and where they need to take the company. They know who their customers are because they spend time talking to them. They use strategy committees and the executive staff for advice, but none of these CEOs pivot by committee.\nWhy Tim Cook Is the New Steve Ballmer\nAnd that brings us to Apple, Tim Cook, and the Apple board.\nOne of the strengths of successful visionary and charismatic CEOs is that they build an executive staff of world-class operating executives (and they unconsciously force out any world-class innovators from their direct reports). The problem is in a company driven by a visionary CEO, there is only one visionary. This type of CEO surrounds himself/herself with extremely competent executors but not disruptive innovators. While Steve Jobs ran Apple, he drove the vision but put strong operating execs in each domain – hardware, software, product design, supply chain, manufacturing – who translated his vision and impatience into plans, process, and procedures.\nWhen visionary founders depart (death, firing, etc.), the operating executives who reported to them believe it’s their turn to run the company (often with the blessing of the ex CEO). At Microsoft, Bill Gates anointed Steve Ballmer, and at Apple, Steve Jobs made it clear that Tim Cook was to be his successor.\nOnce in charge, one of the first things these operations/execution CEOs do is to get rid of the chaos and turbulence in the organization. Execution CEOs value stability, process, and repeatable execution. On one hand, that’s great for predictability, but it often starts a creative death spiral – creative people start to leave, and other executors (without the innovation talent of the old leader) are put into more senior roles. The company hires more process people, which in turn forces out the remaining creative talent. This culture shift ripples down from the top, and what once felt like a company on a mission to change the world now feels like another job.\nAs process oriented as the new CEOs are, you get the sense that one of the things they don’t love and aren’t driving are the products (go look at the Apple Watch announcements and see who demos the product).\nCook has now run Apple for five years, long enough for this to be his company rather than Steve Jobs’. The parallel between Gates and Ballmer and Jobs and Cook is eerie. Apple under Cook has doubled its revenues to $200 billion while doubling profit and tripling the amount of cash it has in the bank (now a quarter of trillion dollars). The iPhone continues its annual upgrades of incremental improvements. Yet in five years, the only new thing that managed to get out the door is the Apple Watch. With 115,000 employees, Apple can barely get annual updates out for its laptops and desktop computers.\nBut the world is about to disrupt Apple in the same way it disrupted Microsoft under Ballmer. Apple brilliantly mastered User Interface and product design to power the iPhone to dominance. But Google and Amazon are betting that the next of wave of computing products will be AI-directed services – machine intelligence driving apps and hardware. Think of Amazon Alexa, Google Home, and Google Assistant directed by voice recognition that’s powered by smart, conversational artificial intelligence – and most of these will be a new class of device scattered around your house, not just on your phone. It’s possible that betting on the phone as the platform for conversational AI may not be the winning hand.\nIt’s not that Apple doesn’t have exciting things in conversational AI going on in its labs. Heck, Siri was actually first. Apple also has autonomous car projects, AI-based speakers, augmented and virtual reality, etc in its labs. The problem is that a supply chain CEO who lacks a passion for products and has yet to articulate a personal vision of where Apple will go is ill equipped to make the right organizational, business model, and product bets to bring those to market.\nFour Challenges for the Board of Directors\nThe dilemma facing the boards at Microsoft, Apple, or any board of directors on the departure of an innovative CEO is strategic: Do we still want to be a innovative, risk taking company? Or should we now focus on execution of our core business, reduce our risky bets, and maximize shareholder return.\nTactically, that question results in asking: Do you search for another innovator from outside, promote one of the executors, or go deeper down the organization to find an innovator?\nHerein lie four challenges. Jobs and Gates (and the 20th century’s other creative icon, Walt Disney) shared the same blind spot: They suggested execution executives as their successors. They confused world-class execution with the passion for product and customers and market insight. Gates saw no difference between him and Ballmer. Yet history has shown us that, for long-term survival in markets that change rapidly, there definitely is a difference in these types of CEO.\nThe second conundrum is that if the board decides that the company needs another innovator at the helm, you can almost guarantee that the best executor – the number 2 and/or 3 vice president in the company – will leave, feeling that they deserved the job. Now the board is faced with not only having lost its CEO but potentially the best of the executive staff.\nThe third challenge is that many innovative/visionary CEOs have become part of the company’s brand. Jobs, Jeff Bezos, Mark Zuckerberg, Jeff Immelt, Elon Musk, Mark Benioff, Larry Ellison. This isn’t a new phenomenon, think of 20th-century icons like Walt Disney, Edward Land at Polaroid, Henry Ford, Lee Iacocca at Chrysler, Jack Welch at GE, and Alfred Sloan at GM. But they’re not only an external face to the company, they are often the touchstone for internal decision-making. Years after a visionary CEO is gone, companies are still asking “What would Walt Disney/Steve Jobs/Henry Ford have done?” rather than figuring out what they should now be doing in the changing market.\nFinally, the fourth conundrum is that, as companies grow larger and management falls prey to the fallacy that it only exists to maximize shareholder short-term return on investment, companies become risk averse. Large companies and their boards live in fear of losing what they spent years gaining (customers, market share, revenue, profits.) This may work in stable markets and technologies. But today very few of those remain.\nIn the 21st Century an Execution CEO as a Successor Increasingly May be The Wrong Choice\nIn a startup, the board of directors realizes that risk is the nature of new ventures and innovation is why they exist. On day one there are no customers to lose, no revenue and profits to decline. Instead, there is everything to gain. In contrast, large companies are often risk-averse engines – they are executing a repeatable and scalable business model that spins out the short-term dividends, revenue, and profits that the stock market rewards. And an increasing share price becomes the reason for existing. The irony is that in the 21st century, the tighter you hold onto your current product/markets, the likelier you are to be disrupted. (As articulated in the classic Clayton Christensen book The Innovators Dilemma, in industries with rapid technology or market shifts, disruption cannot be ignored.)\nIncreasingly, a hands-on product/customer, and business model-centric CEO with an entrepreneurial vision of the future may be the difference between market dominance and Chapter 11. In these industries, disruption will create opportunities that force “bet the company” decisions about product direction, markets, pricing, supply chain, operations, and the reorganization necessary to execute a new business model. At the end of the day, CEOs who survive embrace innovation, communicate a new vision, and build management to execute the vision.\nLessons Learned\nInnovation CEOs are almost always replaced by one of their execution VPs\nIf they have inherited a powerful business model, this often results in gains in revenue and profits that can continue for years\nHowever, as soon the market, business model, or technology shift, these execution CEOs are ill-equipped to deal with the change. The result is a company obsoleted by more agile innovators and left to live off momentum in its twilight years\n[This story originally ran on the author’s blog.]\nSteve Blank is a retired serial entrepreneur-turned-educator who has changed how startups are built and how entrepreneurship is taught. He created the Customer Development methodology that launched the lean startup movement, and wrote about the process in his first book, The Four Steps to the Epiphany. His second book, The Startup Owner’s Manual, is a step-by-step guide to building a successful company. Blank teaches the Customer Development methodology in his Lean LaunchPad classes at Stanford University, U.C. Berkeley, Columbia University, UCSF, NYU, the National Science Foundation and the I-Corps @NIH. He writes regularly about entrepreneurship at www.steveblank.com.",
        "sentiment": 0.03915921603531941
    },
    "article_15": {
        "title": "Apple delays AirPod rollout, don’t expect them in October",
        "body": "If you’ve been waiting for Apple’s AirPod wireless headphones to go on sale, you’re going to have to wait a little longer. Apple says that it is not ready and will need “a little more time.”\n“The early response to AirPods has been incredible. We don’t believe in shipping a product before it’s ready, and we need a little more time before AirPods are ready for our customers,” an Apple spokesperson told TechCrunch.\nApple did not say whether hardware or software updates are what is at the heart of the delay so I couldn’t conjecture which. My experiences with the AirPods have been very positive this far but the pre-production units that were given out to press are not without their foibles and bugs. Read about my time with them here.\nI have seen a variety of small software/hardware interaction issues that have caused some frustration – but have taken them in stride because they are not final products. Some folks who have had them early, as noted by Eduardo Arcos, have reported seeing some physical issues, though I have not seen anything like that myself.\nIt appears that Apple feels the same way and is taking more time to fix either hardware or software issues that prevent them from being customer ready. No timeline was given as far as future availability.\nThe AirPods are a brand new piece of hardware for Apple incorporating a half dozen new technologies including a bespoke wireless chip. They couldn’t have been easy to make and it seems that’s being reflected in these delays. Apple has placed the AirPods at the center of a variety of strategies surrounding wireless audio and AI, so it’s important that it gets the launch right.",
        "sentiment": 0.0759768265166453
    },
    "article_16": {
        "title": "32GB iPhone 7 and 7 Plus slower than the 128GB and 256GB models.",
        "body": "Apple’s iPhone 7 and iPhone 7 Plus are now almost a month old, and in general, they have both been well received. While one or two small issues have arisen here and there, there have been no overblown dramas unlike previous releases of Apple’s flagship products, and that’s great news. But it doesn’t mean that something isn’t just around the corner.\nTake this new report as a prime example, because while it is still early days, it has the potential to have quite the impact if third-party tests can confirm this theory. That theory? The 32GB iPhone 7 and iPhone 7 Plus uses storage that is considerably slower to write data than other capacities.\nBased on findings across both synthetic and real-world tests, it would appear that the storage Apple is using in at least some of its 32GB iPhones is noticeably less speedy than say, the storage used in 128GB models. While the synthetic benchmarks used first alerted to the issue, it’s a real-world test that was devised that best illustrates the issue as it currently stands.\n…benchmarks are synthetic, and we wanted to see how this slower storage relates to real-life performance. So we came up with the following test: we shot a 10-minute 4K video with the iPhone, and we then trimmed it exactly in half using the built-in trimming feature of the standard Photos app. We then timed how long it takes the three iPhones to complete the operation of saving the trim as a new file.\nThe results of that test, and especially when tied into the synthetic results gathered, show quite the interesting story.\nBased on the table above, it would certainly appear that the hardware used for testing – a 32GB iPhone 7 Plus – performs considerably worse than 64GB and 128GB flavors of Apple’s new flagship. Just look at that PassMark write speed, for example.\nNow, it is possible that there is more at play here and that the storage has nothing to do with the results, but such a difference is one that seems worthy of questioning. Are Apple’s smaller capacity iPhone 7 and iPhone 7 Plus simply slower than their more well-endowed brethren?\nWe await further testing before we can be sure as to the answer to that question.\nUpdate: Here’s a video proof showing write speed on 32GB iPhone 7 being significantly slower than higher-end capacity models:\n(Source: GSMArena)\nYou might also like to check out:\nYou can follow us on Twitter, add us to your circle on Google+ or like our Facebook page to keep yourself updated on all the latest from Microsoft, Google, Apple and the web.",
        "sentiment": -0.10516153462231159
    },
    "article_17": {
        "title": "iOS 10 now installed on two thirds of devices, faster adoption than any previous iOS update",
        "body": "iOS 10 is now installed on more than two thirds of the active iOS device install base, recording 66.7% twenty-seven days after iOS 10 was released according to Fiksu. Mixpanel is also recording iOS 10 adoption topping 66% since Sunday.\nAs shown by the graph, iOS 10 has the fastest adoption rate than any previous update, a month after release. Interestingly, iOS 10 initially lagged behind iOS 6, 7 and 9 until about two weeks in. The upgrade rate then rockets upwards to take the top spot at the end of September.\nThese metrics from Fiksu and Mixpanel measure the adoption rate of the active iOS install base, as they track any iPhones and iPads in use on the web.\nBefore iOS 10 was released, iOS 9 was installed on 88% of the active device base. Less than a month later, iOS 10 is already on the majority of iPhone, iPad and iPod touch devices. There are now more devies in use running iOS 10 than iOS 9. This is unprecedented uptake outside of Apple’s ecosystem.\nThe unusual spike two weeks after iOS 10 launch is difficult to explain, as it initially seemed like iOS 10 would lag behind iOS 9 for many months. Previous iOS updates do not feature the same ‘S-curve’ growth pattern.\nA flurry of new iPhone users unboxing their iPhone 7 and iPhone 7 Plus units probably contributed, which ship with iOS 10 preinstalled. Although Apple will have a sold many millions of iPhone 7 so far, it does not explain most of the jump, where iOS adoption increased 20% between September 27 and October 4.\nOne thing to consider is that Apple does not aggressively push customers to update to iOS 10 when the software ships. The initial influx of upgrades comes from people proactively visiting Software Update in iOS Settings and starting the update. Apple does sends notification for people that have not yet updated, but they are delayed by a week or more.\nIt is possible that Apple waited to send many iOS 10 update alerts until two weeks in. The release of iOS 10.0.2 on September 23rd will also have triggered fresh update warnings for users, which may have contributed to the sudden increase in adoption. Early update issues with iOS 10 may also have made people wait a few weeks before committing to the upgrade.\nThe next version of iOS 10, iOS 10.1, is currently in beta for developers and public beta testers and will be released by the end of the year. It includes several improvements, most noticeably adding a depth-of-field bokeh ‘Portrait’ mode for iPhone 7 Plus owners which takes advantage of the dual camera system.\nIf someone could explain the 2-weeks-later spike in iOS 10 adoption, I’d love to hear it. https://t.co/in4ixoP5MB pic.twitter.com/rFYwXqZVYc — Benjamin Mayo (@bzamayo) October 10, 2016\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.13260765581591322
    },
    "article_18": {
        "title": "Macbook charger teardown: The surprising complexity inside Apple's power adapter",
        "body": "Have you ever wondered what's inside your Macbook's charger? There's a lot more circuitry crammed into the compact power adapter than you'd expect, including a microprocessor. This charger teardown looks at the numerous components in the charger and explains how they work together to power your laptop.\nInside the Macbook charger. Many electronic components work together to provide smooth power to your laptop.\nMost consumer electronics, from your cell phone to your television, use ato convert AC power from the wall to the low-voltage DC used by electronic circuits. The switching power supply gets its name because it switches power on and off thousands of times a second, which turns out to be a very efficient way to do this conversion. [1]\nSwitching power supplies are now very cheap, but this wasn't always the case. In the 1950s, switching power supplies were complex and expensive, used in aerospace and satellite applications that needed small, lightweight power supplies. By the early 1970s, new high-voltage transistors and other technology improvements made switching power supplies much cheaper and they became widely used in computers.[2] The introduction of a single-chip power supply controller in 1976 made switching power supplies simpler, smaller, and cheaper.\nApple's involvement with switching power supplies goes back to 1977 when Apple's chief engineer Rod Holt designed a switching power supply for the Apple II. According to Steve Jobs:[3]\n\"That switching power supply was as revolutionary as the Apple II logic board was. Rod doesn't get a lot of credit for this in the history books but he should. Every computer now uses switching power supplies, and they all rip off Rod Holt's design.\"\nThis is a fantastic quote, but unfortunately it is entirely false. The switching power supply revolution happened before Apple came along, Apple's design was similar to earlier power supplies[4] and other computers don't use Rod Holt's design. Nevertheless, Apple has extensively used switching power supplies and pushes the limits of charger design with their compact, stylish and advanced chargers.\nInside the charger\nFor the teardown I started with a Macbook 85W power supply, model A1172, which is small enough to hold in your palm. The picture below shows several features that can help distinguish the charger from counterfeits: the Apple logo in the case, the metal (not plastic) ground pin on the right, and the serial number next to the ground pin.\nApple 85W Macbook charger\nStrange as it seems, the best technique I've found for opening a charger is to pound on a wood chisel all around the seam to crack it open. With the case opened, the metal heat sinks of the charger are visible. The heat sinks help cool the high-power semiconductors inside the charger.\nInside the Apple 85W Macbook charger\nThe other side of the charger shows the circuit board, with the power output at the bottom. Some of the tiny components are visible, but most of the circuitry is covered by the metal heat sink, held in place by yellow insulating tape.\nThe circuit board inside the Apple 85W Macbook charger. At the right, screws firmly attach components to the heat sinks.\nAfter removing the metal heat sinks, the components of the charger are visible. These metal pieces give the charger a substantial heft, more than you'd expect from a small unit.\nExploded view of the Apple 85W charger, showing the extensive metal heat sinks.\nThe diagram below labels the main components of the charger. AC power enters the charger and is converted to DC. The PFC circuit (Power Factor Correction) improves efficiency by ensuring the load on the AC line is steady. The primary chops up the high-voltage DC from the PFC circuit and feeds it into the transformer. Finally, the secondary receives low-voltage power from the transformer and outputs smooth DC to the laptop. The next few sections discuss these circuits in more detail, so follow along with the diagram below.\nThe components inside an Apple Macbook 85W power supply.\nAC enters the charger\nAC power enters the charger through a removable AC plug. A big advantage of switching power supplies is they can be designed to run on a wide range of input voltages. By simply swapping the plug , the charger can be used in any region of the world, from European 240 volts at 50 Hertz to North American 120 volts at 60 Hz. The filter capacitors and inductors in the input stage prevent interference from exiting the charger through the power lines. The bridge rectifier contains four diodes, which convert the AC power into DC. (See this video for a great demonstration of how a full bridge rectifier works.)\nThe input components in a Macbook charger. The diode bridge rectifier is attached to the metal heat sink with a clip.\nPFC: smoothing the power usage\nThe next step in the charger's operation is the Power Factor Correction circuit (PFC), labeled in purple. One problem with simple chargers is they only draw power during a small part of the AC cycle.[5] If too many devices do this, it causes problems for the power company. Regulations require larger chargers to use a technique called power factor correction so they use power more evenly.\nThe PFC circuit uses a power transistor to precisely chop up the input AC tens of thousands of times a second; contrary to what you might expect, this makes the load on the AC line smoother. Two of the largest components in the charger are the inductor and PFC capacitor that help boost the voltage to about 380 volts DC.[6]\nThe primary: chopping up the power\nThe primary circuit is the heart of the charger. It takes the high voltage DC from the PFC circuit, chops it up and feeds it into the transformer to generate the charger's low-voltage output (16.5-18.5 volts). The charger uses an advanced design called a resonant controller, which lets the system operate at a very high frequency, up to 500 kilohertz. The higher frequency permits smaller components to be used for a more compact charger. The chip below controls the switching power supply.[7]\nThe circuit board inside the Macbook charger. The chip in the middle controls the switching power supply circuit.\nThe two drive transistors (in the overview diagram) alternately switch on and off to chop up the input voltage. The transformer and capacitor resonate at this frequency, smoothing the chopped-up input into a sine wave.\nThe secondary: smooth, clean power output\nThe secondary side of the circuit generates the output of the charger. The secondary receives power from the transformer and converts it DC with diodes. The filter capacitors smooth out the power, which leaves the charger through the output cable.\nThe most important role of the secondary is to keep the dangerous high voltages in the rest of the charger away from the output, to avoid potentially fatal shocks. The isolation boundary marked in red on the earlier diagram indicates the separation between the high-voltage primary and the low-voltage secondary. The two sides are separated by a distance of about 6 mm, and only special components can cross this boundary.\nThe transformer safely transmits power between the primary and the secondary by using magnetic fields instead of a direct electrical connection. The coils of wire inside the transformer are triple-insulated for safety. Cheap counterfeit chargers usually skimp on the insulation, posing a safety hazard. The optoisolator uses an internal beam of light to transmit a feedback signal between the secondary and primary. The control chip on the primary side uses this feedback signal to adjust the switching frequency to keep the output voltage stable.\nThe output components in an Apple Macbook charger.The two power diodes are in front on the left. Behind them are three cylindrical filter capacitors.The microcontroller board is visible behind the capacitors.\nA powerful microprocessor in your charger?\nOne unexpected component is a tiny circuit board with a microcontroller, which can be seen above. This 16-bit processor constantly monitors the charger's voltage and current. It enables the output when the charger is connected to a Macbook, disables the output when the charger is disconnected, and shuts the charger off if there is a problem. This processor is a Texas Instruments MSP430 microcontroller, roughly as powerful as the processor inside the original Macintosh.[8]\nThe microcontroller circuit board from an 85W Macbook power supply, on top of a quarter. The MPS430 processor monitors the charger's voltage and current.\nThe square orange pads on the right are used to program software into the chip's flash memory during manufacturing.[9] The three-pin chip on the left (IC202) reduces the charger's 16.5 volts to the 3.3 volts required by the processor.[10]\nThe charger's underside: many tiny components\nTurning the charger over reveals dozens of tiny components on the circuit board. The PFC controller chip and the power supply (SMPS) controller chip are the main integrated circuits controlling the charger. The voltage reference chip is responsible for keeping the voltage stable even as the temperature changes.[11] These chips are surrounded by tiny resistors, capacitors, diodes and other components. The output MOSFET transistor switches the power to the output on and off, as directed by the microcontroller. To the left of it, the current sense resistors measure the current flowing to the laptop.\nThe printed circuit board from an Apple 85W Macbook power supply, showing the tiny components inside the charger.\nThe isolation boundary (marked in red) separates the high voltage circuitry from the low voltage output components for safety. The dashed red line shows the isolation boundary that separates the low-voltage side (bottom right) from the high-voltage side. The optoisolators send control signals from the secondary side to the primary, shutting down the charger if there is a malfunction. [12]\nOne reason the charger has more control components than a typical charger is its variable output voltage. To produce 60 watts, the charger provides 16.5 volts at 3.6 amps. For 85 watts, the voltage increases to 18.5 volts at 4.6 amps. This allows the charger to be compatible with lower-voltage 60 watt chargers, while still providing 85 watts for laptops that can use it.[13] As the current increases above 3.6 amps, the circuit gradually increases the output voltage. If the current increases too much, the charger abruptly shuts down around 90 watts.[14]\nInside the Magsafe connector\nThe magnetic Magsafe connector that plugs into the Macbook is more complex than you would expect. It has five spring-loaded pins (known as Pogo pins ) to connect to the laptop. Two pins are power, two pins are ground, and the middle pin is a data connection to the laptop.\nThe pins of a Magsafe 2 connector. The pins are arranged symmetrically, so the connector can be plugged in either way.\nInside the Magsafe connector is a tiny chip that informs the laptop of the charger's serial number, type, and power. The laptop uses this data to determine if the charger is valid. This chip also controls the status LEDs. There is no data connection to the charger block itself; the data connection is only with the chip inside the connector. For more details, see my article on the Magsafe connector\nThe circuit board inside a Magsafe connector is very small. There are two LEDs on each side. The chip is a DS2413 1-Wire switch.\nOperation of the charger\nYou may have noticed that when you plug the connector into a Macbook, it takes a second or two for the LED to light up. During this time, there are complex interactions between the Macbook, the charger, and the Magsafe connector.\nWhen the charger is disconnected from the laptop, the output transistor discussed earlier blocks the output power.[15] When the Magsafe connector is plugged into a Macbook, the laptop pulls the power line low.[16] The microcontroller in the charger detects this and after exactly one second enables the power output. The laptop then loads the charger information from the Magsafe connector chip. If all is well, the laptop starts pulling power from the charger and sends a command through the data pin to light the appropriate connector LED. When the Magsafe connector is unplugged from the laptop, the microcontroller detects the loss of current flow and shuts off the power, which also extinguishes the LEDs.\nYou might wonder why the Apple charger has all this complexity. Other laptop chargers simply provide 16 volts and when you plug it in, the computer uses the power. The main reason is for safety, to ensure that power isn't flowing until the connector is firmly attached to the laptop. This minimizes the risk of sparks or arcing while the Magsafe connector is being put into position.\nWhy you shouldn't get a cheap charger\nThe Macbook 85W charger costs $79 from Apple, but for $14 you can get a charger on eBay that looks identical. Do you get anything for the extra $65? I opened up an imitation Macbook charger to see how it compares with the genuine charger. From the outside, the charger looks just like an 85W Apple charger except it lacks the Apple name and logo. But looking inside reveals big differences. The photos below show the genuine Apple charger on the left and the imitation on the right.\nInside the Apple 85W Macbook charger (left) vs an imitation charger (right). The genuine charger is crammed full of components, while the imitation has fewer parts.\nThe imitation charger has about half the components of the genuine charger and a lot of blank space on the circuit board. While the genuine Apple charger is crammed full of components, the imitation leaves out a lot of filtering and regulation as well as the entire PFC circuit. The transformer in the imitation charger (big yellow rectangle) is much bulkier than in Apple's charger; the higher frequency of Apple's more advanced resonant converter allows a smaller transformer to be used.\nThe circuit board of the Apple 85W Macbook charger (left) compared with an imitation charger (right). The genuine charger has many more components.\nFlipping the chargers over and looking at the circuit boards shows the much more complex circuitry of the Apple charger. The imitation charger has just one control IC (in the upper left).[17] since the PFC circuit is omitted entirely. In addition, the control circuits are much less complex and the imitation leaves out the ground connection.\nThe imitation charger is actually better quality than I expected, compared to the awful counterfeit iPad charger and iPhone charger that I examined. The imitation Macbook charger didn't cut every corner possible and uses a moderately complex circuit. The imitation charger pays attention to safety, using insulating tape and keeping low and high voltages widely separated, except for one dangerous assembly error that can be seen below. The Y capacitor (blue) was installed crooked, so its connection lead from the low-voltage side ended up dangerously close to a pin on the high-voltage side of the optoisolator (black), creating a risk of shock.\nSafety hazard inside an imitation Macbook charger. The lead of the Y capacitor is too close to the pin of the optoisolator, causing a risk of shock.\nProblems with Apple's chargers\nThe ironic thing about the Apple Macbook charger is that despite its complexity and attention to detail, it's not a reliable charger. When I told people I was doing a charger teardown, I rapidly collected a pile of broken chargers from people who had failed chargers. The charger cable is rather flimsy, leading to a class action lawsuit stating that the power adapter dangerously frays, sparks and prematurely fails to work . Apple provides detailed instructions on how to avoid damaging the wire, but a stronger cable would be a better solution. The result is reviews on the Apple website give the charger a dismal 1.5 out of 5 stars.\nBurn mark inside an 85W Apple Macbook power supply that failed.\nMacbook chargers also fail due to internal problems. The photos above and below show burn marks inside a failed Apple charger from my collection.[18] I can't tell exactly what went wrong, but something caused a short circuit that burnt up a few components. (The white gunk in the photo is insulating silicone used to mount the board.)\nBurn marks inside an Apple Macbook charger that malfunctioned.\nWhy Apple's chargers are so expensive\nAs you can see, the genuine Apple charger has a much more advanced design than the imitation charger and includes more safety features. However, the genuine charger costs $65 more and I doubt the additional components cost more than $10 to $15 [19] . Most of the cost of the charger goes into the healthy profit margin that Apple has on their products. Apple has an estimated 45% profit margin on iPhones [20] and chargers are probably even more profitable. Despite this, I don't recommend saving money with a cheap eBay charger due to the safety risk.\nConclusion\nNotes and references\nPeople don't give much thought to what's inside a charger, but a lot of interesting circuitry is crammed inside. The charger uses advanced techniques such as power factor correction and a resonant switching power supply to produce 85 watts of power in a compact, efficient unit. The Macbook charger is an impressive piece of engineering, even if it's not as reliable as you'd hope. On the other hand, cheap no-name chargers cut corners and often have safety issues, making them risky, both to you and your computer. [1] The main alternative to a switching power supply is a linear power supply, which is much simpler and converts excess voltage to heat. Because of this wasted energy, linear power supplies are only about 60% efficient, compared to about 85% for a switching power supply. Linear power supplies also use a bulky transformer that may weigh multiple pounds, while switching power supplies can use a tiny high-frequency transformer.\n[2] Switching power supplies were taking over the computer industry as early as 1971. Electronics World said that companies using switching regulators \"read like a 'Who's Who' of the computer industry: IBM, Honeywell, Univac, DEC, Burroughs, and RCA, to name a few\". See \"The Switching Regulator Power Supply\", Electronics World v86 October 1971, p43-47. In 1976, Silicon General introduced SG1524 PWM integrated circuit, which put the control circuitry for a switching power supply on a single chip.\n[3] The quote about the Apple II power supply is from page 74 of the 2011 book Steve Jobs by Walter Isaacson. It inspired me to write a detailed history of switching power supplies: Apple didn't revolutionize power supplies; new transistors did. Steve Job's quote sounds convincing, but I consider it the reality distortion field in effect.\n[4] If anyone can take the credit for making switching power supplies an inexpensive everyday product, it is Robert Boschert. He started selling switching power supplies in 1974 for everything from printers and computers to the F-14 fighter plane. See Robert Boschert: A Man Of Many Hats Changes The World Of Power Supplies in Electronic Design. The Apple II's power supply is very similar to the Boschert OL25 flyback power supply but with a patented variation.\n[5] You might expect the bad power factor is because switching power supplies rapidly turn on and off, but that's not the problem. The difficulty comes from the nonlinear diode bridge, which charges the input capacitor only at peaks of the AC signal. (If you're familiar with power factors due to phase shift, this is totally different. The problem is the non-sinusoidal current, not a phase shift.)\nThe idea behind PFC is to use a DC-DC boost converter before the switching power supply itself. The boost converter is carefully controlled so its input current is a sinusoid proportional to the AC waveform. The result is the boost converter looks like a nice resistive load to the power line, and the boost converter supplies steady voltage to the switching power supply components.\n[6] The charger uses a MC33368 \"High Voltage GreenLine Power Factor Controller\" chip to run the PFC. The chip is designed for low power, high-density applications so it's a good match for the charger.\n[7] The SMPS controller chip is a L6599 high-voltage resonant controller; for some reason it is labeled DAP015D. It uses a resonant half-bridge topology; in a half-bridge circuit, two transistors control power through the transformer first one direction and then the other. Common switching power supplies use a PWM (pulse width modulation) controller, which adjusts the time the input is on. The L6599, on the other hand, adjusts the frequency instead of the pulse width. The two transistors alternate switching on for 50% of the time. As the frequency increases above the resonant frequency, the power drops, so controlling the frequency regulates the output voltage.\n[8] The processor in the charger is a MSP430F2003 ultra low power microcontroller with 1kB of flash and just 128 bytes of RAM. It includes a high-precision 16-bit analog to digital converter. More information is here.\nThe 68000 microprocessor from the original Apple Macintosh and the 430 microcontroller in the charger aren't directly comparable as they have very different designs and instruction sets. But for a rough comparison, the 68000 is a 16/32 bit processor running at 7.8MHz, while the MSP430 is a 16 bit processor running at 16MHz. The Dhrystone benchmark measures 1.4 MIPS (million instructions per second) for the 68000 and much higher performance of 4.6 MIPS for the MSP430. The MSP430 is designed for low power consumption, using about 1% of the power of the 68000.\n[9] The 60W Macbook charger uses a custom MSP430 processor, but the 85W charger uses a general-purpose processor that needs to loaded with firmware. The chip is programmed with the Spy-Bi-Wire interface, which is TI's two-wire variant of the standard JTAG interface. After programming, a security fuse inside the chip is blown to prevent anyone from reading or modifying the firmware.\n[10] The voltage to the processor is provided by not by a standard voltage regulator, but a LT1460 precision reference, which outputs 3.3 volts with the exceptionally high accuracy of 0.075%. This seems like overkill to me; this chip is the second-most expensive chip in the charger after the SMPS controller, based on Octopart's prices.\n[11] The voltage reference chip is unusual, it is a TSM103/A that combines two op amps and a 2.5V reference in a single chip. Semiconductor properties vary widely with temperature, so keeping the voltage stable isn't straightforward. A clever circuit called a bandgap reference cancels out temperature variations; I explain it in detail here.\n[12] Since some readers are very interested in grounding, I'll give more details. A 1KΩ ground resistor connects the AC ground pin to the charger's output ground. (With the 2-pin plug, the AC ground pin is not connected.) Four 9.1MΩ resistors connect the internal DC ground to the output ground. Since they cross the isolation boundary, safety is an issue. Their high resistance avoids a shock hazard. In addition, since there are four resistors in series for redundancy, the charger remains safe even if a resistor shorts out somehow. There is also a Y capacitor (680pF, 250V) between the internal ground and output ground; this blue capacitor is on the upper side of the board. A T5A fuse (5 amps) protects the output ground.\n[13] The power in watts is simply the volts multiplied by the amps. Increasing the voltage is beneficial because it allows higher wattage; the maximum current is limited by the wire size.\n[14] The control circuitry is fairly complex. The output voltage is monitored by an op amp in the TSM103/A chip which compares it with a reference voltage generated by the same chip. This amplifier sends a feedback signal via an optoisolator to the SMPS control chip on the primary side. If the voltage is too high, the feedback signal lowers the voltage and vice versa. That part is normal for a power supply, but ramping the voltage from 16.5 volts to 18.5 volts is where things get complicated.\nThe output current creates a voltage across the current sense resistors, which have a tiny resistance of 0.005Ω each - they are more like wires than resistors. An op amp in the TSM103/A chip amplifies this voltage. This signal goes to tiny TS321 op amp which starts ramping up when the signal corresponds to 4.1A. This signal goes into the previously-described monitoring circuit, increasing the output voltage.\nThe current signal also goes into a tiny TS391 comparator, which sends a signal to the primary through another optoisolator to cut the output voltage. This appears to be a protection circuit if the current gets too high. The circuit board has a few spots where zero-ohm resistors (i.e. jumpers) can be installed to change the op amp's amplification. This allows the amplification to be adjusted for accuracy during manufacture.\n[15] If you measure the voltage from a Macbook charger, you'll find about six volts instead of the 16.5 volts you'd expect. The reason is the output is deactivated and you're only measuring the voltage through the bypass resistor just below the output transistor.\n[16] The laptop pulls the charger output low with a 39.41KΩ resistor to indicate that it is ready for power. An interesting thing is it won't work to pull the output too low - shorting the output to ground doesn't work. This provides a safety feature. Accidental contact with the pins is unlikely to pull the output to the right level, so the charger is unlikely to energize except when properly connected.\n[17] The imitation charger uses the Fairchild FAN7602 Green PWM Controller chip, which is more advanced than I expected in a knock-off; I wouldn't have been surprised if it just used a simple transistor oscillator. Another thing to note is the imitation charger uses a single-sided circuit board, while the genuine uses a double-sided circuit board, due to the much more complex circuit.\n[18] The burnt charger is an Apple A1222 85W Macbook charger, which is a different model from the A1172 charger in the rest of the teardown. The A1222 is in a slightly smaller, square case and has a totally different design based on the NCP 1203 PWM controller chip. Components in the A1222 charger are packed even more tightly than in the A1172 charger. Based on the burnt-up charger, I think they pushed the density a bit too far.\n[19] I looked up many of the charger components on Octopart to see their prices. Apple's prices should be considerably lower. The charger has many tiny resistors, capacitors and transistors; they cost less than a cent each. The larger power semiconductors, capacitors and inductors cost considerably more. I was surprised that the 16-bit MSP430 processor costs only about $0.45. I estimated the price of the custom transformers. The list below shows the main components.\nComponent Cost MSP430F2003 processor $0.45 MC33368D PFC chip $0.50 L6599 controller chip $1.62 LT1460 3.3V reference $1.46 TSM103/A reference $0.16 2x P11NM60AFP 11A 600V MOSFET $2.00 3x Vishay optocoupler $0.48 2x 630V 0.47uF film capacitor $0.88 4x 25V 680uF electrolytic capacitor $0.12 420V 82uF electrolytic capacitor $0.93 polypropylene X2 capacitor $0.17 3x toroidal inductor $0.75 4A 600V diode bridge $0.40 2x dual common-cathode schottky rectifier 60V, 15A $0.80 20NC603 power MOSFET $1.57 transformer $1.50? PFC inductor $1.50?\n[20] The article Breaking down the full $650 cost of the iPhone 5 describes Apple's profit margins in detail, estimating 45% profit margin on the iPhone. Some people have suggested that Apple's research and development expenses explain the high cost of their chargers, but the math shows R&D costs must be negligible. The book Practical Switching Power Supply Design estimates 9 worker-months to design and perfect a switching power supply, so perhaps $200,000 of engineering cost. More than 20 million Macbooks are sold per year, so the R&D cost per charger would be one cent. Even assuming the Macbook charger requires ten times the development of a standard power supply only increases the cost to 10 cents.",
        "sentiment": 0.09103246396799997
    },
    "article_19": {
        "title": "Macs End Up Costing 3 Times Less Than Windows PCs Because of Fewer Tech Support Expense, Says IBM's IT Guy",
        "body": "IBM Fletcher Previn\nFletcher Previn could be one of the funniest vice presidents that IBM employs.\nBefore achieving what he jokes was his \"true lifelong ambition of middle management at IBM\" he worked as an intern on the \"Late Show with David Letterman,\" and he did a stint for Conan O'Brien, too, he told attendees at the Jamf tech conference.\nWhen a career in entertainment didn't work out, he made a nice living for himself as an IT pro managing fleets of Windows PCs for huge corporations.\nLast year, he became a cult figure of sorts in the world of enterprise IT. As IBM's vice president of Workplace as a Service, Previn is the guy responsible for turning IBM, the company that invented the PC, into an Apple Mac house.\nPrevin gave a great presentation at last year's Jamf tech conference in which he said Macs were less expensive to support than Windows. (Jamf is a company that makes software that manage fleets of Macs and iOS devices.) Only 5% of IBM's Mac employees needed help-desk support, versus 40% of PC users.\nAt that time, some 30,000 IBM employees were using Macs. Today 90,000 of them are, he said. And IBM ultimately plans to distribute 150,000 to 200,000 Macs to workers, meaning about half of IBM's approximately 370,000 employees will have Macs.\nPrevin's team is responsible for all the company's workers' computers, not just the Macs. IBM's IT department supports about 604,000 laptops between employees and its more than 100,000 contractors. Most are Windows machines — 442,000 — while 90,000 are Macs and 72,000 are Linux PCs. IBM is adding about 1,300 Macs a week, Previn said.\nWith another year of working with Macs under his belt, he gave another funny presentation at Jamf's conference.\nHe reiterated that, in his experience, Mac users needed less help. Though Macs make up about 15% of the PCs in use, only 5% of the help desk is dedicated to supporting them.\nPrevin said that while a Mac initially cost $117 to $454 more than a similarly configured Windows PC, over four years IBM saves $273 to $543 per Mac compared with a similarly configured Windows PC.\nStory continues\nIn other words, when you add in all the software a company has to buy from Microsoft to run and manage its Windows devices, Windows PCs are 3 times as expensive, he says.\n\"It ends up being $57.3 million more expensive per 100,000 Windows machines, or exactly three times the cost,\" he said. \"And this is a conservative number. This represents the best pricing we've ever gotten from Microsoft.\"\nOn top of that, employees have been downright glowing about the IT team since it began delivering Macs. Employees report a 91% satisfaction rating for their Macs. People are so happy that IBM's Japan unit declared it \"would standardize on Macs, and make PCs the exception,\" Previn said.\nBy the way, IBMers also tend to prefer iPhones and iPads. Sixty-five percent of the mobile devices they use run iOS, while 33% run Android, and there are a few BlackBerry holdouts.\n\"The challenge is, all the people that still have BlackBerries can fire me, so it's hard to force it from them,\" he joked.\nUltimately, he said, this whole Mac experiment showed that when it came to technology, \"If you make it simple and easy for people to use, they will pull it from you — you don't have to push it on them.\"\nHere's the full keynote. Previn's presentation is the first 56 minutes.\nNOW WATCH: Watch millennials try a McDonald's Big Mac for the first time\nMore From Business Insider",
        "sentiment": 0.35433166241273284
    },
    "article_20": {
        "title": "Latest Apple patent appears to show fingerprint recognition almost anywhere on the screen",
        "body": "Long-standing rumors that Apple plans to embed the Home button into the display of future iPhones became more concrete when Bloomberg, the WSJ and NYT all reported that Apple plans make this move in 2017.\nWe’ve seen a succession of Apple patents for this technology, and another one published today appears to describe a technology that would allow a fingerprint to be recognised almost anywhere on the screen, not just in a fixed location …\nThe patent (spotted by Patently Apple) describes how ‘electric field differences between ridges and valleys of the fingerprint’ could be applied to a capacitive screen. In it, Apple outlines the reason for the company wanting to combine Touch ID with the display.\nIn the case of fingerprint recognition systems that include arrays of capacitive sensing elements to detect the fingerprint images, i.e. capacitive fingerprint sensors, there may be a number of reasons for these components to axially aligned with other components of the consumer electronics device, such as display stacks and touch screens, not the least of which is an interest in avoiding assigning valuable surface space exclusively to an component that may only be used briefly during the process of identifying the user.\nA previous patent described a different method of achieving the same aim, via ultrasound imaging. Chinese brand Xiaomi recently launched a smartphone using this technology (video). Apple said that technique is more accurate than current-gen Touch ID, but it appears to require a fixed location.\nFrom the drawings (above), however, it appears that the ‘capacitive fingerprint sensor with electrostatic lens’ would allow detection across either the entire display or a substantial portion of it.\nThe touch-sensitive Home button used in the iPhone 7 is likely intended a stepping-stone toward a version that can be embedded in the display itself. It’s not yet known what next year’s iPhone will be called, with iPhone 8 seen as the most likely contender for what is set to be a substantial redesign, but other names have been suggested. KGI recently reported ‘increasing likelihood’ the phone will be mostly glass, with stainless steel used for ‘premium models.’\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.1832226921732609
    },
    "article_21": {
        "title": "Debate over: IBM confirms that Macs are $535 less expensive than PCs",
        "body": "Watch this JNUC session in its entirety or just catch the IBM highlights.\nAttendees arrived early to the Guthrie this morning to claim seats for the most anticipated session at the Jamf Nation User Conference (JNUC). And they weren’t disappointed. In a passionate presentation from industry leaders in enterprise, education and healthcare, attendees learned how they too can achieve unprecedented success in their own environments.\nUser choice at IBM\nFletcher Previn, VP of Workplace as a Service at IBM, started the discussion by sharing what they’ve done to transform company culture for the 400,000+ employees who span across IBM’s 2,800 locations. It started with user choice.\nIn 2015, IBM let their employees decide – Windows or Mac. “The goal was to deliver a great employee choice program and strive to achieve the best Mac program,” Previn said. An emerging favorite meant the deployment of 30,000 Macs over the course of the year. But that number has grown. With more employees choosing Mac than ever before, the company now has 90,000 deployed (with only five admins supporting them), making it the largest Mac deployment on earth.\n[Click here for your free guide to managing iOS in the enterprise]\nBut isn’t it expensive, and doesn’t it overload IT? No. IBM found that not only do PCs drive twice the amount of support calls, they’re also three times more expensive. That’s right, depending on the model, IBM is saving anywhere from $273 - $543 per Mac compared to a PC, over a four-year lifespan. “And this reflects the best pricing we’ve ever gotten from Microsoft,” Previn said. Multiply that number by the 100,000+ Macs IBM expects to have deployed by the end of the year, and we’re talking some serious savings.\nNeedless to say, the employees at IBM got it right. And with 73% of them saying they want their next computer to be a Mac, the success will only increase with time.\nTo help maintain the demand for Macs in the workplace, and the 1,300 new Macs deployed each week, IBM adopted Jamf to leverage Apple’s Device Enrollment Program (DEP) for zero-touch deployment, which is critical given 40% of their workforce is remote. Employees receive a consumer experience from the moment they receive their Mac, which continues with a Workstation Asset Management Tool and a re-designed intranet, providing employees with an Apple-like, self-help experience. Not only do these additions drive self-sufficiency among employees, but they also help create confidence with the product.\n“The shortest distance to engaging employees is by what’s in their hand or what’s on their desk,” Previn said. He was right. Year over year, IBM has seen a drastic increase in their employee engagement scores. In fact, “Better Tools” was cited as the number one driver for the overall improvement.\nPrevin ended the session with a fact worth noting. “Every Mac we buy is in fact continuing to make and save IBM money.”\nPersonalized learning in education\nNot only are Macs making a difference in the workplace – they’re also changing lives in the classroom. Vicki Lyons, Technology Services Director for the La Crosse School District, shared how their Apple deployment continues to change the educational experience through personalized learning.\nThe School District of La Crosse, Wisconsin serves a diverse population of 8,000 students across 11 elementary schools, six middle schools and four high schools. Determined to create student equality, staff members districtwide donated 10 percent of their yearly budget so all faculty and students could receive an Apple device.\n“We really believe the management piece of Jamf lets us manage what our users need, especially in the classroom,” Lyons said.\nhttps://www.jamf.com/resources/myths-revealed-technology-in-the-classroom/\nUsing Jamf Pro, the district deployed approximately 9,400 Apple devices. While grades K-4 use iPads in the classroom, students in grades 5-8 participate in a 1:1 iPad program. High schoolers have a 1:1 MacBook program, and staff members each have a MacBook Air. The district recently migrated to Apple School Manager (ASM), and plans to integrate with its student information system (SIS), Skyward.\nAnd while they appreciate the same benefits as the La Crosse School District, Blair Anderson, Technology Manager at Shawnee Heights School District, had different reasons for choosing Jamf.\nAbove all else – there’s Jamf Nation. “Even when we were not using Jamf, we were using the Jamf Nation website to get the resources we needed,” Anderson said. And there’s true, zero-day support - as in, the moment you need help, it’s there. Roll all that together with a single system to manage both Mac and iOS, and Anderson said you can’t lose.\nPrior to implementation, the school district in Tecumseh, Kansas, was 100% Microsoft. Since implementing a user choice program in Sept. 2015, more than 90% of the district’s teachers choose Mac. And despite constant budget cuts, the district is committed to offer Apple to their approximately 3,500 students, grades pre-K –12.\nChanging lives in the enterprise\nAs Apple continues to change the educational landscape around the world, iOS is changing lives in a more unexpected environment – healthcare.\nThe University of California, San Diego’s (UCSD) Jacobs Medical Center will soon transform patient experience with an interactive system that personalizes care. It’s a new, patient-centered world, and it’s possible with Apple and Jamf.\nJacobs Medical Center, opening in November 2016, will be the first hospital with Apple devices (iPad and Apple TV) across each of its 245 patient rooms. The offering will allow patients to look through their medical records and see when their medications should be taken. “We also want the patient to have control of the room,” Eric Boyd, Data Security Engineer at UC San Diego Health Sciences, said about the ability to control the blinds, TV and room temperature – all from the iPad.\nAnd with security as a top priority, each device will be cleared automatically upon a patient’s discharge. Using Jamf Pro, Boyd said, “There’s no need for an IT person, at all, to touch the device.”\nSee the full news release for more details.\n[Click here to download the Mobile Device Management 101 e-book]\nMoving forward\nHager wrapped up the day with grateful thanks to everyone who continues to make a difference for those in their environments, whether in education, the enterprise or healthcare. And he encouraged everyone to continue telling their stories – always. He lastly invited everyone to next year’s JNUC, which will be held October 24-26, 2017. Registration will open in November.",
        "sentiment": 0.551893708591039
    },
    "article_22": {
        "title": "A10 GPU beats Adreno 530 by 20%, Exynos 8890 by 30%",
        "body": "Performance\nApple has equipped the iPhone 7 with a new-generation A10 Fusion chip. It has a quad-core CPU, a first for the iPhones, with two high-performance cores running at 2.34GHz and two power-saving ones. The high-performance ones run about 40% faster than the A9 chip and two times faster than the A8. The other two are more power-efficient cores and require only 20% of the power needed for the high-performance cores.\nThere's a new GPU inside as well. It's a six-core one and is 50% faster than the A9's GPU and draws just 66% of the power.\nFinally, the iPhone 7 uses 2GB of RAM, while the iPhone 7 Plus will offer 3GB.\nThe guys over Chipworks have been working hard to decrypt the new A10 Fusion chip and what's interesting is that they can't find the two low-power cores. In fact, those are not available to anything but the OS itself. No benchmark or game can use those; in fact, the benchmarks can't detect them at all - they show the CPU as dual-core.\nChipworks are still guessing the position on the chip of those two cores, but their placement is not of importance right now, but the fact that they are exclusive to the iOS and can't be found by anything else. So, as far as the processing performance is concerned - all benchmarks use the two high-performance A10 cores ticking at 2.34GHz.\nAnd speaking of CPU cores, meet the most powerful mobile processor core in the world to date - the one inside Apple A10 Fusion. It runs on 2.34GHz, which is among the highest clocks we've seen, but it also offers the best performance right now. The new A10 core offers double the processing power of the Snapdragon 820's Kryo (OnePlus 3), double the Cortex-A72 performance (Huawei P9), and 40% increase over the CPU Twister core inside the iPhone 6s, 6s Plus, and SE.\nGeekBench 4 (single-core)\nHigher is better\nApple iPhone 7\n3488\nApple iPhone SE\n2514\nApple iPhone 6s Plus\n2509\nApple iPhone 6s\n2380\nSamsung Galaxy S7\n1854\nHuawei Honor 8\n1720\nOnePlus 3\n1719\nSony Xperia XZ\n1578\nApple iPhone 6 Plus\n1471\nApple iPhone 6\n1465\nSamsung Galaxy Note5\n1332\nHuawei nova\n842\nBut how about two of those? Well, the dual-core A10 processor is more powerful than any other dual, quad, hexa, octa, or deca-core processor on the market. It's 40% better than the quad-core Kryo (S820, OnePlus 3) and the dual-core Twister inside the iPhone 6s generation, and just a hair on top of the latest Kirin chipset inside the Honor 8 (4x A72 + 4x A53).\nGeekBench 4 (multi-core)\nHigher is better\nApple iPhone 7\n5654\nHuawei Honor 8\n5447\nSamsung Galaxy S7\n5245\nApple iPhone 6s Plus\n4234\nApple iPhone SE\n4158\nOnePlus 3\n4045\nApple iPhone 6s\n4001\nSony Xperia XZ\n3868\nSamsung Galaxy Note5\n3754\nHuawei nova\n3105\nApple iPhone 6 Plus\n2465\nApple iPhone 6\n2459\nChipworks hasn't yet determined the exact GPU model, but it confirmed it's indeed a six-core unit (just like the PowerVR GT7600 six-core GPU inside the iPhone 6s). We know Apple promises a 50% performance bump, so let's see.\nThe 1080p offscreen tests which help us determine the raw performance put the A10 GPU on top of any other GPU we've tested so far. The 3.0 test gives the A10 GPU about 20% more power over the Adreno 530 in the OnePlus 3 and 30% over the latest Mali-T880MP12 inside the Exynos-powered Galaxy Note7. It is also 50% better than the PowerVR GT7600 inside the iPhone 6s, as promised.\nGFX 3.0 Manhattan (1080p offscreen)\nHigher is better\nApple iPhone 7\n61\nSamsung Galaxy Note7 (Snapdragon)\n49\nOnePlus 3\n46\nSamsung Galaxy Note7 (Exynos)\n40\nApple iPhone SE\n39.6\nApple iPhone 6s\n39.5\nApple iPhone 6s Plus\n39.5\nSamsung Galaxy S7\n38\nSamsung Galaxy Note5\n21\nApple iPhone 6 Plus\n18.6\nHuawei Honor 8\n18\nHuawei P9\n18\nApple iPhone 6\n17.7\nSony Xperia X\n14\nHuawei nova\n10\nThe 3.1 test gives the A10 GPU 30% more power over the Adreno 530 and 50% sharp over the Mali-T880MP12 (Note7) and PowerVR GT7600 (iPhone 6s).\nGFX 3.1 Manhattan (1080p offscreen)\nHigher is better\nApple iPhone 7\n43\nSamsung Galaxy Note7 (Snapdragon)\n32\nSony Xperia XZ\n31\nOnePlus 3\n31\nSamsung Galaxy Note7 (Exynos)\n28\nSamsung Galaxy S7\n28\nApple iPhone 6s Plus\n27.9\nApple iPhone SE\n26.8\nSamsung Galaxy Note5\n15\nHuawei Honor 8\n10\nHuawei P9\n10\nSony Xperia X\n9.2\nHuawei nova\n6.3\nThe iPhone 7 runs on a sub-1080p resolution, which gives it an advantage over the flagship competition running at 1080p or 1440p. The iPhone 7 reaches the 60fps refresh-rate cap on both tests, so there is nothing the phone can't handle not today, and not for the next couple of years to come.\nGFX 3.0 Manhattan (onscreen)\nHigher is better\nApple iPhone 7\n60\nApple iPhone SE\n59.2\nApple iPhone 6s\n53.6\nOnePlus 3\n45\nApple iPhone 6s Plus\n38.6\nApple iPhone 6\n29.2\nSamsung Galaxy Note7 (Snapdragon)\n29\nSamsung Galaxy S7\n27\nSamsung Galaxy Note7 (Exynos)\n27\nHuawei Honor 8\n19\nHuawei P9\n19\nSamsung Galaxy Note5\n15\nSony Xperia X\n15\nHuawei nova\n10\nGFX 3.1 Manhattan (onscreen)\nHigher is better\nApple iPhone 7\n60\nApple iPhone SE\n58\nSony Xperia XZ\n32\nOnePlus 3\n30\nApple iPhone 6s Plus\n27.9\nSamsung Galaxy Note7 (Snapdragon)\n16\nSamsung Galaxy S7\n15\nSamsung Galaxy Note7 (Exynos)\n15\nHuawei Honor 8\n11\nHuawei P9\n11\nSony Xperia X\n10\nSamsung Galaxy Note5\n6.7\nHuawei nova\n6.5\nBaseMark ES 3.1 is a super-heavy GPU benchmark that only flagships can finish without crashing or taking an hour or two. The iPhone 7' GPU not only topped that one by a mile, but it also received another gold medal by BaseMark for being the best device in their database so far!\nBasemark ES 3.1 / Metal\nHigher is better\nApple iPhone 7\n1547\nApple iPhone 6s Plus\n916\nApple iPhone SE\n882\nApple iPhone 6s\n879\nSamsung Galaxy S7\n732\nSamsung Galaxy Note7 (Exynos)\n727\nSamsung Galaxy Note7 (Snapdragon)\n629\nOnePlus 3\n625\nHuawei Honor 8\n345\nHuawei P9\n341\nSamsung Galaxy Note5\n316\nSony Xperia X\n251\nHuawei nova\n138\nNext, it's time to run the compound benchmarks, which compute CPU, GPU, RAM, storage, UX performance among others. You bet the iPhone 7 topped the BaseMark OS II 2.0 test with a huge gap between the second-best phone - the two Galaxy Note7 models. The device also received a Gold medal for being the best device in BaseMark OS II 2.0 all-time chart taking the first place! A respectable moment of awe silence goes here.\nBasemark OS 2.0\nHigher is better\nApple iPhone 7\n3416\nSamsung Galaxy Note7 (Exynos)\n2676\nSamsung Galaxy Note7 (Snapdragon)\n2432\nOnePlus 3\n2365\nApple iPhone 6s Plus\n2261\nApple iPhone 6s\n2195\nApple iPhone SE\n2163\nSony Xperia XZ\n2151\nSamsung Galaxy S7\n2128\nHuawei Honor 8\n2099\nHuawei P9\n2068\nSamsung Galaxy Note5\n1880\nSony Xperia X\n1714\nHuawei nova\n1218\nFinally, AnTuTu 6 pretty much confirms the BaseMark OS 2.0 conclusions - there isn't any better smartphone than the iPhone 7 right now.\nAnTuTu 6\nHigher is better\nApple iPhone 7\n179386\nOnePlus 3\n141764\nApple iPhone 6s Plus\n137420\nSamsung Galaxy Note7 (Exynos)\n134660\nSamsung Galaxy S7\n132084\nSamsung Galaxy Note7 (Snapdragon)\n130111\nApple iPhone 6s\n129990\nApple iPhone SE\n123961\nHuawei P9\n98069\nHuawei Honor 8\n94892\nSamsung Galaxy Note5\n81615\nSony Xperia X\n77537\nHuawei nova\n65021\nApple has done it again - it made the best mobile chipset from which others can only learn from. Its dual-core processor, even without the help of the tiny energy efficient cores, beats any other processor out there. The A10 GPU is equally impressive acing every graphic benchmark.\nThe iPhone 7 is the fastest and most powerful smartphone in the world. It runs cooler than any other flagship even at peak performance though along the edge around the power key there is a zone that gets quite hot at times when the phone is under load but it's still within reasonable limits.",
        "sentiment": 0.37517703883349895
    },
    "article_23": {
        "title": "Tim Cook: \"we don't buy\" the need to give up privacy for AI",
        "body": "During today's fourth quarter 2016 earnings call, Apple CEO Tim Cook was asked about Siri, artificial intelligence, home assistants vs. mobile assistants, and balancing AI with security, which led to some interesting new insights into Siri's popularity and Apple's privacy stance.\nAccording to Cook, Apple is now getting more than 2 billion Siri requests per week. \"It's very large,\" he said, \"and to the best of our knowledge, we've shipped more assistant enabled devices than anyone out there.\" He went on to highlight Apple's efforts to deliver a great Siri experience around the world. While most AI services are limited to the United States, Siri is available in many countries. \"We put a lot of energy into that,\" Cook said.\nCook also said that he believes there's more value in having a phone with a personal assistant built in, like Siri, than a home device. \"We live in a mobile society,\" he said. \"People are constantly moving from home to work and to other things they may be doing. And so the advantage of having an assistant on your phone is that it's with you all the time.\" He went on to say that there's still a market for a home assistant like the Amazon Echo, but that usage on a phone \"will likely be much greater.\"\nOn security, Cook said that Apple does not believe there's a need to compromise security for the sake of artificial intelligence.\nIn terms of the balance of privacy and AI, this is a long conversation, but at a high level, this is a false tradeoff. People would like you to believe you have to give up privacy to have AI do something for you, but we don't buy that. It might take more work, it might take more thinking, but I don't think we should throw our privacy away. It's sort of like the age old argument between privacy and security. You should have both. You shouldn't have to make a choice.\nIn the past, rumors have suggested that Apple's staunch dedication to privacy has held back the development of Siri. Apple is said to employ \"policy czars\" that make sure Apple services are not collecting customer data, something that has restricted the way Siri can be used.\nApple has, however, made some important steps forward with Siri in recent years through the use of machine learning and a neural network, advancements Cook highlighted earlier in the call. Just this year, Apple was able to open up Siri to third-party developers, and the company is said to be hard at work on some major improvements that will allow Siri to do more and to be built into products like a rumored Echo-like smart home device.",
        "sentiment": 0.14769670630440765
    },
    "article_24": {
        "title": "The iPhone 7 Plus Smokes Google's Pixel XL in Speed Test Comparison",
        "body": "When compared to the iPhone 7 Plus, not only did Google’s Pixel XL lose, but it took nearly twice as long to complete two rounds of the same apps. Remember, this is despite the fact that the Pixel XL has an extra GB of RAM and is using the latest SnapDragon 821 processor.\nWhat’s even worse, the Pixel is not much faster than the heavily skinned Samsung Galaxy Note 7, a phone that has since been pulled from the market due to faulty battery issues.\nThe video clearly shows how far ahead Apple is when it comes to optimizing hardware and software together, something we can’t say for any other smartphone.\nYou can check more of Phonebuff’s videos here, where the iPhone 7 continues to slaughter the competition.",
        "sentiment": -0.4495929304510355
    }
}