{
    "article_0": {
        "title": "Comment: Apple selling a $79 MacBook Pro power adapter without a USB-C cable is a step too far",
        "body": "I’ve said more than once that I’m relaxed about Apple’s decision to fit only USB-C ports in the new MacBook Pro. I’d rather have to pay for two adapters and one cable now than be stuck with outdated ports for most of the 4-5 years I expect to keep the machine.\nBut I discovered that Apple did have one more hidden extra cost in store for 2016 MacBook Pro buyers: the $69 (13-inch model) or $79 (15-inch model) power adapter the company sells as an accessory doesn’t include the USB-C cable you need to actually, you know, use it …\nWhat you get in the box is:\nthe power adapter\na mains plug\nthat’s all\nThere is no figure-8 extension cable, exactly as with the MacBook Pro itself (it’s available separately for $19), which is perhaps forgivable – not everyone will need one. But there’s also no USB-C cable, rendering the charger completely useless unless you lay out another $19. If you want both the figure-8 cable and USB-C cable, that brings the total cost of a second charger for the 15-inch MacBook Pro up to $125.\nI’m lazy. I can’t be bothered to move power adapters around, so I always have three: one in the office, one in the living-room and one that lives in my luggage along with a complete set of essential cables. That’s a habit I developed when I was doing a lot of travel, enabling me to pack in ten minutes flat and also ensuring I didn’t forget anything important, but one I still consider worthwhile today.\nSo two additional power adapters would – at Apple prices – add up to $250 on top of what is already an extremely expensive machine. That does, I have to say, leave a rather unpleasant taste in my mouth.\nOf course, there’s no need to pay Apple prices for either cable. Amazon has masses of USB-C to USB-C cables, including ones from respected brands for around half the price of Apple’s cable. Same with figure-8 leads, like a two-pack for $8.\nBut it’s the principle of the thing. What Apple is selling is not a power adapter in the sense that it has always sold them – something you can take out of the box and start using – but rather one half of a power adapter kit, with the other half sold separately. That, to me, is taking penny-pinching a step too far.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.17075388237006134
    },
    "article_1": {
        "title": "Ars Technica Review: The $1,499 2016 MacBook Pro is an expensive MacBook Air on the inside",
        "body": "Andrew Cunningham\nAndrew Cunningham\nAndrew Cunningham\nAndrew Cunningham\nAndrew Cunningham\nAndrew Cunningham\nAndrew Cunningham\nAndrew Cunningham\nAndrew Cunningham\nAndrew Cunningham\nYou can't fault longtime die-hard Mac users for being a little frustrated with Apple. In the space of just a decade, they've watched their favorite platform go from being the center of the company's attention to a minor line item. The iPhone gets refreshed promptly and consistently every September, while some Macs sit there for one or two or three years without even being mentioned. Macs aren't even regularly refreshed with new processors from Intel, Nvidia, and AMD as they're released anymore; we could rely on that as recently as three years ago.\nThe new MacBook Pros—released, for the record, a year and a half after the 2015 models, which were in some cases changed very little from the 2014 and 2013 models—have been birthed into this era of frustration. As a result, the initial reaction has been harsher than it would have been if Apple refreshed the Mac with the same regularity that it managed back in 2012 or 2013.\nBut not everyone is a longtime Mac user, and divorced from that context what you've got in the new MacBook Pros is a lineup of very nice-looking (if not game-changing) laptops that combine a refreshed design with a healthy dose of updated technology. Today, we'll be examining the $1,499 version of the 13-inch MacBook Pro, the version with the row of function keys in place of the ballyhooed Touch Bar. We'll be examining the other 13- and 15-inch model thoroughly when we can get them, of course, but the $1,499 version still tells us a lot about the design, the keyboard, the new Thunderbolt 3 ports, and about Apple's design priorities and the Pro's target audience.\nAdvertisement\nDifferences between the Touch Bar model and this one\nSpecs at a glance: 13-inch 2016 Apple MacBook Pro (Two Thunderbolt 3 ports) Screen 2560×1600 at 13.3\" (227 PPI) OS OS X 10.12.1 Sierra CPU 2.0GHz Intel Core i5-6360U (Turbo up to 3.1GHz) RAM 8GB 1866MHz LPDDR3 (soldered, upgradeable to 16GB at purchase) GPU Intel Iris 540 (integrated, 64MB eDRAM) HDD 256GB PCIe 3.0 x4 solid-state drive Networking 867Mbps 802.11a/b/g/n/ac, Bluetooth 4.2 Ports 2x Thunderbolt 3, headphones Size 11.97\" × 8.36\" × 0.59\" (304.1 mm × 212.4 mm × 14.9 mm) Weight 3.02 lbs (1.37 kg) Battery 54.5Whr Warranty 1 year Starting price $1,499.99 Price as reviewed $1,499.99 Other perks 720p webcam, backlit keyboard, dual integrated mics\nThe Touch Bar is the biggest feature separating this entry-level MacBook Pro from the more expensive models, but there are some other small and not-so-small differences you have to live with when you opt for the $1,499 model. This is the complete list—otherwise, assume that the two share all the same features.\nThe low-end Pro uses a 15W Core i5-6360U CPU with an Intel Iris 540 GPU; the high-end model uses a 28W Core i5-6267U CPU with an Intel Iris 550 GPU. The difference, aside from small boosts to CPU and GPU clock speeds, is that the 28W model can run faster for longer and throttle less frequently. The 15W model can also consume less power.\nThe low-end Pro uses a single “Alpine Ridge” Thunderbolt 3 controller from Intel while the high-end Pro uses two Thunderbolt controllers (one of those controllers uses \"reduced PCI Express bandwidth,\" which I assume means it's using PCI Express 2.0 instead of 3.0). Intel’s Thunderbolt controllers support a maximum of two Thunderbolt 3 ports each, and while many PC OEMs are shipping Thunderbolt 3, none is providing more than one or two ports.\nThe low-end Pro uses 1866MHz LPDDR3 RAM while the high-end Pro uses 2133MHz LPDDR3. Apple has said it’s using LPDDR3 to save power, but it’s also the reason the systems max out at 16GB.\nThe low-end Pro actually has a larger battery than the high-end one: 54.5Whr compared to 49.2Whr. Apple says both laptops have 10 hours of battery life, but the lower-power processor, the larger battery, and the lack of a little second screen above the keyboard should all mean that the low-end model actually lasts a bit longer than the Touch Bar model.\nThe low-end model includes two integrated mics, while the high-end model includes three.\nLook and feel\nIf the Retina MacBook was what you’d get if an iPad and a MacBook Air were put into the Large Hadron Collider and smashed into each other, the new MacBook Pro is what you’d get if you took the Retina MacBook and the first Retina MacBook Pro and did the same thing. Like the MacBook, the new Pros are slimmer, have much smaller display bezels and footprints, and jettison many ports. Like the previous Pro, they’re a uniform thickness throughout rather than tapered, they’ve still got more powerful processors, and because of those more powerful components they still have fans inside.\nAdvertisement\nThe Pro’s construction is still rock solid despite being thinner and lighter, and there’s still not a trace of creaking or flexing anywhere in its aluminum unibody design. If you were bothered by previous designs’ unadorned metal or the hard corners of their wrist rests, none of that has changed. Apple does offer both a “space gray” finish alongside the classic silver, though the MacBook’s gold and rose gold finishes and the iPhone 7’s black and jet black finishes aren’t available. I tend to prefer darker gray and black colors when I can get them, and the space gray finish is really nice even if it still bothers me that Apple can’t quite keep the “space gray” color consistent across different product lines and model years.\nAt 3.02 pounds, the new Pro is around half a pound lighter than last year’s and roughly the same weight as the 13-inch MacBook Air. I’m jumping from the 13-inch Air to the 13-inch Pro since I can’t quite live with the 12-inch MacBook’s performance or its individual port, so if you’re making that jump the laptop is going to feel exactly the same in your bag. The weight savings is noticeable but not life-changing if you’re coming from an earlier Retina model, but remember that it’s a full 1.5 pounds lighter than a pre-Retina, 13-inch unibody Pro—if you’re coming from one of those older machines, it makes a huge difference.\nThe laptop’s fan is normally not audible in a room with little to no ambient noise. You can definitely notice it spin up if you’re pushing the laptop’s performance for an extended period, but it’s quieter than the previous Pros or Airs, and it’s much quieter than the jet engine-style noises that come out of some PC Ultrabooks. Even when the fan is going at full-tilt, the laptop can still get pretty warm, especially underneath and on the area above the keyboard. Still, it never gets too uncomfortable to hold or rest on your lap.",
        "sentiment": -0.04010034932621888
    },
    "article_2": {
        "title": "GIF of Apple's website in late 90's",
        "body": "Distance and online courses\nWe’re experts in distance learning and online courses – we've helped over 2 million people fulfil their potential and open up their future.\nStudy with us to benefit from innovative teaching and qualifications respected by employers; all with the flexibility and value not always available at classroom-based universities.",
        "sentiment": 0.9955098927021027
    },
    "article_3": {
        "title": "Apple cuts USB-C adaptor prices in response to MacBook Pro complaints",
        "body": "Apple is cutting prices for all of its USB-C adapters following a week of complaints about the MacBook Pro’s inconvenient port situation.\nThe new MacBook Pro only has USB-C / Thunderbolt 3 ports, so the vast majority of the peripherals people use today will need adapters to work. Someday, all those devices will likely use USB-C, but that day is not today and the Pro users interested in Apple’s new computers have been vocal about the problem.\nApple released a statement explaining the price cut: \"We recognize that many users, especially pros, rely on legacy connectors to get work done today and they face a transition. We want to help them move to the latest technology and peripherals, as well as accelerate the growth of this new ecosystem. Through the end of the year, we are reducing prices on all USB-C and Thunderbolt 3 peripherals we sell, as well as the prices on Apple's USB-C adapters and cables.”\nIt’s a sign that Apple recognizes these dongles are a hassle, and it seems to hope that reducing the prices on them will lessen the pain of this transition. Starting immediately, all of Apple’s USB-C adapters and some of its USB-C cables will have their prices cut by $6 to $20:\nOnly USB-C charging cables aren’t being discounted.\nApple is also cutting prices by around 25 percent on all third-party USB-C peripherals that it sells. SanDisk’s USB-C SD card reader is getting a slightly steeper discount, from $49 to $29.\nThe discounted adapters will be available at Apple’s physical and online stores through the end of the year. It still has no plans to ship adapters in the box with the new MacBook Pro.\n“We want to help [pros] move to the latest technology.”\nWhile it’s never been hard to find cheap USB-C adapters — they’ve always been plentiful on Amazon — these price cuts will still be a big help for early buyers of the MacBook Pro. Apple’s cables, unlike those you might order from a random seller online, are going to be well-made and reliable. With their prices cut lower, it now makes sense to buy from Apple instead of a seller you don’t have experience with.\nThe 13-inch MacBook Pro without a Touch Bar is already on sale, and reviews have been coming out — including our own — critical of Apple’s decision to use USB-C ports exclusively, effectively mandating that buyers use adapters to get anything connected. Cutting adapter prices doesn’t solve the problem, but it does ease the transition, something that Apple ought to be doing since it’s the one pushing people headfirst into this change in the first place.",
        "sentiment": 0.21554662794288662
    },
    "article_4": {
        "title": "Apple releases $199/$299 hardbound book covering 20 years of Apple product design, dedicated to Steve Jobs",
        "body": "Update: The ‘Designed By Apple In California’ book is now available to buy at Apple Stores, if you are so inclined. Both sizes, $199 small or $299 large, are shipping in one business day in the United States. Original story below …\nApple has announced a new hardbound book, available for $199 or $299 online at Apple.com and Apple retail stores from tomorrow, which charts a 20-year history of Apple design from the iMac in 1998 to the Apple Pencil in 2015. The book features 450 photographs of Apple products new and old, including iPhone, iPod and Apple Watch.\nThe book is called ‘Designed by Apple in California’ and is dedicated to Steve Jobs. Jony Ive has also conducted in a video interview discussing the commemorative book.\nThe book is available in two sizes and printed on specially milled, custom-dyed paper with silver edges. According to Apple, the book was created over an eight-year period and is published by the company itself, not a third-party.\nThe full-page images inside are shot by photographer Andrew Zuckerman and show off the finished products in addition to the design process. ‘Designed by Apple in California’ features total of 450 images spanning twenty years of Apple product design.\nHere’s how Jony Ive describes the purpose of the book:\nWhile this is a design book, it is not about the design team, the creative process or product development. It is an objective representation of our work that, ironically, describes who we are. It describes how we work, our values, our preoccupations and our goals. We have always hoped to be defined by what we do rather than by what we say. We strive, with varying degrees of success, to define objects that appear effortless. Objects that appear so simple, coherent and inevitable that there could be no rational alternative.\nIt is described as a photo archive, focusing predominantly on the full-page imagery of iPhone, Apple Watch, iPod, Mac and more. In the press release, Apple SVP Design Jony Ive says that the book is an archive of work: “This archive is intended to be a gentle gathering of many of the products the team has designed over the years. We hope it brings some understanding to how and why they exist, while serving as a resource for students of all design disciplines.”\nAs a specialist item, the book will only be available from Apple directly. From tomorrow, the book will be available from Apple.com in United States, the United Kingdom, Australia, France, Germany, Hong Kong, Japan, Korea, Taiwan as well as “select” Apple Stores.\nThe book is available in two sizes. The small 10.20 inch by 12.75 inch edition is priced at $199 and the larger 13 inch by 16.25 inch edition is priced at $299. If the price is too high for you to buy this piece of Apple memorabilia, Apple says the book will be on display at Apple retail stores in which it is sold.\nBy the way, for a substantially cheaper photo book of Apple design, Jonathan Zufi published Iconic: A Photographic Tribute to Apple Innovation for $50 hardcover in 2014. It’s not official nor as fancy as the new Ive book, but it is a quarter of the price!\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.11968064697326294
    },
    "article_5": {
        "title": "Netflix Launches Downloads for Offline Viewing on Smartphones, Tablets",
        "body": "Netflix has finally rolled out a feature subscribers have been requesting for years: The company will now let members worldwide download select TV shows and movies for viewing on Apple and Android devices while disconnected from the internet.\nThe latest versions of the company’s mobile apps include a “download” button on the details page for a film or TV series — although not all titles on the streaming service are currently available to watch offline. The app also includes a new menu item showing what’s available to download.\nNetflix said it will add more series and movies to download in the future. Original series including “Orange Is the New Black,” “Narcos,” “House of Cards,” “Stranger Things,” “Unbreakable Kimmy Schmidt,” “Master of None” and “The Crown” are available for download starting Wednesday. Other titles available for offline viewing include TV shows “Breaking Bad,” “Supernatural,” “The Office,” “The Flash” and “The 100,” and animated movies “Minions,” “Kung Fu Panda 3” and “Home.”\nContent currently not available to download for offline viewing includes Netflix’s reboots of “Gilmore Girls” and “Fuller House,” as well as the Marvel street-hero series including “Daredevil,” “Luke Cage” and “Jessica Jones.” Also excluded are Disney movies including “Jungle Book,” “Zootopia” and “Lilo & Stitch.”\n“While many members enjoy watching Netflix at home, we’ve often heard they also want to continue their ‘Stranger Things’ binge while on airplanes and other places where internet is expensive or limited,” Eddy Wu, Netflix’s director of product innovation, wrote in a blog post announcing the feature.\nAmazon Prime Video has offered offline viewing to members on iOS and Android apps for more than a year, while YouTube Red and Starz’s mobile apps also provide video downloads for access in offline mode.\nNetflix’s new download feature is included in all plans and available for Android and iOS phones and tablets. To download titles, users will need iOS 8.0 or later or Android 4.4.2 or later as well as the latest update of Netflix’s app. The default settings allow downloads only over Wi-Fi connections but users can turn that off.\nNetflix execs had previously raised the prospect of allowing downloads for offline viewing, but they had suggested the company would first launch the feature in countries with constrained bandwidth infrastructure.",
        "sentiment": -0.20193829896549384
    },
    "article_6": {
        "title": "Apple Takes 104% of All Smartphone Profits Following Galaxy Note 7 Recall",
        "body": "Apple accounted for over 100 percent of smartphone industry profits in the third quarter of this year, according to estimates published by BMO Capital Markets on Thursday.\nAnalyst Tim Long, quoted in the Investor's Business Daily, said Apple's staggering 103.6 percent profit share in Q3 2016 came largely as a result of significant losses posted by rival vendors including LG and HTC, and despite Apple continuing to shift fewer handsets year on year.\nBased on units alone, Samsung accounted for 21.7 percent of all smartphones sold, with Apple coming in second with a 13.2 percent share. In terms of profits however, Samsung came a distant second to Apple, capturing only a 0.9 percent share.\nSamsung ceded market share in smartphone shipments to Apple and Chinese vendors in the third quarter because of its Galaxy Note 7 troubles, Long said. He expects further share loss by Samsung in the current quarter. Apple captured over 100% of smartphone industry profits for the first time, thanks in part to Samsung's weaker results, Long said.\nIf accurate, the estimates represent the first time Apple has achieved smartphone industry profits of over 100 percent - an impressive number for a company owning only around 12 percent of the market.\nAccording to the same report, Apple managed 90 percent profit share in the same quarter a year ago. However, this year Apple's iPhone 7 numbers were undoubtedly helped by Samsung's hugely damaging Galaxy Note 7 recall and discontinuation, which effectively took the South Korean company out of this year's flagship smartphone race, indicating Apple's profit share is unlikely to be sustained in the long term.\nDespite the impressive numbers, Apple's recent third quarter financial results reported its first full-year revenue decline for Apple since 2001, although Apple expects to return to revenue growth in the holiday season on the back of sales of the iPhone 7 and iPhone 7 Plus.",
        "sentiment": -0.001226185059005564
    },
    "article_7": {
        "title": "New MacBook Pro outsold every competing laptop in just five days – Slice Intelligence",
        "body": "Apple already told us that the 2016 MacBook Pro had set a new online sales record, backed by supply-chain reports of increased component orders, but Slice Intelligence has provided our first look at the scale of those orders. The company reports that the new models took just five days to outsell every high-profile laptop on the U.S. market.\nIt has already outsold combined sales of the Dell XPS 13 and 15 – probably the closest equivalents in the Windows world – which have been on sale for more than ten months. It has also sold almost four times as many units as Microsoft’s flagship laptop, the new Surface Book.\nThe company additionally compared sales to Apple’s own 12-inch MacBook, to see how its pro laptops were faring against its ultraportable model …\nJust five days in, the MacBook Pro models had already hit almost 80% of combined 2015 and 2016 MacBook sales – and look set to exceed 18 months of sales in the first week.\nSlice gets its data by analysing email receipts among its panel of 4.4M online shoppers. The methodology isn’t perfect, counting only online sales in the USA, but the size of the panel should mean it provides a reasonably reliable steer.\nIt wasn’t all good news for Apple: the data also showed that not everyone could wait for the company to finally update its pro models. Of those who bought an Apple laptop in 2014, some 40% had since bought another brand. This number will, however, include those who bought a second machine, or a Windows laptop as a gift for family or friends.\nThe sales of course need to be viewed in perspective. Just as iPhone 6 sales reflected pent-up demand for larger-screen phones, 2016 MacBook Pro sales will be in large part driven by similar pent-up demand for a long-awaited update to the range. Even so, this data indicates a successful launch by any standards.\nVia CNET\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.1232341319322586
    },
    "article_8": {
        "title": "Apple May Add 'Jet White' Color Option For iPhone 7 and iPhone 7 Plus",
        "body": "Apple plans to add a \"Jet White\" color option for iPhone 7 and iPhone 7 Plus models, according to Japanese website Mac Otakara. The report did not outline when Apple might add the sixth color to the lineup, and it also warned the information obtained from supply chain sources \"may be unreliable.\"\nMac Otakara has accurately leaked information about Apple's upcoming plans in the past, including the new Jet Black color and no 3.5mm headphone jack on iPhone 7. It was also correct about several other iPhone 7 details, including its naming, flush Home button, longer earpiece cutout, and lack of Smart Connector.\nNevertheless, the blog has been wrong on occasion, such as when it said the iPhone SE may come in a brighter pink shade that's different than Rose Gold. Moreover, given the lack of confidence in its own source, this rumor may not materialize and should be treated with a proverbial grain of salt.",
        "sentiment": -0.23856562562286854
    },
    "article_9": {
        "title": "\"That one glaring design mistake in the iMac is that Apple decided to build it without a floppy-disk drive\" - Walt Mossberg",
        "body": "HESE WORDS are being created on the coolest-looking desktop personal computer I've ever used. It's a handsome two-tone devil, sort of blue-green and off-white, tapered at the rear, with a crisp, built-in 15-inch monitor and internal stereo speakers. It takes up very little space and looks like part of the decor in your home, not an invader from some techie's workshop.\nThe case is translucent, so that the internal components are faintly visible. The cords and connectors are conveniently located on the side, not the back, and are hidden behind a little door to preserve the clean lines. As I move the unusual, circular mouse, I can see the blue and white ball rolling around inside, like a spinning top.",
        "sentiment": 0.6672634184360504
    },
    "article_10": {
        "title": "Phil Schiller Says Apple Tested and Rejected Touch Screen Macs, Finding It 'Absurd' on a Desktop",
        "body": "Apple's senior vice president of worldwide marketing, Phil Schiller, recently continued the company's stance against turning its desktop and laptop devices into touch screen-enabled computers, which some customers believe could be advantageous additions to the macOS platform. With the new addition of the \"Touch Bar\" on the MacBook Pro line, seen by some as a potential step towards a full-on Mac touch screen, many Apple executives have come out saying this isn't the case.\nSpeaking with Backchannel, Schiller has now stated that a multi-touch display on a MacBook \"wouldn't be enough,\" because it would begin a divide between MacBook and iMac. But, if the company implemented the same touch screen on a desktop it would \"become absurd,\" due to the iMac's main source of user interaction -- the keyboard and mouse or trackpad -- residing too far away from where users would raise their hand to interact with the screen. Ultimately, Schiller said this line of thought is \"lowest common denominator thinking.\"\n“We think of the whole platform,” he says. “If we were to do Multi-Touch on the screen of the notebook, that wouldn’t be enough — then the desktop wouldn’t work that way.” And touch on the desktop, he says, would be a disaster. “Can you imagine a 27-inch iMac where you have to reach over the air to try to touch and do things? That becomes absurd.” He also explains that such a move would mean totally redesigning the menu bar for fingers, in a way that would ruin the experience for those using pointer devices like the touch or mouse. “You can’t optimize for both,” he says. “It’s the lowest common denominator thinking.”\nAll the same, Schiller confirmed that Apple has tried out touch screens on a Mac in its labs over the last few years and the company \"absolutely come away with the belief that it isn't the right thing to do,\" he said. \"Our instincts were correct.” When asked whether the Touch Bar was the beginning of a larger influence by iOS on the macOS platform, Schiller said this was not the case.\nWhen I suggested that this might be only the latest in a number of mobile innovations moving to the Mac, in an overall annexation of the Macintosh platform, Schiller pushed back, hard. “Its implementation is pure Mac,” he said. “The thought and vision from the very beginning was not at all, ‘How do we put iOS in the Mac?’ It was entirely, ‘How to you use the [iOS] technology to make a better Mac experience?’”\nIn regards to the MacBook Pro's switch to Thunderbolt 3/USB-C ports, and the subsequent frustration by some users who fear needing to purchase and keep track of many dongles, Schiller said that “we’re absolutely more sure than ever that we’ve done the right thing,” because of the standard that USB-C is set to become. For context regarding the amount of cables available, MacRumors recently collected some USB-C adapters and dongles available from Apple and third-party accessory makers into a roundup.\nUltimately, Schiller said that the \"fundamental difference\" between the MacBook Pro's naysayers and fans is divided between those who have not yet interacted with the laptop, and those who have. Thankfully, many more will be able to get a chance to use the MacBook Pro and Touch Bar as the first round of shipments have begun arriving to pre-order customers today.",
        "sentiment": -0.18251688374827305
    },
    "article_11": {
        "title": "Apple, let us choose the apps we want to use in iOS",
        "body": "Apple’s desktop and mobile operating systems provide a full suite of applications that allow you to do most of what you want without downloading any additional apps. You can browse the web, send and receive email, manage calendars and contacts, and much more, all with the stock apps included in macOS and iOS.\nBut on macOS, you have the choice to not use those apps. Say you want to use Microsoft Outlook instead of Apple Mail; you can make this change, and when you click a link to send an email, Outlook will open. Or if you want to use Chrome instead of Safari, the same thing will happen: URLs you click will open in Google’s browser.\nIn macOS Sierra, change the default web browser in the General pane of System Preferences. To change the default email client, go to Mail’s General preferences.\nYou can even change the default app to open any specific file type on the Mac. Say you work with plain text files, but have a text editor you prefer over Apple’s TextEdit. You can change this so every time you double-click a .txt file, it opens with your selected app. To do this, select a file, press Command-I, then expand the Open With section if it’s not already expanded. Click the popup menu and select the app you want to use, then click Change All.\nChange the default app for a specific file type on the desktop.\nBut iOS offers no such option. If you tap a URL, it opens in Safari. If you tap a link to send an email, it opens in Mail. The default calendar is Apple’s Calendar app. And so on. You may not want to work that way and because Apple doesn’t give you any choice, you’re stuck with workarounds: using share sheets to open a web page in a different browser; copying an email link or address to create an email; and so on.\nYou might subscribe to Google’s or Microsoft’s cloud ecosystems, either because you choose to or because your business imposes it. You’d save a lot of time if you could open new links automatically in apps such as Gmail or Outlook. (Yes, you can get and send email from these services in Apple’s Mail, but the other apps may have features you want or need.) You may want to use calendar apps from these companies as well. And there are plenty of reasons to use Google Chrome instead of Safari; if you use it on the desktop, you may want to sync all your bookmarks and activity to be able to access the same information on your iPhone.\nPersonally, I’m quite happy with Safari and Mail, though I don’t use Apple’s Calendar; I use BusyCal, both on the desktop and on iOS. But I know lots of people who are frustrated by the complications of using a browser and email client they don’t like on their iPhones and iPads. I also prefer Google Maps over Apple Maps; the latter is full of erroneous information, and is a lot harder to read.\nWe’re at iOS 10, and Apple still hasn’t allowed users to make these choices. It seems ridiculous that, with a mature operating system, we’re still locked into Apple’s default apps. It’s not rocket science to make these changes; after all, there are protocols that funnel requests to specific handlers, the same way they do on the Mac. Let us choose the apps we want to use: It’s time to let iOS users have the same freedom of choice as Mac users.",
        "sentiment": -0.3393467175483238
    },
    "article_12": {
        "title": "Tim Cook calls for unity at Apple following Trump's victory",
        "body": "Apple CEO Tim Cook sought to reassure employees following Donald Trump's shocking electoral victory this week, according to an internal memo obtained by Buzzfeed News. In the memo, sent Wednesday, Cook called on Apple employees to come together after the bitter presidential campaign, and reaffirmed the company's commitment to diversity.\n\"We have a very diverse team of employees, including supporters of each of the candidates,\" Cook said in the memo. \"Regardless of which candidate each of us supported as individuals, the only way to move forward is to move forward together.\"\n\"Our company is open to all.\"\nTrump was sharply critical of Apple during the campaign, calling for a boycott of the company's products over its refusal to unlock an iPhone used by one of the San Bernardino shooters. \"To think that Apple won't allow us to get into her cellphone? Who do they think they are?\" he said of the company's pro-encryption stance during a TV interview in February. In January, Trump made a fantastical promise to \"get Apple to start building their damn computers and things in this country,\" rather than overseas.\nApple also distanced itself from Trump during the campaign, after withdrawing its support of the Republican National Convention, though Cook held a fundraiser for Speaker of the House Paul Ryan and other Republicans in June. The memo sent this week did not mention Trump by name, though it implicitly repudiated much of the hateful rhetoric upon which the Republican nominee based his campaign.",
        "sentiment": -0.18160349677782506
    },
    "article_13": {
        "title": "Donald Trump Tells Tim Cook He'll Offer Apple Incentives and 'Very Large Tax Cut' to Make Products in America",
        "body": "In a recent interview with The New York Times, President-elect Donald Trump said he received phone calls from Apple CEO Tim Cook and Microsoft co-founder Bill Gates after winning the presidential election earlier this month.\nDonald Trump at The New York Times offices in Manhattan\nI got a call from Tim Cook at Apple, and I said, ‘Tim, you know one of the things that will be a real achievement for me is when I get Apple to build a big plant in the United States, or many big plants in the United States, where instead of going to China, and going to Vietnam, and going to the places that you go to, you’re making your product right here.’\nTrump told Cook it will be a \"real achievement\" for him when he gets Apple to make its products in the United States, as opposed to countries like China and Vietnam where many of its current manufacturing partners operate.\nCook acknowledged the proposition by nondescriptly saying \"I understand that,\" according to Trump.\nTrump said he is confident Apple will turn to U.S. manufacturing based on the incentives he plans to offer the iPhone maker, including a \"very large tax cut\" and \"substantial regulation cuts\" for corporations.\nI said: ‘I think we’ll create the incentives for you, and I think you’re going to do it. We’re going for a very large tax cut for corporations, which you’ll be happy about.’ But we’re going for big tax cuts, we have to get rid of regulations, regulations are making it impossible. Whether you’re liberal or conservative, I mean I could sit down and show you regulations that anybody would agree are ridiculous. It’s gotten to be a free-for-all. And companies can’t, they can’t even start up, they can’t expand, they’re choking.\nA recent report said Apple asked its Taiwanese manufacturing partner Foxconn to study the possibility of moving iPhone production to the United States, although Foxconn chairman Terry Gou is said to be less enthusiastic about the idea due to inevitably higher production costs compared to China.\nWhile campaigning at Liberty University in Virginia earlier this year, Trump said \"we're going to get Apple to start building their damn computers and things in this country instead of in other countries,\" while he has also threatened to introduce a 45% tax on products imported from China.\nCook previously said Apple manufactures iPhones in China because the country has put an \"enormous focus on manufacturing,\" while noting the U.S. workforce has a smaller number of individuals with the \"vocational kind of skills\" needed.\nChina put an enormous focus on manufacturing. In what we would call, you and I would call vocational kind of skills. The U.S., over time, began to stop having as many vocational kind of skills. I mean, you can take every tool and die maker in the United States and probably put them in a room that we're currently sitting in. In China, you would have to have multiple football fields.\nApple also benefits from lower wages in China, where many of its suppliers are located within close proximity of each other. In Asia, Taiwan's TSMC makes A-series chips for iPhones, Japan's Sharp and Japan Display supply iPhone displays, and South Korea's SK Hynix and Japan's Toshiba produce memory chips for the device.\nApple does have a Mac Pro manufacturing facility in Austin, Texas, operated by Flextronics, but it is a limited effort given the relatively low production volume of its high-end desktop computer.\nCook was personally a Hillary Clinton supporter, hosting a fundraiser for the Democratic presidential nominee in August on behalf of himself. In a company-wide memo issued following Trump's victory, Cook urged Apple employees to \"move forward together\" despite \"uncertainties ahead.\"\nApple as a company showed support for both the Democratic and Republican parties during their respective campaigns, but it reportedly withheld support for the 2016 Republican National Convention due to Trump's controversial comments about minorities, women, and immigrants, among other subjects.",
        "sentiment": 0.09481058046221733
    },
    "article_14": {
        "title": "PSA: From December the 4th, HP will be selling a 27\", 4K, 99% sRGB coverage, IPS Monitor that supports USB Type C input and 60w power supply output. Native compatibility with the new MBPs, for $499.",
        "body": "Today HP announced an update to their product lineup, and one of the announcements that caught my eye immediately was the new ENVY 27 display. HP has packed a lot of features into a great looking display, but best of all it’s going to be available for $499.\nThe 27-inch display is an IPS panel, and although HP doesn’t list the refresh rate, it is likely going to be 60 Hz. It also supports FreeSync, meaning it should help with image tearing when gaming at 4K, where the high resolution really taxes even the strongest cards. The benefits won’t be as pronounced as some higher refresh rate gaming displays, but regardless it is better to have this than not.\nHP is also promoting that the “sRGB color accuracy exceeds 99 percent” which sounds like they don’t mean what they are saying. Accuracy is generally measured in Delta E, where lower is better, and gamut coverage is measured in percentage. With full sRGB gamut coverage, hopefully they have spent a bit of effort on panel calibration, and if so they will have a pretty nice display for the money.\nIt also features DisplayPort, HDMI, and USB-C for connectivity, and the latter can also charge your laptop or phone with up to 60 Watts of power. That means this can be a single cable connection to drive the display and power the laptop, which is exactly what USB-C is designed to achieve, and it’s great to see more products supporting this. For a desktop, it is less important, but if you want to dock your laptop, a single cable will give you display, and power.\nThe design is a thin bezel, with a chrome finished support mounting the display to the base. There is no mention of height adjustment, and the images are unclear.\nAs already mentioned, this 27-inch 4K IPS FreeSync display will be price at just $499, with availability starting December 4th.\nSource: HP via Windows Blog",
        "sentiment": 0.26246571966579985
    },
    "article_15": {
        "title": "KGI: Apple to incorporate wireless charging into ‘all-glass’ iPhone 8 in 2017, but wireless charger may not be bundled in the box",
        "body": "According to Apple analyst Ming-Chi Kuo from KGI Securities, the 2017 iPhone will add wireless charging for the first time. Instead of plugging in a cable, iPhone 8 owners will be able to charge their batteries using an inductive pad similar to how the Apple Watch charges. Although many Android phones support wireless charging with plastic and metal chassis, the report says Apple’s switch to a glass casing for iPhone 8 will enable wireless charging at fast speeds with minimum disruption from frequency interference.\nThe report says that Apple may not bundle a wireless charger with every model — it may be limited to the more expensive, higher-capacity SKUs — but expects Apple to adopt wireless charging aggressively through 2018. Plans are up in the air at this point, of course, but buyers of the low-end models may find they have to buy an additional accessory if they want to charge their phone wirelessly.\nKGI has previously said Apple intends to release three new iPhone devices in 2017, two models that are more-iterative successors to the existing iPhone 7 and iPhone 7 Plus, and one major new ‘bezel-less’ design with an OLED display that wraps around the edges and sides of the phone. All three models are expected to feature glass casings which suggests they all will incorporate wireless charging components.\nThe OLED display would technically be about 5.8-inches in size although the active touchscreen diagonal size would be circa 5.2-inches as some of the screen area is being used up on the sides of the product for aesthetic reasons.\nThis iPhone is also expected to feature a Touch ID Home Button somehow integrated into the display itself, eliminating the bottom bezel ‘chin’. The OLED iPhone 8 continues to be described as ‘bezel-less’ but it is unclear how Apple will deal with the top bezel which currently features a speaker and FaceTime camera.\nThe KGI report says that Pegatron will be the sole supplier of the wireless charger as Foxconn is tied up managing the production of the ‘revolutionary’ OLED iPhone. It is not clear whether all iPhones will support wireless charging or whether all iPhones will be bundled with wireless chargers to do it. These may be sold as add-on accessories on some models. Wireless charging is certainly something the public have been asking for but it makes up just one element of the radical new OLED iPhone set to debut late in 2017.\nWireless charging is somewhat of a misnomer because the device still has to be close to another unit that is connected by a wire to the wall. Early this year, Bloomberg said Apple was developing long-range wireless charging for future iPhones, which would better fulfil the promise of distance wireless charging, but the KGI report seems to suggest that the new iPhones would only use the typical close-range inductive mat technology. Hopefully, there can be more clarity on the finer details as the months progress: after all, we are still a year away from the official launch of these new phones.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.19729145351601274
    },
    "article_16": {
        "title": "Don’t Be Fooled: The Mac App Store Is Full of Scams",
        "body": "You love technology, but not everyone does. For many people computers are confusing, even scary. Malevolent actors know this, and try to deliberately trick people online. From ads that look like download buttons to ransomware pop-ups, the web is full of deception-based design, intended to take advantage of the less technically inclined.\nIn theory, this is part of why app stores are useful. Users afraid of being scammed on the open web can browse the Mac App Store with confidence, knowing that Apple’s walled garden will protect them.\nExcept it won’t.\nLet’s Try to Buy Excel Together\nTry to put yourself into the mental state of a novice computer user. You have a brand new iMac, and you want to edit some Excel spreadsheets. In the dock you find that App Store you’ve heard so much about, so you open it. You find the search bar, then type “Microsoft Excel.”\nThe top result is something called “Office Bundle,” and costs $30. You click the result to read more.\nLook at that! This is the “easiest way to create high-quality Word documents, Excel spreadsheets, and PowerPoint presentations.” That’s exactly what you need! Let’s read a little more.\nReading that block of text, what do you suppose this download offers? Go ahead and guess.\nSeriously: guess. I’ll wait.\nIt’s…templates. A $30, 293MB collection of templates, all of which are useless without Microsoft Office.\nIt’s possible for a collection of templates to be worth $30, and for all I know these are really great. But let’s review:\nThis is the top result if you search for “Microsoft Excel.”\nThe word “template” is not in the name of the product.\nThe word “template” is not in the product’s description.\nThe product’s description outlines several functions that are specific to Microsoft Office, and have nothing to do with what customers will acquire by purchasing a collection of templates.\nIt’s literally impossible to find this product by searching for “templates.”\nIt’s easy to see that users could be deceived by this, and it’s hard to imagine that it’s not intentional on the developer’s part. Whatever the intention here, people were deceived:\nLet’s be blunt: these customers were ripped off, and Apple pocketed $10 each. And you’ll only see these comments if you scroll past the two five star reviews that mention the word “app” numerous times. Both of those reviews, by the way, were left by accounts that haven’t reviewed any other apps in the Store.\nSearch for other Office applications and you’ll find more template bundles, disguised as official applications to varying degrees.\nThere are also several $20+ applications that put Microsoft’s free online version of Office into a dedicated browser. Then there are the actual “apps” capable of opening and editing Office files, many of which use terms like “Microsoft Word” in their names. They appear to be slightly modified versions of open source applications, but we’re not about to buy them to find out.\nAll of these fakes use Microsoft brands like Office, Word, and Excel in the product names. The logos aren’t one-to-one copies of Microsoft’s official logos, but they’re almost always the correct color and letter (blue “W” for Word, green “E” for Excel, etcetera).\nRELATED: Why the Mac App Store Doesn’t Have the Applications You Want\nWe’ve talked about why the Mac App Store doesn’t have the applications you want, and the Microsoft Office Suite is among the applications you can’t get there. Maybe you already know this, but tell me: why should the average computer user be expected to? Scammy developers know that they can’t be, and are taking advantage of a hole in the market.\nWith the exception of OneNote and OneDrive, you cannot buy any official Office app from the Mac App Store. You have to purchase it directly from Microsoft, either for $150 or in the form of a yearly Office 365 subscription. (Alternatively, you can use Apple’s iWork suite, which probably came with your Mac, as well as the web version of Microsoft Office online or a free open source alternative like LibreOffice.)\nThis might seem obvious to you. It isn’t obvious to everyone, and the existence of the Mac App Store full of imitators serves to make this a lot more complicated. The walled garden isn’t protecting everyone.\nThese Scummy Apps Are All Over the App Store\nWe’ve focused on Microsoft Office because this is a particularly egregious example. But you don’t have to dig long to find similar problems.\nSearch for “Indesign” and you won’t find Adobe’s publishing tool, but you will find several bundles of tutorial videos with icons that mimic InDesign’s closely.\nIt’s not as clear that any of these applications are trying to deceive people, but it’s another case where it’s striking how closely these developers are mimicking official branding.\nAnd other developers seem to be working some dark App Store SEO magic. Search for “Firefox” or “Chrome” and the top application is “Fast Browser,” a $1 app that hasn’t been updated since 2014.\nUsing this as your browser is a very, very bad idea.\nAnd there’s all sorts of weirdness to be found elsewhere:\nSearch for “Adblock” and you’ll get a $2 application completely unaffiliated with the browser plugin with the same name.\nSearch for any website—Facebook, Gmail, anything—and you’ll find several dozen “apps” that do nothing more than open a browser window with the appropriate website. (Something that you can do for free with many browsers.)\nOver the summer at least one Mac App Store app installed malware onto users’ Macs.\nThe App Store is also full of disk cleaners and memory cleaners, which you absolutely do not need.\nWe could go on. The point is that the App Store, which is supposed to protect users from deception, doesn’t seem to be doing a great job at that. There’s a lot of nonsense offered inside the walled garden.\nRELATED: PC Cleaning Apps are a Scam: Here's Why (and How to Speed Up Your PC)\nApple Needs to Clean Up the Mac App Store\nLast year we outlined how the Windows Store was a cesspool of scams, a problem Microsoft has since been tackling. Apple, for their part, is making an effort to alleviate fake applications for iPhone and iPad users: the iOS App Store is currently being purged of outdated and broken applications.\nBut anyone who browses the Mac App Store regularly knows that this platform needs cleaning out too. Seemingly official applications of dubious value are way to easy to accidentally find by searching. It’s understandable that Apple wants the App Store to appear full, but leaving things seemingly designed to deceive people is hardly an answer.",
        "sentiment": -0.4393411318442839
    },
    "article_17": {
        "title": "John Gruber: \"We’ve all been speculating for years that Apple might start designing its own chips for Macs. At this point it looks like they have to do it. If anything, these new MacBook Pros were overdue — they arrived late and Intel still doesn’t have the chips Apple really needs.\"",
        "body": "“Exploding_m1”, in a thread on Reddit:\nThe true reason behind the lack of 32 GB or DDR4 is Intel. Skylake does not support LPDDR4 (LP for low power) RAM. Kabylake is set to include support, but only for the U category of chips. So no LPDDR4 support for mobile until 2018 I think. One example is the Dell XPS 13. On the Dell XPS 13 version, you cannot go for 32 GB of RAM. Meanwhile, the 15 inches does give you that option, but you have to sacrifice battery life for it.\nFrom what Apple told me last week, I believe this is true. You can certainly argue with the design of the new MacBook Pros — and many are. The argument against this design is that it’s backwards — that for MacBooks targeting pro users, Apple should start with high performance specs and then build a machine that supports things like 32 GB of RAM. If they had done that, they’d have wound up with thicker, heavier designs. Many actual pro users would be delighted by that.\nApple simply places a higher priority on thinness and lightness than performance-hungry pro users do. Apple is more willing to compromise on performance than on thinness and lightness and battery life. Intel just doesn’t make the chips that Apple needs.\nThis is why Apple designs its own chips for iOS. You don’t see people complaining that the iPhone or iPad Pro are underpowered. In fact, they’re faster than their competition. (The iPhone 7 has a single-core Geekbench 4 score that is double that of the Google Pixel.) With iPhones and iPads, Apple makes them ever thinner and lighter and yet they still offer industry-leading performance. We’ve all been speculating for years that Apple might start designing its own chips for Macs. At this point it looks like they have to do it. If anything, these new MacBook Pros were overdue — they arrived late and Intel still doesn’t have the chips Apple really needs.\nIntel is designing its chips for an industry that does not share Apple’s obsession with thinness and lightness.\n★ Monday, 31 October 2016",
        "sentiment": -0.11866557993926108
    },
    "article_18": {
        "title": "Apple Pay branding on vending machines increases mobile payment usage 135%, overall sales by 36%",
        "body": "The results of a new six month study by a company offering Apple Pay on vending machines shows that branding specific to “Apple Pay” helped increase mobile transactions and overall sales.\nThe study offers evidence that Apple Pay messaging on the machines resulted in an increase of mobile transactions by as much as 135%, while transactions in general were up 44.6% and overall sales up 36.5%.\nThe vending machines with increased transactions used language specific to Apple’s payment service, prompting users to “Pay with your favorite card using Apple Pay.” Another 130 machines in a control group used more generic text that simply read: “Ready – Swipe or Tap Now.”\n36.5% increase in overall sales\n44.6% increase in total transactions\n6% increase in total contactless average ticket; 18% at week 20*\n55.5% increase in revenue through contactless purchases, including Apple Pay; 121% at week 20*\n135.2% increase in overall mobile payment usage\nThe results were published by USAT after the company tracked sales on 35 of its vending machines using Apple Pay through its point-of-sale platform in the US.\n“Based on our study, we believe that when businesses and operators present consumers with the option to pay for items with Apple Pay, the number of mobile payments made and the amount spent, increases,” said Maeve McKenna Duska, senior vice president of marketing and sales, USA Technologies…the numbers provide evidence that negative seasonality trends may be tempered, and even reversed, by telling consumers they have an option to pay with Apple Pay.”\nEarlier this month a separate study showed how Apple’s recently launched Apple Pay on the web feature, which allows the payments service to be used for website checkouts, is quickly gaining share among other popular online payment platforms. Usage of that feature could soon see an increase as Apple’s new MacBook Pro that officially launched last week is the company’s first Mac with a built-in Touch ID sensor to authenticate payments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.20884979479014873
    },
    "article_19": {
        "title": "Three New iPads Said to Launch in March, Including Bezel-Free 10.9-Inch Model",
        "body": "Apple will launch a trio of new iPad Pro models in March, including refreshed 9.7-inch and 12.9-inch versions and an all-new bezel-free 10.9-inch model, according to Barclays Research analysts Blayne Curtis, Christopher Hemmelgarn, Thomas O'Malley, and Jerry Zhang, citing sources within the company's Asian supply chain.\nIn a research note obtained by MacRumors, the analysts said the 10.9-inch model's borderless design will allow for it to be the same physical size as the current-generation 9.7-inch iPad Pro. That means the display itself will need to have an edge-to-edge design, possibly signaling the removal of the Home button.\nMultiple rumors have claimed Apple is developing a new iPad in the 10-inch range, but the exact screen size has varied in each report. KGI Securities analyst Ming-Chi Kuo said a new 10.5-inch iPad Pro will launch in 2017, while Japanese website Mac Otakara said a new 10.1-inch iPad Pro will launch in early 2017.\nBarclays, like Kuo, expects the new 9.7-inch iPad Pro to be a \"low-cost\" model alongside the 7.9-inch iPad mini, which the analysts do not believe will be refreshed alongside the larger tablets. Instead, the research note said Apple will continue to produce and sell the iPad mini 4, released in September 2015.\nMac Otakara previously said the 12.9-inch iPad Pro will feature a True Tone display like its current 9.7-inch counterpart, using advanced four-channel ambient light sensors to automatically adapt the color and intensity of the display to match the light in the surrounding environment.\nThat report said all three new iPad Pro models will gain quad microphones, compared to the current dual setup, and retain 3.5mm headphone jacks.\nThe 12.9-inch iPad Pro is also said to gain the 9.7-inch model's same 12-megapixel rear-facing iSight camera and True Tone flash.\nMore \"revolutionary\" changes to iPads, including a switch to OLED displays, are expected in 2018, according to Kuo's earlier report.",
        "sentiment": -0.014639148657972162
    },
    "article_20": {
        "title": "Apple brings back the peach butt emoji",
        "body": "Nobody can touch the peach butt emoji, not even Apple. A couple of weeks ago, Apple dropped the first iOS beta for iOS 10.2 with dozens of new and redesigned emojis. The world needs more emojis, I’m all for it. But Apple also accidentally redesigned the peach emoji and was a bit too literal — it didn’t quite look like a butt. Calm down, no need to grab the pitchforks. Apple released a new beta with a butt-looking peach emoji.\nAs you can see on the top image, the new peach emoji looks even more like a butt. Apple didn’t just roll back to the old emoji design. The company called its emoji designers again and asked them to redraw the peach emoji.\nEmojis accidentally became a universal visual language withs its own set of rules. People now use emojis all the time to add emotions and personality to their messages. And sometimes, a peach can become so much more than a simple peach. TechCrunch’s Devin Coldewey wrote an ode to the peach emoji that sums up pretty well why it’s important to keep the peach butt.\nApple released iOS 10.2 beta 3 yesterday and it’s still only available for developers and public beta testers. You can expect the final version of iOS 10.2 in the coming weeks with a wide range of new emojis.\nMy favorite ones are the new professions. There are male and female emojis for a teacher, astronaut, welder, coder, business worker, farmer, scientist, chef, student, mechanic, doctor/health worker…\nBut the Unicode consortium is also iterating to keep up with new gesture emojis. There will be a finger-crossed emoji, a shrug emoji and a facepalm emoji. Your friends will also need to update their iPhones before you can send each other astronaut emojis.",
        "sentiment": -0.03036584509046454
    },
    "article_21": {
        "title": "AirPods Might Not Launch Until January 2017",
        "body": "Following the confirmation that Apple has delayed its wireless \"AirPods\" beyond the original late October launch window, foreign supply chain sources are now pointing towards a launch date in January 2017, and not the late 2016 estimation that many believed would help the Bluetooth device sell during the holidays.\nThe news comes from Chinese-language Economic Daily News (via DigiTimes), which cites market watchers who believe AirPods manufacturing supplier Inventec will see a profit boost in January because of the new launch date for the device.\nApple originally planned to release the AirPods at the end of October, but has postponed release. Inventec is expected to begin shipping AirPods in January 2017, the paper noted.\nBecause of AirPods orders, Inventec's revenue is expected to grow 7 percent in 2017, to reach around $23.83 billion, while its earnings per share are also estimated to increase by 35 percent. Its Q4 2016 earnings will be mainly in its PC supplier business, which will \"stay flat\" from the third quarter output of around 4.85 million units shipped.\nThe connection between Inventec and AirPods first came in a report by KGI Securities analyst Ming-Chi Kuo in September. Apple then announced the device during its September 7 iPhone 7 event, where it confirmed the headphones have up to 5 hours of music playback and high-quality sound through a \"seamless and automatic connection\" between devices, as well as a battery case that includes up to 24 hours of charge.",
        "sentiment": -0.07787725538946688
    },
    "article_22": {
        "title": "Demand for new MacBook Pro models tepid due to high prices, disappointing specs",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nNoted KGI analyst Ming-Chi Kuo sees slow demand for Apple's recently released MacBook Pro with Touch Bar models, as the notebooks ship at higher than expected prices and present disappointing specifications to core Mac users.\nMing-Chi Kuo in a note to investors obtained by AppleInsider on Monday said initial demand for the new MacBook Pro models \"seems tepid\" in the days after Apple unveiled the laptops at a special media event last week.\nAt least part of the blame falls on higher than expected prices, with flagship 13- and 15-inch Touch Bar models starting at $1,799 and $2,399, respectively. By contrast, last year's 13-inch MacBook Pro refresh sold for $1,299 in March, while the larger 15-inch variant started at $1,999 in May.\nIn addition to high customer costs, Kuo believes key design changes are a major disappointment to core users. Specifically, the analyst cites Apple's switch to USB-C, the removal of the standard SD card reader and lack of support for higher memory allotments.\nFor the first quarter of 2017, the analyst anticipates demand for older MacBooks to remain steady, but forecasts a 15 to 25 percent a decline in overall shipments quarter-on-quarter due to slower uptake of the new models. The net result is three million MacBook shipments for quarter one, flat from the same time last year.\nDespite mediocre readings on immediate demand, Kuo is optimistic going further into 2017. Specifically, the analyst believes Apple will lower pricing of MacBook Pro with Touch Bar models in the second half of next year to drive channel sell-through. Apple historically reduces hardware prices about a year after launch in conjunction with discounts on legacy models.\nBeyond out-the-door cost, consumers might be more willing to adopt MacBook Pro as USB-C accessories become more prevalent in the marketplace, and developers begin coding for Touch Bar.\nFinally, Apple's 2017 MacBook Pro update, expected in the second half of the year, may gain support for up to 32GB of RAM, making the platform a more compelling option for power users.\nAs AppleInsider noted earlier today, the recently released MacBook Pro series is powered by Intel's Skylake class of processors with LPDDR3 memory, a specification that supports up to 16GB RAM. Next-generation Cannonlake CPUs that efficiently run LPDDR4 RAM at higher allotments are scheduled for release in time for next year's MacBook update. If Intel fails to ship Cannonlake on time, however, Apple will likely turn to Coffee Lake, which features the same LPDDR3 specifications as Skylake.",
        "sentiment": 0.03241317595957833
    },
    "article_23": {
        "title": "Customers not happy with Apple's 'pitiful' cure for iPhone 'touch disease' - Business",
        "body": "Apple is finally offering a cure for its iPhone 6 Plus models plagued by so-called \"touch disease.\" The affliction causes the phone's screen to freeze up and no longer respond to touch commands.\nThe fix will cost American customers $149 US. Canadians will have to shell out $189.\nThe move follows months of customer complaints about touch disease and multiple proposed class action lawsuits filed against Apple over the issue.\nThe suits allege the California-based tech giant knew about the defect and failed to take action.\nBut while Apple is offering a fix, some customers are dismayed to discover the company is charging a fee and placing the blame on them.\n\"Apple has determined that some iPhone 6 Plus devices may exhibit display flickering or multi-touch issues,\" states the company on its website.\nThis problem, explains the company, arises after the phone has been dropped \"multiple times on a hard surface\" and then is subjected to \"further stress.\"\n'Pitiful' offer\n\"I think it's pitiful,\" says iPhone owner Trina Rae Wiegers from Prince Albert, Sask.\nShe claims that many smartphones get dropped, so if that's the culprit, lots of different iPhone models should be suffering from the same problem.\n\"You can't just pick one and say apparently people are just dropping the 6 Pluses.\"\nTrina Rae Wiegers in Prince Albert, Sask. believes Apple's repair program for iPhones suffering from 'touch disease' is 'ridiculous.' (Trina Rae Wiegers)\nWiegers owns an iPhone 6, which she believes also suffers from touch disease. She says it periodically freezes up and becomes useless. \"You miss calls, you can't text, it's a horrible piece of crap.\"\nOther iPhone 6 customers have also complained of the same problem, but Apple is only offering to fix the bigger 6 Plus. CBC News asked the tech company why, but it did not address the question.\nEven if she could get the fix, Wiegers claims she would never pay $189. \"It's ridiculous,\" she says. \"It's their problem and they need to own up to it.\"\n$189 fee for show?\nWiegers is the lead plaintiff in a proposed Canadian class action lawsuit launched against Apple over touch disease.\nA total of four proposed class-actions have been filed, two in Canada and two in the U.S. involving both iPhone 6 and 6 Plus owners.\n\"It's a design defect, so to charge $189 to fix their problem is simply atrocious,\" claims Regina lawyer Tony Merchant, who's heading up the Canadian lawsuits.\nHe alleges both the 6 and 6 Plus were designed in a way that even the slightest bend results in a disconnect in the phone, causing the screen to no longer respond to touch.\nMany iPhone 6 Plus customers have complained that a flickering grey bar appears on the screen before it freezes up and becomes unresponsive to touch. (Yusuf Motiwala)\nMerchant claims Apple came up with a fee for the fix not because it needed the cash but to create the impression touch disease is not its fault.\n\"Their motive is to maintain the pretense that they didn't design a defective phone,\" he alleges.\n\"What they ought to be doing is fixing all of [them] without charge and pay compensation to people who've lost the use of their phone.\"\nIn order to proceed, all four class actions must first be certified in court. Apple would not comment on the proposed suits.\nNot interested in the fix\nThe term \"touch disease\" was first coined by an online repair guide, iFixit. It posted a blog in August claiming that iPhone repair shops in the U.S. were being inundated with customers looking for fixes for the problem.\nAfter CBC News first reported on the issue, we heard from several customers who claim their phones are afflicted. They include Paul So from Toronto who took his iPhone 6 Plus to an Apple store last month.\nHe says the customer service rep acknowledged touch disease and explained it happened when the phone was bent.\nSo says he was told he'd have to pay $425 to replace the device because it's no longer under warranty.\nHe wasn't willing to pay that price and he's not keen to cough up $189 for a problem he too believes is Apple's fault. \"It's not right. They should acknowledge the fact they did make the mistake.\"\nPaul So in Toronto says he's not interested in shelling out $189 to fix a problem he believes is Apple's fault. (Paul So)\nYusuf Motiwala in Mississauga also doesn't plan to take Apple up on its offer. \"That's a lot of money,\" he says about the fee, estimating it would total about $200 with taxes. \"I don't think that's fair.\"\nMotiwala's 19-year-old daughter, Hawwa bought a second-hand 6 Plus for $750 in February. By September, it started flickering and eventually stopped responding to touch altogether.\nMotiwala believes the $200 fee would be better used to help pay for a new phone for his daughter — one that's not an Apple product.\nAs for Wiegers, she's sticking with the proposed class action lawsuit and says she's still waiting for the day Apple fesses up and addresses her problem — at no charge.\n\"I just want them to fix my phone, that's all I want.\"\nCBC News asked Apple for a response to the customer criticisms. It would only confirm that it is indeed running a repair program for the iPhone 6 Plus.\nAs part of the program, customers who already paid to get their device fixed will be reimbursed — minus the mandatory $189 fee.\nPhones that have cracked or broken screens won't be eligible for the repair.",
        "sentiment": -0.5327480690892447
    },
    "article_24": {
        "title": "Apple \"puck\" mouse named one of the worst tech products of all time",
        "body": "The Apple hockey puck shaped mouse shipped with iMacs in 1998. It was hard to hold, uncomfortable, and cheap feeling. It was a terrible mouse. The guys at cNet UK think it was SO terrible that it’s one of the worst tech products ever invented.\nI tend to agree that it was an absolutely horrible mouse. One silver lining, though. As is often the case with Apple products, even when they get something wrong – they get something right. The hockey puck mouse was the very first mouse to ever use USB as the standard for connectivity.\nThe rest of the list is interesting as well…I don’t recognize most of the products listed, but there is one that I am familiar with. It’s name? Windows Vista.",
        "sentiment": -0.12587235122919083
    }
}