{
    "article_0": {
        "title": "A Message to Our Customers",
        "body": "The San Bernardino Case\nWe were shocked and outraged by the deadly act of terrorism in San Bernardino last December. We mourn the loss of life and want justice for all those whose lives were affected. The FBI asked us for help in the days following the attack, and we have worked hard to support the government’s efforts to solve this horrible crime. We have no sympathy for terrorists.\nWhen the FBI has requested data that’s in our possession, we have provided it. Apple complies with valid subpoenas and search warrants, as we have in the San Bernardino case. We have also made Apple engineers available to advise the FBI, and we’ve offered our best ideas on a number of investigative options at their disposal.\nWe have great respect for the professionals at the FBI, and we believe their intentions are good. Up to this point, we have done everything that is both within our power and within the law to help them. But now the U.S. government has asked us for something we simply do not have, and something we consider too dangerous to create. They have asked us to build a backdoor to the iPhone.\nSpecifically, the FBI wants us to make a new version of the iPhone operating system, circumventing several important security features, and install it on an iPhone recovered during the investigation. In the wrong hands, this software — which does not exist today — would have the potential to unlock any iPhone in someone’s physical possession.\nThe FBI may use different words to describe this tool, but make no mistake: Building a version of iOS that bypasses security in this way would undeniably create a backdoor. And while the government may argue that its use would be limited to this case, there is no way to guarantee such control.",
        "sentiment": 0.11791875902563334
    },
    "article_1": {
        "title": "Apple proven right: WSJ reports \"about a dozen\" other iPhone unlock requests from government",
        "body": "In addition to the iPhone used by one of the San Bernardino shooters, the US government is pursuing court orders to force Apple to help bypass the security passcodes of \"about a dozen\" other iPhones, the Wall Street Journal reports. The other cases don't involve terror charges, the Journal's sources say, but prosecutors involved have also sought to use the same 220-year-old law — the All Writs Act of 1789 — to access the phones in question.\nThe FBI has argued that it only wants Apple to allow it to \"guess\" the passcode for the San Bernardino iPhone, but that innocuous-sounding process involves Apple performing a rewrite of the phone's iOS software, allowing the Bureau to use brute-force techniques to crack the passcode that might otherwise take years. The agency says it only wants this process performed on this one specific iPhone, but privacy advocates could see the additional cases as the US government already attempting to overreach this mandate.\nIt's not clear yet what the other cases involve\nAt this point, however, it's not clear what the dozen-or-so cases actually entail, nor what prosecutors are asking Apple to do exactly, or why Apple is pushing back. The FBI has complained that Apple is simply resisting its demand to unlock the phone so as not to \"tarnish the Apple brand,\" but the company says if it gives in and allows the FBI to access the phone with \"absent clear legal authority to do so,\" it would breach its consumers' trust.",
        "sentiment": -0.6989158199479183
    },
    "article_2": {
        "title": "Uninstalling Facebook app saves up to 15% of iPhone battery life",
        "body": "Facebook is one of the most downloaded apps on iOS but it has long been cited as a cause of fast-draining iPhone batteries. Last year it was accused of using background tricks to stay active even when it wasn’t being used. Facebook admitted bugs existed, and fixed them, but questions of the app’s impact on battery life remained.\nSimilar concerns about Facebook’s Android app led to the discovery that deleting the app saves up to 20% of a phone’s battery. After that revelation, I set about seeing if the same was true for iPhone users. I discovered that uninstalling Facebook’s iOS app and switching to Safari can save up to 15% of iPhone battery life.\nAn alternative to uninstalling Facebook is using the hump from Apple’s Smart Battery case\nUsing an iPhone 6S Plus for a week without the main Facebook app installed, I recorded the battery life at 10.30pm each day for a week comparing it to a daily average taken from a week with the app. I charged the phone overnight, taking it off the charger at 7.30am, and used it normally. I accessed Facebook for the same amount of time, and for the same purposes, using the social network’s excellent mobile site within Safari, as I had done using the app. I also left the Facebook Messenger app installed.\nOn average I had 15% more battery left by 10.30pm each day. I had also saved space, because at the point I had deleted the Facebook app it had consumed around 500MB in total combining the 111MB of the app itself and its cache on the iPhone.\nTo make sure that this wasn’t an isolated incident, I also recruited several other Facebook-using iPhone owners to conduct a similar test. They all found similar results, with increased battery life when using Facebook in Safari having uninstalled the main Facebook iOS app.\nSpot the difference: one is the Facebook app, the other the Facebook mobile site. Photograph: Samuel Gibbs/The Guardian\nUsing Facebook in Safari was almost as good as the app. You can even place a shortcut to Facebook in Safari on the homescreen that looks almost identical to the app’s icon (the white is a little less bright but you need eagle eyes to see). The only restriction was the Share-to function, which does not exist for websites, meaning that to share photos I had to manually hit the “post photos” button on the mobile site.\nFeatures of the app, such as Instant Articles, are also not available. Tapping a link on the Facebook mobile site opens a new Safari tab.\nThe results will vary for the smaller iPhone 6S, as it has a smaller battery and shorter battery life overall, but judging by the 6S Plus experience, removing the Facebook app in preference of using the social network in Safari will extend the battery life of any iPhone.\nA Facebook spokesperson said the company was investigating the matter.",
        "sentiment": -0.6233829752626744
    },
    "article_3": {
        "title": "Donald Trump calls for boycott on Apple … while tweeting from iPhone",
        "body": "Update: In a conference call with reporters, Apple responded saying, Trump’s call for Apple boycott puts the company in standing with other good people he has criticized\nOkay, this may be my favorite “via Twitter for iPhone” gaffe yet. It’s Friday afternoon so presidential candidate Donald Trump has called for a boycott on all Apple products. His announcement follows this week’s FBI request that Apple help it unlock the San Bernardino gunman’s iPhone, which Tim Cook says would set a dangerous precedent.\nHere’s the kicker: As news broke that Trump was calling for a boycott on Apple until it cooperates with the FBI, Donald Trump (or whoever manages his Twitter account) was tweeting a series of unrelated messages … from Twitter for iPhone.\nWe’ll keep an eye on Apple’s stock and see how this boycott request goes. In the meantime, best comment goes to chrisl84 with “Make encryption average again”.\nAs for Mr. Trump, my understanding is that these tweets from iPhone were sent while the presidential candidate was on stage at an event. My guess is senior advisor Dan Scavino might have been behind them (Trump often tweets via iPhone and Android) and the message wasn’t coordinated in time.\n[youtube=https://www.youtube.com/watch?v=oe9ydy_zwe8&start=45]\nFormer Florida governor Jeb Bush, who is also competing for the GOP’s nomination, has similarly expressed siding with the FBI in this situation, although his allegiance to Apple products appears strong.\nBREAKING: Trump​ calls for Apple boycott until $AAPL turns over info requested by FBI in the San Bernardino case.https://t.co/NBek87Ob6J — CNBC Now (@CNBCnow) February 19, 2016\nTrump has since responded:\nI use both iPhone & Samsung. If Apple doesn't give info to authorities on the terrorists I'll only be using Samsung until they give info. — Donald J. Trump (@realDonaldTrump) February 19, 2016\nSince people started noticing Mr. Trump’s uncoordinated message, the presidential candidate has since moved over to Twitter for Android…\nBoycott all Apple products until such time as Apple gives cellphone info to authorities regarding radical Islamic terrorist couple from Cal — Donald J. Trump (@realDonaldTrump) February 19, 2016\n—\nhttps://vine.co/v/erX66WYXx6p\ncan we boycott trump instead — Edward Snowden (@Snowden) February 19, 2016\nConsidering that Donald Trump picked a fight with the Pope yesterday, having him attack Tim Cook today isn't too much of a surprise. — Neil Cybart (@neilcybart) February 19, 2016\nDonald Trump calls for boycott on successful mega corporation that is 0.5% of American GDP #makeamericagreatagain — Stephen Hall (@stephenhall_) February 19, 2016\nI would say Donald Trump should get a BlackBerry, but aren’t those manufactured in Mexico? — Christina Warren (@film_girl) February 19, 2016\n\"Oh so NOW we're all going Android?!\" — Trump's head of I.T. — Gavin Purcell (@gavinpurcell) February 19, 2016\nOh Donald. Or perhaps just another politician playing both sides of the fence? https://t.co/QndKyVfMME — Jersey Boy (@Gartenberg) February 19, 2016\nThis is the best endorsement Apple could ever hope for. https://t.co/pNprhMouET — Aaron Levie (@levie) February 19, 2016\nDon’t forget…\nFlashback from October, 2013: “Donald Trump demands larger iPhone screen” http://t.co/5CCg8p8N2O You’re welcome! Apple listened. — Donald J. Trump (@realDonaldTrump) September 10, 2014\nAs a stockholder in Apple, they should get on with a larger screen iPhone as a supplement—immediately. — Donald J. Trump (@realDonaldTrump) September 19, 2013\nMaybe this explains why close Trump ally and infamous Apple investor Carl Icahn (who Trump wants as Treasury Secretary) recently dumped millions of Apple shares.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.3937903609185014
    },
    "article_4": {
        "title": "NY judge rules feds can't force Apple to unlock an iPhone",
        "body": "NY judge rules feds can't force Apple to unlock an iPhone Case in New York adds a new twist to the ongoing legal battle.\nA US magistrate judge in New York has ruled that the government can't force Apple to help law enforcement unlock an iPhone using the All Writs Act. This case in question is about drug trafficking and is not related to the San Bernardino shooter case\nWhile the cases are different, it's a win for Apple in its battle with the FBI and Department of Justice. An Apple senior executive told Engadget that while it's a important precedent, it's not a binding precedent that magistrate Judge Pym in the San Bernardino case is legally bound to follow.\nIn his order magistrate Judge James Orenstein states: \"More specifically, the established rules for interpreting a statute's text constrain me to reject the government's interpretation that the AWA empowers a court to grant any relief not outright prohibited by law.\"\nTurn on browser notifications to receive breaking news alerts from Engadget You can disable notifications at any time in your settings menu. Not now Turned on Turn on\nApple has earlier prodded Judge Orenstein to rule on the feds wanting Apple to help it unlock the phone of Jun Feng who was suspected of conspiracy to traffic methamphetamine. During a search, DEA agents seized an iPhone 5s belonging to Feng.\nThe government then initiated the execution of a search warrant for the contents of the phone which has a passcode. Apple then submitted an opposition to the order and after additional filings and oral arguments, we're here. Another case with a locked iPhone that the government want's Apple to help unlock and the company rejecting that order. Only in this case, a judge has already ruled and its in Apple's favor.\nIn the brief, the judge concluded that this is an issue that should be handled by congress. If the government wants to use All Writs or CALEA to force companies to circumvent encryption, there needs to a clear law granting it that power.\nOne interesting bit of information to come out of today's news is that during a conference call with reporters, an Apple senior executive insisted that Apple has never created or signed any piece of software to decrypt a phone.\nThe company has handed iCloud backups over to law enforcement when order by the courts. This is in line with the company's remarks that if it has the data, it will comply with lawful orders.\nApple and Department of Justice will argue their cases in front of Judge Pym on March 22.",
        "sentiment": -0.4034727360121906
    },
    "article_5": {
        "title": "Google’s CEO just sided with Apple in the encryption debate",
        "body": "Google CEO Sundar Pichai has chimed in on the escalating battle between the FBI and Apple over iPhone encryption. Describing the letter published by Apple's Tim Cook as \"important,\" Pichai says that a judge's order forcing Apple to assist the FBI in gaining access to the data on a terrorist's iPhone \"could be a troubling precedent.\" Seeing as Google oversees the Android operating system, Pichai is a crucial voice in this debate; Android also offers encryption to safeguard personal data.\n\"We build secure products to keep your information safe and we give law enforcement access to data based on valid legal orders,\" Pichai tweeted moments ago. \"But that's wholly different than requiring companies to enable hacking of customer devices and data.\" Pichai seems to side squarely with Cook. \"Forcing companies to enable hacking could compromise users’ privacy.\" Google's CEO said he's \"looking forward to a thoughtful and open discussion on this important issue.\"\nThat echoes the words of Cook, who in his letter wrote \"This moment calls for public discussion, and we want our customers and people around the country to understand what is at stake.\" At this point it seems like not a matter of if, but when other influential tech CEOs like Facebook's Mark Zuckerberg and Microsoft's Satya Nadella will weigh in on the matter.\n1/5 Important post by @tim_cook. Forcing companies to enable hacking could compromise users’ privacy — sundarpichai (@sundarpichai) February 17, 2016\n3/5 We build secure products to keep your information safe and we give law enforcement access to data based on valid legal orders — sundarpichai (@sundarpichai) February 17, 2016\n4/5 But that’s wholly different than requiring companies to enable hacking of customer devices & data. Could be a troubling precedent — sundarpichai (@sundarpichai) February 17, 2016\nIn taking this public stance, Pichai is also dismissing NSA whistleblower Edward Snowden's assumption that Google had favored the government's position over \"the public's\" side — that of Google's users.",
        "sentiment": -0.1825746656037294
    },
    "article_6": {
        "title": "Apple's lawyer: If we lose, it will lead to a 'police state'",
        "body": "Apple's attorney painted a scary picture if Apple loses its fight with the FBI.\nIn an interview with CNNMoney's Laurie Segall on Friday, Ted Olson warned of a government with \"limitless\" powers that could \"listen to your conversations.\"\nOlson said the demands would mount.\n\"You can imagine every different law enforcement official telling Apple we want a new product to get into something,\" Olson said. \"Even a state judge could order Apple to build something. There's no stopping point. That would lead to a police state.\"\nThe government is trying to force Apple to create new software allowing the FBI to break through the passcode of an iPhone used by the San Bernardino shooter. A magistrate Judge initially ruled in the government's favor, but a final hearing will be held on March 22.\nApple (AAPL) says the software will create a back door that will potentially allow anyone to break into millions of iPhones around the world.\n\"Apple is being asked to put an Achilles heel on the iPhone,\" Olson said. \"The iPhone's security is the reason why many, many people bought the phone.\"\nRelated: Apple tells court that the government can't force it to write code\nOlson said that Apple is \"very sensitive\" to national security and efforts by law enforcement to protect American citizens. He said that Apple has complied with every \"legal\" request by law enforcement for customers' data.\nBut in the case against the FBI, Olson said the government overstepped its legal authority. He said Apple's stance hasn't changed -- instead, it's the government's request that has changed and become more expansive than ever.\n\"It's very easy to say 'terrorism is involved' and therefore you should do whatever the government wants to do,\" he said. \"But just because you're using the word 'terrorism,' you don't want to violate the civil liberties that all of us cherish.\"\nThough he declined to say how far Apple plans to go in its court battle -- \"we are a long, long way from that\" -- he said that this is the kind of precedent-setting case that could go to the Supreme Court.\nIf the Supreme Court rules against Apple, though, he said Apple would go along with the ruling.\nMeanwhile, Olson noted that Apple continues to upgrade the security of its iPhones. CNNMoney has reported that Apple is working on developing an iPhone that even it can't break into.\n\"Apple is constantly trying to improve its iPhones ... so that people can't hack in and find out where your children are or what your medical records are,\" he said. \"So if Apple continues to do that, it's just a point at which the government just can't get into your soul. We have got to have a stopping point.\"\n- Erica Fink contributed reporting to this story.",
        "sentiment": -0.13505134889139578
    },
    "article_7": {
        "title": "Apple posts FAQ follow-up to Tim Cook's Public Letter",
        "body": "Why is Apple objecting to the government’s order?\nThe government asked a court to order Apple to create a unique version of iOS that would bypass security protections on the iPhone Lock screen. It would also add a completely new capability so that passcode tries could be entered electronically.\nThis has two important and dangerous implications:\nFirst, the government would have us write an entirely new operating system for their use. They are asking Apple to remove security features and add a new ability to the operating system to attack iPhone encryption, allowing a passcode to be input electronically. This would make it easier to unlock an iPhone by “brute force,” trying thousands or millions of combinations with the speed of a modern computer.\nWe built strong security into the iPhone because people carry so much personal information on our phones today, and there are new data breaches every week affecting individuals, companies and governments. The passcode lock and requirement for manual entry of the passcode are at the heart of the safeguards we have built in to iOS. It would be wrong to intentionally weaken our products with a government-ordered backdoor. If we lose control of our data, we put both our privacy and our safety at risk.\nSecond, the order would set a legal precedent that would expand the powers of the government and we simply don’t know where that would lead us. Should the government be allowed to order us to create other capabilities for surveillance purposes, such as recording conversations or location tracking? This would set a very dangerous precedent.",
        "sentiment": -0.36831719915454203
    },
    "article_8": {
        "title": "Carole Adams, mom who lost son in San Bernardino shooting, sides with Apple",
        "body": "A mother whose son was killed in the San Bernardino, California, shooting last year is siding with Apple in its battle to protect consumer’s privacy rights by refusing the FBI’s demands for new software to break into the iPhone of her son’s killer.\nCarole Adams, the mother of Robert Adams — a 40-year-old environmental health specialist who was shot dead by Syed Rizwan Farook and his wife in December — told the New York Post Thursday that the constitutional right to privacy “is what makes America great to begin with.”\nShe stood by Apple’s decision to fight a federal court order to create software that would allow federal authorities to access the shooter’s password-blocked iPhone. The software would allow authorities to retrieve personal banking passwords, photos and other information.\nApple CEO Tim Cook has argued that such software could be used in the future and would create a dangerous precedent for cell phone evidence in court cases.\n“The government suggests this tool could only be used once, on one phone. But that’s simply not true,” Mr. Cook said. “Once created, the technique could be used over and over again, on any number of devices.”\nMs. Adams said such software could undermine the Constitution.\n“This is what separates us from communism, isn’t it? The fact we have the right to privacy,” she told the New York Post. “I think Apple is definitely within their rights to protect the privacy of all Americans.\n“This is what makes America great to begin with, that we abide by a Constitution that gives us the right of privacy, the right to bear arms, and the right to vote.”\nFederal authorities want to hack into Farook’s phone to retrace the Islamic State sympathizer’s steps on Dec. 2 when he and his wife, Tashfeen Malik, shot and killed 14 people at the Inland Regional Center in San Bernardino.\nCalifornia US Magistrate Judge Sheri Pym has ordered Apple to create a back door for the FBI to bypass an iPhone feature that destroys data after 10 consecutive unsuccessful unlock attempts.\n• Kellan Howell can be reached at khowell@washingtontimes.com.",
        "sentiment": 0.007520726279300802
    },
    "article_9": {
        "title": "Billionaire Mark Cuban says Apple deserves a 'standing ovation' for fighting FBI on encryption",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple did \"exactly the right thing\" by refusing a request from the U.S. government to create a backdoor to access a terrorist's locked iPhone, billionaire Mark Cuban wrote in response to the encryption controversy this week.\n\"Amen. A standing ovation,\" Cuban wrote on his personal blog, heaping praise upon Apple and its chief executive, Tim Cook, for refusing to comply with the FBI's order. In his view, if Apple were to comply, it would open the doors for countless situations in the future where the government could point to this case as a precedent.\n\"We must stand up for our rights to free speech and liberty.\" - Mark Cuban\n\"Every tool that protects our privacy and liberties against oppression, tyranny, madmen and worse can often be used to take those very precious rights from us,\" Cuban said. \"But like we protect our 2nd Amendment Right, we must not let some of the negatives stand in the way of the positives. We must stand up for our rights to free speech and liberty.\"\nCuban believes American citizens should begin pushing their representatives to pass a law that limits the circumstances under which companies can be compelled to help the government break into a device. He proposed a series of four points that would justify such an instance:\nThat the incident in question be declared an Act of Terrorism, with casualties\nThat there is reason to believe the device was possessed by a participant in the incident\nThe device must have been on location for the incident\nThe terrorist who owned the device must be deceased\nCuban admitted that the subject is \"not an easy topic,\" but he believes an open discussion should be had for America to decide how to protect its citizens while also protecting personal liberties and security.\nThe open letter from Cuban joins a number of other high-profile names who have sided with Apple in its opposition to the government. Facebook, Twitter, Google and Microsoft have also expressed support for Apple.\nThe controversy began Tuesday, when a U.S. magistrate judge ordered Apple to comply with FBI requests to help extract data from an iPhone owned by one of the shooters involved in the December terrorist attack in San Bernardino, Calif. The device in question is an iPhone 5c that was password protected by the gunman, and is set to erase a stored decryption key after ten unsuccessful login attempts.\nApple Chief Executive Tim Cook responded with his own letter on Wednesday, saying that the creation of a backdoor tool to access a locked iPhone could open the flood gates for future issues, rippling well beyond the investigation into the San Bernardino shooting. The terrorist attack resulted in 16 deaths and 24 injuries.",
        "sentiment": -0.03161533352206735
    },
    "article_10": {
        "title": "Apple apologizes and updates iOS to restore iPhones disabled by Error 53.",
        "body": "Earlier this month, a Guardian report flagged a curious ‘Error 53’ message that was disabling iPhones. The error was caused by unofficial repair shops replacing the connector that ran between the Touch ID sensor in an iPhone’s home button — usually in the process of replacing faulty home button assemblies.\nToday, Apple is issuing an updated version of iOS 9.2.1 for users that update their iPhones via iTunes only. This update will restore phones ‘bricked’ or disabled by Error 53 and will prevent future iPhones that have had their home button (or the cable) replaced by third-party repair centers from being disabled. Note that this is a patched version of iOS 9.2.1, previously issued, not a brand-new version of iOS.\nUpdate: A new support document on Apple’s site has been issued that details the causes and repair methods for Error 53.\nThe update is not for users who update their iPhones over the air (OTA) via iCloud. If you update your phone that way, you should never have encountered Error 53 in the first place. If, however, you update via iTunes or your phone is bricked, you should be able to plug it into iTunes to get the update today, restoring your phone’s functionality.\nApple issued the following statement to TechCrunch.\nSome customers’ devices are showing ‘Connect to iTunes’ after attempting an iOS update or a restore from iTunes on a Mac or PC. This reports as an Error 53 in iTunes and appears when a device fails a security test. This test was designed to check whether Touch ID works properly before the device leaves the factory. Today, Apple released a software update that allows customers who have encountered this error message to successfully restore their device using iTunes on a Mac or PC. We apologize for any inconvenience, this was designed to be a factory test and was not intended to affect customers. Customers who paid for an out-of-warranty replacement of their device based on this issue should contact AppleCare about a reimbursement.\nApple is currently facing a class action lawsuit over the Error 53 matter. The quick fix could help to mitigate some of the suit’s claims.\nNote, that the update will NOT re-enable Touch ID. As we wrote when we covered this issue previously, this is the right thing to do.\n“…your fingerprints are stored on a secure enclave. The secure enclave is a coprocessor that utilizes a secure boot process to make sure that it’s uncompromised. It has a secret unique ID not accessible by the rest of the phone or Apple — it’s like a private key. The phone generates ephemeral keys (think public keys) to talk with the Secure Enclave. They only work with the unique ID to encrypt and decrypt the data on the coprocessor.”\nAllowing a third-party Touch ID sensor to function properly without an official Apple repair center both verifying that it is legitimate and recalibrating the cable to work with your iPhone’s Secure Enclave is a huge security risk. A malicious repair shop or corrupted part could allow unauthorized access to your phone or its data. Apple is absolutely right to disable TouchID — it was also wrong for it to disable your entire iPhone for getting your home button replaced on the cheap.\nIf you want to retain Touch ID functionality, you can get your home button replaced by Apple. If cost is a concern (and you don’t mind losing Touch ID) you can still get it done elsewhere without fear of bricking your phone.\nArticle updated to include mention of class action lawsuit.",
        "sentiment": -0.22787933170118116
    },
    "article_11": {
        "title": "Walt Mossberg on the decreasing quality of Apple's native apps",
        "body": "Welcome to Mossberg , a weekly commentary and reviews column on The Verge and Re/code by veteran tech journalist Walt Mossberg, now an Executive Editor at The Verge and Editor at Large of Re/code.\nIn response to my inquiries about this, Apple said: \"We have dedicated software teams across multiple platforms. The effort is as strong there as it has ever been.\" The company explains that these teams work on every major core app each year, but, as with its hardware, some years see more major revamps of some apps than others.\nApple's own apps often fail to meet its self-imposed standards\nApple has, of course, had a few famous software misfires, like the MobileMe and iTunes Ping cloud services, and the first iterations of Apple Maps (which has gotten vastly better). And, so far, Apple News is nothing to write home about, in my view.\nBut I’m talking about more familiar mainstays, like Mail and Photos, iTunes, and iCloud. In ways big and sometimes just small and nagging, I think they too often fail to meet Apple’s self-imposed standards. Sometimes this is on iOS, sometimes on OS X, sometimes on both.\nHere are a few examples.\niTunes for the desktop\nApple’s iTunes program was once the envy of the world. A combined digital music store and player, it could also sync your iPod. And it worked on both Mac and Windows. It was reasonably fast and very sure-footed.\nNow, I dread opening the thing.\nDespite a big overhaul in 2012 that made it better for a while, iTunes is once again bloated, complex, and sluggish. That has gotten even worse since the recent integration of the new Apple Music streaming service. Just the other day, I tried to sync two iPads to it (a rare event) and it took forever for the program to recognize them. On my three Macs, which were built from 2013–2015, iTunes is just too slow at almost every task.\nI dread opening iTunes\nIt’s time to disassemble the thing, the way Apple has done on iOS, where iTunes is just a store and each content type, such as music, videos, and podcasts, has its own playback app.\nThe company concedes that it has debated this question, but, so far, has come down on the side of keeping the huge program in one piece and working to make it faster and wring out any bugs that occur.\nMail\nApple’s desktop and mobile mail apps were once superb, but, despite some nice feature additions, I find they’ve become slow and unreliable. This is especially true if you use Gmail, as a billion people now do. In my experience, on both platforms, Mail is slow at both receiving and sending Gmail messages, whether they are from personal or business accounts. Some messages don’t show up. Search misses things.\nThe problem goes beyond Gmail\nLike many others I know who rely on Gmail, I’ve been forced to switch to, or at least add, Google’s Gmail app or website. Apple claims this is an issue beyond its control, or the control of any other email app vendor, because Gmail uses nonstandard technology that gives a speed advantage to the search giant’s own apps and sites. (Google has told me otherwise in the past.)\nBut the problem goes beyond Gmail. You can find lots of other iOS and some new OS X email apps that try and help you do quick message triage, intelligently auto-sort various types of email, and more. Apple hasn’t ventured into that territory, beyond enabling swiping actions for dealing with messages. Even its junk mail filters, once far superior to competitors’, are failing on me regularly these days.\nAnd the mobile version of Mail still can’t send mail to the contact groups you can make in Apple’s own contacts app. (The company says this is deliberate, that groups on the iPhone weren’t meant for use with Mail.)",
        "sentiment": -0.08861462638846465
    },
    "article_12": {
        "title": "Apple Hires Developer Behind Signal, Edward Snowden’s Favorite Secure Chat App",
        "body": "Apple hires plenty of interns all year round, but one particular addition revealed this week caught the eye given the company’s current position opposing a controversial order to enable the FBI to access the iPhone used by one of the San Bernardino shooters.\nFrederic Jacobs, a Switzerland-based developer who worked to develop secure messaging app Signal — the communications app of choice for NSA whistleblower Edward Snowden — announced today that he is joining the Cupertino-based company this summer to work on its CoreOS security team. Jacobs spent two-and-a-half years with Whisper Systems, the company behind Signal, before leaving earlier this year.\nI'm delighted to announce that I accepted an offer to be working with the CoreOS security team at Apple this summer. — Frederic Jacobs (@FredericJacobs) February 25, 2016\nSignal has been praised by the cybersecurity community for its robustness. Snowden, for one, said he uses it daily. It was one of the few apps to receive top marks for security in an EFF survey, while Jonathan Ździarski, a security researcher who has been much cited in Apple’s battle with the FBI, praised it for revealing “virtually nothing” when put through its paces with data excavation tools.\nIt’s unclear exactly what Jacobs’ role will be at Apple, but his hiring comes at a time when the firm is under major pressure. Apple increases the security measures within iOS with every major software release, but yesterday news broke that the company is working to remove the current passcode-free recovery option from future iPhones, while it wants to begin encrypting iPhone backups on iCloud.\nWhy make these moves? The company has been ordered to create software to allow the FBI to access data stored on the iPhone but — were these new changes implemented — it would be unable to do that. In effect, the company has identified itself as a potential weak point in the security process because the FBI can compel it to provide data, thus, removing its ability to do that, mitigates that risk. Or at least it forces the FBI to find new ways to get inside devices.\nAs regards the current situation, Apple and the FBI have voiced very different opinions on the order.\nFBI Director James Comey this past weekend denied wanting to create a backdoor to all iPhones.\n“We don’t want to break anyone’s encryption or set a master key loose on the land. I hope thoughtful people will take the time to understand that,” Comey wrote in an editorial.\nApple CEO Tim Cook focused on the long-term implications that such a move might have. Cook called the FBI’s strategy “chilling” and, in an interview with ABC yesterday, he went so far as to describe the software that Apple has been ordered to create as being the “equivalent of cancer” which would compromise the security and safety of all Apple customers.\n“[A] master key to turn 100 million locks, even if in the possession of a person you trust, could be stolen,” the Apple CEO explained. “You can imagine the target on that piece. I’m not saying [that] the government would abuse it, but there are lots of bad guys in the world. Millions of people have [already] had their personal information stolen by hackers.”",
        "sentiment": 0.026573585548802563
    },
    "article_13": {
        "title": "Apple's iPad Pro outsells Microsoft tablets in debut quarter",
        "body": "The iPad Pro may be following in the footsteps of the Surface tablets — with its detachable keyboard, big screen and digital pen — but Apple’s new high-end device came out ahead of Microsoft’s first-party tablets in the key holiday quarter, according to new estimates released this morning by the IDC market research firm.\nReleased in November, the iPad Pro sold more than 2 million units in the fourth quarter, while Microsoft sold about 1.6 million Surface devices, most of them the high-end Surface Pro and not the entry-level Surface 3 device, said Jean Philippe Bouchard, IDC’s research director for tablets, in a news release this morning. The research firm said the iPad Pro was the top-selling tablet in the category known as detachables.\n“With these results, it’s clear that price is not the most important feature considered when acquiring a detachable – performance is,” Bouchard said.\nLast week, Microsoft said its Surface lineup reached a new peak of more than $1.37 billion in revenue in the December quarter, a 22 percent increase from the same quarter last year. That included the Surface Pro 4 tablet and also the Surface Book, the Redmond company’s first notebook computer, which wasn’t included in the tablet numbers released by IDC this morning.\nOverall, Apple was the top tablet vendor for the fourth quarter, with 16.1 million units shipped, although that represented a decline of nearly 25 percent. Apple’s result compared with 9.0 million units shipped by Samsung during the quarter, which was a decline of more than 18 percent.\nAmazon came in at #3 in the tablet market for the quarter, thanks to its budget Fire tablet, but IDC says it doesn’t expect the company to hold that position.",
        "sentiment": 0.2090235836803913
    },
    "article_14": {
        "title": "The iSight camera - such amazing design for its time",
        "body": "Apple discontinued the iSight in 2006, meaning that it was only in production for 3 years. Makes sense, as computers like the MacBook launched that same year had built-in iSight cameras. Because electronics have become so miniaturized, I feel like we have lost some connection to our devices. I am typing this on my Retina MacBook Pro and my FaceTime camera is nearly invisible and I have no idea where my microphones are located. Today, we don't think about turning on our webcam when we call someone - it's just there. This has put content, and the interactions we have with our computers center stage, but has also made technology more enigmatic. It's a great thing that the devices we use have become less cumbersome and easier to use, but as a lover of objects, I did feel a bit sentimental analyzing the iSight. The iSight's form truly speaks to its function. It looks at you, and when it doesn't, a physical shutter shuts its eye. It listens, and you know for sure because it looks and feels like a microphone. It's a question worth asking - when does magical become obscurity?\nNext up: iPod Hi-Fi",
        "sentiment": 0.1592769758267836
    },
    "article_15": {
        "title": "OPINION: FBI fight with Apple is a big farce to get inside your phone",
        "body": "Earlier this week, the U.S. government dropped a bombshell in its ongoing crusade against strong encryption: A court order demanding that Apple help the Federal Bureau of Investigation bypass the security features of an iPhone recovered from Syed Rizwan Farook, who, along with his wife, Tashfeen Malik, killed 14 people last December during a mass-shooting in San Bernardino, California.\nNational Security Agency whistleblower Edward Snowden called it the “the most important tech case in a decade,” and in many ways he’s absolutely right. Apple has been on the front lines of the tech privacy fight ever since it improved the security of its devices such that no one, not even the company itself, would be technically capable of accessing their stored data. Now, facing a standstill in Congress, the U.S. government has ordered the company to build a custom version of the iOS operating system that would disable the iPhone’s security features, allowing FBI investigators to crack the passcode protecting the device by trying every possible combination — a method known as “brute force.”\nThe order is unprecedented. At stake is whether the U.S. government can legally compel a company to create software that sabotages its own products in the name of fighting crime. In a scathing letter posted on Apple’s website, CEO Tim Cook announced the company’s intent to fight the order, saying it would set a “dangerous precedent” that would be ineffective against criminals and “would hurt only the well-meaning and law-abiding citizens who rely on companies like Apple to protect their data.”\nWhat’s more, many details of the case cast doubt on the value or existence of data supposedly contained on the device. It suggests the government’s real goal is actually setting this dangerous precedent — not unlocking a dead criminal’s phone.\nEvidence of this strategy can be found in the order itself — including in its legal justification, the All Writs Act, a law that was enacted 277 years ago. The Act broadly allows courts to compel individuals and companies to do pretty much anything, as long as it aids the execution of a court order and isn’t unreasonably burdensome. Needless to say, its invocation in a case dealing with advanced technology is bizarre and smacks of desperation to many legal scholars. As the CATO Institute’s privacy law expert Julian Sanchez puts it, “The FBI [...] is relying on an 18th-century law to grant it powers that our 21st Congress won’t.”\nSecondly, the FBI’s assertion that the phone contains valuable evidence is at odds with the known facts of the case. The court order notes that Farook destroyed several other phones to hide evidence prior to the attack. It’s extremely doubtful he’d neglect to destroy the remaining phone if it had any evidence on it. Another reason to be skeptical: The device was actually owned by Farook’s employer, the San Bernardino county health department. Given the lengths he went to destroy evidence, it’s highly unlikely Farook would plan attacks using a company device, since it would be reasonable to assume his employer might be monitoring it. The phone was discovered by agents with the “Find My iPhone” feature turned on — a very strange setting to have activated on a device being used to coordinate terrorist plots.",
        "sentiment": -0.44399236034797995
    },
    "article_16": {
        "title": "Apple plans Siri for Mac as tentpole feature for this fall’s OS X 10.12 launch",
        "body": "Apple currently plans to use its next major release of the Mac operating system, known as OS X 10.12, this fall to continue to expand Siri across its product lines. Last year, Apple implemented Siri as cornerstone features of both the Apple Watch and new Apple TV, and for 2016, Siri is planned to finally make its way to the Mac.\nApple had been testing versions of OS X internally with Siri integration since at least 2012, but sources now say that Apple has a clear vision for Siri on the Mac along with a polished user-interface and is nearly ready to launch the feature publicly. Apple is expected to introduce OS X 10.12 in June at its annual Worldwide Developers Conference.\nInstead of integrating Siri as a swipe menu akin to the Mac’s Notification Center or as a full screen view like on the iPhone and even the iPad Pro, Siri for the Mac will live in the Mac’s Menu Bar. Similar to the Spotlight magnifying glass icon for search and notifications icon for Notification Center, a Siri icon in the top right corner of the menu bar will activate the voice control feature.\nWhen a user clicks the Siri button, a dark, transparent Siri interface will appear in the top right corner of the screen, as shown in our mockup by Michael Steeber. This interface will feature colorful sound waves to indicate speech input. The interface design in testing is not finalized and may still change before the summer introduction, according to sources.\nSiri on the Mac will have its own pane in System Preferences and users are said to also have the option to choose a keyboard shortcut for activating the service. Like with recent versions of iOS, users will be able to enable Siri at the first startup of OS X 10.12, according to sources. If the Mac running the new OS X version is plugged into power, a “Hey Siri” command will work much like with recent iPhone and iPad models.\nCodenamed “Fuji,” OS X 10.12 is also planned to include minor user-interface tweaks across core system application windows, but the changes will not be as notable as those in 2014’s OS X Yosemite update. Apple is also continuing its performance-focused engineering efforts emphasized in OS X El Capitan last year. The company is also developing iOS 10 for the fall, and we’ll be posting details on that in the near future.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.08950946992263198
    },
    "article_17": {
        "title": "The FBI's Apple hack would be a big, shiny gift to criminals",
        "body": "Check out all the on-demand sessions from the Intelligent Security Summit here.\nThe FBI wants to compel Apple to write a new, modified operating system, load to it their central security key, and install it on a cell phone used by Syed Farook, one of the terrorists who carried out the San Bernardino attack. The request seems simple and harmless, as well as morally sound, at least on the surface. And since Apple writes updates to the IOS software all the time, the argument that it would be a huge burden for the company to create the OS needed to unlock this phone does not stand up to any rational inspection.\nWhat Apple can’t do — what it shouldn’t do — is reassemble and release the secret key cipher that allows it to load its OS on phones. Without this step, it is impossible to unlock this phone. But here are the risks — to Apple and to the rest of us — if that happens.\nErosion of trust and value\nFirst, while I’m not privy to the exact way Apple manages its OS secret key, I believe it’s probably one of the most closely guarded secrets in the corporate world. It’s likely that no one single person manages the key and that the codes and permissions of many people are required to open it. Second, these individuals probably don’t have visibility or access to the fully assembled key and aren’t allowed to know where the assembly occurs. These are the kinds of security controls that would have to be in place for a $500 billion company to maintain the trust of its customers.\nAnd that’s what this is about: Trust. The value of Apple can almost exclusively be defined as trust. I trust Apple with my personal data, my pictures, my conversations, my work data, my credit card data, and so on. Artists entrust their creative content (songs, movies, books, etc.) to Apple, believing that they will be compensated and their content remain protected. Merchants trust the security of Apple Pay. If Apple ends up building this OS — and assembling the signature keys for this one phone — that trust goes away. Apple could lose billions of dollars of valuation because this trust was breached. Like a reputation, trust takes companies years to earn but can be destroyed in seconds.\nEvent Intelligent Security Summit On-Demand Learn the critical role of AI & ML in cybersecurity and industry specific case studies. Watch on-demand sessions today. Watch Here\nA slippery slope and criminal opportunity\nDon’t be fooled by the false argument that this is a one-time request and that the secret keys and OS wouldn’t be leaked. Once the break-in is available, why should Apple refuse to unlock the phone of a regular criminal? Why not unlock the phone of a drug dealer to find his customers? Why not unlock a phone that was found near a crime scene? Why not unlock your phone to see if you are breaking the law? Furthermore, if this OS were built, criminals throughout the world would pay handsomely to get their hands on it. Are all the technicians who have the ability to do this trustworthy individuals? What if the coercion tactic was a death threat to their families?\nQuestionable effectiveness or benefit\nFinally, I think we have to ask ourselves: To what end are the FBI’s requested efforts? The San Bernardino criminals had phones, computers and other devices that they used before, during, and shortly after the crimes and that they fully and completely physically destroyed. Do we think that Mr. Farook made his plots on his work phone and then forgot to bring it along when he destroyed his computer? I think we all know that this is unlikely.\nLike others in my industry, I have a personal stake in the outcome of Apple’s case. For most of my career, I have provided communication networks to businesses. These businesses — my clients — expect their communications to be private and their data to be secured. While in certain countries we have an obligation to provide lawful intercept for public telephone calls if requested by a warrant, the technology to encrypt calls from source to destination — with no ability for a technology company in the middle to intercept, whether compelled to do so by a court or not — is available.\nThese end-to-end encryption tools are simple and widely available. Criminals can at any time write their own end-to-end encrypted apps and then not even Apple — nor all the king’s horses and men — can intercept. So again, the U.S. government wants Apple to put itself at grave fiduciary risk for no gain for the public at large. And criminals get an early start on their big, shiny gift of unbreakable communications.\nWe all need to think long and hard about what we will fight to keep private, because the government is coming with its emotional arguments, and it looks like they’ll leave no place unturned.\nCurtis Peterson is senior vice president of operations at RingCentral.",
        "sentiment": -0.14373360320248388
    },
    "article_18": {
        "title": "Eddy Cue: \"We've got a new refresh [of iTunes] with the new version of OS X that's coming out next month that makes it even easier to use in the music space.\"",
        "body": "Eddy Cue and Craig Federighi spoke with John Gruber in this week's episode of \"The Talk Show,\" where they commented on recent opinions that Apple's software isn't up to snuff and offered some details on a new version of iTunes coming in OS X 10.11.4.\nLast week, Re/code's Walt Mossberg wrote a piece entitled \"Apple's Apps Need Work,\" pointing towards a \"gradual degradation\" in quality in several Apple apps and services like iCloud, Mail, and Photos. iTunes for the desktop was one of the most heavily criticized apps, with Mossberg saying he \"dreads\" opening it because it's \"bloated, complex, and sluggish.\"\nDuring the podcast, Gruber asked Eddy Cue about Mossberg's opinion, prompting him to give some background on how Apple wanted the iTunes experience to work. iTunes, Cue said, was designed at a time when people synced their devices via cable, so offering a centralized place with all of a user's content was key. With Apple Music, Apple decided on a design that would put music front and center while also integrating cloud music with hard copies purchased through iTunes.\n\"We decided in the short term that what we wanted to do is really make it when you're in music and iTunes, all you see is music,\" said Cue. He went on to explain that Apple is continually re-evaluating iTunes, and there are plans to release a refreshed version alongside OS X 10.11.4 next month.\n\"That's not to say we are continuing... and will continue to think about what's the best way to architect the app and whether it makes sense to do a separate app for some of the components that are in there or all of the components that are in there. But right now, we think we've designed iTunes and you'll see we've got a new refresh with the new version of OS X that's coming out next month that makes it even easier to use in the music space.\"\nCue and Federighi went on to talk about the issues that arise whenever Apple makes major changes to software, as there are always people who prefer not to see significant changes. According to Federighi, there's a \"tricky balancing act\" with software updates.\n\"People are serious about their music and their collection, and so I think we debate pretty heavily internally the right way to evolve these things. We tend to err on the side of being pretty bold, but there's a lot of responsibility.\nThe two also highlighted the immense scale that Apple is working on, with more than 1 billion active devices and 782 million iCloud users. More than 200,000 iMessages per second are sent at peak times, and there are more than 750 million transactions per week in the iTunes Store and the App Store. Apple Music has grown to 11 million subscribers and more than 2.5 million errors in Maps have been fixed, a number presented as evidence that Apple is continually working on its software.\n\"I would say first there's nothing we care about more,\" said Federighi, speaking on Apple's software and services. He believes Apple's core software quality has improved significantly over the course of the last five years, but pointed towards an ever-raising bar that pushes Apple to keep evolving and implementing new features. \"Every year we realize the things we were good at last year and the techniques we were using to build the best software we can are not adequate for the next year because the bar keeps going up,\" he said.\nFederighi and Cue's full discussion with John Gruber about the state of software, the desktop version of iTunes, and Apple's efforts to expand its public beta program, can be listed to over on the Daring Fireball website.",
        "sentiment": 0.32936589348883855
    },
    "article_19": {
        "title": "DJ Khaled Just Signed a Deal With Apple Music for His Own Show on Beats 1",
        "body": "Caption: “They didn’t see this coming notice how I said they because our fans know we will never stop!!! GOD IS GREAT!”\nHere’s the high-octane trailer for We the Best, which looks like it should be a truly insane cross between the Michael Bay musical and the interior doge monologue you never knew you needed, a.k.a. the best — or something like it:\nThe first installment, with Future, drops this Friday at 8 p.m. EST.",
        "sentiment": 0.20102226734161377
    },
    "article_20": {
        "title": "Warning: Bug in Adobe Creative Cloud deletes Mac user data without warning",
        "body": "Adobe Systems has stopped distributing a recently issued update to its Creative Cloud graphics service amid reports a Mac version can delete important user data without warning or permission.\nThe deletions happen whenever Mac users log in to the Adobe service after the update has been installed, according to officials from Backblaze, a data backup service whose users are being disproportionately inconvenienced by the bug. Upon sign in, a script activated by Creative Cloud deletes the contents in the alphabetically first folder in a Mac's root directory. Backblaze users are being especially hit by the bug because the backup service relies on data stored in a hidden root folder called .bzvol. Because the folder is the alphabetically top-most hidden folder at the root of so many users' drives, they are affected more than users of many other software packages.\n\"This caused a lot of our customers to freak out,\" Backblaze Marketing Manager Yev Pusin wrote in an e-mail. \"The reason we saw a huge uptick from our customers is because Backblaze's .bzvol is higher up the alphabet. We tested it again by creating a hidden file with an '.a' name, and the files inside were removed as well.\"\nBackblaze officials have published three videos that show the deletion bug in action, including the one below.\nOn Friday morning, Adobe Creative Cloud users flooded Twitter with complaints about the unauthorized data deletions. Many users who don't use Backblaze (the reporter of this Ars story included) will find the first folder in their Mac root drive is .DocumentRevisions-V100,\na folder that stores data required for Mac autosave and Version history functions to work properly. Deleting its contents could have negative consequences. The Adobe bug could also have dire consequences for users who have important folders with spaces in them, since those also assume a top alphabetically sorted spot on the Mac hard drive (which by default is labeled Macintosh HD).\nAdvertisement\nAn Adobe spokeswoman issued a statement that read: \"We are aware that some customers have experienced this issue and we are investigating in order to resolve the matter as quickly as possible. We are stopping the distribution of the update until the issue has been resolved.\" The version that appears to be causing the deletions is 3.5.0.206, Pusin said.\nCreative Cloud users who have not yet installed the update should hold off doing so until Adobe releases detailed guidance. People who have already installed the update shouldn't log in for the time being. One work-around for people who have installed the update and want to log in right away is to create a folder that assumes the alphabetically top-most spot in the root folder. A hidden folder with the name \".aaaaa\" comes to mind, but the Backblaze guidance, perhaps offering some comic relief for its aggrieved users, suggested creating a folder called \".adobedontdeletemybzvol.\"\nTo do so, users can Open Terminal and paste in \"cd /\" followed by \"sudo mkdir /.adobedontdeletemybzvol\" (minus the quotes).",
        "sentiment": -0.7951519530234409
    },
    "article_21": {
        "title": "Apple’s Elephant in the Room",
        "body": "Apple’s Elephant in the Room\nI’ve been watching the story about Apple’s “declining software quality” unfold over the past year with amusement but never felt the need to write anything contesting this narrative until John Siracusa (on episode 155 of Accidental Tech Podcast) came to the conclusion that the problem must be real because the story keeps coming back up. To John’s credit, he allowed for the possibility that this is a perception problem but ultimately concluded otherwise because “no one else seems to be disagreeing”. I disagree.\nThis is in fact a perception problem, and one that originated from Marco Arment’s blog post over a year ago. A comment on a recent Reddit thread got to the crux of the matter:\nThere’s a reason why Marco’s “Functional high ground” post took off, it’s because it was vague enough that everyone could project whatever current bug they’re facing on to it.\nAs the comment noted there were no examples cited, which was a critical factor in it going viral. It suggested an urgency and a sudden onset of this crisis. Apple was great before but now they’ve lost their way.\nIt wasn’t until July, seven months after Marco’s original post, that we saw Marco publish a follow-up essentially admitting that the premise of his original post was based on the buggy discoveryd service that Apple had shipped (and replaced again with mDNSResponder). Hedged no doubt, but as close as you’ll get to a retraction:\nThe entire decline of software quality that I felt in January wasn’t all due to a single buggy network-lookup service — but, unbeknownst to me at the time, alot of it was. And that huge swath of problems that annoyed me every day disappeared instantly and completely as soon as I updated every computer on the network to 10.10.4.\nOf course this post wasn’t as widely read. In the intervening time the narrative had taken root, it was hashed and rehashed countless times by the Apple pundits with blogs and podcasts and eventually the Apple community of developers and fans had come to accept it as truth.\nToday the “declining software quality” narrative is the explanation not only for every bug experienced (despite the size of the affected user base) but also for product design decisions. The recent release of the Apple TV was lambasted by journalists and Apple bloggers for lacking features such as a remote app or keyboard support. Jessie Char captured the mood:\nWe now know from Craig Federighi and Eddy Cue on John Gruber’s podcast that many of these features were essentially unused by anyone who wasn’t a developer.\nWhat’s going on? It’s a little interesting that John Siracusa mentioned that he isn’t seeing anyone disagreeing with the notion of Apple’s declining software quality because he himself completely disagreed with it when Marco’s original post was first published. If you follow enough people on Tech Twitter and listen to enough podcasts, you will begin to see this small and insular group start to say and believe the same things, which eventually leads to their audience coming to believe it as well. This echo chamber phenomenon is what I believe is at the root of this narrative and something John identified.\nMarco is clearly in the “out of love” phase of the cycle. He has stated that part of why he wants to get a Tesla is because of wanting to be a fan of something new and to be on the ground floor. His frequent “cynical takes” on what Apple’s intentions are, are related. In fact he came to this realization himself on episode 148 of Accidental Tech Podcast; Apple is getting too big for his liking and he doesn’t seem to like that Apple’s focus is on anything but the Mac (John’s response to him was both insightful and self-aware).\nMarco frequently asserts that Apple is measuring the wrong things, that they are tunnel visioned on metrics such as crash rates of their software while missing the forest for the trees, which implies that Apple executives and engineers don’t use their own products. The notion is silly and not borne by the facts. Apple’s installed base of users has grown massively over the past few years. Even if you dismiss this as a lagging indicator what you cannot dismiss is that customer satisfaction remains at an all-time high. More importantly, actual usage of Apple’s products and services continues unabated, something you would not expect if Apple’s software quality were truly declining. It’s likely that Apple’s disclosure that there are over a billion active devices in-use is designed to counter this narrative.\nIf the biggest example that can be pointed to is iTunes or its back-end (which seem to generate the most criticism) then there isn’t any validity to the idea that Apple’s software quality is declining. iTunes has been the target of complaints for as long as anyone can remember and it seems clear that it will be reworked much like Photos, iWork, or Final Cut have been (and likely receive the same backlash for missing functionality). The reason it hasn’t been done sooner is obvious: it has hundreds of millions of users and transacts billions of dollars in sales, revamping it from the ground up is akin to fixing an airplane while it’s in flight and won’t be done lightly.\nThere is a massive disconnect between enthusiasts and Apple’s broader customer base on the perception of Apple’s software quality. That is a PR problem for Apple to solve, not a software one.",
        "sentiment": -0.36781151002006873
    },
    "article_22": {
        "title": "‘Error 53’ May Be a Drag, But It’s Vital to Keep iPhone Users’ Data Safe",
        "body": "Apple came under fire on Friday over a security feature that some iPhone users say rendered their smartphones inoperable bricks after they were repaired by third-party service centers.\nThese users have noted on websites like gadget repair clearinghouse iFixit.com that an error message, \"error 53,\" sometimes appears on their iPhone after non-Apple technicians repair a broken Home button or the cable that connects the Home button to the iPhone's motherboard. Kyle Wiens, the CEO of IFixit, told The Guardianthat the issue may be a \"big problem\" for iPhone users given that the message board thread discussing the issue has already amassed more than 183,000 hits.\nAdvertisement\nApple says the error message is part of a security feature designed to protect iPhone users' data. According to Apple, error 53 is triggered whenever a security test between the Touch ID sensor and the iPhone's \"Secure Enclave\" (which processes fingerprint data, which in turn is used to unlock the smartphone and authorize purchases on the App Store) fails. Authorized Apple service centers are able to re-validate the secure connection whenever Home button repairs are made.\nWhile that may seem cold comfort to some users, security researcher Jonathan Zdziarski told me in an email that Apple's efforts represent a \"basic anti-tampering mechanism,\" and are an \"overall good idea.\"\nIn Zdziarski's view, the security feature is \"especially useful\" in a number of different scenarios, including the protection of \"high-profile individuals whose devices could possibly be bugged.\" Zdziarski also pointed to the recent development of tools like IP-Box that can brute force crack an iPhone PIN code. \"It would not surprise me to see a future black box capable of either brute forcing biometrics, or transmitting biometric data from prints taken from other sources,\" he added.\nIn other words, while strictly protecting the integrity of the Touch ID fingerprint sensor may inadvertently create problems for some users, failing to do so may create even larger problems.\n\"If [Apple] knew there were a lot of knock-off parts being used, I'd think [it would] have issued a warning of some sort,\" Zdziarski said, explaining that a glut of cheap parts on the market would \"impact [Apple's] own repair and warranty programs.\"\nAll of this \"leads me to believe [Apple was] probably doing [error 53] for security reasons more than just to mess with users,\" he added. While perhaps true, it does make repairing the iPhone that much more difficult for everyday users, particularly if there's not an authorized Apple repair center nearby. It also speaks to the larger, and perhaps more worrying, trend of the increased difficulty of repairing gadgets without a manufacturer's blessing: Apple protecting the data of its users is admirable, of course, but doing so in a manner that diminishes their freedom to repair is difficult to swallow.",
        "sentiment": -0.27750276814525326
    },
    "article_23": {
        "title": "Apple Pay Coming Soon to Crate &amp; Barrel, Chick-fil-A and Au Bon Pain",
        "body": "Apple Pay is now available at more than 2 million retail locations, with merchants such as Crate & Barrel, Chick-fil-A and Au Bon Pain set to accept the system in stores imminently, reports The Business Times.\nOnline clothing retailer Zappos.com also added Apple Pay to its iPhone and iPad apps on Tuesday, following a number of requests from customers to use the feature.\nThe announcement by Apple comes alongside news that the mobile payment service exceeded the company's goal to make it available at 1.5 million locations by the end of 2015. In-app purchases using the service also more than doubled in the last six months of 2015 compared with the first half, says the company.\nDespite the upbeat announcement, Apple still has work to convince U.S. customers to use Apple Pay at retail stores. According to a survey by consumer researcher Pymnts and InfoScout, 16.6 percent of people who own newer iPhones tried Apple Pay in October, an increase from 9 percent in November 2014.\nApple Pay is set to expand to China early this year, making it the fifth country to adopt the payments service since its U.S. launch in October 2014. The service expanded to the United Kingdom in July 2015, followed by Australia and Canada last November in partnership with American Express. Hong Kong, Singapore and Spain are also expected to gain support later this year.",
        "sentiment": 0.055978644639253616
    },
    "article_24": {
        "title": "Qualcomm’s new Snapdragon chip still can’t beat last year’s iPhone",
        "body": "Qualcomm’s new Snapdragon chip still can’t beat last year’s iPhone\nBy Killian Bell\nMany of this year’s high-end Androids will come with Qualcomm’s latest Snapdragon 820 processor. It’s up to twice as fast as the Snapdragon 810 that powered many of last year’s flagships — but it still can’t beat the iPhone 6s.\nAccording to tests carried out on GFXBench, Apple’s A9 processor outperforms Qualcomm’s best alternative — despite slower clock speeds and fewer cores.\nThe Snapdragon 820 is a huge improvement over the Snapdragon 810, thanks mostly to a cutting-edge 14-nanometer manufacturing process that makes it faster, more efficient, and cooler — eliminating those dreaded heat issues.\nSamsung has been tasked with building it, so we know it’s going to be good — but perhaps not quite as good as the Apple A9.\nA mysterious device has popped up on GFXBench with a Snapdragon 820 processor, 4GB of RAM, 16GB of internal storage, and Android 6.0 Marshmallow. In a series of graphics tests, it blows most competitors out of the water.\nAs you can see in the graph below from PhoneArena, the Galaxy Note 5 — one of the fastest Android devices of 2015 — doesn’t stand a chance against the Snapdragon 820, which also outperforms the Galaxy S6 series, the LG G3, and just about any other 2015 smartphone.\nBut the iPhone 6s Plus powered by an A9 achieves a higher score in all three onscreen tests.\nYes, the Snapdragon 820 is powering a 6.2-inch display with a sharper 2560×1600 resolution (compared to the iPhone’s 5.5-inch display with 1920×1080 resolution), but even so, it should probably achieve greater scores given its strength on paper.\nThe Snapdragon 820 has two Kyro cores clocked at 2.1GHz, and two Kyro cores clocked at 1.6GHz. That’s four cores in total. In comparison, the A9 has two cores clocked at 1.8GHz… and that’s it! Seriously.\nWe shouldn’t get too hung up in numbers, though; devices running the Snapdragon 820 will be blazing fast in real-world usage, and that’s all that really matters.",
        "sentiment": 0.11383912563323975
    }
}