{
    "article_0": {
        "title": "Apple unveils the new 4-inch 'iPhone SE'",
        "body": "The “iPhone SE” is now official as Apple today unveiled the device on stage at its ‘Let us loop you in’ press event in Cupertino.\nThe new iPhone SE’s major upgrades include Apple’s A9 chip and M9 motion coprocessor, since the design is mostly identical to the iPhone 5s apart from the new rose gold color as expected. Apple noted that the upgraded internals give the iPhone SE the same graphics and processing performance as the iPhone 6S.\nThe other big upgrade for the iPhone SE, as expected, is a new 4K-capable 12MP iSight camera with Retina Flash, Focus Pixels, True Tone Flash, and a new image signal processor. That gives the device support for 4k video, 1080p at up to 60fps, slo-mo up to 240 fps, and Panoramas up to 63MP.\nOther new specs in the iPhone SE include faster LTE, voice over LTE support, Wi-Fi calling, Bluetooth 4.2, and improved battery life over the iPhone 5s. You’ll also now get support for Live Photos and always-on “Hey Siri”.\nAnd the device has new microphones as well as an NFC chip, which means Apple Pay will be supported unlike with previous 4-inch iPhones.\nThe much anticipated 4-inch iPhone marks a few firsts for Apple as it introduces the smaller, less expensive iPhone as a rare mid-year iPhone update ahead of what most expect will be the next-generation iPhone 7 launch in the fall later this year. The device comes as an upgrade to the aging iPhone 5S, Apple’s last device to include the 4-inch display size before it upgraded to 4.7 and 5.5-inch displays for the iPhone 6, 6 Plus, and later generations.\nApple made a point of noting why it’s introducing the new device, pointing out that it sold around 30 million 4-inch iPhones last year and the fact that there are many users that appreciated the 5s for being either smaller or less expensive. Earlier today we noted that based on data of active iPhone users, the market for a 4-inch device could be as high as almost one third of total users or 36%.\nAnd the iPhone SE will be Apple’s least expensive new iPhone yet starting at just $399 or free on contract with carriers. Get full information on the iPhone SE’s pricing and availability here.\nHit up our news hub for all of our coverage from today’s ‘Let us loop you in’ iPhone/iPad event.\nApple Introduces iPhone SE — The Most Powerful Phone with a Four-inch Display Featuring A9 Chip, Advanced 12-Megapixel iSight Camera & Apple Pay CUPERTINO, California — March 21, 2016 — Apple® today introduced iPhone® SE, the most powerful phone with a four-inch display, in a beloved compact aluminum design that has been updated with matte-chamfered edges, a color-matched stainless steel Apple logo, and four gorgeous metallic finishes, including rose gold. iPhone SE offers exceptional performance with the same 64-bit A9 chip offered in iPhone 6s and iPhone 6s Plus for blazing fast speeds, longer battery life, faster wireless, a 12-megapixel iSight® camera featuring Live Photos™ and 4K video, and Touch ID® with Apple Pay®. “iPhone SE is an exciting new idea — we started with a beloved, iconic design and reinvented it from the inside out. The result is the most beautiful and powerful phone with a four-inch display in the world,” said Philip Schiller, Apple’s senior vice president of Worldwide Marketing. “iPhone SE is packed with a stunning four-inch Retina display, advanced 64-bit A9 chip with M9 motion co-processor, longer battery life, 12-megapixel iSight camera with True Tone flash, Live Photos, 4K video, faster LTE and Wi-Fi, and Touch ID with Apple Pay. Everyone who wants a smaller phone is going to love iPhone SE.” The Most Powerful Phone with a Four-inch Display iPhone SE takes a beloved iPhone design and reinvents it from the inside out, giving customers a powerful, full-featured iPhone no matter which model they choose. The 64-bit A9 chip, introduced in iPhone 6s and iPhone 6s Plus, offers iPhone SE customers two times faster CPU and three times faster GPU performance compared to iPhone 5s, all with gains in energy efficiency for improved battery life. M9, Apple’s next-generation motion coprocessor, is integrated into A9 allowing more features to run all the time at lower power, including “Hey Siri” without having to pick up your iPhone, and a range of fitness tracking capabilities like measuring your steps and distance. iPhone SE users can browse, download and stream content even faster with Wi-Fi up to three times and LTE up to 50 percent faster than iPhone 5s.* iPhone SE also includes more LTE bands for better worldwide roaming and supports Voice over LTE and Wi-Fi calling for high-quality wideband calls. With an easy-to-use interface, amazing features, and security at its core, iOS 9 is the foundation of iPhone SE and brings powerful built-in apps like Messages, FaceTime®, Photos, Music and Maps to iPhone users. iOS 9 also brings more intelligence to iPhone SE with proactive assistance, powerful search, improved Siri® features, and a new Night Shift™ feature that uses your iPhone SE’s clock and geolocation to automatically adjust the colors in the display to the warmer end of the spectrum after dark and may even help you get a better night’s sleep. All of these innovations are packed into a light and compact phone designed to fit comfortably in your hand, crafted from bead-blasted aluminum for a satin-like finish, refined matte-chamfered edges, a new color-matched stainless steel inset Apple logo and a brilliant four-inch Retina® display. The World’s Most Popular Camera iPhone SE has an advanced 12-megapixel iSight camera featuring Focus Pixel technology for fast focusing, an Apple-designed image signal processor, advanced noise reduction, third-generation local tone mapping and better face detection, all resulting in sharper, more detailed photos like the ones shot on iPhone 6s. With Live Photos on iPhone SE, customers can go beyond snapshots to capture moments in motion and relive unforgettable memories with sound. Live Photos are beautiful 12-megapixel photos that, with just a touch, reveal the moments immediately before and after the shot was taken, so users can enjoy a living memory rather than an instant frozen in time. Additional camera advancements include: The ability to shoot HD video with support for 4K at a resolution of 3840 x 2160. After capturing 4K video, customers can edit on a Mac®, PC or iPad®, and with the latest version of iMovie® on iPhone, can even edit two simultaneous streams of 4K on iPhone SE.\nRetina Flash, which momentarily makes the display three times brighter with True Tone® lighting technology, for wonderfully bright selfies in low light with the FaceTime HD camera.\nFeatures introduced with iPhone 6s, including up to 63-megapixel panorama photos, video capture up to 60fps for 1080p video and 240fps for slo-mo, time-lapse with video stabilization and cinematic video stabilization. Pricing & Availability iPhone SE will be available in space gray, silver, gold and rose gold metallic finishes in 16GB and 64GB models starting at $399 (US) from Apple’s retail stores, Apple.com, Apple Authorized Resellers and select carriers, or for 24 monthly payments starting at $17 (US) exclusively at Apple’s retail stores in the US.** As part of the newly-announced Trade Up with Installments program at Apple stores in the US, customers can also purchase iPhone SE for as low as $10/month for 24 months.***\nCustomers in Australia, Canada, China, France, Germany, Hong Kong, Japan, New Zealand, Puerto Rico, Singapore, the UK, US Virgin Islands and the US will be able to order iPhone SE beginning Thursday, March 24, with availability beginning Thursday, March 31.\niPhone SE will be available in early April in Albania, Andorra, Austria, Bahrain, Belgium, Bosnia, Bulgaria, Croatia, Czech Republic, Denmark, Estonia, Finland, Greece, Guernsey, Jersey, Hungary, Iceland, India, Ireland, Isle of Man, Italy, Kosovo, Kuwait, Latvia, Liechtenstein, Lithuania, Luxembourg, Macedonia, Maldives, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Russia, Saudi Arabia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Taiwan, Turkey and UAE.\nApple-designed accessories including leather cases in black and midnight blue will be available for $39 (US), and Lightning® Docks in color-matched metallic finishes are currently available from Apple’s retail stores and Apple.com for $49 (US).\nEvery customer who buys iPhone SE from Apple will be offered free Personal Setup, in-store or online, to help them customize their iPhone by setting up email, showing them new apps from the App Store® and more.\nAnyone who wants to learn more about iPhone SE or iOS 9 can register for the free workshops offered at every Apple Store®.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.459956253423459
    },
    "article_1": {
        "title": "FBI warns that car hacking is a real risk - so why the hell would we want backdoors made for hackers?",
        "body": "It's been eight months since a pair of security researchers proved beyond any doubt that car hacking is more than an action movie plot device when they remotely killed the transmission of a 2014 Jeep Cherokee as I drove it down a St. Louis highway. Now the FBI has caught up with that news, and it's warning Americans to take the risk of vehicular cybersabotage seriously.\nIn a public service announcement issued together with the Department of Transportation and the National Highway Traffic and Safety Administration, the FBI on Thursday released a warning to drivers about the threat of over-the-internet attacks on cars and trucks. The announcement doesn't reveal any sign that the agencies have learned about incidents of car hacking that weren't already public. But it cites all of last year's car hacking research to offer a list of tips about how to keep vehicles secure from hackers and recommendations about what to do if you believe your car has been hacked---including a request to notify the FBI.\n\"Modern motor vehicles often include new connected vehicle technologies that aim to provide benefits such as added safety features, improved fuel economy, and greater overall convenience,\" the PSA reads. \"Aftermarket devices are also providing consumers with new features to monitor the status of their vehicles. However, with this increased connectivity, it is important that consumers and manufacturers maintain awareness of potential cyber security threats.\"\nThe FBI and DOT's advice includes keeping automotive software up to date and staying aware of any possible recalls that require manual security patches to your car's code, as well as avoiding any unauthorized changes to a vehicle's software and being careful about plugging insecure gadgets into the car's network. Most of those tips stem directly from last year's research demonstrations: After hackers Charlie Miller and Chris Valasek hacked the Jeep in July, Chrysler issued a 1.4 million vehicle recall and mailed USB drives with software updates to affected drivers. And the next month, researchers from the University of California at San Diego showed that a common insurance dongle plugged into a Corvette's dashboard could be hacked to turn on the car's windshield wipers or disable its brakes.\nThe announcement also notes that drivers should be careful about offering physical access to their vehicles to strangers. \"In much the same way as you would not leave your personal computer or smartphone unlocked, in an unsecure location, or with someone you don’t trust, it is important that you maintain awareness of those who may have access to your vehicle,\" the announcement reads. (If only the FBI felt quite so strongly about keeping intruders out of your iPhone.)\nNot much in the FBI's warning is new information, says Chris Valasek, one of the two Jeep-hacking researchers. But he says the imprimatur of the FBI could make the threat of car hacking real for anyone who hasn't considered the growing risk of digital attacks on connected vehicles. \"It seems super delayed,\" says Valasek. \"But it's good advice...people take the FBI seriously.\"\nValasek says the most significant part of the announcement may be its request that anyone who suspects their car has been hacked to get in contact with the FBI, along with the car manufacturer and the National Highway and Traffic Safety Administration. Until now, Valasek says, he and his fellow Jeep hacker Charlie Miller have themselves been bombarded with messages---credible and not-so-credible---from people who believe they're car hacking victims. \"Charlie and I get emails all the time from people who say 'my car's been hacked!'\" he says. \"The FBI is more than welcome to take that over.\"",
        "sentiment": -0.4262817505261172
    },
    "article_2": {
        "title": "Official: Justice Department to withdraw legal action against Apple",
        "body": "FBI hacks into terrorist’s iPhone without Apple\nShow Caption Hide Caption The FBI is dropping the San Bernardino iPhone court case Thanks to the skills of an unknown third party, the Department of Justice was able to access data on the iPhone of one of the San Bernardino shooters.Video provided by Newsy Newslook\nSAN FRANCISCO — Although the government officially withdrew from its battle against Apple Monday, many observers sense the tech privacy war is just getting started.\n\"This lawsuit may be over, but the Constitutional and privacy questions it raised are not,\" Congressman Darrell Issa (R-Calif.), who had criticized the Justice Department's legal effort against Apple, said in a statement Monday.\nThe Justice Department withdrew its legal action against Apple after a method brought to the FBI earlier this month by an unidentified entity allowed investigators to crack the security function without erasing contents of the iPhone used by Syed Farook, who with his wife, Tashfeen Malik, carried out the December mass shooting in San Bernardino that left 14 dead.\nThe government maintained it was looking for access to one phone, but Apple countered that asking for a code that could access the iPhone 5c would create a backdoor to all such devices that was exploitable by other entities.\n\"This case should never have been brought,\" Apple said in a statement released late Monday. \"We will continue to help law enforcement with their investigations, as we have done all along, and we will continue to increase the security of our products as the threats and attacks on our data become more frequent and more sophisticated. ... This case raised issues which deserve a national conversation about our civil liberties, and our collective security and privacy.\"\nIn its two-page filing in a California magistrate's court, the government noted that due to outside assistance it \"no longer requires the assistance from Apple Inc.\" Justice spokeswoman Melanie Newman said the FBI is reviewing the contents of the phone as \"consistent with standard investigatory procedures,\" and that \"we will continue to pursue all available options for this mission, including seeking the cooperation of manufacturers and relying upon the creativity of both the public and private sectors.\"\nGovernment law enforcement officials have denied charges the FBI wanted to establish a backdoor to Apple's encryption, and swatted away accusations that they were using the case to gain broader access to consumers' devices.\n\"The San Bernardino case was not about trying to send a message or set a precedent; it was and is about fully investigating a terrorist attack,'' FBI Director James Comey wrote in an editorial last week.\nThe FBI has about a dozen similar cases pending in which it wants access to smartphone information to assist with a case. So while this particular showdown may be over, \"there are other cases pending where law enforcement relies on the All Writs Act\" to access tech gadget data, referring to an old law that can compel companies to help the government in pursuit of its duties, says Denelle Dixon-Thayer, Chief Legal and Business Officer at Mozilla, the company behind the Firefox browser.\n\"This question is clearly not going away just because the government has withdrawn their request in this particular case,\" she says.\nMozilla and dozens of other tech companies that supported Apple with amicus briefs will be watching what happens next carefully.\nPrivacy issues have both societal and financial implications. Given the ubiquity of smartphones and tablets, concerns loom about how rogue regimes could leverage back doors into tech products to go after detractors. Companies like Apple, whose brand identity is anchored to data security, could face declining sales if smartphones and tablets prove hackable.\nAll that is counterbalanced by the need for public security in an age when terrorists use encrypted smartphone communication to secretly plot devastating attacks such as the recent suicide missions in Brussels and Paris.\nJustice officials declined to comment on whether the technique used to unlock the phone would be applied to other encrypted devices. Authorities also refused comment on whether the method would be shared with Apple.\nApple officials said on a call with reporters last week that if the iPhone in question was accessed, the company would want to know how so it can improve its encryption techniques. Declining to turn over such details to Apple engineers would \"leave ordinary users at risk from malicious third-parties who also may use the vulnerability,\" says Andrew Crocker, staff attorney for the Electronic Frontier Foundation.\nMonday's action concludes six weeks of building tensions between the government and the the Silicon Valley i-product giant. The FBI insisted for weeks that only Apple could crack the contents of Farook's iPhone. Apple said such an action amounted to a digital \"backdoor\" that could eventually undermine the privacy of consumers — an unwavering stance supported by Google, Facebook, Microsoft and other tech giants.\nThe foes were poised to face off in a court room in Riverside, Calif., last week before the Justice Department abruptly asked for — and was granted — a postponement.\nApple CEO Tim Cook has crusaded in a highly coordinated public campaign against the dangers of weakened security in digital devices. This month, Apple said the “Founding Fathers would be appalled” because the government’s order to unlock the iPhone was based on what it said was non-existent authority asserted by the DOJ.\nCalifornia U.S. Attorney Eileen Decker said federal authorities had pursued the litigation to “fulfill a solemn commitment to the victims of the San Bernardino shooting — that we will not rest until we have fully pursued every investigative lead related to the vicious attack.’’\nAlex Abdo, staff attorney for the American Civil Liberties Union, called the government’s “unprecedented power-grab” a threat to everyone’s security and privacy.\n“Unfortunately, (Monday's) news appears to be just a delay of an inevitable fight over whether the FBI can force Apple to undermine the security of its own products,” Abdo said in a statement late Monday. “We would all be more secure if the government ended this reckless effort.”\nMarco della Cava and Jon Swartz reported from San Francisco, Johnson from Washington, D.C.",
        "sentiment": -0.44768518462910184
    },
    "article_3": {
        "title": "FBI 'could force Apple to hand over private key': If Apple doesn’t comply with the court order requiring it to weaken the security on the San Bernardino shooter’s iPhone, it may be asked to hand over the source code to the entire operating system instead, the Department of Justice has implied.",
        "body": "If Apple doesn’t comply with the court order requiring it to weaken the security on the San Bernardino shooter’s iPhone, it may be asked to hand over the source code to the entire operating system instead, the Department of Justice has implied.\nIn its formal legal rebuttal to Apple, the department addressed one of Apple’s key legal arguments: that forcing it to write the code, which would remove key security features from Syed Farook’s iPhone would be unduly burdensome.\nThe department wrote in a footnote to its filing: “The FBI cannot itself modify the software on Farook’s iPhone without access to the source code and Apple’s private electronic signature.\n“The government did not seek to compel Apple to turn those over because it believed such a request would be less palatable to Apple. If Apple would prefer that course, however, that may provide an alternative that requires less labour by Apple programmers.”\nSuch an order would not be unprecedented. In August 2013, Lavabit, the secure email service used by NSA leaker Edward Snowden, abruptly shut down citing government interference. It later emerged that the FBI had attempted to force the site’s owner, Ladar Levison, to hand over the encryption keys for his email service so that they could monitor any emails sent by Snowden. Levison refused and was sanctioned for contempt of court as a result.\nIn its filing regarding Apple, the US government cited the precedent set by Lavabit.\nPossession of Apple’s private key wouldn’t just allow the FBI to modify Farook’s iPhone. It would also make it possible for the organisation to write new versions of iOS in future cases, and deliver them in other ways. For instance, if the FBI were able to intercept the net connection of a target (known as a “man in the middle” attack), with Apple’s private key it could plausibly push an update that looked like a real software release from the company.",
        "sentiment": -0.5514348957401055
    },
    "article_4": {
        "title": "John McAfee lied about San Bernardino shooter's iPhone hack to 'get a s**tload of public attention'",
        "body": "John McAfee isn’t telling you the truth—but he says he’s lying for a good cause.\nMcAfee has been on a media tour discussing a court order that directs Apple to write custom code to help the FBI access a terrorist’s iPhone. The method McAfee says he would use to break open the phone, he admitted to the Daily Dot, is false.\nMcAfee, who founded of one of the first companies to offer antivirus software, claimed on CNN and Russia Today, as well as in a Business Insider column, that he could bypass the advanced encryption protecting the iPhone without Apple’s help. But he lied in those interviews, he told the Daily Dot, to “get a shitload of public attention.”\nFurther, the method McAfee says is real—the one he says he’s lying to try to hide—is neither a secret nor feasible for anyone to accomplish without expensive tools and specialized skills. Even then, experts believe it would be difficult and would risk destroying the data the FBI is fighting so hard to access.\n“Now, what I did not lie about was my ability to crack the iPhone. I can do it. It’s a piece of friggin’ cake.”\nApple has the ability to write custom software that would allow the FBI to brute force its way into San Bernardino shooter Syed Rizwan Farook’s iPhone without triggering a self-destruct security feature. But it must do so by authorizing the specialized version of iOS with a signature Apple exclusively holds.\nFBI Director James Comey said during a congressional hearing on Tuesday that his office had requested the help of the entire U.S. government but that he did not find a viable solution for breaking into the iPhone without demanding Apple’s assistance.\nMcAfee said he bent the truth in order to push back against the official narrative.\n“By doing so, I knew that I would get a shitload of public attention, which I did,” McAfee said. “That video, on my YouTube account, it has 700,000 views. My point is to bring to the American public the problem that the FBI is trying to [fool] the American public. How am I going to do that, by just going off and saying it? No one is going to listen to that crap.\n“So I come up with something sensational,” he continued. “Now, what I did not lie about was my ability to crack the iPhone. I can do it. It’s a piece of friggin’ cake. You could probably do it.”\nMcAfee first admitted to lying in an interview with Inverse.The software company executive offered to tell the Daily Dot his secret method for cracking an encrypted iPhone, something that experts say cannot be done without Apple’s authentic digital signature, but only if the Daily Dot promised to “not publish this publicly or tell anybody else.”\nThe Daily Dot declined to make such a promise in order to keep the entire conversation on the record.\nLater in the interview, McAfee described his method, which involves “decapping” the phone’s processor and acquiring the device’s unique identifier (UID), that may allow someone to brute force the phone’s password—guess the password by flooding it with options—at a faster rate. Despite his insistence that the Daily Dot not publish this technique, McAfee has explained the method in previous media interviews.\nSome experts believe, however, that McAfee’s theory doesn’t make much sense. Ars Technica explained why:\nThus far, the most plausible method for decrypting the San Bernardino iPhone without Apple’s assistance involves manually inspecting the handset’s processor using acid and lasers. Done correctly, this would let the FBI learn not the PIN, but the device’s unique hardware ID. With that ID, they could combine it with each of the PINs in turn until they hit upon the right one. The cost and complexity of this technique would be extremely high, and it would be extremely risky: one wrong move and the hardware ID would be destroyed permanently, making the phone’s data permanently and irrevocably lost.\nWhen asked why he was discussing this method on the record, McAfee said, “Because I’m assuming, because you kept on asking, that you aren’t going to publish it.”\nWhen the Daily Dot pointed out that McAfee had never secured such a promise, he said that the conversation was over and hung up.\n“The lie was an exaggeration of simplicity,” McAfee said in a text message after the interview. “As the Inverse article explained, it would have been impossible in the time allowed to explain the fullness of the truth. If you fault me for that, then you, and possibly your readers, will have been the only one on the planet to have done so.”\nMcAfee also said, “I apologize for my anger.” He added that it “seemed absurd to me to focus on a simplification of a technique, given the stakes at risk—a potentially Orwellian state initiated by the populace ignoring the truth of what the FBI is trying to do to us.”\nIllustration via Max Fleishman",
        "sentiment": -0.31289043459223537
    },
    "article_5": {
        "title": "Judge: Order to Compel Apple Has Been 'Unenforceable' All Along",
        "body": "On Monday, less than 24 hours before the hearing was scheduled to start, the US government asked to cancel its big court date in the Apple vs FBI fight. The judge convened a quick conference with the Department of Justice and Apple attorneys. A transcript shows the judge repeatedly emphasizing that the order to compel Apple to create a backdoor for the government is \"unenforceable\" and has been so since the court battle began weeks ago.\nAdvertisement\nThe March 22 hearing was set to be an all-out battle. Both sides planned to call witnesses, with one to two hours of live testimony expected in court. Lawyers for Apple said that the judge had set aside four to five hours total for the hearing. The court was clearly braced for a storm of media attention, with three overflow rooms set aside for spectators (a total of 324 seats, including the main courtroom), and with a special court order announcing a first-come, first-serve ticketing system (starting at 7 AM) reminiscent of Supreme Court practices, along with an advisory that the security line could only process 50 people per hour.\nBut all this preparation was for naught, when the government moved for a continuance at the very last minute. Prosecutors said that an \"outside party\" (now thought to be an Israeli forensics firm) had \"demonstrated to the FBI a possible method for unlocking Farook's iPhone.\"\nIt's hard to tell how the hearing-that-never-was would have actually gone. But on Tuesday, Cryptome published the transcript to the conference that happened right before the judge granted the government's request to cancel the hearing. It shows the judge pushing back—gently—against the government, while the government backpedaled on the aggressive stance it had taken against Apple in its filings.\nScreenshot from the transcript.\nOn February 16, Magistrate Judge Sheri Pym issued an order to compel Apple to assist the FBI in searching a work-issued iPhone belonging to Syed Rizwan Farook, the suspected shooter in the December 2015 San Bernardino attack. In order to access the contents of the phone, the FBI asked Apple for custom software that would disable certain security mechanisms, allowing the agency to brute-force the password. Apple has been fighting that court order. The company and the Department of Justice were set to argue their positions in court on March 22.\nAdvertisement\nApple's lawyers called into the March 21 conference, agreeing to the government's request to cancel the hearing. But they also asked the judge to vacate the February 16 order. The order had been premised on the government's claim that Apple was the only party that could help them access the phone—now that the DOJ had turned up this \"outside party,\" the order was invalid. The DOJ disagreed, saying that since the Justice Department wasn't sure whether the method would work, it would be premature.\nWhile the judge sided with DOJ and left her February 16 order in place, she emphasized that \"the order that was entered is unenforceable and is stayed.\" The judge said that she was \"struggling\" to see the difference between vacating the February 16 order and leaving it in place, since the order had no legal effect for the time being.\nOn March 1, in a hearing before the House Judiciary Committee, Rep. Trey Gowdy (R-SC) blasted Apple for flouting the law, by not complying with Magistrate Judge Pym's order. The judge's own remarks—while not directed at Gowdy—serve to rebutt him.\n\"I certainly don't think, let me just comment, that Apple's been flouting the order,\" said Magistrate Judge Pym in the meeting on March 21. \"The order, essentially—it isn't—pending a final decision, there's not really—it's not in a stage that it could be enforced at this point.\"\nThe transcript also shows prosecutors backpedaling on some of the more hostile things they've said about Apple, claiming that they are \"not saying anything nefarious about Apple.\"\nAdvertisement\nTheodore Boutrous, one of the lawyers for Apple on this case, responded by quoting the government's own filings back to them. \"Just on page 2 of their reply and opposition brief they declare, 'Apple's rhetoric is not only false, but is corrosive of the very institutions that are best able to safeguard our liberty and our rights.'\"\nScreenshot from the transcript.\nWhile the DOJ canceled the court date ostensibly because an \"outside party\" had demonstrated a forensic technique at the last minute, the timing is still suspicious. The most likely forensic technique is one that experts have been discussing for weeks—in fact, Rep. Darrell Issa (R-CA) even mentioned it to FBI Director James Comey in the House Judiciary Committee hearing on March 1.\nIs the government retreating from the San Bernardino iPhone fight because its lawyers think the judge is likely to rule against them? It's possible. After a flood of amicus briefs and unprecedented media attention on a magisterial proceeding, Judge Pym might be having second thoughts about the order she issued on February 16. If the hearing had gone poorly for the government, the DOJ would have lost face on a national stage. But the DOJ hasn't fully backed out yet, and it still has an appeal in a similar case pending on the East Coast.",
        "sentiment": -0.5552909469639417
    },
    "article_6": {
        "title": "U.S. Secretary of Defense on Apple encryption: 'I'm not a believer in backdoors'",
        "body": "Check out all the on-demand sessions from the Intelligent Security Summit here.\nThe United States Secretary of Defense today came out against the creation of a so-called backdoor to break the data encryption of the iPhone at the heart of the Apple-FBI court case. Speaking at the RSA Conference, Secretary Ashton Carter declared, “I’m not a believer in backdoors. It’s not realistic and it’s not technically accurate.”\nImage Credit: Blaise Zerega/VentureBeat\nSecretary Carter also warned against the creation of a new law that would compel technology companies to unlock data upon request by the government. Currently several U.S. Senators have voiced support for such a bill. Speaking for the Department of Defense, he said, “We’re not in the executive branch seeking legislation of this kind. I don’t think writing a law without an exploration of all the technical solutions out there” is a good idea. Further, he cautioned against “a law written by people [without tech expertise] or written in an atmosphere of anger and grief.”\nSecretary Carter’s remarks came in discussion with Ted Schlein, general partner at venture capital firm Kleiner Perkins, Caufield & Byers, during a session entitled, “A Conversation on Collaboration Between Silicon Valley and the Department of Defense,” which seemed to be an olive branch to the tech community amid the bitter acrimony arising from Apple’s standoff with the FBI. Secretary Carter explained that he doesn’t see one single solution to the encryption cases, but instead sees many different pieces to a cooperative approach. “We shouldn’t let one case drive the solution,” he said. “We have to innovate our way to a sensible result.”\nFor more coverage of Apple and the FBI’s fight over unlocking the San Bernardino shooter’s iPhone, visit our timeline of the case here.",
        "sentiment": -0.6357639181826796
    },
    "article_7": {
        "title": "More developers now use OS X than Linux, says ‘most comprehensive survey ever conducted’ by Stack Overflow.",
        "body": "Stack Overflow reports that more developers now use OS X than Linux as their primary OS, and that if the trend continues, fewer than half of all developers will be using Windows next year.\nLast year, Mac edged ahead of the Linuxes as the number 2 operating system among developers. This year it became clear that trend is real. If OS adoption rates hold steady, by next year’s survey fewer than 50% of developers may be using Windows.\nThe site says it carried out ‘the most comprehensive developer survey ever conducted,’ with more than 56,000 coders across 173 countries taking part.\nIn mobile development, more were still developing for Android than iOS – 61.9% versus 47.5% – but Swift is now used by almost a third of developers. Swift was also the second most loved language after Rust.\nThere are many more stats to be found in the full survey results.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.1319004312157631
    },
    "article_8": {
        "title": "Apple Sends Invites for 'Let Us Loop You In' Media Event on March 21",
        "body": "Apple today sent out invites for a media event that will be held on Monday, March 21 at the company's Town Hall auditorium located on its 1 Infinite Loop campus in Cupertino, California, reports BuzzFeed. As with most Apple media events, it will kick off at 10:00 a.m. Pacific Time.\nSeveral products are expected to be showcased at the event, including the new 9.7-inch iPad, the 4-inch iPhone SE, and new Apple Watch bands. There's also a possibility that some Mac refreshes could be announced as the time is right for updates, but there have been no rumors confirming that is the case.\nHeadlining the event will be the 4-inch iPhone SE and a new 9.7-inch iPad. Rumors suggest the iPhone SE will look nearly identical to the iPhone 5s, but it will include new internal hardware that brings it in line with newer Apple devices. It is rumored to have an A9 chip, an improved camera, and NFC support for use with Apple Pay.\nThe new 9.7-inch iPad has been referred to as the iPad Air 3, but recent rumors have suggested it may instead be branded as an iPad Pro. The device is said to include many iPad Pro features, like a four-speaker design, a Smart Connector for connecting accessories, and display improvements for Apple Pencil support. It may also be the first iPad to feature a rear LED flash.\nApple also plans to introduce new Apple Watch bands at the event. Existing bands will likely be available in new colors and there may be new product lines, such as a rumored nylon band and a Space Black Milanese Loop.\nApple will be live streaming the event on its website and through the Apple TV. MacRumors will also provide live coverage of the event, both here on our website and through the MacRumorsLive Twitter account.",
        "sentiment": 0.19474115581916912
    },
    "article_9": {
        "title": "Apple asks the FBI: How hard did you really try to hack into the iPhone?",
        "body": "There’s no question that Apple’s ongoing legal dispute with the FBI has brought a myriad of complex legal, security, and policy issues to the forefront. But if we put those serious issues aside for just a moment, one of the more interesting aspects of the case, I think, is that the FBI even needed Apple’s help in the first place.\nEspecially given how pervasive and advanced the NSA’s surveillance and hacking techniques were even just a few years ago, many people, including myself, were of the opinion that government agencies, from the FBI to the CIA, likely had the technical expertise to effectively hack into any device and monitor anyone, anywhere.\nMUST SEE: The 10 best new movies and TV shows coming to Netflix in March\nThat being the case, it always struck me as odd and somewhat surprising that the FBI didn’t already have a way to bypass the iPhone’s passcode security scheme given that it’s been in existence for years now. After all, the iPhone involved in the San Bernardino shooting was an iPhone 5c, which is to say that there’s no Secure Enclave or Touch ID to hack around.\nIs it really feasible that the FBI, for nearly a decade, hasn’t developed a means to break into a passcode protected iPhone, even if that iPhone was set up to erase itself after 10 incorrect passcode entries?\nAssuming that that’s the reality we’re living in, are we also to believe that the NSA, which employs innumerable technical wizards and has no shortage of zero-day exploits (per Edward Snowden) is similarly unable to access the San Bernardino terrorist’s iPhone?\nPerhaps I’m giving the NSA too much credit here, but one can almost imagine NSA engineers watching this saga unfold and smirking to themselves, armed with the knowledge that they’ve been able to bypass a data-protected iPhone for years.\nAll of that said, one of the more interesting aspects of Apple’s recently filed motion to vacate argues that the FBI may not have tried all possible avenues to hack into the shooter’s iPhone 5c.\nIn a section titled, “The Government Has Not Demonstrated Apple’s Assistance Was Necessary To Effectuating The Warrant”, Apple argues that there’s no evidence to suggest that the FBI sought assistance from other agencies (read: the NSA, the CIA) when it came to unlocking the iPhone in question.\nA third party cannot be compelled to assist the government unless the government is authorized to act and the third party’s participation is imperative. … Moreover, the government has not made any showing that it sought or received technical assistance from other federal agencies with expertise in digital forensics, which assistance might obviate the need to conscript Apple to create the back door it now seeks. … As such, the government has not demonstrated that “there is no conceivable way” to extract data from the phone.\nIt’s an interesting argument that was even brought up, albeit quickly, during yesterday’s congressional hearing on mobile device encryption and the balance between American security and privacy.\nDuring the course of the hearing, FBI director James Comey was asked if the FBI sought help from other intelligence agencies.\nThe Washington Post reports:\nLater in the hearing, Comey was specifically asked if the FBI had talked to other government agencies, including the NSA. “Yes is the answer,” he said. “We’ve talked to anybody who will talk to us about it.” When he was asked again whether other agencies could have helped them access the phone, he said Apple had effectively created phones that could not be broken into, which is why they had to resort to court action.\nIt’s hard to know exactly what’s being alluded to here and if Comey is being a bit coy.\nSo we know that the FBI sought out help from other intelligence agencies, but did those agencies agree to help? Did they refuse? Did they claim they lacked the technical know-how to hack into the iPhone? Is it at all possible that the NSA is keeping its iPhone hacking methods under wraps and told the FBI that there’s nothing they can do? And just when, exactly, did the FBI seek out assistance from the NSA?\nMore than likely, we’ll never find out the answers to these questions. In the meantime, it will certainly be fascinating to see how Apple’s legal tussle with the FBI plays out now that it’s captured the attention of lawmakers and citizens alike.",
        "sentiment": -0.34741130457432184
    },
    "article_10": {
        "title": "Donald Trump has already given up his iPhone boycott",
        "body": "Three weeks ago, Donald Trump announced an impromptu boycott of Apple products \"until such time as Apple gives cellphone info to authorities regarding radical Islamic terrorist couple from Cal.\" A staunch supporter of the FBI's demands, Trump said he owns both Samsung and Apple phones, but pledged to use only the Samsung phone until Apple complied with the court order in San Bernardino.\nBut three weeks down the line, Mr. Trump seems to have forgotten about the boycott entirely. In the past 24 hours, Trump has tweeted from an iPhone at least four times, as confirmed by Twitter's own metadata:\nTrump has also made almost no mention of the boycott in recent appearances, despite extensive appearances at debates, interviews and campaign speeches. Apple has not complied with the government's demands in the intervening weeks and has only intensified its objections to the proposed order, yesterday accusing prosecutors of mounting \"an unsupported, unsubstantiated effort to vilify Apple.\"",
        "sentiment": -0.8378387555480004
    },
    "article_11": {
        "title": "Harvard Law professor &amp; former Obama special assistant dismisses FBI’s claims – “the law is clear: The FBI Cannot Make Apple Rewrite its OS”",
        "body": "Harvard Law professor Susan Crawford and former special assistant to President Obama has written a blog post setting out the reason why she believes it is legally impossible for the FBI to win its case. The piece is entitled ‘The Law is Clear: The FBI Cannot Make Apple Rewrite its OS.’\nWhile the FBI is relying on an extremely broad interpretation of the All Writs Act, Crawford points out that it is an accepted principle that specific laws take precedence over more general ones – and there is a specific law which outlaws what the FBI is asking for …\nThat law is the Communications Assistance for Law Enforcement Act (CALEA). CALEA grants the government a lot of wiretapping powers, she says, but also clearly sets out the limits to those powers.\nThe government won an extensive, specific list of wiretapping assistance requirements in connection with digital communications. But in exchange, in Section 1002 of that act, the Feds gave up authority to “require any specific design of equipment, facilities, services, features or system configurations” from any phone manufacturer.\nThat wording, she argues, means that the government is specifically prohibited from requiring Apple to create a compromised version of iOS.\nThe government is aware of this, and the blog piece describes how it is attempting to argue its way around the issue, but Crawford says the FBI’s brief uses a circular argument. CALEA has, she writes, “no gaps; no interpretive sunlight: CALEA stops the government from doing what it wants to do to Apple.”\nThe next hearing takes place at the U.S. District Courthouse in Riverside, California, on 22nd March. Protest group Fight for the Future is inviting Apple supporters to post online messages which it will display outside the court.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.07595627883879039
    },
    "article_12": {
        "title": "Obama's 'tone deaf' comments on encryption draw criticism at SXSW",
        "body": "Rep. Darrell Issa speaking at a previous SXSW festival.\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nPresident Barack Obama's recent comments on encryption and national security have drawn criticism from the highly connected audience of the South by Southwest festival, including one particularly prominent voice — Â Congressman Darrell Issa.\nIn an appearance at the festival last week, Obama warned against taking an \"absolutist\" position on encryption, saying that both sides need to make concessions. Unsurprisingly, that didn't sit well with SXSW attendees, who tend to side with Apple in favor of stronger encryption.\nThere's just no way to create a special key for government that couldn't also be taken advantage of by the Russians, the Chinese, or others who want access to the sensitive information we all carry in our pockets everyday.\" - Rep. Darrell Issa\nRep. Issa, R-Calif., spoke with USA Today about the encryption debate, and didn't mince words when it came to Obama's response.\n\"It was tone deaf,\" Issa reportedly said. \"He did not read the room in that portion of the answer. There's just no way to create a special key for government that couldn't also be taken advantage of by the Russians, the Chinese, or others who want access to the sensitive information we all carry in our pockets everyday.\"\nIn Obama's view, un-hackable encryption is not an ideal solution. He believes law enforcement agencies should be given access to devices in limited cases, likening it to TSA checks at the airport or drunk driving checkpoints.\nBut to Issa, those comments were \"a detriment to privacy.\"\nUnlike many in politics or law enforcement, Issa has a background in technology. He was co-founder and CEO of Directed Electronics, a maker of car security products including the Viper alarm. He also served as chairman of the Consumer Electronics Association, which runs CES, from 1998 to 2001 before becoming a member of the U.S. Congress.\nIssa's stance is in opposition to many of his colleagues in Washington, who largely side with the FBI and believe Apple should create a \"backdoor\" to access iPhones that may be of interest to law enforcement. At the center of the debate is an iPhone 5c that was used for work by one of the shooters in the San Bernardino terrorist attack late last year.\nApple has countered by saying that creating a \"backdoor\" to its iOS platform would not only be a major security issue, but it could also set a precedent for governments to request access to devices in questionable situations.",
        "sentiment": -0.1588863197552121
    },
    "article_13": {
        "title": "This site perfectly sums up why I love Reader view in Safari and why I will exit and never visit a site again if the option isn't available. Make sure you click \"turn bullshit on\".",
        "body": "We're bombarded by more information than ever before. With the rise of all this information comes a rise of the amount of bullshit we're exposed to. Death to Bullshit is a rallying cry to rid the world of bullshit and demand experiences that respect people and their time.\nWhat is bullshit?\nBullshit lies on a spectrum somewhere between ineptitude and outright deception. Bullshit can be characterized in a few different ways:\nSuperfluous or unnecessary\nCluttered, clunky, or needlessly complex\nIntentionally deceptive or insincere\nPopups, jargon, junk mail, anti-patterns, sensationalism, begging for likes, tracking scripts, marketing spam, dark patterns, unskippable ads, clickbait, linkbait, listicles, seizure-inducing banners, captchas, QR codes, barely-visible unsubscribe buttons, 24-hour news networks, carousels, auto-playing audio, bloatware, sudden redirects to the App Store, telemarketing, ticked-by-default subscribe buttons, \"your call is important to us\", pageview-gaming galleries, native advertising, the list of bullshit goes on and on and on. This bullshit assaults our senses in a desperate attempt to capture our attention.\nPeople's capacity for bullshit is rapidly diminishing.\nWhen information is cheap, attention becomes expensive. James Gleick\nWe as human beings are trying to maximize our signal and minimize the amount of noise we're exposed to. Our willingness to be inconvenienced, interrupted, and insulted is dwindling. We're finding more ways to circumvent bullshit, whether it's through tools like ad-blockers or actions like cutting cable.\nAs the landslide of bullshit surges down the mountain, people will increasingly gravitate toward genuinely useful, well-crafted products, services, and experiences that respect them and their time. So we as creators have a decision to make: do we want to be part of the 90% of noise out there, or do we want to be part of the 10% of signal? It's quite simple really:\nRespect people and their time.\nRespect your craft.\nBe sincere.\nCreate genuinely useful things.\nThis site and accompanying blog explore the themes of information, bullshit, and craft. Enjoy.\nLove,\nBrad",
        "sentiment": -0.2690010637044907
    },
    "article_14": {
        "title": "Apple Music Becomes First Streaming Service to Include Underground DJ Remixes and Mashups",
        "body": "Apple has announced a new partnership with Dubset Media Holdings to stream thousands of remixed songs and DJ mixes, both based on original recordings, that were previously unavailable due to copyright issues. Apple Music will be the first streaming music service to provide access to these previously unlicensed tracks, according to Billboard.\nDubset will use a technology called MixBank to analyze a remix or DJ mix file, identify existing recordings within the file, pay the necessary rights holders, and distribute the mix through Apple Music and other streaming services. The process can take about 15 minutes for a 60-minute recording.\nBut licensing remixes and DJ mixes, both based on original recordings, is incredibly complex. A single mix could have upward of 600 different rights holders. According to CEO Stephen White, a typical mix has 25 to 30 songs that require payments to 25 to 30 record labels and anywhere from two to ten publishers for each track. […] MixBank matches the recordings used in the remix or DJ mix against a database of three-audio snippets from Gracenote, where White was CEO prior to joining Dubset. He says fingerprinting is a “brute force” tool that can provide MixBand with up to 100 possible matches for each three-second match.\nThe rise in popularity of the EDM genre has resulted in an increasing number of user-generated remixes, mash-ups, and DJ mixes of popular songs, and this partnership will help bring those underground tracks to Apple Music and potentially \"all 400 distributors worldwide\" in the future, said White.\nDubset will retain a percentage of revenue for providing in-house licensing and pay the DJ or remixer a share of that amount. The service \"allows everyone to make money on this content for the first time,\" according to White. The digital distributor has agreements with over 14,000 labels and publishers.\nIn related news, Beats 1 recently announced that popular EDM artist deadmau5 will host his own show this Friday at 3:00 p.m. Pacific.",
        "sentiment": 0.13783484936824866
    },
    "article_15": {
        "title": "Mac OS X Might Be Dropping The \"X\" to become 'MacOS'",
        "body": "We’ve all noticed Apple’s latest operating system nomenclature, with each new release a device-centric OS, like iOS, tvOS, or watchOS.\nWhy not macOS, then?\nA bit of source code in the current stable release of OS X (10.11.4) seems to point to that very thing.\nDeveloper Guilherme Rambo told Portuguese-language site MacMagazine.com.br that he found an interface file (FUFlightViewController_macOS.nib, in the FlightUtilities framework) that uses the macOS terminology in the file name.\nSurely Apple is looking to this as a possible renaming of OS X, which would fit it right in with it’s OS naming for its mobile devices, Apple TV and Apple Watch. It would make sense to launch MacOS 11 this year, too, with new OS versions across the line up (iOS 10, watchOS 3 and tvOS 10) to make it a banner year.\nThe UNIX-based OS X has been around for 15 years, so it’s probably time to start calling it something new. Originally named after big cats (Puma, Cheetah, Jaguar, Panther, Snow Leopard, and so on), recently the team at Apple has named the different releases after places in California, like El Capitan and Yosemite. There’s no reason Apple can’t continue this naming convention; it’s just that making the OS match the device name would make things a bit clearer to customers.\nWhile we don’t really know what the plan is, we do hope to see the arrival of Siri on macOS (or whatever it’s called in the next release). It would make a lot of branding sense, for sure. Here’s hoping.",
        "sentiment": -0.005717943721850004
    },
    "article_16": {
        "title": "Apple Said to Ship New 'Ultra-Thin' 13\" and 15\" MacBooks by June-July",
        "body": "While some customers were hopeful that Apple would release new Macs at its \"Let Us Loop You In\" media event yesterday, the product announcements were focused on the new 4-inch iPhone SE, 9.7-inch iPad Pro, and additional Apple Watch bands.\nBut those waiting patiently for a Mac refresh may not have much longer to wait, as DigiTimes today reported that Apple will begin shipping new \"ultra-thin\" 13-inch and 15-inch MacBooks at the end of the second quarter.\nThe second calendar quarter ends on June 30, meaning that new Macs could feasibly be introduced by WWDC 2016, which will likely take place between June 13-17 based on scheduling information available from the Moscone Center.\nThe new MacBooks will allegedly \"share a design similar to the existing 12-inch MacBook\" and be \"thinner than [the] existing MacBook Air,\" which makes it difficult to infer which MacBook lineup the report is referring to.\nDigiTimes has a mixed track record at reporting on Apple's upcoming product plans, but its report corroborates a previous rumor claiming Apple is preparing thinner 13\" and 15\" MacBook Airs with \"fully redesigned\" internal components. That report said the notebooks would be ready by the third quarter, which corresponds to a July-September timeframe -- possibly shortly after a WWDC announcement.\nApple currently offers the MacBook Air in 11\" and 13\" sizes, and it has never released a 15\" MacBook Air. In fact, many have assumed the MacBook Air will be discontinued at some point as declining costs allow the MacBook to become Apple's mainstream notebook offering. A redesigned MacBook Air, possibly with a long-awaited Retina display, could be considered a bit of a surprise.\nThe current MacBook Pro perhaps better corresponds with the rumored 13\" and 15\" sizes, but whether Apple is able to fit pro-level hardware in an \"ultra-thin\" design similar to the lower-spec 12-inch MacBook remains to be seen. There is also the possibility that the new 13\" and 15\" notebooks will be MacBooks, but the notion seems questionable unless Apple discontinues the year-old 12\" model.\nApple's refreshed Mac lineup is expected to feature Intel's faster Skylake processors and Thunderbolt 3 with USB-C, while the MacBook Air and MacBook Pro are also deserving candidates for an overall redesign.\nApple last refreshed the 13-inch MacBook Pro in March 2015, while the 15-inch model was updated in May. For this reason, the 13-inch model is classified as Early 2015, and the 15-inch model is Mid 2015. Both notebooks received Force Touch trackpads, faster flash storage, longer battery life, and improved graphics.\nThe Early 2015 13-inch MacBook Pro is based on Intel's last-generation Broadwell chip architecture, while the 15-inch model still has older Haswell architecture. Over the past year, Intel has announced Skylake chips appropriate for the 13-inch MacBook Pro, 15-inch MacBook Pro, 12-inch MacBook, and MacBook Airs.",
        "sentiment": 0.00485158185748493
    },
    "article_17": {
        "title": "As Apple resists creating a ‘GovtOS’ in the U.S., Microsoft already wrote one for China",
        "body": "Update: A source close to Microsoft tells me the software – which is not yet complete – will be used only by public sector agencies. No information was provided as to how the software differs from the standard Chinese version of Windows 10.\nWhile Apple has strongly resisted building a special ‘GovtOS’ to provide the U.S. government with access to iOS devices, it appears that Microsoft has no such qualms. TechInAsia reports that Microsoft has created a special version of Windows 10 for China, called Windows 10 Zhuangongban, which includes “more management and security controls.”\nAlthough Microsoft hasn’t gotten any more specific than that, I’d agree with TNW that these controls are likely to have been introduced at the request of the Chinese government for domestic surveillance purposes.\nWe’re currently waiting to hear whether the Apple vs FBI case will return to court, or whether it will quietly fade away now that the FBI is receiving technical assistance from elsewhere. Apple, meantime, seemingly believes that not even the servers it purchases are safe from interception. It was reported last week that it is developing its own cloud infrastructure specifically to reduce the risk of snooping.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.6042736018076539
    },
    "article_18": {
        "title": "Steve Wozniak says the FBI \"picked the lamest case you ever could\" [Video]",
        "body": "Appearing on Conan last night, Woz said that he sided with Apple in the FBI fight, first because he’s always been strong on human rights, as one of the founders of the Electronic Frontier Foundation, but because governments shouldn’t be able to tell manufacturers to make their products insecure at a time when security is so important.\nHe argued that there is absolutely no reason to think the FBI would learn anything from the iPhone in question.\nThey picked a lame case. They picked the lamest case you ever could […] [For the shooters’ own phones] Verizon turned over all the phone records, all the SMS messages. So they want to take this other phone, that the two didn’t destroy, which was a work phone, and it’s so lame and worthless to expect something’s on it and get Apple to expose it.\nRevealing that he had once written something that could have acted as a Macintosh virus, he said he’d thrown away every line of code because he was so scared of what might happen if the code got out …\nHe echoed two of Apple’s arguments at the Congressional hearing: that there is always the risk that the code will get into the wrong hands once it exists, and that other governments would also expect access to it.\nOnce you create it, there’s a good chance hackers will get into it – and what if China says ‘Apple, you’ve got to give us a backdoor so we can get into any phone, even [those belonging to] your government officials.’\nConan said he was convinced by Woz’s arguments.\nYou can watch the video clip below.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.20511554181575775
    },
    "article_19": {
        "title": "Apple, basically: 'If it pleases the court, tell FBI to go f**k themselves' / Boing Boing",
        "body": "The intensifying legal battle between Apple and the Government of the United States of America is blowing my mind. The legal briefs coming out of Cupertino are awesome reading for those of us who care about silly stuff like freedom and liberty and iPhones. Here are some of the excerpts everyone was talking about on Twitter today.\nHere, Apple is saying, \"If it pleases the court, tell the FBI to go fuck themselves.\" pic.twitter.com/OxzaaOjNwj — Jonathan Ździarski (@JZdziarski) March 15, 2016\nOn Twitter today, forensic scientist and O'Reilly author Jonathan Ździarski highlighted notable snippets of new legal briefs filed by Apple, which you can read here on Mashable's servers.\n‏\"Here,\" tweets Ździarski about the snippet screengrabbed above, \"Apple is saying, 'If it pleases the court, tell the FBI to go fuck themselves.'\"\nFrom Ździarski's analysis today of what may happen next in FBI vs. Apple:\nShould the government have carte blanche rights to force anyone to work for them? Should the privacy of people's entire past be subject to a warrant? Should people be allowed to have private conversations, private thoughts, private ideas – all things stored on people's iPhones – subject to search by the government? I am honestly in shock, and saddened by the fact that any of these questions could be raised at all in this country. The fundamental construct of our constitution, and the basic human rights they were based on, have answered these questions for hundreds of years – a free society cannot live without privacy. A free society cannot live without freedom from tyranny. A free society cannot live without free speech, or under the fear that your speech and thoughts will be used to imprison you. The questions that the Department of Justice is posing, at the very core of the matter, are questions of whether or not we should be a free people. The very government that we founded to protect our liberties is now, in a very raw way, questioning them. This should shock you. It should shock every American, and it is no doubt shocking the rest of the watching world. How can the freest country in the world, a beacon for those in oppressive countries, lay down their speech, their privacy, their identities over a dead terrorist's iPhone? The shootings that took place in San Bernardino were horrible and flat out evil, and I mourned for the victims… but the greatest damage that Syed Farook stands to cause is to our country and our constitutional rights as a whole; giving up our rights will ultimately affect the liberty and safety of generations to come. Make no mistake about it – Syed Farook would be pleased to see this agenda being played out in the court system today. We should not be pleased. We should be indignant. We should be deeply offended. Offended that anyone would attempt to curtail rights that our families have died, and continue dying, to protect.\nMore from Ździarski's tweeted analysis, and that of others who read the brief, below.\nIt's very clear from this brief that Apple is schooling DOJ, and doing it quite well. — Jonathan Ździarski (@JZdziarski) March 15, 2016\nAs always, this is an excellent brief from Apple. I would read it regardless, like I would read a good book. https://t.co/ITNVeGJ0By — Jonathan Ździarski (@JZdziarski) March 15, 2016\nNeuenschwander (Apple engineer) points out NIST defined Root of Trust as a \"security component\" and endorsed it. pic.twitter.com/lJeJVO3vf2 — Jonathan Ździarski (@JZdziarski) March 15, 2016\nToday I learned that #Apple has way better lawyers than the DOJ. — Edward Snowden (@Snowden) March 15, 2016\nCraig Federighi reaffirms that, as the SVP of Software Engineering, he's never worked to create a backdoor. pic.twitter.com/jG5aIUMMTN — Jonathan Ździarski (@JZdziarski) March 15, 2016\n@GlennF Today's conf. call was very different in tone from last week's. Last week: slightly outraged. Today: measured logical confidence. — John Gruber (@gruber) March 15, 2016\nApple's brief was interesting reading. They make the DOJ/FBI lawyers sound like they are 8 year olds with a too-high Adderall dosage. — Glenn Fleishman (@GlennF) March 15, 2016\nI suspect any Apple engineer sufficiently qualified to write the code, should she or he exercise conscience, would be employable elsewhere. — Glenn Fleishman (@GlennF) March 15, 2016\nThis is a really important point about the evidence contained on Farook's phone. Read this again. https://t.co/AzVfCppmej — Jonathan Ździarski (@JZdziarski) March 15, 2016\nNeuenschwander: FBI must have been looking at the wrong screen when checking their facts. pic.twitter.com/7qLshyrh2t — Jonathan Ździarski (@JZdziarski) March 15, 2016\nProps to Neuenschwander for completely dismantling many of FBI's inaccurate claims with the humility of a tech support specialist. — Jonathan Ździarski (@JZdziarski) March 15, 2016\nNeuenschwander is saying that the lack of evidence found in Farook's iCloud *really does* indicate he had no mail, photos, notes to backup. — Jonathan Ździarski (@JZdziarski) March 15, 2016\nNeuenschwander: Vulnerabilities and jailbreaking are EXACTLY why this code could be hacked to run anywhere. pic.twitter.com/MVC6RpehpH — Jonathan Ździarski (@JZdziarski) March 15, 2016\nAs I (and many others) have been saying: Data backed up to iCloud is not encrypted with a user's passcode. BEWARE. pic.twitter.com/7rrFi9C0S5 — Jonathan Ździarski (@JZdziarski) March 15, 2016\nNeuenschwander: There's hardly anyone at Apple that can even do this, and they're busy making SECURITY happen. pic.twitter.com/X8eZ4Z3rHz — Jonathan Ździarski (@JZdziarski) March 15, 2016\nNeuenschwander: Employees will become high risk targets thanks to this, and we can't classify names like you can. pic.twitter.com/ZLS1kCYg3S — Jonathan Ździarski (@JZdziarski) March 15, 2016\nBoeing is developing a secure version of Android exclusively for government use. pic.twitter.com/leafCCRXLB — Jonathan Ździarski (@JZdziarski) March 15, 2016\nApple: We're painters. We're singers. We're authors. We're these that dream dreams. You can't force our craft. pic.twitter.com/Pb97mvwDJn — Jonathan Ździarski (@JZdziarski) March 15, 2016\nApple: Cryptographic signatures mean we're endorsing [dangerous] code. pic.twitter.com/OcrqtF0YqX — Jonathan Ździarski (@JZdziarski) March 15, 2016\nApple decided to quote the San Bernardino Police Chief to drive their point home. pic.twitter.com/3C8Ng0BLyn — Jonathan Ździarski (@JZdziarski) March 15, 2016\nApple enumerates all of the excellent ways in which code is speech. pic.twitter.com/TUCoAVr0La — Jonathan Ździarski (@JZdziarski) March 15, 2016\nApple does an excellent job discrediting claims about the Aaron Burr case. pic.twitter.com/A0XkV3epwf — Jonathan Ździarski (@JZdziarski) March 15, 2016",
        "sentiment": -0.23706669705609482
    },
    "article_20": {
        "title": "Congressman Suggests FBI Is Taking Advantage of San Bernardino Tragedy to Push Agenda",
        "body": "A leading House Democrat expressed serious concern on Tuesday that the FBI is exploiting the ISIS-inspired massacre of 14 people in San Bernardino to sidestep Congress on the encryption debate.\nRep. John Conyers, D-Mich., said it was troubling “that in the middle of an ongoing congressional debate on this subject, the FBI would ask a federal magistrate to give them the special access to secure products that this committee, this Congress, and the administration have so far refused to provide.” He spoke at a hearing of the House Judiciary Committee, of which he is the ranking Democratic member.\n“Why has the government taken this step and forced this issue?” he asked.\nIt was a rhetorical question.\n“I suspect that part of the answer lies in an email obtained by the Washington Post and reported to the public last September,” Conyers said.\n“In it, a senior lawyer in the intelligence community writes that ‘although the legislative environment towards encryption is very hostile today … it could turn in the event of a terrorist attack or criminal event where strong encryption can be shown to have hindered law enforcement.’”\nConyers continued: “I am deeply concerned by this cynical mindset. And I would be deeply disappointed if it turns out that the government is found to be exploiting a national tragedy to pursue a change in the law.”\nThe congressman was referring to a leaked letter authored by the intelligence community’s top lawyer, Robert S. Litt. In the letter, Litt advised “keeping our options open for such a situation.”\nA federal magistrate judge in California last month ordered Apple to help the FBI access San Bernardino killer Syed Rizwan Farook’s iPhone by developing software to turn off built-in security features — essentially bypassing the phone’s encryption.\nMost technologists argue it’s a type of “backdoor” into the device — something various congressional committees have been debating for months.\nLaw enforcement agencies say they need a way to access all digital communications to conduct investigations, while technologists and privacy advocates say any vulnerability in a device, whether built into the encryption or around it, gives hackers and criminals a foothold to steal private information.\nBut now, Conyers argues, that debate is being yanked from Congress’s hands. If the FBI succeeds in its court case, it could ask other companies to hack their products too, no matter what type of encryption is involved.\nIf you can get past the door, why do you need to ask Congress for a key?\nFBI Director James Comey insisted that the FBI is not trying to bypass Congress. “I think that the courts are competent to resolve the narrow question about the scope of the All Writs Act,” he said during the hearing, referring to a colonial-era law that allows the government to ask a third party to assist it in carrying out a legal request.\nAnd although Comey has repeatedly insisted that the San Bernardino case is a narrow one, he acknowledged at the hearing that “any decision of a court about a matter is potentially useful for other courts, that’s what precedent is.”\n“There are issues about backdoors,” Comey said. “There’s already a door.” The FBI, he said, is asking Apple to “take the vicious guard dog away and let us try and pick the lock.”",
        "sentiment": -0.26678224767629916
    },
    "article_21": {
        "title": "Snowden: FBI Claim That Only Apple Can Unlock Phone Is “Bullshit”",
        "body": "Here’s the discussion, which also included Malkia Cyril, executive director of the Center for Media Justice, and Dan Froomkin, Washington editor of The Intercept. The comments in question come at about the 30-minute mark.\n“The FBI says Apple has the ‘exclusive technical means’” to unlock the phone, Snowden said during a discussion at Common Cause’s Blueprint for Democracy conference.\nThe FBI last month persuaded a federal judge that the only way to get into the phone was to make Apple write code to undermine its own security protocols. Apple is refusing to comply.\nSnowden further explained on Twitter: “The global technological consensus is against the FBI,” he wrote — linking to a blog post on the American Civil Liberties Union website explaining exactly how the FBI could have bypassed the iPhone’s auto-erase function on its own. That’s “one example,” he wrote.\nOther technologists have explained how the FBI could have easily accessed the phone’s latest iCloud backup if agents working with San Bernardino County had not reset the iCloud password.\nEven so, security researchers say there are other options, like “de-capping” the phone’s memory chip to access it outside the phone (which Snowden has also mentioned), or resetting the phone’s internal counter so that you can guess the passwords as many times as you want. Those techniques are hard and expensive and could destroy the phone, experts say — but have worked in the past.\nAnd that’s not to mention any shadowy tactics the spies from the government’s intelligence community might have. The NSA and CIA have worked for almost 10 years to develop ways to hack into Apple devices, as revealed by The Intercept last year.\nThe key may be that none of those ways would be nearly as easy for the FBI as making Apple do it — this time, and from now on.\nThe NSA has been mysteriously absent from the FBI-Apple fight. Conceivably, it tried and failed to hack the phone, but that seems unlikely. Another possibility is that the NSA was excluded on purpose, so the FBI could create a test case.",
        "sentiment": -0.6134439197776373
    },
    "article_22": {
        "title": "Mossberg: The iPhone 7 had better be spectacular",
        "body": "Welcome to Mossberg, a weekly commentary and reviews column on The Verge and Re/code by veteran tech journalist Walt Mossberg, now an Executive Editor at The Verge and Editor at Large of Re/code.\nOne day this fall, if things occur as usual, Apple will stage a big event to introduce the next flagship iPhone. And, based on the events of this month, that smartphone better be great.\nDon’t get me wrong, it’s not that I have any beef at first glance with the revamped, smaller iPhone SE that Apple unveiled this week, or with the downsized iPad Pro that accompanied it. Each makes business sense — especially the modernized 4-inch phone model, the iPhone SE. Both seemed to work well in the few minutes I had to fiddle with them, and I’ll have reviews of them soon.\nI expect these products will make significant minorities of users happy. Plus, the $399 base price on the iPhone SE (compared to $650 or so for the 6s) may help Apple in overseas markets where cheaper and smaller phones are popular.\nBut these latest iPhones and iPads don’t break much new technology ground.They are derivative products — the iPhone SE is based on the iPhone 5 design first introduced in 2012. And its innards and features mostly, but don’t quite, match those of the current top mainstream model, the 6S, rolled out last year.\nI stand by my view that the premium iPhone 6S and 6S Plus are the best smartphones on the market.\nThe latest iPhones and iPads are derivative products\nBut the top-of-the-line iPhones were challenged impressively just two weeks ago by rival Samsung’s beautiful, carefully engineered new Galaxy S7 phones. A Verge test showed the Samsung’s cameras are better. Only the sadly typical software mess on those phones makes them lag behind Apple’s long-superior iPhone.\nIf the smartphone category is to take a leap forward, and the iPhone is to maintain its ever-thinning lead as the best smartphone you can buy, Apple needs to impress big time in the fall.\nAs always, rumors about the next iPhone abound online. They include new types of wireless and wired headphones, including the elimination of the standard headphone jack; a dual-lens camera that would allow for a form of true optical zooming; and even thinner dimensions.\nI don’t have any inside information about the next flagship iPhone, and I don’t own any stock or have any other financial interest in Apple, or in any other company whose products I cover.\nBut here are seven things I’d love to see Apple do to keep moving the iPhone — and the smartphone itself — forward. Some of these items are catchups with competitors, others would be new.\nFirst of all — and this is very tough scientifically — Apple could make a big leap in battery life. The company has long done a decent job for people who are moderate users, or who, like me, have great cell tower proximity, which keeps the phone from battery-draining tower searches. But I know too many iPhone users who are forced to recharge their phones multiple times a day or carry around bulky extra-battery cases or portable chargers. Apple even brought out such a case itself recently. Fixing battery life would be a huge win.\nThis might mean Apple would have to return to a slightly thicker phone, and not make the next model even thinner. But many users would take that tradeoff for a phone they could be confident would last over a long day, or even more — without a giant battery case bulge.\nSecondly, and closely related, is charging. iPhones aren’t especially slow at charging, but Samsung is now faster, and there are companies working on systems that offer somewhat less battery life in exchange for ultra-quick charging that can take as little as five minutes. Plus, Apple should consider enabling wireless charging so its users can take advantage of charging pads being installed in places like Starbucks, without a special case.\nThird, it’s time to banish, or seriously shrink, the large top and bottom bezels on the iPhone, and even the smaller side ones, so a large screen can be packed into a smaller phone body. Samsung did a good job with this on the S7, especially on the Edge model. The real selling point of the iPhone SE isn't the smaller screen, but the smaller body that's easier to hold. A larger screen in a smaller overall package would greatly benefit users.\nIt's time to banish, or seriously shrink, the top and bottom bezels\nMy fourth wish is for some sort of optical zoom that doesn’t require a heavy telescoping lens. The rumored dual-lens camera might provide this. Previous efforts at unobtrusive optical zooming by other phone makers haven’t been good, so Apple has a real opportunity here. The iPhone camera also needs to do better in low-light situations and to activate even more quickly — great speed is one reason Samsung’s new camera is better.\nMy fifth wish is for a hardier phone. What, you say, the iPhone is pretty sturdy! And its body is. But it’s never been water resistant, like Samsung phones. Its back is slippery. And its screen cracks pretty easily in common kinds of drops. That’s why the beautiful designs in Apple TV ads are rarely seen in real life because the phones are cloaked by ugly (if profitable) cases and gauzy screen protectors.\nSixth, it’s time to bundle adequate internal storage in the base model, without a price increase. Sixteen gigabytes just doesn't cut it anymore, even in a cloud-based world, and storage is cheap. The base iPhone should have 32 GB of storage, or even 64 — even if that cuts Apple’s margin a little.\nFinally, as I’ve written before, Apple needs to up its game in phone software (also on the Mac, but that’s another column). Its Mail app needs to do a much better job of handling Gmail, which has a billion users, even if rival Google makes that hard. Users should be able to select their own favorite apps for core functions. Apple Maps and Siri both need much more work to be consistently reliable, and it’s time to make iMessage, which works well, cross-platform.",
        "sentiment": 0.02175823704532857
    },
    "article_23": {
        "title": "Apple launches Safari Technology Preview, a new browser aimed at web developers",
        "body": "Apple today announced it’s expanding its efforts in the area of web development, with the launch of a new version of its Safari web browser, designed specifically for developers. Called Safari Technology Preview, the company says this browser will allow developers to get an early look at upcoming web technologies in OS X and iOS, including things like the latest layout technologies, visual effects, and other developer tools.\nThe idea is to allow developers to more easily get their hands on these technologies and be able to experiment, then offer feedback to Apple earlier on so the company can make the necessary improvements.\nOf course, Apple has for a long time offered Nightly builds of WebKit, the open source browser engine that today runs on hundreds of millions of devices and powers Apple’s Safari. However, getting access to these builds takes a bit more effort than using the new Safari Technology Preview browser. Instead, with the new browser, its updates are distributed every two weeks by way of the Mac App Store’s software update mechanism. That means it’s less hassle to run a browser that features the latest advances in web technologies, including HTML, JavaScript, CSS and WebKit.\nPlus, the browser allows developers to access the latest versions of Web Inspector and Responsive Design Mode – the latter which is used to help developers build websites that work across devices, from desktop to mobile.\nOther advantages this version of Safari offers over using a Nightly build is that it’s signed and validated by Apple, and it works with iCloud. The lack of iCloud support, in fact, has been a pain point for web developers who wanted to use a Nightly build as their primary browser. Now, they’ll have a different option, while still being able to use their bookmarks, access their Reading List and access the tabs they’ve opened on other devices.\nIn addition, Safari Technology Preview is a standalone application, meaning it can run side-by-side with the shipping version of Safari, to make it easy to switch between the two builds. (The Technology Preview version will feature a purple icon to differentiate it from the shipping version.)\nWhile the big news is the product’s actual launch, developers will also likely be interested to learn what’s shipping in the debut version, out today. This includes a variety of first-release features, such as:\nECMAScript 6 : Apple says this is one of the most complete implementations of ECMAScript 6 (ES6), the latest version of JavaScript. ES6 offers support for classes that allow developers to use the object-oriented principles in their JavaScript code, iterators, and new APIs.\n: Apple says this is one of the most complete implementations of ECMAScript 6 (ES6), the latest version of JavaScript. ES6 offers support for classes that allow developers to use the object-oriented principles in their JavaScript code, iterators, and new APIs. B3 JIT JavaScript Compiler: B3 is a new low-latency, compiler designed from the ground up for JavaScript. B3 optimizes for speedy initial compile times while optimizing the compiled JavaScript for sustained performance.\nB3 is a new low-latency, compiler designed from the ground up for JavaScript. B3 optimizes for speedy initial compile times while optimizing the compiled JavaScript for sustained performance. Updated IndexedDB Implementation: IndexedDB lets developers store lots of structured data on the client and access that data quickly. Developers have asked for an improved implementation, so Apple released this revamped IndexedDB implementation that is more stable and more standards compliant.\nIndexedDB lets developers store lots of structured data on the client and access that data quickly. Developers have asked for an improved implementation, so Apple released this revamped IndexedDB implementation that is more stable and more standards compliant. Shadow DOM: Shadow DOM makes it easier to build large-scale web applications by allowing developers to expose elements on a webpage and defining how they interact with their application. WebKit is the first browser engine to implement this latest version.\nShadow DOM makes it easier to build large-scale web applications by allowing developers to expose elements on a webpage and defining how they interact with their application. WebKit is the first browser engine to implement this latest version. Support for programmatic cut and copy to the clipboard and Content Security Policy Level 2.\nWhile Safari Technology Preview is obviously aimed at developers, it will be accessible to anyone who wants to try it – you won’t need to have a registered Apple Developer account to download the browser.\nFor tech enthusiasts, there are still some advantages to running this version of Safari, even if you aren’t a web developer. Because the browser offers the latest web technologies, there are real consumer benefits that you can see and feel as you use the web – like better performance and a richer web experience, for example.\nSafari Technology Preview is available today, as of 10 AM PT on developer.apple.com/safari/download.",
        "sentiment": 0.6144544428938793
    },
    "article_24": {
        "title": "Apple destroys government claim that it’s using encryption debate as a marketing tool",
        "body": "When the DOJ filed its response brief last week, Apple attorneys didn’t even try to hide their disgust. During a colorful conference call with reporters, Apple general counsel Bruce Sewell was quick to call the DOJ’s accusations “offensive.”\nIn addition to suggesting that Apple “has a different and sinister relationship with China”, the DOJ also issued a thinly veiled threat indicating that it might seek to compel Apple to hand over the source code to iOS.\n“In 30 years of practice,” Sewell added, “I don’t think I’ve seen a legal brief that was more intended to smear the other side with false accusations and innuendo, and less intended to focus on the real merits of the case.”\nDON’T MISS: The FBI’s worst nightmare is coming true\nAnd speaking of false accusations, you might recall that the DOJ, on a few occasions, boldly categorized Apple’s staunch defense of encryption as nothing more than a cheap marketing ploy designed to curry favor with consumers and increase device sales.\nApple’s reluctance to assist the FBI, the DOJ wrote, is “based on its concern for its business model and public brand marketing strategy.”\nYesterday, Apple finally addressed such accusations head on, completely destroying the DOJ’s already flimsy and baseless argument in the process.\nIn a detailed footnote found in its response brief, Apple explained that encryption has never been used, referenced or alluded to in any of Apple’s marketing efforts. Additionally, Apple dismissed the notion that it implements security measures in order to “confound” law enforcement. On the contrary, Apple explained that it “prioritizes the security and privacy of its users, and that priority is reflected in Apple’s increasingly secure operating systems…”\nThe full footnote reads as follows:\nThe government accuses Apple of developing the passcode-based encryption features at issue in this case for marketing purposes. This is a reckless and unfounded allegation. Since passcode-based encryption was first introduced in October 2014, Apple has produced 627 separate ads in the United States and approximately 1,793 ads worldwide. These ads have generated 99 and 253 billion impressions, respectively. Not a single one advertised or promoted the ability of Apple’s software to block law enforcement requests for access to the contents of Apple devices. The idea that Apple enhances its security to confound law enforcement is nonsense. Apple’s “chain of trust” process—which follows accepted industry best practices—is designed to secure its mobile platform against the never-ending threat from hackers and cyber-criminals. It is the same process that helps protect desktop computers from viruses and Trojan horses, and that ensures hackers do not tamper with the software on automobiles.\nAs an aside, it’s fascinating that Apple in about 17 months time has rolled out nearly 1,800 separate ads.\nApple’s full response can be read below.\nAPPLE INC.’S REPLY TO GOVERNMENT’S OPPOSITION TO APPLE INC.’S MOTION TO VACATE ORDER COMPELLING APPLE INC…. by Roberto Baldwin",
        "sentiment": -0.23643931467086077
    }
}