{
    "article_0": {
        "title": "iPhone maker Foxconn has replaced more than half its workforce with robots since iPhone 6 launch",
        "body": "The South China Morning Post reports that iPhone maker Foxconn has replaced more than half of its workforce with robots since the launch of the iPhone 6. The figures were provided by the local government in Kunshan, where the company is based.\n“The Foxconn factory has reduced its employee strength from 110,000 to 50,000, thanks to the introduction of robots. It has tasted success in reduction of labour costs,” said the department’s head Xu Yulian …\nSince September 2014, more than 500 companies in the Chinese province of Dongguan have spent a total of $630M on robot and AI technology to replace human workers. It was reported back in January that Foxconn had received a $12M government subsidy to help minimize layoffs in response to reduced iPhone orders.\nGreater automation in iPhone production could be both good news and bad for Apple. It will reduce the scope for allegations of poor conditions for workers, but will also mean that Apple would be bringing fewer new jobs to countries like India, where economic development has been part of its push to get a better deal from the government.\nVia TNW. Photo: MIT Technology Review.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.18106702241030606
    },
    "article_1": {
        "title": "Apple Releases iOS 9.3.2 With Support for Simultaneous Night Shift/Low Power Mode Usage",
        "body": "Apple today released iOS 9.3.2 to the public, marking the second update to iOS 9 since iOS 9.3 launched in March of 2016. In testing since April 6, Apple seeded a total of four iOS 9.3.2 betas to developers and public beta testers prior to releasing the update to the public.\nToday's iOS 9.3.2 release is available as an over-the-air update for all iOS 9 users and it can also be downloaded through iTunes.\niOS 9.3.2, as a minor 9.x.x update, focuses mainly on under-the-hood performance improvements and bug fixes rather than outward-facing changes. One of the biggest bug fixes resolves an ongoing issue that caused Bluetooth accessories to experience audio quality issues when paired with an iPhone SE.\n- Fixes an issue where some Bluetooth accessories could experience audio quality issues when paired to the iPhone SE\n- Fixes an issue where looking up dictionary definitions could fail\n- Addresses an issue that prevented typing email addresses when using the Japanese Kana keyboard in Mail and Messages\n- Fixes an issue for VoiceOver users using the Alex voice, where the device switches to a different voice to announce punctuation or spaces\n- Fixes an issue that prevented MDM servers from installing Custom B2B apps\nIn addition to the bug fixes listed above, the update also introduces support for using Night Shift and Low Power Mode simultaneously. During the first few iOS 9.3 betas, the two features were able to be turned on simultaneously, but later betas removed that functionality. With iOS 9.3.2, devices capable of using Night Shift can turn it on with Low Power Mode enabled.\niOS 9.3.2 is the eighth update to the iOS 9 operating system, following iOS 9.0.1, iOS 9.0.2, iOS 9.1, iOS 9.2, iOS 9.2.1, iOS 9.3, and iOS 9.3.1.",
        "sentiment": 0.143177203013606
    },
    "article_2": {
        "title": "Apple introduces student discount for Apple Music",
        "body": "Amid news that Apple Music is getting a makeover come this summer, Apple today launched a new plan to boost subscribers to its streaming music service and competitor to Spotify, SoundCloud, Tidal and others. It’s introducing an Apple Music student plan which will discount the service by 50 percent for those who are enrolled in an eligible college or university.\nThat means in the U.S., where an individual membership to Apple Music costs $9.99 per month, the student membership will be $4.99 per month instead.\nThe option isn’t just arriving in the U.S., though. Students in other countries, including the U.K., Germany, Denmark, Ireland, Australia, and New Zealand, will also be able to take advantage of the new membership option.\nHowever, because Apple Music is priced slightly differently in other markets, the cost of the student membership will vary. But in all markets, it will be 50 percent off the standard subscription price.\nThe cost reduction will be available for up to four years following sign-up, and those years don’t have to be continuous. In other words, a student who takes breaks in between semesters can still sign up for a student membership when they return to school. In addition, those who are enrolled in Master’s programs are also able to sign up for a student membership, as it’s aimed at anyone attending college or university, regardless of degree.\nThe membership tier will be made available starting today to both new and existing subscribers who will be able to either sign up or change their membership from the web or the Apple Music mobile application for iOS and Android.\nThe company is also working with a leading student verification technology provider, UNiDAYS, to ensure that those who are signing up as students are actually enrolled at a supported school.\nApple Music, of course, has been plagued with complaints about its cluttered and unintuitive user interface (which is reportedly being addressed by a redesign) and it has struggled with issues and glitches where it has had caused songs to disappear from users’ hard drives, thanks again to its confusing and complex nature.\nHowever, that hasn’t impacted its ability to grow – the service is nine months old now and is expanding its subscriber base at a faster rate than Spotify. The company recently reported that it now has 13 million subscribers, up from 11 million in February this year.\nCompetitive pricing has contributed to this growth. While its individual plan is a par-for-the-course $9.99 per month, the Family Plan is $14.99 per month. This has made it the most affordable option on the market for multiple users, as it permits up to 6 people to stream. (For the same price, Spotify only allows 2 users to share an account, for comparison’s sake.)\nThe addition of yet another low-cost membership option will also likely have a similar impact on subscriber growth, as there are a number of budget-conscious students who may now choose to join Apple’s service.\nApple is no stranger to the power of the student discount, it should also be noted. The company already offers discounts on its hardware to those with a valid student ID. However, it not yet offered a similar discount on a software service.\nThe student membership is rolling out now in the available markets.",
        "sentiment": 0.2769428074049453
    },
    "article_3": {
        "title": "Apple CEO Tim Cook says next-gen iPhones are so good you’ll wonder how you lived without them",
        "body": "TNW's former West Coast writer in the PNW (Portland, Oregon). Nate loves amplifying developers, and codes in Swift when he's not writing. If (show all) TNW's former West Coast writer in the PNW (Portland, Oregon). Nate loves amplifying developers, and codes in Swift when he's not writing. If you need to get in touch, Twitter is your best bet.\nIn an interview with CNBC, Apple CEO Tim Cook excitedly hinted that Apple had more great stuff in the pipeline, and this time we won’t be able to live without it.\nHere are some of Cook’s comments, courtesy of Tech Insider:\nWe have great innovation in the pipeline, like new iPhones that will incent you and other people that have iPhones today to upgrade to new iPhones. We are going to give you things that you can’t live without, that you just don’t even know you need today…You will look back and wonder ‘how did I live without this?’\nCook also said Apple is “incredibly excited” about what it’s working on, and makes a technical acquisition every month or so.\nOf course, Cook’s statements are vague and offer no clues as to what he’s even suggesting. They should also be appreciated with a good dollop of levity.\nStill, Cook’s insistence that we will soon have features on Apple devices that we find critical to our daily lives is interesting. The last time he made similar proclamations, Apple had a run that led to the best fiscal quarter in history.\nBut he also pluralized iPhone, so maybe he needs a sit-down with Schiller to set him straight.",
        "sentiment": 0.5935890956648758
    },
    "article_4": {
        "title": "94% of App Store revenue comes from the top 1% of developers",
        "body": "During the first quarter of 2016, the top 1 percent of U.S. App Store publishers with paid or in-app purchase (IAP) supported apps generated approximately 94 percent of all revenue on the store. In this post, we'll examine that surprising finding in more detail, along with our analysis of the top 1 percent's contribution to total downloads for Q1 as tracked by the Sensor Tower Store Intelligence platform.\nAbout Our Data\nTo produce this report, we analyzed U.S. App Store revenue and download estimates from January 1 through March 31, 2016 (Q1). For our revenue breakdown, we compared the estimated net revenue of publishers on the U.S. App Store with at least one actively ranking paid or IAP supported app. For our downloads breakdown, we compared the estimated downloads of publishers in the U.S. store with at least one actively ranking app on the top paid, free, or grossing charts.\nTop 1 Percent of Monetizing Publishers - Share of Revenue\nThe most surprising takeaway from our analysis of U.S. App Store publishers is that the top 1 percent of those who monetize their apps accounted for 94 percent of the store's revenue last quarter. That means approximately $1.34 billion of the estimated $1.43 billion in net revenue generated by the store during Q1 went to 623 publishers, the remaining 6 percent—approximately $85.8 million—was divided among the other 61,677 publishers whose apps are paid or feature in-app purchases.\nThe top 1 percent of revenue earning publishers on the U.S. App Store during Q1 was comprised of familiar juggernauts such as Supercell, MZ, Spotify, Netflix, and HBO. It should be noted that prominent shopping and services app publishers, such as Amazon and Uber, were not included in this analysis as they do not generate revenue via paid apps or IAPs.\nTop 1 Percent of All Publishers - Share of Downloads\nIn examining the larger base of 127,000 publishers that had at least one app ranking on the App Store in Q1, we found that the top 1 percent—1,270—accounted for 70 percent of all downloads.\nThere were approximately 1.38 billion app downloads on the U.S. store in Q1, and approximately 966 million of those were generated by the top 1,270 publishers out of 127,000 we analyzed. The remaining 99 percent of publishers split the other 414 million downloads between them.\nFor an idea of the biggest players in terms of U.S. App Store downloads last quarter, be sure to read our Q1 2016 Store Intelligence Data Digest.\nThe Importance of App Store Discoverability\nThis dominance of the U.S. App Store's revenue and downloads by such a small percentage of its publisher base probably doesn't come as a surprise to most app marketers. The issues faced by companies hoping to get their apps discovered by Apple's mobile audience are well documented and widely known, and continue to fuel rumors that a major overhaul of the store, focused on improving discoverability, is in the works.\nObviously, an App Store on which it's easier to find new apps is in Apple's best interest. It can only serve to attract more publishers—enticed by the idea that their apps won't languish in obscurity—and drive more revenue, as users (hopefully) find and pay for more apps, and Apple takes its percentage of their gross earnings.\nIntense competition for new users will still exist when this redesign finally arrives, no matter how easy it is to find apps. Publishers will continue to need to do everything they can to increase discoverability on their own, by staying on top of search trends and optimizing their apps for search, conversion, and monetization through platforms such as App Intelligence. We're intrigued to see what another analysis like this may uncover in 12 months' time.",
        "sentiment": -0.32943599447607996
    },
    "article_5": {
        "title": "Spotify reduces their price on family accounts to match Apple Music.",
        "body": "Do we share an account, or do we each get our own?\nEvery family member invited to Premium Family gets their own Premium account, so you can each play your own music whenever you want. You don't need to use each other's login details or schedule time when you can use Spotify. And because you now have separate accounts, music recommendations are tailored to your individual tastes.",
        "sentiment": 0.031141817569732666
    },
    "article_6": {
        "title": "Apple Music getting a revamp at WWDC",
        "body": "Apple is planning to overhaul its Apple Music service to make it \"more intuitive to use,\" according to Bloomberg News. Citing sources, Bloomberg News claims Apple will also better integrate its streaming and download options, and expand its radio service. Apple is rumored to unveil its updated Apple Music service at the company's Worldwide Developers Conference (WWDC) in June.\nWhile Apple Music has 13 million subscribers, the service has been criticized for its confusing interface and a lack of features. Prominent Apple watcher Jim Dalrymple labeled Apple Music a \"nightmare\" before giving up on the service last year. Apple Music hasn't had any major feature updates in its first year of existence, and the company has largely been addressing bug fixes rather than improvements.\nApple has faced a lot of criticism over Apple Music\nApple also had to deal with criticism from Taylor Swift and other artists, and changed its policy on paying royalty fees during its free trial period as a result. Apple recently unveiled a marketing campaign for Apple Music featuring Taylor Swift, and Bloomberg News reports that Apple will launch a \"marketing blitz\" to accompany the new updates.\nBloomberg's report also paints a picture of internal clashes over Apple Music. Apple acquired Beats Music two years ago, but Beats executive Jimmy Iovine has reportedly fueled some friction inside Apple. Bloomberg claims Iovine has carried out his own negotiations with artists, separate to other Apple employee negotiations. While there's clearly a complex management structure of Apple Music, Iovine reportedly helped negotiate a truce with Taylor Swift, and secured Drake's latest album as an exclusive.\nSome critics feel Apple waited too long to get into music streaming, but WWDC might be the perfect time for the company to unveil features and improvements that will change critic's minds.",
        "sentiment": -0.43096571788191795
    },
    "article_7": {
        "title": "Apple Sent Two Engineers to Customer's House to Figure Out Music Deletion Bug",
        "body": "A couple weeks ago Vellum's James Pinkstone wrote on his blog that Apple Music and iTunes Match deleted 122 GB of his personal music collection. The post kicked off a wave of speculation about whether Apple Music intentionally deletes users' music. Apple eventually confirmed that the deletion was a glitch and that a fix was incoming. Today, Pinkstone wrote a blog post detailing how two Apple engineers named Tom and Ezra visited his home to try to recreate the problem.\nBefore they arrived, Pinkstone said that Apple told him a couple of things: Amber, the Apple Support Representative who told him the music deletion glitch was a \"feature\" functioning as intended, was mistaken and the company was convinced the issue wasn't user error.\nThe engineers spent the day at Pinkstone's house researching the issue, telling Pinkstone to use Apple Music, iTunes and his personal library as he would in the past. The next day, Tom returned to collect the data logs and cleared any evidence of him being on the laptop. Apple's engineers weren't able to recreate the problem, though Pinkstone notes that they did think the issue was a glitch that needed to be combatted. Yesterday's iTunes 12.4 update includes safeguards to protect users from the music deletion bug.\nThrough an external drive connected to my laptop, we were now using a specialized version of iTunes in the hopes that the deletion would again occur; an idea that we knew may not pan out, since I’d had Apple Music for eight months before that first mass deletion. If something did go wrong, though, this version of iTunes would document what happened in more detail than the consumer version could.\nPinkstone's Apple engineer visit is a good example of how far the Cupertino company will go to try to correct bugs in its products. MacRumors has heard several reports of Apple sending out engineers to the homes of users experiencing unique problems in an attempt to research them for fixes. The entire visit can be read about on Pinkstone's blog.",
        "sentiment": -0.3377235746011138
    },
    "article_8": {
        "title": "Analyst claims iPhone 7 to feature 32 GB base storage",
        "body": "An IHS Technology analyst has posted on Chinese social media that company supply chain research indicates that the iPhone 7 will feature 32 GB storage as the $199 base model, which would mean Apple would finally drop the much-loathed 16 GB SKU from its lineup with its new flagship smartphone expected in the fall. IHS has a reasonable track record of accuracy when it comes to Apple rumors, correctly predicting last year that a 4 inch iPhone would debut in 2016 based on supply chain sources … which obviously transpired into reality as the iPhone SE.\nThe analyst also claims that iPhone 7 will feature 2 GB of RAM, the same specification as iPhone 6s. It is unclear if the analyst is referring to the iPhone 7 as a category or the specific 4.7 inch model. KGI analyst Ming-Chi Kuo has reported that the larger 5.5 inch iPhone 7 Plus will be equipped with 3GB RAM to handle the processing needs demanded by the dual-camera components. The big story here though is the claim that we could finally be saying goodbye to 16 GB flagship iPhones later this year …\nAlthough one report from one analyst is by no means conclusive proof that Apple will move to a minimum size 32 GB SKU, the existence of 16 GB phones in Apple’s top-of-the-line product range has lasted far too long and it is due for an upgrade. Apple introduced 16 GB to the iPhone lineup in 2008 on the original iPhone and it has stuck around as the base model specification since.\nHowever, customers increasingly find that a 16 GB phone is not suitable for their needs — just a few apps, photos and videos will easily fill the device. Especially as the latest iPhones feature 4K video recording, 16 GB is a pitifully small amount which is suitable for very few consumers. 16 GB may still work for some enterprise use cases but — on the whole — it is time for a larger capacity to become the new normal.\nIt’s interesting that IHS suggests Apple will bump the base model to 32 GB, as the iPhone 6s is not actually offered in that size at all. The current available configurations are 16 GB, 64 GB and 128 GB. One theory for keeping 16 GB around so long is that allows Apple to upsell a lot of customers onto the 64 GB model for an additional $100 of bottom-line revenue.\nThe analyst does not address the specifics of how Apple would configure the lineup other than saying 32 GB would be the base model; this could mean Apple simply replaces 16 with 32 or goes for something more drastic. With rumors of a 256 GB storage option for iPhone 7, a 32/128/256 GB product lineup is a possibility.\nIn general, the iPhone 7 is shaping up to be an iterative update over the iPhone 6s. Rumors suggest the device chassis will look largely the same as current iPhone design enhanced by a slightly thinner body, redesigned antenna lines and new camera components. iPhone 7 schematics indicate new camera optics are on the cards for both models. The larger iPhone 7, the 5.5 inch iPhone 7 Plus, will see more significant updates including a rear dual-camera system for better quality photos and videos. Apple will also be dropping the headphone jack in favor of Bluetooth wireless or Lightning port connections for audio output.\nA full design revamp is currently rumored for 2017 with the ‘iPhone 8’, with KGI reporting Apple is developing a major ‘all-glass’ design for next-year’s iPhone.\nFollowing tradition, the iPhone 7 will likely be announced in the fall, likely at a media press event around September. iOS 10 may shine some light on what to expect from Apple’s future hardware — Apple will unveil its latest software at WWDC on June 13th.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.0019432882964611053
    },
    "article_9": {
        "title": "Latest iPhone 7 Plus component leak shows new 256GB storage option",
        "body": "Earlier this week, we saw a leaked image appear showing the 4.7-inch model and its potential support for laser auto focus. It’s been rumored for a while now that the iPhone 7 Plus, however, will see even more camera updates with a new dual-camera setup on the back. In March, leaked images emerged claiming to show the alleged dual-camera module and now a new leak from Weibo has emerged corroborating the earlier images and showing potential for a 256GB storage tier (via Steven Hemmerstoffer).\nIn addition to showing the dual-camera module, the Weibo images claim to show a 256GB memory chip, suggesting that Apple for the first time will introduce a higher storage variant with the iPhone 7 lineup. What’s notable, though, is that the images show 16GB, 64GB, and 256GB chips, perhaps implying that the 128GB model will be replaced all together with the new 256GB model. Judging by this leak, however, the 16GB model is here to stay.\nThe 256GB component leak corroborates a report from earlier this year that claimed Apple would introduce the higher capacity option with the iPhone 7 Plus. That same report claimed that Apple would include a larger battery with the iPhone 7 Plus, as well.\nWith the addition of a second camera comes the need for more storage, so it seems likely that Apple would want to offer that to power users. But it’s odd from a usability standpoint to see the 16GB remain despite the file size of 4K videos and higher quality images. In my opinion, the best storage lineup for the iPhone 7 Plus would be 64GB/128GB/256GB, but Apple does not seem to be keen on ditching that 16GB variant just yet.\nA leak earlier this week showed the 4.7-inch iPhone 7 with a new tapered antenna design and potential support for laser auto-focus. Essentially, laser auto-focus means the device will have improved low-light performance as well as faster auto focus overall as the camera will better know the distance to the subject. LG first added this feature to its flagship in 2014.\nWith the design remaining largely the same for the third year in a row (and a major design seeming more likely for 2017), it’s looking increasingly possible that camera updates will the big selling points for the iPhone 7 and iPhone 7 Plus.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2747271652607357
    },
    "article_10": {
        "title": "Spy Photos of next Macbook Pro 2016 leaked",
        "body": "Leaked photos of what is claimed to be Apple’s next-generation MacBook Pro all but confirm it will ship with a new OLED touchpad above its keyboard. The images sent to Cult of Mac also hint at four USB-C connectors.\nA recent report from reliable KGI Securities analyst Ming-Chi Kuo promised Apple will introduce an OLED touchpad to the MacBook Pro lineup during the third quarter of this year. The machine is also expected to get a thinner form factor, and Apple’s new butterfly keys.\nThese photos, sent into us by an anonymous source who claims to work for one of Apple’s manufacturing partners in China, reveal a new cutout above the MacBook Pro’s keyboard — where the function keys would normally sit — that could house that OLED touchpad.\nThere are a bunch of reasons why adding an OLED touchpad to the MacBook Pro is a great idea, the main one being the ability to customize those function keys to swap out shortcuts you don’t use for ones you will. You could also add shortcuts for specific apps.\nIt looks like the touchpad might have a lip that slips into that smaller hole on the left side of the cutout, keeping it in place. The hole on the right side appears to contain three pins, which likely connects the touchpad to the logic board.\nThese photos also suggest that almost all of the connectors on the machine will be replaced by USB-C ports. There appear to be two on the right and two on the left sides of the device, while the only other hole looks like a headphone jack.\nIt’s hard to tell whether the new MacBook Pro is any thinner from these photos, but it doesn’t appear to be significantly slimmer than the existing model.\nWe can see what looks like speaker grilles either side of the keyboard, which suggests Apple may have moved the speakers to make way for that OLED touch pad. On existing models, the speakers are located at the back of the keyboard.\nThe MacBook Pro has long been Apple’s “prosumer” notebook, aimed at those who need a portable powerhouse they can take anywhere to get stuff done on the go. The most recent models were introduced just over a year ago when Apple added Intel Haswell processors, up to 16GB of RAM, and Force Touch trackpads.\nThe lineup is certainly in need of a refresh, then, and if Apple’s going to make us wait until the third quarter for it, it has to be a big one!",
        "sentiment": -0.06892540919430115
    },
    "article_11": {
        "title": "No, You Can’t Manufacture That Like Apple Does",
        "body": "No, You Can’t Manufacture That Like Apple Does\nStartups can’t do things the same way big companies do. And that’s a good thing; here’s why.\nStartups and big companies differ in a lot of ways. When it comes to hardware, the gulf between the two is massive. Early-stage startups are painfully under-financed. This lack of capital makes manufacturing one of the most critically dangerous periods in a young company’s life. One tiny mistake in a design, tool, or QC process and BAM, you’re out of business.\nThere are no second chances in hardware.\nAt least once a week, I have a conversation with a founder that wants to design something that mimics an Apple product. Maybe it’s a surface with no ejector pin marks, or some complex texturing, or laser drilled holes, it doesn’t really matter: it’s impossible for a startup to do certain things. “But no,” they say, “Apple does it. Why can’t I?”\nApple is an exception to nearly every rule.\nWhat happened when Apple wanted to CNC machine a million MacBook bodies a year? They bought 10k CNC machines to do it. How about when they wanted to laser drill holes in MacBook Pros for the sleep light but only one company made a machine that could drill those 20 µm holes in aluminum? It bought the company that made the machines and took all the inventory. And that time when they needed batteries to fit into a tiny machined housing but no manufacturer was willing to make batteries so thin? Apple made their own battery cells. From scratch.\nPretty much no company, big or small, can afford to do these things. Yes, Apple has done a great job building many of these products and yes, consumers have come to love many of these difficult-to-manufacture features. But you are not Apple. So long as you’re providing value to your customers, taking the fit and finish of your product down a notch is okay. Especially for your first few production runs.\nSo what should you avoid? Here’s a few things that Apple often does that can cause problems for a startup:\nWhite plastic\nWhite is of course the most difficult color to mold. If you NEED to use white, never have two separately molded white-on-white parts. They will never be perfectly color matched. CNC machining at scale\nCNC machining is fantastic for prototypes and pretty awesome for high margin parts like hip implants and turbine blades. It is not for consumer devices. Figure out a way to cast your metal parts. Laser drilled holes\nInvisible laser drilled holes are far more difficult to make than it may seem. You can usually accomplish a similar look and feel without the complex secondary operation if you’re willing to sacrifice a bit. Molded plastic packaging\nMany small Apple products come in polycarbonate + ABS/PC mix molded packaging. This is both harder and more expensive than you might think. Recycled cardboard is your friend No ejector pin marks\nUnless you’re a billionaire genius, your product will have noticeable ejector pin marks. A good CM knows how to hide these well. Nearly zero CMs hide them as well as Apple does. Embrace it. Most consumers don’t know what the hell an ejector pin mark is anyways. 4-color, double-walled, matte boxes + HD foam inserts\nI know you’re going to do this anyways, but be aware that these kind of boxes will literally be the most expensive line item on your BOM. It’s not unusual for them to cost upwards of $12/unit at scale. And then they get thrown away.\nThere are many more. If you see a feature on an Apple device you want to copy, try to find it on another company’s product. If you do, it’s probably okay to design into your product. Otherwise, lower your expectations. I assure you it’ll be better for your startup.\nBen Einstein was one of the founders of Bolt. You can find him on LinkedIn.",
        "sentiment": -0.24280865011992409
    },
    "article_12": {
        "title": "Apple’s actual role in podcasting: be careful what you wish for",
        "body": "This New York Times article gets a lot wrong, and both podcast listeners and podcast producers should be clear on Apple’s actual role in podcasting today and what, exactly, big producers are asking for.\nPodcasts work nothing like the App Store, and we’re all better off making sure they never head down that road.\nPodcasts still work like old-school blogs:\nEach podcast can be hosted anywhere and completely owned and controlled by its producer.\nPodcast-player apps periodically check each subscribed podcast’s RSS feed, and when a new episode is published, they fetch the audio file directly from the producer’s site or host.\nMonetization and analytics are completely up to the podcasters.\nSome podcasts have their own custom listening apps that provide their creators with more data and monetization opportunities.\nIt’s completely decentralized, free, fair, open, and uncontrollable by any single entity, as long as the ecosystem of podcast-player apps remains diverse enough that no app can dictate arbitrary terms to publishers (the way Facebook now effectively controls the web publishing industry).1\nApple holds two large roles in podcasting today that should threaten its health, but haven’t yet:\nThe biggest player app: Apple’s built-in iOS Podcasts app is the biggest podcast player in the world by a wide margin, holding roughly 60–70% marketshare.\nApple’s built-in iOS Podcasts app is the biggest podcast player in the world by a wide margin, holding roughly 60–70% marketshare. The biggest podcast directory: The iTunes Store’s Podcasts directory is the only one that matters, and being listed there is essential for podcasts to be easily found when searching in most apps.\nCritically, despite having these large roles, Apple never locked out other players, dictated almost any terms to podcasters,2 or inserted themselves as an intermediary beyond the directory stage.\nLike most of the iTunes Store, the podcast functionality has been almost completely unchanged since its introduction over a decade ago. And unlike the rest of the Store, we’re all better off if it stays this way.\nDistribution\nApple’s directory gives podcast players the direct RSS feed of podcasts found there, and then the players just fetch directly from the publisher’s feeds from that point forward. Apple is no longer a party to any activity after the search unless you’re using Apple’s player app.\nThere’s nothing stopping anyone else from making their own directory (a few have), and any good podcast player will let users bypass directories and subscribe to any podcast in the world by pasting in its URL.\nPromotion\nApple’s editorial features are unparalleled in the industry. I don’t know of anyone who applies more human curation to podcasts than Apple.\nThe algorithmic “top” charts, as far as podcasters have been able to piece together, are based primarily (or solely) on the rate of new subscriptions to a podcast in Apple Podcasts for iOS and iTunes for Mac.\nSubscriptions happening in other apps have no effect on Apple’s promotional charts because, as long as this remains decentralized and open, Apple has no way of knowing about them.\nPlayback\nApple’s Podcasts app for iOS is fine, but not great, leaving the door wide open for better apps like mine. (Seriously, it’s much better, and it’s free. Trying to succeed in the App Store in 2016 is neither the time nor the place for modesty.)\nApple’s app has only a few integrations and privileges that third-party apps can’t match, and they’re of ever-decreasing relevance. They haven’t locked down the player market at all.\nSo let’s get back to that misguided New York Times article.\nWhat (big) podcasters are asking for\nIgnoring for the moment that “podcasters” in news articles usually means “a handful of the largest producers, a friend or two of the reporter, and a press release from The Midroll, who collectively believe they represent all podcasters, despite only being the mass-market tip of the iceberg, as if CBS represented all of television or Business Insider represented all of blogging,” and this article is no exception, what these podcasters are asking for is the same tool web publishers have used and abused to death over the last decade to systematically ruin web content nearly everywhere:\n“More data.”\nOn the web, getting more data was easy: web pages are software, letting their publishers use JavaScript to run their own code right in your “player app” (web browser) to creepily record and analyze every move you made, selling you more effectively to advertisers and letting them algorithmically tailor their content to maximize those pennies at any cost to quality and ethics.\nPodcasts are just MP3s. Podcast players are just MP3 players, not platforms to execute arbitrary code from publishers. Publishers can see which IP addresses are downloading the MP3s, which can give them a rough idea of audience size, their approximate locations, and which apps they use. That’s about it.\nThey can’t know exactly who you are, whether you searched for a new refrigerator yesterday, whether you listened to the ads in their podcasts, or even whether you listened to it at all after downloading it.3\nBig publishers think this is barbaric. I think it’s beautiful.\nBig publishers think this is holding back the medium. I think it protects the medium.\nAnd if that ill-informed New York Times article is correct in broad strokes, which is a big “if” given how much it got wrong about Apple’s role in podcasting, big podcasters want Apple to add more behavioral data and creepy tracking to the Apple Podcasts app, then share the data with them. I wouldn’t hold my breath on that.\nBy the way, while I often get pitched on garbage podcast-listening-behavioral-data integrations, I’m never adding such tracking to Overcast. Never. The biggest reason I made a free, mass-market podcast app was so I could take stands like this.\nBig podcasters also apparently want Apple to insert itself as a financial intermediary to allow payment for podcasts within Apple’s app. We’ve seen how that goes. Trust me, podcasters, you don’t want that.\nIt would not only add rules, restrictions, delays, and big commissions, but it would increase Apple’s dominant role in podcasts, push out diversity, give Apple far more control than before, and potentially destroy one of the web’s last open media ecosystems.\nPodcasting has been growing steadily for over a decade and extends far beyond the top handful of public-radio shows. Their needs are not everyone’s needs, they don’t represent everyone, and many podcasters would not consider their goals an “advancement” of the medium.\nApple has only ever used its dominant position benevolently and benignly so far, and as the medium has diversified, Apple’s role has shrunk. The last thing podcasters need is for Apple to increase its role and dominance.\nAnd the last thing we all need is for the “data” economy to destroy another medium.",
        "sentiment": -0.3556732644564381
    },
    "article_13": {
        "title": "UK shows off prototype of digital iPhone driving license using Apple’s Wallet app",
        "body": "It looks like drivers in the UK could soon be able to store their driver’s license within Apple’s Wallet app on iPhones as CEO of the country’s Driver Vehicle Licensing Agency (DVLA) today shared the image of the work in progress feature above.\nApple’s Wallet app on iOS is currently used to store Apple Pay credit cards and debit cards, as well things like boarding passes, tickets, and rewards cards. It appears that the UK government is working with Apple’s Wallet APIs to allow users to store their driver’s license alongside their other cards already in the app.\nIn a separate tweet, DVLA CEO Oliver Morley shared additional information noting that the app is currently only a prototype and that there is no timeline regarding availability. He also noted that the feature is not a replacement for a photo card but “an add-on” and that security is a main priority.\nDevelopment of the feature has been made possible by recent changes to laws for UK driving licenses that abolished the paper counterpart to the photo card last year.\nSo here's a little prototype of something we're working on #drivinglicence pic.twitter.com/a5eItrdiNI — Oliver Morley (@omorley1) May 13, 2016\nThe UK agency isn’t the first we’ve heard to be working on digital iPhone driver’s licenses. A little over a year ago reports noted that Iowa was looking into making driver’s licenses available through an iPhone app and it has since started a pilot program. At the time the company helping Iowa build its app, MorphoTrust USA, said it was in talks with 20 other states. The implementation by the DVLA would be, however, the first we’ve seen using Apple’s Wallet app.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.11435972469357344
    },
    "article_14": {
        "title": "Tim Cook rules out Apple becoming a mobile carrier, saying it lacks the expertise",
        "body": "As part of an interview at Startup Fest Europe in Amsterdam today, Tim Cook has ruled out the possibility of Apple becoming a mobile carrier or MVNO (Mobile Virtual Network Operator).\nApple was reported to have been trialling an MVNO service – where the company would piggy-back onto existing networks but have its own branding & tariffs – back in August of last year. The company quickly issued a denial that it had any plans to do so, but Cook has today gone further in his answer to a question by retired European Commissioner for Digital Agenda Neelie Kroes.\nOur expertise doesn’t extend to the network. We’ve worked with AT&T in the US, O2 in the UK, as well as T-Mobile and Orange, and we expanded as we learned more. But generally, the things Apple likes to do, are things we can do globally. We don’t have the network skill. We’ll do some things along the way with e-SIMs along the way, but in general, I like the things carriers do.\nSo it’s likely that the embedded SIM seen in the latest iPad Pros will extend to other iDevices, but you won’t be able to buy a service plan directly from Apple.\nhttps://www.youtube.com/watch?v=L0p85qqfGKU\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.0495318160034143
    },
    "article_15": {
        "title": "Instagram finally has a new app icon",
        "body": "Instagram looks different today. The first thing you’ll notice is the new icon, a simple illustration set against a gradient of sunset hues replacing the cutesy retro camera. Now open the app. The interface is flatter and less colorful. Stark white and grey replace chrome and blue. The notification color is now watermelon pink, not orange, with simplified toolbar icons so light they resemble shadows.\nWhy the thorough makeover? Because it was time. On a purely aesthetic level, Instagram’s icon and interface weren’t bad, but they weren’t good, either. And functionally, the interface needed a change. Since its founding in 2010, Instagram has become one of the world's leading visual platforms. More than 400 million people post photos each month; all those people post 80 million photos each *day, *and those photos generate some 3.5 billion daily likes.\nThose numbers boggle the imagination, and underscore how essential content is to Instagram's continued growth. The redesign suggest the company felt its interface was getting in the way of that content. Instagram figures that a flatter, whiter, and less cluttered interface will only serve to enhance your (and advertiser’s) photos and videos.\nIn a blog post, design director Ian Spalter says the company started toying with the idea of a redesign some time ago. By contemporary standards, the old icon felt dated and uninspired. Instagram waited far longer than most tech companies before embracing \"flat\" design, the graphic style that values minimalism over dimensionality. The retro icon, which Instagram hadn't changed in any meaningful way in more than four years, resembled the front of an actual camera. Its lens and viewfinder conveyed a sense of physicality. By contrast, the new icon, anchored by a very on-trend gradient, seems ripped from the sunset photos so often found on the platform. The camera glyph, too, nods toward modernity with its stripped down form showing only the outline of a camera.\nCompared to the impending algorithmic photo feed, these changes feel relatively insignificant. They’re the sort of superficial tweaks that cause a stir until people settle into them and forget what the old interface and icon even looked like. Nothing about your experience will change, aside from clicking on a prettier icon. And if you ask us, that's a good thing.",
        "sentiment": -0.3216879230279189
    },
    "article_16": {
        "title": "Opera launches 'free and unlimited' VPN app for iOS",
        "body": "Opera is on a bit of a privacy tear at the moment. Last month, the company integrated a free and unlimited VPN (virtual private network) into the developer version of its web browser, and last week, it added built-in ad blocking to its desktop and mobile software. Now, Opera has launched a new VPN app for iOS, and, again, it's free to use with unlimited data.\nLike Opera's previous VPN integrations, the app uses the US-based SurfEasy VPN service acquired by Opera last March. SurfEasy offers its own standalone apps for Android and iOS, as well as desktop software, but charges a subscription fee after a trial period. Other third-party VPN apps have a similar set-up, or insert ads to pay for their server time. Opera, by comparison, is promising that its mobile VPN is free for life, with no subscription needed. The company said it had no plans to serve users ads \"for now.\"\nOpera is marketing the app as \"especially relevant on campuses and workplaces,\" where Wi-Fi provided by one institution or another may have limited access to \"social ­media and video ­streaming websites.\" You can use the app to route your internet connection through another country to access geo-blocked content (the virtual regions on offer are Canada, Germany, Singapore, and the US), and the software also blocks ads and trackers.\nVerge Video: How torrenting works",
        "sentiment": -0.7138624720275402
    },
    "article_17": {
        "title": "Purported iPhone 7 component leak disagrees with previous rumors, suggests 3.5 mm headphone jack will stay",
        "body": "The iPhone 7 had been rumored to be dropping the analog 3.5 mm headphone jack, in favour of wireless Bluetooth or Lightning cable headphones for audio output. However, a new iPhone 7 component leak posted on Weibo disagrees with previous reports, depicting a board that includes a 3.5mm jack (in the top right of the photo above).\nThe 3.5mm jack is large (relative to the thinness of the phone), dates back more than a hundred years and has been superseded in terms of signal quality by the modern digital solutions, so it is plausible that Apple would want to abandon it. However, the idea of removing the port has been controversial (with complaints about existing accessory compatibility). This Chinese leak indicates it is sticking around …\nThe pictured board is sized for a 4.7 inch sized iPhone (and an equivalent version for the 5.5 inch phone has not surfaced) so there’s a possibility the 3.5mm jack will stay on the smaller sized phone but be dropped on the Plus models. This strategy does not sound very ‘Appley’ — it makes more sense for it to deprecate technologies consistently across the lineup.\nIt seems to be an iPhone part of sorts, with similar layout to the equivalent part in the iPhone 6s. As this Weibo poster does not have a track record of accuracy, there is another alternative explanation. There is a decent likelihood that the pictured part is for an iPhone clone, not designated for an official Apple product. iPhone clones are big business in China and errant parts often get misinterpreted as components for as-yet-unreleased Apple hardware.\nCurrent expectations foretell the iPhone 7 being a small update over the current iPhone 6s, with a 1mm thinner body and a redesigned back with streamlined antenna lines. The iPhone 7 Pro is expected to feature a dual-camera on the rear for better quality photos and videos. The device is also expected to be waterproof and dustproof. A more fully-fledged external design revamp is currently pegged for 2017, with reports claiming the ‘iPhone 8’ will feature an all-glass chassis.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.25697400426724926
    },
    "article_18": {
        "title": "Touch ID, OLED touch bar to highlight thinner MacBook Pro models in Q4",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple is expected to drastically revamp its flagship laptop line in the second half of 2016, according to one informed insider, with the slimmed down 13- and 15-inch models said to sport Touch ID, an OLED display touch bar, USB-C and Thunderbolt 3, among other improvements.\nIn a note to investors obtained by AppleInsider on Monday, analyst Ming-Chi Kuo predicts Apple to release a new form factor MacBook Pro design sometime in the fourth quarter of 2016. Thinner and lighter than current hardware, the long-awaited redesign will also feature exotic technologies carried over from Apple's mobile device lineup.\nSpecifically, Kuo believes Apple plans to introduce a Touch ID fingerprint reader into the new MacBook Pro chassis, which if true will be the first non-iOS implementation of the biometric security system. In addition, an \"OLED display touch bar\" is earmarked for integration and will replace physical function keys located above the laptop's QWERTY keyboard.\nPrevious Apple patents have outlined illuminated touch controls embedded within a MacBook's chassis, while others protect rights to switchless keyboards and illuminated trackpads. The company also owns IP relating to in-key displays ala Art Lebedev's Optimus keyboard line, though the inventions yet to ship in a consumer product.\nRiffing on the \"thinner and lighter is better\" trend, Apple will attempt to squeeze MacBook Pro's powerful innards into an even slimmer chassis, Kuo said. To help keep thickness at a minimum, Apple plans to employ low-rise butterfly mechanism switches and battery tech introduced with the 12-inch MacBook Pro with Retina display. The move should prove to further blur the lines between the company's MacBook pedigrees, which include the 12-inch Retina MacBook, aging MacBook Air models and the beefy (by comparison) MacBook Pro.\nLike last year's 12-inch MacBook, the new Pro models are expected to adopt speedy USB-C connectivity alongside the usual Thunderbolt ports, which should get a bump up to Thunderbolt 3. Whether Apple intends to ditch its proprietary MagSafe charger, as it did with the Retina MacBook thin-and-light, remains to be seen.",
        "sentiment": 0.28867071093275
    },
    "article_19": {
        "title": "Report: Apple suppliers ramp hiring earlier than usual, assembling ‘more complex’ iPhone 7 design",
        "body": "Economic Daily News is reporting that Apple suppliers have begun hiring en-masse this month as they prepare for assembly of Apple’s upcoming flagship iPhone, the iPhone 7. The new iPhones (coming in 4.7 inch and 5.5 inch sizes) are expected to debut in the fall, following tradition. The report comes via CNBC.\nInterestingly, the report notes that the surge in hiring at Foxconn and Pegatron is happening earlier than usual (‘at least a month earlier’). Apparently, the new Apple iPhone includes a ‘more complex design’ than previous models meaning suppliers need more time to train staff about the assembly process. This somewhat contradicts previous leaks in the rumor mill which indicated the iPhone 7 would look very similar to the iPhone 6s and iPhone 6s Plus …\nThe general consensus of leaks about iPhone 7 have suggested it will feature a design very similar to the current iPhone lineup, with tweaked antenna lines. Although Apple has made major external chassis changes to the iPhone hardware every two years in the past, expectations of such a radical redesign in 2016 had been lowered given the leaks. Reports from KGI indicated a major iPhone revamp was not due until 2017 (iPhone 8?), featuring an all-glass chassis with AMOLED screen.\nPerhaps those rumors were wrong and a more substantial overhaul is indeed coming later this year. Another possibility is that Economic Daily News is inaccurate (it wouldn’t be the first time). Foxconn and Pegatron are hiring earlier than normal as evidenced by messages on their factory websites … but it’s very possible there is another reason for the sooner start. Apple may have asked suppliers to prepare more phones in advance of the launch, to prevent supply chain stock issues common with previous launches.\nA ‘more complex design’ does not have to necessarily refer to the external appearance either. Apple could be employing new components and new processes inside the device that require the additional training. For example, the iPhone 7 has been rumored to be the first iPhone to be fully dustproof and waterproof. The additional checks and finer tolerances required for this to happen could explain why suppliers need to give staff more training than usual.\nIn terms of new features, the iPhone 7 will likely include new internal components such as Apple’s next-generation A10 SoC processor and graphics for better performance. KGI has suggested the phones will include 3 GB RAM for the first time. Digitimes is reporting Intel will provide next-generation LTE chips for the handset.\nA dual-camera system for the back of the iPhone 7 has also been widely rumored but is slated to be exclusive to the 5.5 inch iPhone 7 Plus only. The iPhone 7 is also expected to drop the headphone jack completely, instead relying on Bluetooth or Lightning accessories for audio output.\nIf the iPhone 7 is going into production soon, expect more leaks to follow in the next couple of months as Apple finalizes component and chassis choices. The new iPhone 7 and iPhone 7 Plus are expected to publicly debut in the fall, around September. iOS 10 may also give some clues as to what expect from the new hardware; Apple will release the first betas of iOS 10 at WWDC in June.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2743720405355648
    },
    "article_20": {
        "title": "No, Apple Music is not deleting tracks off your hard drive — unless you tell it to",
        "body": "On Wednesday, I saw a post widely shared about an unfortunate individual who lost half of their local library and was blaming Apple Music for automatically deleting their local files.\nI sympathize, and I'm very glad this person had a backup of their music, but I want to dispel some FUD here: Apple Music has definite problems and its matching algorithms aren't great, but this is simply not how the service works. Apple Music should never automatically delete files off your primary Mac's hard drive unless you specifically delete them first.\nUpdate: A bug with iTunes on the Mac may be to blame for an extremely small number of users losing files. Apple is investigating.\nHow Apple Music on your primary Mac works\nWhen you enable Apple Music on your original Mac, the service scans your music library and matches any tracks you own to its streaming library. This is so, when you're on a secondary device — like an iPhone, iPad, or other Mac — you can stream those tracks at their highest quality without having to download local files. These referenced files become part of your iCloud Music Library.\nIf you have tracks that aren't in Apple Music's library — say, personal recordings, for instance — they will be uploaded as-is to your iCloud Music Library, though songs encoded in ALAC, WAV, or AIFF will be uploaded as AAC 256kbps files for easier storage (opens in new tab).\nOnce this matching and uploading process is complete, you have two libraries: your locally-stored library on your original Mac with all your old files, and an iCloud-stored library that you can access from other devices.\nWhere it gets confusing\nOn your original Mac, Apple Music will never delete songs without your knowledge. Your original library is scanned into iCloud, but your songs are yours, and Apple will not automatically delete them, or replace them with its own proprietary copies.\nOn an iPhone, iPad, or secondary Mac, this process is different: Any songs you play on those devices are sourced directly from your iCloud Music Library, and even if you download them locally, they can be removed from your device if your iPhone's storage space dips too low.\nYou can, however, download iCloud Music Library-sourced tracks on your Mac if you delete your original copies — and this is what I suspect may have happened to Vellum Atlanta author James Pinkstone's original library, possibly unknowingly.\nWhen you press delete on a song in your iTunes Library with Apple Music or iTunes Match enabled, you'll see the following dialog:\n@settern My theory is that this dialog box is causing a fundamental misunderstanding of what happens next. pic.twitter.com/ROYbw1WQzf@settern My theory is that this dialog box is causing a fundamental misunderstanding of what happens next. pic.twitter.com/ROYbw1WQzf— Jason Snell (@jsnell) May 5, 2016May 5, 2016 See more\nIf you choose \"Remove Download,\" it will send the local file from your hard drive to your Trash, but leave the reference in your library — so that you can stream that track directly from iCloud Music Library. It won't delete the file until you empty your Trash.\nThis is great if you're on a laptop and want streaming access to your music library, but you don't want the hassle of having 40GB of music on your hard drive. But it should only ever be done on a secondary computer or secondary iTunes Library — never for your master library.\nThis is because iCloud Music Library's matching is far from perfect: It's been known to match live albums to studio ones, original songs to cover tracks, and more. If you delete your original files to save some space, you're putting those tracks at the mercy of iCloud.\nWorse, iCloud Music Library only sticks around while you have an active Apple Music subscription: If you delete songs and replace them with iCloud versions — even if you re-download those versions to your hard drive — they'll disappear or become inoperable 30 days after you cancel your subscription.\nAs such, I've advised from the beginning to always keep a master copy of your original library when using streaming services that match your library, and back up that library before signing up for anything cloud-related.\nIs this Apple's fault?\nSort of. iCloud Music Library is confusing as all hell, and it's been so since the first days of iTunes Match. That's absolutely Apple's fault.\nIn an ideal world, iCloud Music Library would work like Dropbox, or even iCloud Photo Library — whatever you upload is yours, it doesn't get \"matched\" to anything, and as long as you re-download everything before you cancel your subscription, you're fine. But DRM and downloading streaming tracks you don't have ownership rights to mucks things up. iCloud Music Library is always going to be complicated, and people are going to make mistakes because of it. And if they don't have backups, those mistakes might be costly.\nThere's also a possibility that some nasty bug wiped out Pinkstone's original library unintentionally. We haven't been able to reproduce this problem, however; Apple is currently talking with Pinkstone and investigating other reports from a small number of individuals.\nWhatever the case, Apple Music was never designed to delete Pinkstone's source library, and it won't delete yours. That's simply not how the service works on your primary Mac. But if you're not aware of how iCloud Music Library stores copies of tracks, you may delete your local copies to save space, thinking you can get them back — and get screwed as a result.\nFor more information on iCloud Music Library and the Mac:",
        "sentiment": -0.49673546093683213
    },
    "article_21": {
        "title": "Apple Confirms Music Deletion Glitch, Says Fix Incoming in Future iTunes Update",
        "body": "Apple today confirmed reports of an issue that causes music from personal collections to be deleted, telling The Loop it only affects a small number of users and that a fix is incoming in an iTunes update next week.\n“In an extremely small number of cases users have reported that music files saved on their computer were removed without their permission,” Apple said. “We’re taking these reports seriously as we know how important music is to our customers and our teams are focused on identifying the cause. We have not been able to reproduce this issue, however, we’re releasing an update to iTunes early next week which includes additional safeguards. If a user experiences this issue they should contact AppleCare.”\nLast week, debate raged over the supposed glitch after Vellum's Jake Pinkstone wrote a blogpost complaining that Apple Music had deleted 122 GB of his personal music collection without his permission after he joined the service. The deletion occurred after Pinkstone had his music library scanned by Apple to make his collection available across his devices.\nConfusion ensued after Pinkstone was told by an Apple Support Representative named Amber that Apple Music's matching system was \"functioning as intended.\" When asked whether Apple Music was supposed to delete his personal music without his permission, Amber responded \"yes.\" Amber's statement, however, was inaccurate according to Apple's own support document.\nWhile the causation of the bug is still unknown, as Apple has failed to reproduce the issue, the company's statement suggests Apple has narrowed down the issue to iTunes rather than the Apple Music service. It's unclear whether the fix will arrive with a minor or major iTunes update. However, one possibility is iTunes 12.4, which will include a minor redesign and arrive in the next couple of weeks, according to a MacRumors source.",
        "sentiment": -0.38158621640804297
    },
    "article_22": {
        "title": "Mac Users Reporting Widespread System Freezes With OS X El Capitan 10.11.4 Update",
        "body": "A large number of MacBook Pro owners running OS X El Capitan are reporting widespread system freezes since installing the 10.11.4 update to Apple's Mac OS.\nHundreds of MacRumors forum members have been posting to a dedicated thread to discuss the issue, which spans 20 pages at the time of writing. The problem appears to be concentrated on 13-inch Retina MacBook Pros (Early 2015) running 10.11.4. Users report that their system becomes totally unresponsive at seemingly random times, with no way to regain access to their Mac other than to force a hard reboot.\nThe issue was initially reported by MacRumors forum member Antonnn on March 25, four days after Apple released what is the third update to the Mac OS. In Antonnn's case, the freezes have been occurring \"about once a week\", first when browsing in Safari, but then also during the use of other Mac apps, including Adobe Photoshop and several third-party browsers. The freeze seems to affect not only the screen and mouse cursor but also the Mac's Force Touch trackpad, which completely loses feedback.\nMany other users have since reported similar freezes after updating to 10.11.4, with some 15-inch MacBook Pro (Mid 2015) owners also experiencing issues. One potential cause has been identified from crash logs as a system framework or an Intel Graphics driver bug. The issue is also being reported after installing Safari Technology Preview Version 1 and OS X 10.11.5 Public Beta 1.\nVideo by MacRumors forum member appleofmy\"i\" experiencing the freeze issue.\nApple Support is apparently aware of the issue but have so far offered no concrete solution. Meanwhile, some users have resorted to downgrading their system to 10.11.3 by restoring from a Time Machine backup or performing a clean install.\nWe'll update this post throughout the day as we learn more.",
        "sentiment": -0.1636882915294596
    },
    "article_23": {
        "title": "iTunes 12.4 Update to Feature Minor Redesign With New Sidebar, Improved Navigation",
        "body": "Back in February, iTunes chief Eddy Cue promised a new version of iTunes would be coming out with OS X 10.11.4, featuring a simpler design that makes Apple Music easier to use. That update wasn’t included in OS X 10.11.4 and has been delayed, but a source has shared some screenshots of the upcoming iTunes 12.4 update with MacRumors, giving us a look at the changes Apple plans to introduce in the near future.\nA redesigned dropdown media picker will be used to switch between Music, TV Shows, Movies, and other content, replacing the existing navigation icons. Like the current menu, the new menu is customizable, so sections of iTunes that are not used can be hidden from view. Forward and back buttons can be used to navigate between different sections.\nA persistent sidebar located on the left side of the app is being added, which will make it easier to access different portions of an iTunes Library like specific songs or albums. The sidebar, like the menu bar, can be edited to show desired content, and songs can be dragged and dropped to playlists.\nMenus in iTunes 12.4 are being simplified to make them easier to use, and the available content in Library can be customized using the redesigned View menu. Menus will be \"easier to use\" updated with new navigation options.\nThe mini player will also get some slight design changes, with the Up Next song feature being relocated to the right side of the player where it is more clearly visible.\nIt is not clear when Apple will debut iTunes 12.4, but our source says it should be released within in the next few weeks, putting a launch date in late May or early June.\nRumors have suggested Apple is also planning to introduce significant changes to Apple Music in the iOS Music app in iOS 10, and additional tweaks could be made to iTunes in OS X 10.12 to mirror changes being introduced in iOS 10.",
        "sentiment": -0.23894313847025236
    },
    "article_24": {
        "title": "AirPort Extreme and Time Capsule Out of Stock at U.S. Apple Stores",
        "body": "Following a rare firmware update for the AirPort Express, AirPort Extreme, and AirPort Time Capsule earlier this week, a few readers have contacted us about the Wi-Fi base stations being out of stock at their local Apple retail stores in the United States.\nSpecifically, the tipsters informed us that the AirPort Extreme was out of stock at the Apple Store, Sagemore location in Marlton, New Jersey, an outer suburb of Philadelphia, and the Apple Store, Beverly Center location in Los Angeles, California.\n\"I was trying to buy an AirPort Extreme today from the Beverly Hills Apple Store and an employee told me that Apple had asked for all of them back from all the stores,\" wrote one anonymous tipster.\nTo verify the tipster's claim, we contacted an Apple support representative who confirmed that Apple has pulled AirPort Extreme and AirPort Time Capsule stock from all U.S. stores. The base stations remain available to order online, while it appears the smaller AirPort Express can still be purchased both online and in stores at present time.\nApple's web-based Personal Pickup tool has also been removed from the AirPort Extreme and Time Capsule product pages on its U.S. storefront.\nEven though Apple has pulled all AirPort Extreme and Time Capsule stock from U.S. stores, it is possible that select locations may still some units available. The base stations also remain on sale through authorized resellers such as Best Buy.\nA retail source informed us that the AirPort Extreme and AirPort Time Capsule remain in stock at stores in the U.K., as confirmed by Personal Pickup, and the Wi-Fi base stations are also currently available at most stores in Australia, Canada, and Europe, so the in-store outage appears to be limited to U.S. stores for now.\nWith WWDC 2016 around the corner, scarce availability of the AirPort Extreme and Time Capsule in the U.S. will naturally stir speculation about a possible refresh to its Wi-Fi base station lineup. However, the stock outage could be related to the recent firmware update, Apple Store renovations, or regular fluctuations within Apple's inventory channels. There are also no rumors about an impending AirPort refresh.\nApple last updated the AirPort Extreme and AirPort Time Capsule at WWDC 2013 with faster 802.11ac Wi-Fi, new designs, and other internal changes. The slimmer AirPort Express was last updated in June 2012, drawing on the design of the Apple TV and gaining simultaneous dual-band 802.11n connectivity.\nGiven the lack of rumors, it is unknown what features a next-generation AirPort Extreme could have, but 802.11ac wave 2 Wi-Fi is a possibility. Some readers also speculate that Apple could integrate Siri features into the AirPort Extreme amid rumors it is working on an Amazon Echo competitor -- which could also be a new Apple TV.\nApple's AirPort base stations are designed to create or expand Wi-Fi networks, providing dual-band connectivity in addition to other features like music playback, wireless printing, and wireless backups. Read our AirPort roundup to learn more.\nUpdate: Apple may be complying with an FCC deadline of June 2, 2016 related to router software security rules gradually phased in since 2014, which would explain why the stock outage is limited to U.S. stores.\n\"Starting June 2, 2016, permissive changes will not be permitted for devices approved under the old rules, unless they meet the requirements of the new rules,\" the FCC writes. \"All devices partially or completely approved under the old rules cannot be marketed starting June 2, 2016 unless they meet the requirements of the new rules in all the bands of operation.\"\nUpdate 6/2: Apple's AirPort base stations are once again available for Personal Pickup and are in stock at most retail locations in the United States, suggesting the stock shortage was a temporary blip that has now been resolved.\n(Thanks, Cole, Justin, and Corrode!)",
        "sentiment": -0.1433788678082435
    }
}