{
    "article_0": {
        "title": "Apple sticking with climate change fight despite Trump administration regulation loosening",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple, Google, and Microsoft have banded together with a number of major corporations in the United States keeping to their pledges to combat climate change, despite actions by President Donald Trump to try and free companies from constraints in environmental policies put in place by the Obama administration.\nOn Tuesday, Trump signed an executive order telling the Environmental Protection Agency to reconsider climate rules instigated by President Barack Obama, as well as to rescind other Obama orders that forced the government to consider climate change in its decision-making processes.\nThe core of the attack was against the Clean Power Plan, a rule that aimed to reduce carbon pollution from power plants, cutting emissions by 32 percent by 2030 relative to 2005 levels. While the plan set targets for individual states to meet, each state had to come up with its own plan of attack, or have plans created for them by the EPA.\nAccording to Bloomberg, many companies that have pledged to fight climate change will continue to do so. Apple joined other tech companies, including Amazon, Google, and Microsoft in expressing support for the attacked climate rules, in a joint statement shortly after Trump signed the order.\n\"We believe that strong clean energy and climate policies, like the Clean Power Plan, can make renewable energy supplies more robust and address the serious threat of climate change while also supporting American competitiveness, innovation, and job growth,\" the statement reads.\nThis is not the first time the four tech companies have spoken out in favor of the policies. During a legal battle in April 2016, Apple pledged their support for the Clean Power Plan alongside Google, Microsoft, and Amazon in an amicus brief filing, during a lawsuit brought forward by 27 states against the Obama administration's plan.\nOther companies have spoken out against Trump's action, with confectionery company Mars' vice president of corporate affairs, Andy Pharoah, advising the firm was continuing its commitment to eliminate its emissions entirely by 2040, and that it is disappointed the administration has decided to roll back climate regulations. Companies that signed a 2015 pledge to the Obama administration to reduce their carbon footprint, including Wal-Mart, Nestle, Ikea, and Best Buy, are also said to stand by their commitments.\nApple has been at the forefront of the push to a more environment-conscious economy for quite some time, and has a number of policies in place to help further the agenda. In 2013, Apple hired Lisa P. Jackson, the former administrator of the EPA, to oversee the company's green initiatives.",
        "sentiment": -0.18310718331485987
    },
    "article_1": {
        "title": "UK government says Apple ‘cannot get away with’ unbreakable encryption following terrorist attack",
        "body": "British Home Secretary Amber Rudd – in charge of police policy in the UK – has told the BBC that Apple ‘cannot get away with’ apps that offer unbreakable encryption following last week’s terrorist attack in London.\nRudd was speaking after it was revealed that Khalid Masood accessed WhatsApp two minutes before ploughing through pedestrians on Westminster Bridge in a rented car, killing three of them, before fatally stabbing a police officer guarding the Houses of Parliament.\nShe described end-to-end encrypted messaging as used by WhatsApp and Apple’s Messages app as ‘completely unacceptable’ …\nIt is completely unacceptable, there should be no place for terrorists to hide. We need to make sure that organisations like WhatsApp, and there are plenty of others like that, don’t provide a secret place for terrorists to communicate with each other […] In this situation we need to make sure that our intelligence services have the ability to get into situations like encrypted WhatsApp.\nRudd continued with a confused statement in which she referenced Apple directly.\nIf I was talking to Tim Cook, I would say to him that this is something completely different. We’re not saying ‘open up,’ we don’t want to ‘go into the cloud,’ we don’t want to do all sorts of things like that. But we do want them to recognize that they have a responsibility to engage with governments, and engage with law enforcement agencies when there is a terrorist situation. We would do it all through the carefully thought-through, legally covered arrangements. But they cannot get away with saying we are a different situation. They are not.\nSo, er, that’s clear.\nMember of Parliament Nadine Dorries added her voice to the controversy.\nTo help keep our streets safe, we need to rise up against companies like #Apple and #Whattsapp who provide space and comfort to terrorists — Nadine Dorries (@NadineDorriesMP) March 27, 2017\nWhile tweeting from her iPhone.\n‘Something must be done’ syndrome means that it’s commonplace for elected officials to demand backdoors to secure devices and messaging systems in the wake of terrorism, completely oblivious to the fact that you cannot have a loophole available to the good guys that won’t be discovered by the bad guys. As I wrote back in 2015 following the Paris attacks, Apple is right to stand firm on encryption no matter how much such attacks ramp up the pressure.\nPhoto: Terrance Gaines\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2826142457003395
    },
    "article_2": {
        "title": "Apple Expected to Announce New Products as Soon as Next Week, Supply Chain Sources Say",
        "body": "Apple is expected to announce new products later this month, most likely between Monday, March 20 and Friday, March 24, according to reputable supply chain analysts we spoke to who wish to remain anonymous. The analysts said the information is from its own sources and not based on other reports.\nThe research firm did not disclose which products it expects Apple to announce, but rumors have widely suggested at least a trio of new iPad Pro models will be unveiled as early as this month, including an all-new 10.5-inch model with slimmer bezels and updated 9.7-inch and 12.9-inch versions.\nThe sources expecting an iPad refresh include, among others, KGI Securities analyst Ming-Chi Kuo, Barclays analyst Blayne Curtis, and Japanese blog Mac Otakara. The last of the three expects a new 7.9-inch model that would supplant the iPad mini 4, but other reports deny or fail to mention that particular claim.\nLast month, Mac Otakara said Apple will host a March event where it will debut its new iPad Pro lineup, a larger iPhone SE model with 128GB storage, and new Apple Watch bands. The report also claimed Apple will add a red color option for iPhone 7 and iPhone 7 Plus, which could be part of (PRODUCT)RED.\nApple has yet to invite the media to an event this month, however, and those invites would be on shorter notice than usual if it is indeed planning to announce new products this way as early as next week.\nIn each of the past two years, Apple invited the media to its March event roughly 11-12 days beforehand, including February 26 invites for a March 9 event in 2015 and March 10 invites for a March 21 event last year.\nThere are three plausible scenarios if new products are in the cards: Apple is planning a March event, and invites will go out soon; Apple is planning a Spring event, but not this month; or Apple will share its announcements through a press release as it did when it dropped the price of the fourth-generation iPad to $399 in March 2014.\nA few reports have suggested the 10.5-inch iPad Pro could face shipping delays, so perhaps Apple will delay announcing it entirely.\nApple has hosted March events four times in the past six years. In 2011 and 2012, it introduced new iPad models at the Yerba Buena Center for the Arts. In 2015, it revealed Apple Watch pricing and release date information. Last year, Apple debuted the 9.7-inch iPad Pro and iPhone SE at its Town Hall.\nOne rumor suggested Apple could be planning an event on April 4, but this date was based on Personal Pickup for the 12.9-inch iPad Pro, which is generally not a reliable indicator of an event. The in-store pickup date for 12.9-inch iPad Pro models is a rolling target, as evidenced by the April 10 date now shown.\nThe all-new 10.5-inch iPad Pro is expected to have slimmer bezels, and possibly no Home button, allowing it to have the same overall footprint as the 9.7-inch iPad Pro. This design could foreshadow the rumored 5.8-inch iPhone. The tablet is also rumored to have a higher-resolution display and quad microphones.\nThe updated 12.9-inch iPad Pro is said to feature a 12-megapixel rear camera and True Tone display like the current 9.7-inch model, using advanced four-channel ambient light sensors to automatically adapt the color and intensity of the display to match the light in the surrounding environment.",
        "sentiment": -0.058155442942820844
    },
    "article_3": {
        "title": "Apple has acquired Workflow a powerful automation tool for iPad and iPhone",
        "body": "Apple has finalized a deal to acquire Workflow today — a tool that lets you hook together apps and functions within apps in strings of commands to automate tasks. We’ve been tracking this one for a while but were able to confirm just now that the ink on the deal is drying as we speak.\nI haven’t been able to get financial details for the deal, but if I come up with them I’ll update. As far as I know it was a solid payday for the team and small upside for investors. Workflow had raised an unannounced seed round of what we’re hearing was in the range of a couple million from Lowercase, Eniac and General Catalyst.\nThe app was made by a small team that includes Ari Weinstein, a former iPhone jailbreaker. I’ve been following his efforts since the iPod Linux days and covered his very useful DeskConnect app a few years back.\nWorkflow has been around for a couple of years and we’ve covered it and its updates. It shares some similarity with the service IFTTT, in that it allows people to group together a bunch of actions that can allow them to perform complicated tasks with one tap. It had built up a sizeable number of users and downloads over the past few years.\nWorkflow the app is being acquired, along with the team of Weinstein, Conrad Kramer, Ayaka Nonaka and Nick Frey. In a somewhat uncommon move for Apple, the app will continue to be made available on the App Store and will be made free later today.\n“We are thrilled to be joining Apple,” said Weinstein in a statement. “We’ve worked closely with Apple from the very beginning, from kickstarting our company as students attending WWDC to developing and launching Workflow and seeing its amazing success on the App Store. We can’t wait to take our work to the next level at Apple and contribute to products that touch people across the world.”\nThis is not a “pure acqui-hire” in that Workflow — not just the talent — is being purchased in this deal. This makes sense, and I’m glad to see it because Workflow itself was a prime meat example of how to find a need in the iOS ecosystem, tackle it in an interesting way and execute it with cleverness and attention to honoring the platform. Simply put, it’s super smart, really well designed and works very well.\nWorkflow won an Apple Design Award in 2015; Apple Accessibility engineer Dean Hudson waxed ecstatic about the way that it handled accessibility. “When I first saw the app, I was just like man, this accessibility is cray-cray. This is off the charts!”\nApple confirmed the deal, and has said the following about Workflow:\n“The Workflow app was selected for an Apple Design Award in 2015 because of its outstanding use of iOS accessibility features, in particular an outstanding implementation for VoiceOver with clearly labeled items, thoughtful hints, and drag/drop announcements, making the app usable and quickly accessible to those who are blind or low-vision.”\nThe accessibility features of Workflow are super impressive, especially for an app that is a tool for building complicated macros. It would have been much easier to say hey, this is for heavy users, maybe we don’t need to make sure it’s 100 percent accessible — but they didn’t, and they won a bunch of awards (and an exit) for their trouble.\nWorkflow’s existing integrations with apps are extensive and will continue to be updated. You can see some of the pretty intense capabilities of the app in this post from Federico Viticci, a workflow maniac.\nFor you super nerds, this news could be a nice treat given the recent-ish departure of legend Sal Saghoian, Apple’s automation Czar, and the elimination of his position. Some folks had taken this as a signal that Apple was no longer interested in the automation category.\nThe special sauce of Workflow is that it enables users to dip into specific “deep linked” functions of individual apps and connect those actions together into a string of seamless, invisible commands. If that sounds familiar, you might be thinking of the budding Siri API — which will only be getting more beefy as time goes on.\nIf you spool out the thread here it’s not hard to see Workflow being integrated heavily with Siri, allowing even more seamless activation and composition of actions now that the team has access to Apple’s private APIs, which are more robust than the tiny bit of Siri that’s public so far.\nThere are also great opportunities here to offer value-add “power user” capabilities to the iPad ecosystem. Apple’s efforts to get people to see the iPhone, iPad and even Apple Watch ecosystem as something that can be used for many light-to-medium tasks could be bolstered here.\nThe Workflow app for Apple Watch is especially clever and a nice organic fit — I’ve long been a proponent of the “1.5 seconds or bust” interaction model with Apple Watch. Workflow’s “endpoint” is a single tap or automated action that can “hide” a complex system of commands or interactions underneath it — ideal for Apple Watch.\nWorkflow’s acquisition is a fairly crisp example of the kinds of app successes that have become a bit more muddied in this age of services. A small, clever team (that were one-time WWDC student scholarship recipients) built a tool so useful on iOS that Apple itself essentially copped that they couldn’t do it better and bought it. It will be interesting to see where it goes from here.",
        "sentiment": 0.37430000187535034
    },
    "article_4": {
        "title": "Over 187,000 apps could become obsolete with Apple's 64-bit only 'iOS 11'",
        "body": "Over 187,000 apps could become obsolete with Apple's 64-bit only 'iOS 11'\nArticle Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nSome 187,000 apps could be rendered useless with the launch of \"iOS 11,\" according to an app analytics firm, assuming the anticipated update is when Apple plans to kill 32-bit support.\nThe number represents about 8 percent of all titles on the App Store, Sensor Tower said. The real-world figure could potentially be much higher though, as the firm's numbers are based on apps that were submitted prior to the Sept. 2013 launch of the iPhone 5s and haven't been updated since.\nThe iPhone 5s was the first iOS device to include a 64-bit processor, but it was only in Feb. 2015 that Apple required new apps to offer 64-bit support. For updates to existing apps, the cutoff was a few months later in June.\nWith the first iOS 10.3 beta, Apple inserted a message warning that 32-bit apps \"will not work with future versions of iOS.\" Previously iOS only cautioned that 32-bit apps might slow down a device.\n\"iOS 11\" would be a logical cutoff point. The finished 10.3 update has yet to be released, and Apple is expected to reveal iOS 11 during its Worldwide Developers Conference in June.\nMany apps could be potentially be removed from the App Store by the time \"iOS 11\" launches later in the year. Recently the company engaged in a purge of broken or outdated apps, and indeed Sensor Tower noted that 47,300 apps vanished in October alone.",
        "sentiment": -0.33380396564358045
    },
    "article_5": {
        "title": "Tim Cook spotted dining with Google CEO",
        "body": "Apple CEO Tim Cook appears to be open to a friendlier relationship with Google than Steve Jobs ever was. Cook got spotted dining with Google CEO Sundar Pichai at one of the top Vietnamese restaurants in Silicon Valley this week. What the two powerful tech leaders were discussing is still a mystery, though.\nHere’s another angle:\nA post shared by Steve Sims (@steveuglysims) on Mar 8, 2017 at 12:53am PST\nPichai and Cook were dining at Tamarine Restaurant in Palo Alto, which is neutral territory for the world’s two biggest tech companies. It looks like they’re both having a glass of wine, but based on the body language, neither looks totally relaxed.\nThe meeting between the two tech titans is reminiscent of 2010 when Jobs was spotted getting coffee with Eric Schmidt (Google’s CEO at the time). Tensions between Apple and Google were at an all-time high after the Android operating system ripped off many of the iPhone’s features.\nJobs vowed to go thermonuclear on Google for what he called “grand theft.” The company then launched a series of lawsuits against the world’s top Android smartphone manufacturer, Samsung.\nHopefully, Tim’s dinner with Sundar ends on friendlier terms.",
        "sentiment": 0.0250590194016695
    },
    "article_6": {
        "title": "Apple says most vulnerabilities in WikiLeaks docs are already patched",
        "body": "Wikileaks today published a trove of documents, allegedly taken from the CIA, that detail the government’s efforts to hack popular devices like iPhones, Android phones, and Samsung smart TVs. But Apple is pushing back against claims that the CIA’s hoarded vulnerabilities for its devices were effective.\nThe documents, if they are indeed legitimate, include charts that detail iOS exploits that would allow the CIA to surveil iPhone users and, in some cases, control their devices. Some of the exploits may have been developed in-house, while others appear to have been purchased, copied or downloaded from non-governmental sources.\nHowever, Apple says that many of the iOS exploits in the Wikileaks dump have already been patched and it is working to address any new vulnerabilities.\n“Apple is deeply committed to safeguarding our customers’ privacy and security. The technology built into today’s iPhone represents the best data security available to consumers, and we’re constantly working to keep it that way. Our products and software are designed to quickly get security updates into the hands of our customers, with nearly 80 percent of users running the latest version of our operating system. While our initial analysis indicates that many of the issues leaked today were already patched in the latest iOS, we will continue work to rapidly address any identified vulnerabilities. We always urge customers to download the latest iOS to make sure they have the most recent security updates,” an Apple spokesperson said in a statement to TechCrunch.\nThe Wikileaks documents also contain exploits designed for Android. A Google spokesperson did not respond to a request for comment.\nThis isn’t the first time the CIA has targeted mobile phone manufacturers in an effort to spy on certain customers — the Intercept reported in 2015 that the agency had worked to compromise iPhones and iPads.\nIf you’re concerned about the security of your device, it’s always a good idea to keep your software up-to-date.",
        "sentiment": -0.002435009726988418
    },
    "article_7": {
        "title": "WikiLeaks reveals CIA malware that \"targets iPhone, Android, Smart TVs\"",
        "body": "Press Release\nToday, Tuesday 7 March 2017, WikiLeaks begins its new series of leaks on the U.S. Central Intelligence Agency. Code-named \"Vault 7\" by WikiLeaks, it is the largest ever publication of confidential documents on the agency.\nThe first full part of the series, \"Year Zero\", comprises 8,761 documents and files from an isolated, high-security network situated inside the CIA's Center for Cyber Intelligence in Langley, Virgina. It follows an introductory disclosure last month of CIA targeting French political parties and candidates in the lead up to the 2012 presidential election.\nRecently, the CIA lost control of the majority of its hacking arsenal including malware, viruses, trojans, weaponized \"zero day\" exploits, malware remote control systems and associated documentation. This extraordinary collection, which amounts to more than several hundred million lines of code, gives its possessor the entire hacking capacity of the CIA. The archive appears to have been circulated among former U.S. government hackers and contractors in an unauthorized manner, one of whom has provided WikiLeaks with portions of the archive.\n\"Year Zero\" introduces the scope and direction of the CIA's global covert hacking program, its malware arsenal and dozens of \"zero day\" weaponized exploits against a wide range of U.S. and European company products, include Apple's iPhone, Google's Android and Microsoft's Windows and even Samsung TVs, which are turned into covert microphones.\nSince 2001 the CIA has gained political and budgetary preeminence over the U.S. National Security Agency (NSA). The CIA found itself building not just its now infamous drone fleet, but a very different type of covert, globe-spanning force — its own substantial fleet of hackers. The agency's hacking division freed it from having to disclose its often controversial operations to the NSA (its primary bureaucratic rival) in order to draw on the NSA's hacking capacities.\nBy the end of 2016, the CIA's hacking division, which formally falls under the agency's Center for Cyber Intelligence (CCI), had over 5000 registered users and had produced more than a thousand hacking systems, trojans, viruses, and other \"weaponized\" malware. Such is the scale of the CIA's undertaking that by 2016, its hackers had utilized more code than that used to run Facebook. The CIA had created, in effect, its \"own NSA\" with even less accountability and without publicly answering the question as to whether such a massive budgetary spend on duplicating the capacities of a rival agency could be justified.\nIn a statement to WikiLeaks the source details policy questions that they say urgently need to be debated in public, including whether the CIA's hacking capabilities exceed its mandated powers and the problem of public oversight of the agency. The source wishes to initiate a public debate about the security, creation, use, proliferation and democratic control of cyberweapons.\nOnce a single cyber 'weapon' is 'loose' it can spread around the world in seconds, to be used by rival states, cyber mafia and teenage hackers alike.\nJulian Assange, WikiLeaks editor stated that \"There is an extreme proliferation risk in the development of cyber 'weapons'. Comparisons can be drawn between the uncontrolled proliferation of such 'weapons', which results from the inability to contain them combined with their high market value, and the global arms trade. But the significance of \"Year Zero\" goes well beyond the choice between cyberwar and cyberpeace. The disclosure is also exceptional from a political, legal and forensic perspective.\"\nWikileaks has carefully reviewed the \"Year Zero\" disclosure and published substantive CIA documentation while avoiding the distribution of 'armed' cyberweapons until a consensus emerges on the technical and political nature of the CIA's program and how such 'weapons' should analyzed, disarmed and published.\nWikileaks has also decided to redact and anonymise some identifying information in \"Year Zero\" for in depth analysis. These redactions include ten of thousands of CIA targets and attack machines throughout Latin America, Europe and the United States. While we are aware of the imperfect results of any approach chosen, we remain committed to our publishing model and note that the quantity of published pages in \"Vault 7\" part one (“Year Zero”) already eclipses the total number of pages published over the first three years of the Edward Snowden NSA leaks.\nAnalysis\nCIA malware targets iPhone, Android, smart TVs\nCIA malware and hacking tools are built by EDG (Engineering Development Group), a software development group within CCI (Center for Cyber Intelligence), a department belonging to the CIA's DDI (Directorate for Digital Innovation). The DDI is one of the five major directorates of the CIA (see this organizational chart of the CIA for more details).\nThe EDG is responsible for the development, testing and operational support of all backdoors, exploits, malicious payloads, trojans, viruses and any other kind of malware used by the CIA in its covert operations world-wide.\nThe increasing sophistication of surveillance techniques has drawn comparisons with George Orwell's 1984, but \"Weeping Angel\", developed by the CIA's Embedded Devices Branch (EDB), which infests smart TVs, transforming them into covert microphones, is surely its most emblematic realization.\nThe attack against Samsung smart TVs was developed in cooperation with the United Kingdom's MI5/BTSS. After infestation, Weeping Angel places the target TV in a 'Fake-Off' mode, so that the owner falsely believes the TV is off when it is on. In 'Fake-Off' mode the TV operates as a bug, recording conversations in the room and sending them over the Internet to a covert CIA server.\nAs of October 2014 the CIA was also looking at infecting the vehicle control systems used by modern cars and trucks. The purpose of such control is not specified, but it would permit the CIA to engage in nearly undetectable assassinations.\nThe CIA's Mobile Devices Branch (MDB) developed numerous attacks to remotely hack and control popular smart phones. Infected phones can be instructed to send the CIA the user's geolocation, audio and text communications as well as covertly activate the phone's camera and microphone.\nDespite iPhone's minority share (14.5%) of the global smart phone market in 2016, a specialized unit in the CIA's Mobile Development Branch produces malware to infest, control and exfiltrate data from iPhones and other Apple products running iOS, such as iPads. CIA's arsenal includes numerous local and remote \"zero days\" developed by CIA or obtained from GCHQ, NSA, FBI or purchased from cyber arms contractors such as Baitshop. The disproportionate focus on iOS may be explained by the popularity of the iPhone among social, political, diplomatic and business elites.\nA similar unit targets Google's Android which is used to run the majority of the world's smart phones (~85%) including Samsung, HTC and Sony. 1.15 billion Android powered phones were sold last year. \"Year Zero\" shows that as of 2016 the CIA had 24 \"weaponized\" Android \"zero days\" which it has developed itself and obtained from GCHQ, NSA and cyber arms contractors.\nThese techniques permit the CIA to bypass the encryption of WhatsApp, Signal, Telegram, Wiebo, Confide and Cloackman by hacking the \"smart\" phones that they run on and collecting audio and message traffic before encryption is applied.\nCIA malware targets Windows, OSx, Linux, routers\nThe CIA also runs a very substantial effort to infect and control Microsoft Windows users with its malware. This includes multiple local and remote weaponized \"zero days\", air gap jumping viruses such as \"Hammer Drill\" which infects software distributed on CD/DVDs, infectors for removable media such as USBs, systems to hide data in images or in covert disk areas ( \"Brutal Kangaroo\") and to keep its malware infestations going.\nMany of these infection efforts are pulled together by the CIA's Automated Implant Branch (AIB), which has developed several attack systems for automated infestation and control of CIA malware, such as \"Assassin\" and \"Medusa\".\nAttacks against Internet infrastructure and webservers are developed by the CIA's Network Devices Branch (NDB).\nThe CIA has developed automated multi-platform malware attack and control systems covering Windows, Mac OS X, Solaris, Linux and more, such as EDB's \"HIVE\" and the related \"Cutthroat\" and \"Swindle\" tools, which are described in the examples section below.\nCIA 'hoarded' vulnerabilities (\"zero days\")\nIn the wake of Edward Snowden's leaks about the NSA, the U.S. technology industry secured a commitment from the Obama administration that the executive would disclose on an ongoing basis — rather than hoard — serious vulnerabilities, exploits, bugs or \"zero days\" to Apple, Google, Microsoft, and other US-based manufacturers.\nSerious vulnerabilities not disclosed to the manufacturers places huge swathes of the population and critical infrastructure at risk to foreign intelligence or cyber criminals who independently discover or hear rumors of the vulnerability. If the CIA can discover such vulnerabilities so can others.\nThe U.S. government's commitment to the Vulnerabilities Equities Process came after significant lobbying by US technology companies, who risk losing their share of the global market over real and perceived hidden vulnerabilities. The government stated that it would disclose all pervasive vulnerabilities discovered after 2010 on an ongoing basis.\n\"Year Zero\" documents show that the CIA breached the Obama administration's commitments. Many of the vulnerabilities used in the CIA's cyber arsenal are pervasive and some may already have been found by rival intelligence agencies or cyber criminals.\nAs an example, specific CIA malware revealed in \"Year Zero\" is able to penetrate, infest and control both the Android phone and iPhone software that runs or has run presidential Twitter accounts. The CIA attacks this software by using undisclosed security vulnerabilities (\"zero days\") possessed by the CIA but if the CIA can hack these phones then so can everyone else who has obtained or discovered the vulnerability. As long as the CIA keeps these vulnerabilities concealed from Apple and Google (who make the phones) they will not be fixed, and the phones will remain hackable.\nThe same vulnerabilities exist for the population at large, including the U.S. Cabinet, Congress, top CEOs, system administrators, security officers and engineers. By hiding these security flaws from manufacturers like Apple and Google the CIA ensures that it can hack everyone &mdsh; at the expense of leaving everyone hackable.\n'Cyberwar' programs are a serious proliferation risk\nCyber 'weapons' are not possible to keep under effective control.\nWhile nuclear proliferation has been restrained by the enormous costs and visible infrastructure involved in assembling enough fissile material to produce a critical nuclear mass, cyber 'weapons', once developed, are very hard to retain.\nCyber 'weapons' are in fact just computer programs which can be pirated like any other. Since they are entirely comprised of information they can be copied quickly with no marginal cost.\nSecuring such 'weapons' is particularly difficult since the same people who develop and use them have the skills to exfiltrate copies without leaving traces — sometimes by using the very same 'weapons' against the organizations that contain them. There are substantial price incentives for government hackers and consultants to obtain copies since there is a global \"vulnerability market\" that will pay hundreds of thousands to millions of dollars for copies of such 'weapons'. Similarly, contractors and companies who obtain such 'weapons' sometimes use them for their own purposes, obtaining advantage over their competitors in selling 'hacking' services.\nOver the last three years the United States intelligence sector, which consists of government agencies such as the CIA and NSA and their contractors, such as Booz Allan Hamilton, has been subject to unprecedented series of data exfiltrations by its own workers.\nA number of intelligence community members not yet publicly named have been arrested or subject to federal criminal investigations in separate incidents.\nMost visibly, on February 8, 2017 a U.S. federal grand jury indicted Harold T. Martin III with 20 counts of mishandling classified information. The Department of Justice alleged that it seized some 50,000 gigabytes of information from Harold T. Martin III that he had obtained from classified programs at NSA and CIA, including the source code for numerous hacking tools.\nOnce a single cyber 'weapon' is 'loose' it can spread around the world in seconds, to be used by peer states, cyber mafia and teenage hackers alike.\nU.S. Consulate in Frankfurt is a covert CIA hacker base\nIn addition to its operations in Langley, Virginia the CIA also uses the U.S. consulate in Frankfurt as a covert base for its hackers covering Europe, the Middle East and Africa.\nCIA hackers operating out of the Frankfurt consulate ( \"Center for Cyber Intelligence Europe\" or CCIE) are given diplomatic (\"black\") passports and State Department cover. The instructions for incoming CIA hackers make Germany's counter-intelligence efforts appear inconsequential: \"Breeze through German Customs because you have your cover-for-action story down pat, and all they did was stamp your passport\"\nYour Cover Story (for this trip)\nQ: Why are you here?\nA: Supporting technical consultations at the Consulate.\nTwo earlier WikiLeaks publications give further detail on CIA approaches to customs and secondary screening procedures.\nOnce in Frankfurt CIA hackers can travel without further border checks to the 25 European countries that are part of the Shengen open border area — including France, Italy and Switzerland.\nA number of the CIA's electronic attack methods are designed for physical proximity. These attack methods are able to penetrate high security networks that are disconnected from the internet, such as police record database. In these cases, a CIA officer, agent or allied intelligence officer acting under instructions, physically infiltrates the targeted workplace. The attacker is provided with a USB containing malware developed for the CIA for this purpose, which is inserted into the targeted computer. The attacker then infects and exfiltrates data to removable media. For example, the CIA attack system Fine Dining, provides 24 decoy applications for CIA spies to use. To witnesses, the spy appears to be running a program showing videos (e.g VLC), presenting slides (Prezi), playing a computer game (Breakout2, 2048) or even running a fake virus scanner (Kaspersky, McAfee, Sophos). But while the decoy application is on the screen, the underlaying system is automatically infected and ransacked.\nHow the CIA dramatically increased proliferation risks\nIn what is surely one of the most astounding intelligence own goals in living memory, the CIA structured its classification regime such that for the most market valuable part of \"Vault 7\" — the CIA's weaponized malware (implants + zero days), Listening Posts (LP), and Command and Control (C2) systems — the agency has little legal recourse.\nThe CIA made these systems unclassified.\nWhy the CIA chose to make its cyberarsenal unclassified reveals how concepts developed for military use do not easily crossover to the 'battlefield' of cyber 'war'.\nTo attack its targets, the CIA usually requires that its implants communicate with their control programs over the internet. If CIA implants, Command & Control and Listening Post software were classified, then CIA officers could be prosecuted or dismissed for violating rules that prohibit placing classified information onto the Internet. Consequently the CIA has secretly made most of its cyber spying/war code unclassified. The U.S. government is not able to assert copyright either, due to restrictions in the U.S. Constitution. This means that cyber 'arms' manufactures and computer hackers can freely \"pirate\" these 'weapons' if they are obtained. The CIA has primarily had to rely on obfuscation to protect its malware secrets.\nConventional weapons such as missiles may be fired at the enemy (i.e into an unsecured area). Proximity to or impact with the target detonates the ordnance including its classified parts. Hence military personnel do not violate classification rules by firing ordnance with classified parts. Ordnance will likely explode. If it does not, that is not the operator's intent.\nOver the last decade U.S. hacking operations have been increasingly dressed up in military jargon to tap into Department of Defense funding streams. For instance, attempted \"malware injections\" (commercial jargon) or \"implant drops\" (NSA jargon) are being called \"fires\" as if a weapon was being fired. However the analogy is questionable.\nUnlike bullets, bombs or missiles, most CIA malware is designed to live for days or even years after it has reached its 'target'. CIA malware does not \"explode on impact\" but rather permanently infests its target. In order to infect target's device, copies of the malware must be placed on the target's devices, giving physical possession of the malware to the target. To exfiltrate data back to the CIA or to await further instructions the malware must communicate with CIA Command & Control (C2) systems placed on internet connected servers. But such servers are typically not approved to hold classified information, so CIA command and control systems are also made unclassified.\nA successful 'attack' on a target's computer system is more like a series of complex stock maneuvers in a hostile take-over bid or the careful planting of rumors in order to gain control over an organization's leadership rather than the firing of a weapons system. If there is a military analogy to be made, the infestation of a target is perhaps akin to the execution of a whole series of military maneuvers against the target's territory including observation, infiltration, occupation and exploitation.\nEvading forensics and anti-virus\nA series of standards lay out CIA malware infestation patterns which are likely to assist forensic crime scene investigators as well as Apple, Microsoft, Google, Samsung, Nokia, Blackberry, Siemens and anti-virus companies attribute and defend against attacks.\nCIA hackers developed successful attacks against most well known anti-virus programs. These are documented in AV defeats, Personal Security Products, Detecting and defeating PSPs and PSP/Debugger/RE Avoidance. For example, Comodo was defeated by CIA malware placing itself in the Window's \"Recycle Bin\". While Comodo 6.x has a \"Gaping Hole of DOOM\".\nCIA hackers discussed what the NSA's \"Equation Group\" hackers did wrong and how the CIA's malware makers could avoid similar exposure.\nExamples\nThe CIA's Engineering Development Group (EDG) management system contains around 500 different projects (only some of which are documented by \"Year Zero\") each with their own sub-projects, malware and hacker tools.\nThe majority of these projects relate to tools that are used for penetration, infestation (\"implanting\"), control, and exfiltration.\nAnother branch of development focuses on the development and operation of Listening Posts (LP) and Command and Control (C2) systems used to communicate with and control CIA implants; special projects are used to target specific hardware from routers to smart TVs.\nSome example projects are described below, but see the table of contents for the full list of projects described by WikiLeaks' \"Year Zero\".\nUMBRAGE\nThe CIA's hand crafted hacking techniques pose a problem for the agency. Each technique it has created forms a \"fingerprint\" that can be used by forensic investigators to attribute multiple different attacks to the same entity.\nThis is analogous to finding the same distinctive knife wound on multiple separate murder victims. The unique wounding style creates suspicion that a single murderer is responsible. As soon one murder in the set is solved then the other murders also find likely attribution.\nThe CIA's Remote Devices Branch's UMBRAGE group collects and maintains a substantial library of attack techniques 'stolen' from malware produced in other states including the Russian Federation.\nWith UMBRAGE and related projects the CIA cannot only increase its total number of attack types but also misdirect attribution by leaving behind the \"fingerprints\" of the groups that the attack techniques were stolen from.\nUMBRAGE components cover keyloggers, password collection, webcam capture, data destruction, persistence, privilege escalation, stealth, anti-virus (PSP) avoidance and survey techniques.\nFine Dining\nFine Dining comes with a standardized questionnaire i.e menu that CIA case officers fill out. The questionnaire is used by the agency's OSB (Operational Support Branch) to transform the requests of case officers into technical requirements for hacking attacks (typically \"exfiltrating\" information from computer systems) for specific operations. The questionnaire allows the OSB to identify how to adapt existing tools for the operation, and communicate this to CIA malware configuration staff. The OSB functions as the interface between CIA operational staff and the relevant technical support staff.\nAmong the list of possible targets of the collection are 'Asset', 'Liason Asset', 'System Administrator', 'Foreign Information Operations', 'Foreign Intelligence Agencies' and 'Foreign Government Entities'. Notably absent is any reference to extremists or transnational criminals. The 'Case Officer' is also asked to specify the environment of the target like the type of computer, operating system used, Internet connectivity and installed anti-virus utilities (PSPs) as well as a list of file types to be exfiltrated like Office documents, audio, video, images or custom file types. The 'menu' also asks for information if recurring access to the target is possible and how long unobserved access to the computer can be maintained. This information is used by the CIA's 'JQJIMPROVISE' software (see below) to configure a set of CIA malware suited to the specific needs of an operation.\nImprovise (JQJIMPROVISE)\n'Improvise' is a toolset for configuration, post-processing, payload setup and execution vector selection for survey/exfiltration tools supporting all major operating systems like Windows (Bartender), MacOS (JukeBox) and Linux (DanceFloor). Its configuration utilities like Margarita allows the NOC (Network Operation Center) to customize tools based on requirements from 'Fine Dining' questionairies.\nHIVE\nHIVE is a multi-platform CIA malware suite and its associated control software. The project provides customizable implants for Windows, Solaris, MikroTik (used in internet routers) and Linux platforms and a Listening Post (LP)/Command and Control (C2) infrastructure to communicate with these implants.\nThe implants are configured to communicate via HTTPS with the webserver of a cover domain; each operation utilizing these implants has a separate cover domain and the infrastructure can handle any number of cover domains.\nEach cover domain resolves to an IP address that is located at a commercial VPS (Virtual Private Server) provider. The public-facing server forwards all incoming traffic via a VPN to a 'Blot' server that handles actual connection requests from clients. It is setup for optional SSL client authentication: if a client sends a valid client certificate (only implants can do that), the connection is forwarded to the 'Honeycomb' toolserver that communicates with the implant; if a valid certificate is missing (which is the case if someone tries to open the cover domain website by accident), the traffic is forwarded to a cover server that delivers an unsuspicious looking website.\nThe Honeycomb toolserver receives exfiltrated information from the implant; an operator can also task the implant to execute jobs on the target computer, so the toolserver acts as a C2 (command and control) server for the implant.\nSimilar functionality (though limited to Windows) is provided by the RickBobby project.\nSee the classified user and developer guides for HIVE.\nFrequently Asked Questions\nWhy now?\nWikiLeaks published as soon as its verification and analysis were ready.\nIn Febuary the Trump administration has issued an Executive Order calling for a \"Cyberwar\" review to be prepared within 30 days.\nWhile the review increases the timeliness and relevance of the publication it did not play a role in setting the publication date.\nRedactions\nNames, email addresses and external IP addresses have been redacted in the released pages (70,875 redactions in total) until further analysis is complete.\nOver-redaction: Some items may have been redacted that are not employees, contractors, targets or otherwise related to the agency, but are, for example, authors of documentation for otherwise public projects that are used by the agency. Identity vs. person: the redacted names are replaced by user IDs (numbers) to allow readers to assign multiple pages to a single author. Given the redaction process used a single person may be represented by more than one assigned identifier but no identifier refers to more than one real person. Archive attachments (zip, tar.gz, ...) are replaced with a PDF listing all the file names in the archive. As the archive content is assessed it may be made available; until then the archive is redacted. Attachments with other binary content are replaced by a hex dump of the content to prevent accidental invocation of binaries that may have been infected with weaponized CIA malware. As the content is assessed it may be made available; until then the content is redacted. The tens of thousands of routable IP addresses references (including more than 22 thousand within the United States) that correspond to possible targets, CIA covert listening post servers, intermediary and test systems, are redacted for further exclusive investigation. Binary files of non-public origin are only available as dumps to prevent accidental invocation of CIA malware infected binaries.\nOrganizational Chart\nThe organizational chart corresponds to the material published by WikiLeaks so far.\nSince the organizational structure of the CIA below the level of Directorates is not public, the placement of the EDG and its branches within the org chart of the agency is reconstructed from information contained in the documents released so far. It is intended to be used as a rough outline of the internal organization; please be aware that the reconstructed org chart is incomplete and that internal reorganizations occur frequently.\nWiki pages\n\"Year Zero\" contains 7818 web pages with 943 attachments from the internal development groupware. The software used for this purpose is called Confluence, a proprietary software from Atlassian. Webpages in this system (like in Wikipedia) have a version history that can provide interesting insights on how a document evolved over time; the 7818 documents include these page histories for 1136 latest versions.\nThe order of named pages within each level is determined by date (oldest first). Page content is not present if it was originally dynamically created by the Confluence software (as indicated on the re-constructed page).\nWhat time period is covered?\nThe years 2013 to 2016. The sort order of the pages within each level is determined by date (oldest first).\nWikiLeaks has obtained the CIA's creation/last modification date for each page but these do not yet appear for technical reasons. Usually the date can be discerned or approximated from the content and the page order. If it is critical to know the exact time/date contact WikiLeaks.\nWhat is \"Vault 7\"\n\"Vault 7\" is a substantial collection of material about CIA activities obtained by WikiLeaks.\nWhen was each part of \"Vault 7\" obtained?\nPart one was obtained recently and covers through 2016. Details on the other parts will be available at the time of publication.\nIs each part of \"Vault 7\" from a different source?\nDetails on the other parts will be available at the time of publication.\nWhat is the total size of \"Vault 7\"?\nThe series is the largest intelligence publication in history.\nHow did WikiLeaks obtain each part of \"Vault 7\"?\nSources trust WikiLeaks to not reveal information that might help identify them.\nIsn't WikiLeaks worried that the CIA will act against its staff to stop the series?\nNo. That would be certainly counter-productive.\nHas WikiLeaks already 'mined' all the best stories?\nNo. WikiLeaks has intentionally not written up hundreds of impactful stories to encourage others to find them and so create expertise in the area for subsequent parts in the series. They're there. Look. Those who demonstrate journalistic excellence may be considered for early access to future parts.\nWon't other journalists find all the best stories before me?\nUnlikely. There are very considerably more stories than there are journalists or academics who are in a position to write them.",
        "sentiment": -0.47135002357802663
    },
    "article_8": {
        "title": "Apple releases iOS 10.3 with Find My AirPods, Apple File System, CarPlay updates, more",
        "body": "Apple is rolling out iOS 10.3 for iPhone, iPad, and iPod touch. The latest software update includes Find My AirPods support, CarPlay improvements, Apple’s new filesystem, and more.\niOS 10.3 is the first version to include Find My AirPods in the Find My iPhone app, Wi-Fi Calling for iCloud-connected devices for Verizon customers, and a new 32-bit alert that suggests iOS 11 could be 64-bit only.\nApple is also introducing a way for developers to reply to app reviews with iOS 10.3, and a new system-wide app review request feature is being added. iOS 10.3 includes iCloud Analytics for the first time as well.\nHere’s an overview of changes discovered during the beta period:\nFind My AirPods added to Find My iPhone app\nSiri support for cricket scores from Indian Premier League and International Cricket Council\nSafari support for Reduced Motion preference\nProminent user security section in Settings app\niOS 10.3 uses new Apple File System (APFS) which may free up some space\nPodcasts app has a widget like Music app, same app design\nNew system level way for developers to request app rating, opt out option in Settings\nCarPlay status bar has persistent quick access to media, communication, and travel apps for quick switching without accessing the Home screen\nCarPlay gains quick access to albums from songs in Music, new Up Next screen\nWeather data in Maps app now has 3D Touch forecast\nYou can see our hands-on with iOS 10.3 below:\nSubscribe to 9to5Mac for more videos\nLearn More link on 32 bit app warning, new 32 bit app section in Settings\nThe wall of shame. pic.twitter.com/vu9bnvn0DK — Paul Haddad (@tapbot_paul) February 20, 2017\niOS 10.3 beta 4 included an restart message whenever a button is hit during the update installation process.\nWe’ll update with any changes found in official iOS 10.3 release.\nRelease notes:\niOS 10.3 introduces new features including the ability to locate AirPods using Find my iPhone and more ways to use Siri with payment, ride booking and automaker apps.\nFind My iPhone ● View the current or last known location of your AirPods ● Play a sound on one or both AirPods to help you find them\nSiri ● Support for paying and checking status of bills with payment apps ● Support for scheduling with ride booking apps ● Support for checking car fuel level, lock status, turning on lights and activating horn with automaker apps ● Cricket sports scores and statistics for Indian Premier League and International Cricket Council\nCarPlay ● Shortcuts in the status bar for easy access to last used apps ● Apple Music Now Playing screen gives access to Up Next and the currently playing song’s album ● Daily curated playlists and new music categories in Apple Music\nOther improvements and fixes ● Rent once and watch your iTunes movies across your devices ● New Settings unified view for your Apple ID account information, settings and devices ● Hourly weather in Maps using 3D Touch on the displayed current temperature ● Support for searching “parked car” in Maps ● Calendar adds the ability to delete an unwanted invite and report it as junk ● Home app support to trigger scenes using accessories with switches and buttons ● Home app support for accessory battery level status ● Podcasts support for 3D Touch and Today widget to access recently updated shows ● Podcast shows or episodes are shareable to Messages with full playback support ● Fixes an issue that could prevent Maps from displaying your current location after resetting Location & Privacy ● VoiceOver stability improvements for Phone, Safari and Mail\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.2332253051766505
    },
    "article_9": {
        "title": "Apple to 'rapidly address' any security holes as companies respond to CIA leak",
        "body": "Apple has promised to “rapidly address” any security holes used by the CIA to hack iPhones, following the release of a huge tranche of documents covering the intelligence agency’s stockpile of software vulnerabilities.\nThe leak, dubbed “Vault 7” by its publisher WikiLeaks, is made up of a collection of around 10,000 individual documents created between 2014 and 2016. A spokesman for the CIA said it would not comment “on the authenticity or content of purported intelligence documents” and the Trump administration spokesman Sean Spicer also declined comment.\nApple, one of numerous tech companies whose devices appear to have been targeted, released a statement late on Tuesday saying many of the vulnerabilities described by the documents were already fixed as of the latest version of its iOS mobile operating system, and aimed to reassure customers that it was working on patching the rest of the holes.\nIt said: “While our initial analysis indicates that many of the issues leaked today were already patched in the latest iOS, we will continue work to rapidly address any identified vulnerabilities,” it added. “We always urge customers to download the latest iOS to make sure they have the most recent security updates.”\nOther companies mentioned in the leaks, including Microsoft and Samsung, gave briefer statements. “We are aware of the report and are looking into it,” Microsoft said. Samsung said: “Protecting consumers’ privacy and the security of our devices is a top priority at Samsung. We are aware of the report in question and are urgently looking into the matter.” Google has yet to comment on the leaks, which contain a sizeable amount of information on how to target its Android operating system.\nWhile Apple has tried to reassure customers that “many” of the vulnerabilities mentioned in the document have now been fixed, the leak itself represents just a snapshot in time of the CIA’s capabilities, which may have developed further since the documents were created.\nOne page of the leak, which focuses on iOS exploits, shows the most recent version of iOS as 9.2. That version was released in December 2015, implying that the iOS-specific document was created between 8 December that year and 15 January 2016, when iOS 9.2.1 was made available.\nThat page shows some exploits, such as one named “Nandao” and apparently discovered by Britain’s GCHQ, which were unknown outside the intelligence community at the time the document was created. Such an exploit is known as a “zero-day” vulnerability, for the number of days the manufacturer has had to fix the problem.\nIf you're writing about the CIA/@Wikileaks story, here's the big deal: first public evidence USG secretly paying to keep US software unsafe. pic.twitter.com/kYi0NC2mOp — Edward Snowden (@Snowden) March 7, 2017\nIt takes many separate vulnerabilities to craft a full malware kit that can be used to remotely take control of a smartphone. The WikiLeaks document lists six separate vulnerabilities required to remotely exploit an iPhone running iOS 9.2, with codenames like Saline, MiniMe and Juggernaut, and a manufacturer fixing any one of those holes can weaken an attacker’s capabilities.\nThe requirement to keep such zero-day exploits secret from the manufacturer, lest they be fixed, also explains why they are unlikely to be used for anything other than targeted surveillance, security experts say. In August 2016, for instance, Apple issued a global iOS update after three zero-day attacks were found being used to try and break into the iPhone of an Arab human rights activist.\nThe quantity of exploits referred to in the Vault 7 leak has also drawn fresh criticism of the CIA and other intelligence agencies’ practice of purchasing or otherwise discovering security flaws in popular hardware and software, and failing to disclose the flaws to the manufacturers.\n“Here’s the big deal,” tweeted Edward Snowden, the source of a previous huge leak of NSA hacking capabilities: “First public evidence USG [US government] secretly paying to keep US software unsafe. The CIA reports show the USG developing vulnerabilities in US products, then intentionally keeping the holes open. Reckless beyond words.”\nPublicly, the US government has insisted that it doesn’t stockpile such exploits, instead reporting “the greatest numbers of vulnerabilities” it finds, rather than keeping them secret. But it has always maintained the right to keep particularly critical vulnerabilities secret if they have “a clear national security or law enforcement” use.",
        "sentiment": -0.46688650471383125
    },
    "article_10": {
        "title": "iPhone 8 will strain world's supply of OLED displays",
        "body": "Apple will acquire 14 percent of all OLED panels produced this year for the upcoming iPhone 8, according to a new report.\nCupertino, along with South Korean rival Samsung, will require so many that rival smartphone makers like Huawei will be forced to use alternative technologies due to an insufficient supply.\nRecent rumors have somewhat crushed our hopes of an all-OLED iPhone 8 lineup this year. It now looks like Apple’s new 4.7- and 5.5-inch handsets will retain LCD displays like their predecessors, while fans will have to pay more for a “premium” OLED model.\nDespite that, Apple will snap up 14 percent of all OLED panels produced in 2017, reports Digitimes. South Korean rival Samsung, which is expected to manufacture every single one of those, will use 56 percent of the OLED panels produced.\nThat leaves just 30 percent for other smartphone manufacturers like Huawei, which is expected to get just 8 percent of the total share. Follow Chinese companies Oppo and Vivo are expected to secure 13 percent and 10 percent respectively, thanks to deals with Samsung Display.\n“Samsung Display produces an estimated 300 million AMOLED smartphone panels a year,” reports Digitimes. “After priority supply for Samsung Electronics and Apple, Samsung Display can supply only about 50 million AMOLED panels for China-based smartphone vendors a year.”\nDue to the OLED panel shortage, most smartphone manufacturers have been forced to utilize alternative display technologies, like LTPS (low-temperature poly-Si) TFT-LCD panels. Others will use a-Si TFT-LCDs.",
        "sentiment": -0.39139663831641275
    },
    "article_11": {
        "title": "AppleCare+ Can Now be Purchased Up to One Year After Buying an iPhone",
        "body": "A customer that purchases a new iPhone now has up to one year to purchase AppleCare+ for the device, compared to 60 days previously, according to multiple people familiar with the matter. Apple has yet to update the fine print on its website, but MacRumors confirmed the extension with a senior AppleCare advisor.\nThe change means that AppleCare+ can now be added to an iPhone as long as the device remains within its standard one-year limited warranty period. This brings AppleCare+ for iPhone in line with AppleCare for Mac and Apple TV, which can also be purchased up to one year after those devices are purchased.\nThe senior advisor said the extension only applies to the iPhone, and it is retroactive, meaning iPhones sold within the past year qualify for AppleCare+ now. Multiple sources insist that the one-year AppleCare+ purchase window applies to the iPad, iPod touch, and Apple Watch as well, but we cannot confirm this info yet.\nApple's eligibility tool does appear to reflect the change for iPhones in the United States, but not in the United Kingdom, Canada, Hong Kong, or elsewhere, so it is possible the longer purchase window will be U.S. only. \"Eligible for AppleCare+\" did not appear for an iPad or Apple Watch in any country based on our check.\niPhone 7 Plus purchased on September 21, 2016 eligible for AppleCare+\nAppleCare+ costs $129 for iPhone 6s and newer and $99 for iPhone SE . The plan extends an iPhone's warranty coverage to two years from the original purchase date of the device, and adds up to two incidents of accidental damage coverage, each subject to a service fee of $29 for screen damage, or $99 for any other damage.\nAppleCare+ for iPhone also provides 24/7 priority access to AppleCare advisors via chat or phone for up to two years after the device's original purchase date. Without the plan, iPhone owners are covered by a limited one-year warranty and 90 days of complimentary telephone support.\nAppleCare+ for iPhone also covers EarPods, Lightning to USB cables, and batteries that retain less than 80 percent of their original capacity.\nIn order to purchase AppleCare+ after the fact, separately from the iPhone, Apple must physically inspect the device to ensure there is no existing damage. Proof of purchase, such as a receipt, is also required. If purchased online, Apple requires customers to verify their serial number and run a remote diagnostic test.\nUpdate: Apple appears to have reverted back to a 60-day purchase window for AppleCare+ for iPhone, as confirmed with a support representative.",
        "sentiment": 0.03408500694614999
    },
    "article_12": {
        "title": "Apple Aims to Make Every iPhone With an OLED Display by 2019",
        "body": "A new supply chain report claims that Apple is planning to use OLED for every iPhone model by 2019, with the company expected to adopt OLED panels for 60 million units of the iPhone 8 later in 2017, equating to around 40 percent of its total manufacturing run (via The Bell) [Google Translate]. Apple will double the adoption of OLED panels for the 2018 iPhone before completely migrating over to OLED-only models for 2019.\nThe same report claimed that both Samsung and Inteflex are currently gearing up production for flexible printed circuit boards (FPCB) for this year's iPhone 8, with Samsung specifically beginning an expansion of its Electro-Mechanics plant in Vietnam to account for the increased Apple supply quota this year.\nApple plans to introduce OLED panels to all iPhone models by 2019. This year's introduction accounted for only 40%, but next year it is expected to double to 80% and 100% next year.\nFor the 2017 iPhone line, Apple is expected to stick with LCD panels for two of the iPhones -- currently referred to as the \"iPhone 7s\" and \"iPhone 7s Plus\" -- while making the \"iPhone 8\" its first-ever mobile device to include an OLED screen. Today's supply chain report said that Apple will use three suppliers to produce OLED panels, and orders for each will be decided and placed when production is started around April or May.\nThe iPhone 8 is currently rumored to include an edge-to-edge OLED display with an integrated Touch ID fingerprint sensor embedded within the screen. The OLED display is widely agreed to measure 5.8 inches, while the primary area of user interaction will be 5.15 inches, and below that there will be a \"function row.\" The other two models are believed to keep the same aluminum design of current-model iPhones.",
        "sentiment": 0.04721331559121609
    },
    "article_13": {
        "title": "Apple Music saw over 40M users on mobile last month, leading Spotify by 10M",
        "body": "While Spotify may lead in terms of subscribers, it’s already been proven that Apple Music can dominate even with its smaller user base. A new report from analytics firm Verto further highlights the sometimes underestimated reach of Apple Music.\nThe report shows that Apple Music comes out on top in terms of monthly unique users, thanks in large part to the three-month free trial Apple offers.\nThe data from Verto says that Apple Music attracted 40.7 million unique users during the month of February in the US, putting it well ahead of Pandora at 32.6 million unique users. Spotify rounded out the top three, coming in with 30.4 million unique users. Coming in fourth is iHeartRadio, while the struggling SoundCloud places fifth. These numbers include mobile users only, meaning they are likely higher if you take into account desktop.\nVetro explained to TechCrunch that how Apple Music was able to bring in so many unique monthly users centers around the three-month free trial that Apple offers. The analytics firm says that the free trial more than doubles the amount of people who use Apple Music in the United States.\nThis is an interesting tidbit of data for a number of reasons. For one, it really exemplifies just how big of a benefit Apple Music has by coming pre-installed on all iOS devices. Furthermore, it represents the potential for growth that Apple’s streaming music service still has.\nMost recently, Apple stated that Apple Music has “well past” 20 million paying subscribers worldwide. Today’s data from Verto claims that, in the US alone, Apple Music saw over 40 million unique users, presumably the majority of whom were free trial customers. Spotify, on the other hand, recently touted that it has 50 million paying subscribers worldwide, while it also has over 100 million users on its paid + free tiers combined. Nevertheless, Apple Music still outperformed Spotify in terms of active users in the United States.\nWhat this means for artists specifically is that if they’re looking for the best platform to go to with exclusive content, or content in general, Apple Music has the broadest reach. This is especially notable considering Apple pays artists during that three-month free trial.\nA lot has been made about the success of Apple Music and Beats 1, but information like this highlights how Apple’s large user base gives it an automatic leg-up compared to its competitors.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.33954245951913653
    },
    "article_14": {
        "title": "The Telegraph says Apple News has become the most effective third-party platform to drive readers to its sites and app; Telegraph posts about 240 articles/day",
        "body": "For The Telegraph, Apple News has become the most effective third-party platform at driving readers to its own sites and app — where it can eventually turn them into subscribers.\nThe Telegraph has made articles available on Apple News in some form since the news aggregation app launched in September 2015. The publisher introduced a new paywall model last November and saw unique monthly viewers grow 30 percent since last month, though The Telegraph doesn’t give out exact figures. Now on Apple News, as everywhere off-site, The Telegraph publishes 80 percent of its content — approximately 240 articles a day. The remaining 20 percent is for subscribers.\n“Apple News consumers are proving to be a rich part of the funnel driving into our owned and operated platforms,” said Robert Bridge, chief customer officer at The Telegraph Media Group. “And that’s the hope, right? That you extend your reach through these products, then you migrate the audience into your core products.”\nA key benefit of Apple News is that it pushes readers to The Telegraph’s app through ads. The Telegraph’s own app became free to download last October, but only since last week were app users able to subscribe to its premium content through the app. Bridge wouldn’t share how well the app has been in converting casual readers to subscribers, but early signs are encouraging, he said. Interestingly, the publisher said 65 percent of those who have been driven into The Telegraph app from Apple News are its most engaged app users, returning to the app more than five times in a month. They also index higher on other engagement metrics it measures, like dwell time and number of articles read.\n“The main growth has been driven by the iOS10 update and a combination of our new strategy,” said Bridge. Several publishers recorded traffic increases since the iOS10 update last year, partly because of the introduction of notifications. “In the modern age, people look to consume content through notifications. That doesn’t mean they will always open them and click through.”\nRight now, there’s no fixed approach to notifications. The Telegraph is working out whether it should use different content for notifications on its own app versus Apple News.\n“It’s finding that balance between targeting and getting stuff out quickly,” said Bridge, who noted that Apple’s platform is easy to use, but the audience segmentation is more advanced in The Telegraph’s app. The number of notifications it sends in a day also depends on the news cycle.\nFor now, readers cannot subscribe to The Telegraph’s premium product through third-party platforms, but that could change.\n“I’m committed to driving subscriptions to our premium content,” said Bridge, “I’m not against the concept of putting paid content in environments where we can monetize them.”",
        "sentiment": 0.055538217334643654
    },
    "article_15": {
        "title": "Apple’s desktop Mac lineup: A showcase of old technology",
        "body": "There are lots of things that Apple needs to fix, but one of the most glaring right now is the product line. Sure, we’re on the usual annual cycle of iPhone upgrades. We’ve seen new iPads in recent memory. But what about the Mac? The venerable computer that used to be Apple’s core product is now just an afterthought.\nTo be fair, the much-ballyhooed MacBook Pro with Touch Bar saw the light only a few months ago, but it’s pricey, underpowered, and connector-challenged.\nWhat about the desktop? Where are new Macs? The iMac hasn’t been refreshed in 521 days. The Mac mini hasn’t seen any changes in 883 days. And the Mac Pro? Apple should be embarrassed selling a computer that hasn’t been changed in 1,184 days at the same price as when it was launched. That top-of-the-line Mac features three-year old technology at three-year old prices. (Thanks to MacRumors whose Buyer’s Guide keeps track of release dates.)\nThis is the most prestigious computer company in the world, and their top-of-the-line computer is more than three years old. How can the top management at Apple think this is normal? Perhaps they all use iPads, and they expect us all to switch to that platform, but it’s obvious that there are still millions of people who use computers.\nThe Mac is a $22 billion business; many companies would love to generate that much income from a limited product line. Tim Cook recently said that Apple has “great desktops on our roadmap,” but I remember when he said the Mac Pro would be updated in 2013. It was, just a few days before the end of that year, and only in limited quantities.\nThe lack of new Macs is a big deal. If you depend on a Mac for your work, you may be waiting to upgrade an older computer, and, given how long it’s been, you may have no choice but to settle on a model that you’ll use with regrets. Or, if a new Mac is released soon, and supply is “constrained” as it often is—that word means that Apple either can’t plan manufacturing resources, or misjudged how popular a device is—you may need a new Mac and not even be able to buy one.\nI own three Macs: a 2014 5K Retina iMac, a 2015 MacBook, and a 2011 Mac mini. The iMac is my main computer; I need it to run my business. It has AppleCare for another six months, and, after that, I’d be a lot more comfortable with a Mac that has a guarantee in case something goes wrong.\nI use the Mac mini as a server, mainly to house my Plex video library. It doesn’t need to be the latest model, but mine is old enough that it doesn’t have USB 3, and I would like to upgrade. At more than five years old, it’s getting long in the tooth. But there’s no way I’m going to buy one now; it’s been so long since the last upgrade that the current models are out of date and overpriced.\nThe biggest problem facing Apple now is that businesses can’t depend on the availability of new, improved Macs any more. If you are in the traditional creative industries, and you’ve used Macs, you may start thinking about Windows PCs, which can run Photoshop, Lightroom, and other software you depend on. Waiting for Apple to upgrade Macs, when you need new computers, is just too uncertain. And small business users need the security that the computing platform they’ve committed to will be able to grow with them.\nBut the worst thing about the lack of new Macs is the hit that Apple’s reputation is taking. “Can’t innovate any more, my ass!” said Apple VP Phil Schiller in 2013, giving a preview of the Mac Pro.\nIt’s been 1,184 days since Apple last released an innovation for the desktop.",
        "sentiment": -0.22028237250388452
    },
    "article_16": {
        "title": "Apple never made a display with built-in eGPU so this is what I did.",
        "body": "Last summer there were rumors Apple was working on a Thunderbolt 3 Display with built-in eGPU. Anticipation rose as Apple discontinued the 27″ Thunderbolt Display in July 2016. The October “Hello Again” event brought new MacBook Pro laptops with Thunderbolt 3 connectivity but sadly Apple called it quits on making displays.\nWhat’s a Mac and eGPU enthusiast to do? Mounting a full size graphics card to the back of a display seemed reasonable enough. So I got after it.\nWhat you’re seeing is an RX 470 in an AKiTiO Thunder2 enclosure mounted on the back of an LG 34″ ultrawide monitor through a VESA adapter. It took me some time to find the right VESA adapter for this purpose. The key was something with a slim profile that would also allow sliding in and out of place. This VideoSecu Ultra Thin VESA mount bracket was the perfect match.\nI was ready to drill holes on the backside of the AKiTiO Thunder2 inner enclosure in order to make the VESA bracket work. I soon found out I didn’t need to drill at all. The mounting holes for the Thunder2 boards go all the way to the backside. I was able to align the VESA bracket mounting holes to the two existing holes on the Thunder2. I also borrowed 2 mounting screws from the Thunder2 PCIe board.\nInstalling the other VESA bracket on the back of the LG monitor was no big deal. It’s universal sizing and all went in nicely using the supplied mounting screws in the kit. Once these two steps were done, I could slide the AKiTiO Thunder2 in and out of this VESA carrier with ease. I put two more screws on top to secure this eGPU backpack in place.\nThe next step was to route the cables to the right components. I’m using a Dell DA-2 power brick connected to a modified cable to supply power to both the AKiTiO enclosure and the RX 470 graphics card. An Apple Thunderbolt 2 cable connects the eGPU to a mid 2011 Mac mini. Last but not least, a DisplayPort cable runs from the RX 470 to the LG monitor.\nHere’s a video of this monitor with built-in eGPU in action. 😀\nSimilar to my earlier build using this Mac mini inside an AKiTiO Node with an R9 Fury Nitro, everything works as if the external graphics card was an integral component. As a matter of fact, I wrote this post as well as edited the photos and video on this machine.\nJoin our forum for latest Thunderbolt 3 eGPU development. Please share your thoughts in the comments or in our eGPU Implementation forum.",
        "sentiment": 0.21898146199860744
    },
    "article_17": {
        "title": "All of Apple's 2017 iPhones will include fast charging via Lightning port, not USB-C",
        "body": "'iPhone 8' concept rendering by Marek Weidlich.\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nWhile the underlying technology behind the charging may change, the Lightning port will remain on all of Apple's three new iPhones coming later this year — including the flagship \"iPhone 8\" — according to analyst Ming-Chi Kuo of KGI Securities.\nApple is expected to utilize \"Type-C Power Delivery\" technology in this year's iPhones, Ming-Chi Kuo said in a research note on Thursday, a copy of which was obtained by AppleInsider. The note specifically refutes a questionable claim made earlier this week by The Wall Street Journal, which suggested Apple could ditch the Lightning port with this year's \"iPhone 8,\" instead switching to the same USB-C port found on the company's latest MacBooks.\nThat rumor was unlikely for a number of reasons, including a lack of clear advantages in changing the connector type. But one key advantage instead lies in the underlying technology, which can be integrated into Apple's own proprietary Lightning port.\nKuo noted that safety and stable data transmission during a fast charge are crucial elements for Apple to nail in the switch. He believes the company will adopt power management from Texas Instruments and power delivery chips from Cypress.\nIn addition, the high-end \"iPhone 8\" may boast even faster charging thanks to a 2-cell L-shaped battery pack design. Still, \"Type-C Power Delivery\" is expected on all three handsets this year.\nKuo noted that one potential advantage for switching to USB-C would be faster transfer of high-definition videos. However, he said that high-speed data transmission is a \"niche application\" for the iPhone, which is why Apple will stick with the Lightning port.\nThe Lightning port is slightly thinner than USB-C. It also allows Apple to collect royalties on its Made for iPhone program, which licenses use of the Lightning port.\nAs AppleInsider noted earlier this week, Apple has doubled down on Lightning accessories in the last few years, making abandonment of the port on its flagship device extremely unlikely. Use of the proprietary connector has expanded from \"iDevices\" to accessories, including the Apple Pencil, Apple TV Siri Remote, AirPods, and BeatsX headphones, among others.\nInstead, it's more likely that Apple might switch to a USB-C connector on the opposite end of the Lightning cable that ships in the box. That would allow users to plug their \"iPhone 8\" into one of the company's new MacBook Pros, or the 12-inch MacBook.\nBeyond fast charging via Lightning, Apple is also expected to introduce contact-based wireless charging for all three iPhone models this year, including the \"iPhone 7s\" and \"iPhone 7s Plus.\" The addition would allow users to juice their device by simply placing it on a compatible charging pad.\n'iPhone 8' concept image by Moe Slah.\nThe flagship \"iPhone 8\" is expected to stand out in a number of ways, including its price tag, rumored to start above $1,000. The handset is said to feature an all-new, all-glass exterior with a curved OLED display that will embed components like Touch ID, the earpiece and the FaceTime camera into or beneath the screen.\nThe forward-facing camera is also expected to see a major overhaul with \"revolutionary\" 3D facial recognition technology, allowing for a new secure biometric login method. The device is also expected to ditch the physical home button that has been found on every iPhone to date, replacing it with a display function area below the OLED panel, dedicated to system functions with virtual buttons.",
        "sentiment": 0.07251660020735401
    },
    "article_18": {
        "title": "Apple Has a Redesigned Fingerprint ID Solution For the iPhone 8",
        "body": "Apple is set to feature its own in-house developed integrated fingerprint ID technology in the OLED version of its next iPhone, according to a new report out on Friday.\nApple's upcoming \"iPhone 8\" is expected to feature a virtual home button embedded in the display, but questions persist over the role of Touch ID in such a radical redesign, as conflicting reports from analysts, rumors of biometric alternatives, and Apple patents abound.\nToday, DigiTimes cited industry sources claiming that an Apple-designed \"built-in fingerprint sensor device\" is indeed on the way, and will replace the traditional capacitive touch technology known as Touch ID.\nApple has selected neither Synaptics' Natural ID touch fingerprint sensor nor Qualcomm's Sense ID fingerprint technology for its new OLED iPhones, and decided to use its own Authentec algorithm combined with Privaris glass identification technology to redesign a new fingerprint ID solution, according to industry sources.\nApple's Touch ID fingerprint sensor technology originally came from AuthenTec, which Cupertino acquired in 2012, while the Privaris reference harks back to a patent portfolio Apple bought from the closed biometric security firm in June 2015 that included dozens of patents relating to fingerprint and touchscreen technology, including – in at least one example – the ability to use a touchscreen and fingerprint reader at the same time.\nDigiTimes has sources within Apple's supply chain, but it has a mixed track record at reporting on Apple's unannounced product plans, so this latest report should be treated with caution. That said, additional claims made in the article potentially clarify mixed messages regarding production timelines for this year's iPhone line-up:\nApple's in-house developed fingerprint ID solution will be fabricated at TSMC's 12-inch line using 65nm process technology, said the sources, adding that production for the new OLED iPhone is unlikely to start until September due to the redesigned fingerprint ID solution.\nInformation gathered previously by other sources from the supply chain suggested that Apple plans to ramp up iPhone 8 production in June, because that would allow Apple to work out any manufacturing issues in the design and lead to better supply in preparation for a September launch.\nHowever, according to DigiTimes' sources, Apple will enter volume production in July only for \"two other new iPhones, which will retain LCD for their displays\" – suggesting reports of an early summer ramp-up relate exclusively to the two \"S\" cycle iPhones that Apple is also rumored to be launching this year. What that could mean for the fate of the \"iPhone 8\" remains unclear, but not starting production until September would leave supplies limited for a fall launch.\nFinally, the report goes on to claim that the tenth-anniversary edition iPhone will use \"biometric authentication systems such as ultrasound\", adding to the possible mix of facial recognition and iris scanning technologies also rumored to be in the works. Apart from the edge-to-edge display supplied by Samsung, other features more widely expected for the \"iPhone 8\" include some form of wireless charging and a glass body.",
        "sentiment": 0.05103572395940622
    },
    "article_19": {
        "title": "Apple seemingly ends support for 32-bit devices with iOS 10.3.2",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nWith the release of iOS 10.3.2 beta, Apple is not offering iTunes restore images for 32-bit devices like the iPhone 5 and fourth-generation iPad, suggesting the forthcoming point update will mark a watershed for iOS.\nAs seen in the screenshot above, taken from Apple's developer downloads webpage, the latest iOS 10.3.2 beta version issued on Tuesday only contains restore images for 64-bit devices. While not a definitive signal that 32-bit devices are on their way out, the lack of such assets suggests Apple is dropping support for older hardware architectures.\nAs noted by The Apple Post, Apple is not providing restore images for iPhone 5, iPhone 5c or the fourth-gen iPad, all of which were supported by yesterday's iOS 10.3 release. The iPhone 5, 5c and iPad 4 each use a variant of the A6 system-on-chip, the last of Apple's mobile processors built on a 32-bit architecture.\nThe launch of Apple's A7 SoC with iPhone 5s in 2013 marked the beginning of the end for 32-bit hardware, and consequently 32-bit apps. A year after iPhone 5s debuted, Apple alerted developers of a new App Store policy that required app updates to include 64-bit versions as of June 2015.\nApple continues its push toward an all 64-bit future and last year began warning iOS 10 users that 32-bit apps might negatively impact system performance. More recently, users attempting to open 32-bit software in iOS 10.3 are met with the message, \"This app will not work with future versions of iOS,\" a clear indication that legacy apps are on their way out.\nWhether Apple intends to cut off support for 32-bit hardware with the forthcoming iOS 10.3.2 update remains unknown. Since the firmware is still in beta testing, Apple could opt to build in support at a later date.",
        "sentiment": -0.1998149381019175
    },
    "article_20": {
        "title": "Apple Online Store Going Down for 'Maintenance' Tomorrow Morning Ahead of Rumored Product Updates",
        "body": "Apple has updated its System Status page to indicate that its online store will be \"updated and unavailable\" due to \"maintenance\" tomorrow, Tuesday, March 21, between 3:00 a.m. and 8:30 a.m. Eastern Time.\nThe timing of the downtime is notable given that Apple is rumored to launch new products as early as this week. Moreover, Apple commonly issues press releases at 8:30 a.m. Eastern Time, which is exactly when the so-called \"maintenance\" update is scheduled to be completed.\nLast week, a well-known research firm that requested confidentiality told us that, based on their own sources, it expects Apple to announce new products later this month, most likely during this week.\nThe research firm did not say which products it expects Apple to announce, but rumors have widely suggested new iPad Pro models could be unveiled as early as this month, including updated 9.7-inch and 12.9-inch models and an all-new 10.5-inch iPad Pro, although the latter is less likely without an Apple event.\nAt this point, it remains unclear if the 10.5-inch iPad Pro is even ready, so its introduction could be delayed until a future Spring event or WWDC 2017. However, a press release would be appropriate for the more iterative updates expected for the 9.7-inch and 12.9-inch models, along with any other smaller announcements.\nGiven that it is already March 20, and that Apple usually invites the media to its launch events at least 10 days beforehand, an update to its online store accompanied by a press release is likely at this point if new products are imminent.\nJapanese blog Mac Otakara said Apple will host a March event to debut its new iPad Pro lineup, an iPhone SE with 128GB storage, new Apple Watch bands, and a red color option for iPhone 7 and iPhone 7 Plus, but an event this month is looking increasingly unlikely with only 11 days remaining in March.\nApple recently redesigned its System Status page to provide more granular details about the statuses of its services, so there is no precedence for the page foreshadowing new product announcements this way. Accordingly, it is certainly possible that the downtime will indeed be related to maintenance and nothing else.\n(Thanks, Nathan!)",
        "sentiment": -0.08427136422445376
    },
    "article_21": {
        "title": "Target Returns iPhone SE Stock Ahead of Apple's Rumored March Event",
        "body": "Target this week instructed its stores to return a number of iPhone SE models to Apple by today, March 1, according to a company memo obtained by MacRumors.\niPhone SE devices that are to be returned include six unlocked 16GB and 64GB models in Gold, Silver, Rose Gold, and Space Gray, and two Sprint models.\nAn anonymous employee informed us that her Target store had not received iPhone SE stock since before the iPhone 7 was announced in September 2016.\nWhile there are many possible reasons for Target to send back iPhone SE stock, such as poor sales of select models, the move comes just days or weeks before Apple's rumored March event, where a 128GB iPhone SE may be announced. However, no other hardware changes have been rumored.\nKGI Securities analyst Ming-Chi Kuo said an iPhone SE refresh is unlikely in the first half of this year, so fans of Apple's lower-priced smartphone shouldn't set their hopes too high about a second-generation model yet. The original iPhone SE, which starts at $399, was introduced in March 2016.\nEven without a full refresh, one possible scenario is that Apple could begin selling the iPhone SE in 32GB and 128GB capacities, doubling the storage space of the current 16GB and 64GB models, going forward.",
        "sentiment": 0.0175863413605839
    },
    "article_22": {
        "title": "Apple launches new 9.7-Inch iPad for $329",
        "body": "watch now\nApple on Tuesday announced a new version of its 9.7-inch iPad, and a special edition of the iPhone 7 and iPhone 7 Plus. The new red aluminum iPhone is part of Apple's decade-long (RED) campaign, which contributes to the Global Fund to fight AIDS. The new phone starts at $749 and will hit stores Friday. Apple said it's the world's largest corporate donor to the Global Fund, contributing more than $130 million.\nApple releases an iPhone 7 Special Edition in Red. Source: Apple\nThe $329 updated iPad comes with a brighter display, Touch ID, worldwide LTE support, the A9 chip and iOS 10. A year ago, Apple released the 9.7-inch iPad Pro, priced from $599, which featured Apple Pencil compatibility and an improved display. The company on Tuesday also announced a free new app, Clips, that helps users combine video clips, photos and music to be shared through messages and social media. Clips, which will be available in April on iOS 10.3, has \"artistic filters\" shapes and emojis. The app automatically recognizes people in the video and suggests them as recipients of the messages, Apple said. The app pulls in elements that are popular in Instagram, Snapchat, Vine, Google Photos and Musical.ly.\nApple introduces Apple Clips. Source: Apple\nOn top of the new products, Apple also announced new silicon and leather case colors for the iPhone 7 and iPhone 7 Plus and expanded storage capacity for the iPhone SE. It also added new watch bands for spring, with colors like berry, pollen, sapphire, azure, orange and red. Nike watch bands can now be sold separately, and new luxury Hermes bands were released in \"bleu,\" lime and other styles. The company is also doubling down on its learn-to-code app, Swift Playgrounds, which it released in simplified Chinese, Japanese, French, German and Latin American Spanish. Apple is investing heavily in recruiting new developers, aiming to double its software and services revenue by the end of 2020. Mainland China was one of the fastest-growing areas for the iPad last quarter. And while Apple also added more capacity to the iPad Mini 4, it not longer promotes the iPad Mini 2 on its iPad landing page. Apple shares closed at an all-time high of $141.46 a share on Monday, and inched higher in morning trading. — Reporting by CNBC's Josh Lipton and Sally Shin\nWATCH: CNBC puts the first-generation iPhone to the test",
        "sentiment": 0.22712051961570978
    },
    "article_23": {
        "title": "Apple no longer allows developers to advertise pricing info such as ‘Free’ in app titles",
        "body": "Apple is apparently ramping up its efforts to clean up the App Store. According to a report from VentureBeat, Apple has started rejecting applications which tout their price in the name, icons, screenshots, or previews…\nApple has reportedly gradually started this practice over the last month. In the past, Apple has discouraged developers from highlighting an app’s price in titles, but it has not gone as far as to reject apps that do so.\nIf a developer attempts to submit an application for review that contains the word “Free” in the name of the app, they will be presented with an error message. The message explains that price is not considered part of metadata and thus cannot be included in an app’s name, icons, screenshots, or previews. Instead, Apple suggests that developers highlight prices and discounts in the app’s description.\nBelow is the full error message:\nYour app’s name, icons, screenshots, or previews to be displayed on the App Store include references to your app’s price, which is not considered a part of these metadata items. Please remove any references to your app’s price from your app’s name, including any references to your app being free or discounted. If you would like to advertise changes to your app’s price, it would be appropriate to include this information in the app description. Changes to your app’s price can be made in the Pricing and Availability section of iTunes Connect.\nSince the inception of the App Store, developers have regularly touted if an app is free in its title in an effort differentiate from competitors. While an Apple spokesperson has confirmed that pricing information is no longer allowed in app names, the company didn’t offer a specific reason for the policy change.\nApple has been working to clean up the App Store over the last year. In September, the company started removing apps in deemed “problematic and abandoned.” It was later revealed that Apple’s purge of the App Store removed almost 50,000 applications over the course of a month – a 238 percent increase compared to how many apps are normally removed in a month.\nDo you think Apple is making the right move by stopping developers from touting pricing in metadata? Let us know down in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.47100692036512654
    },
    "article_24": {
        "title": "Apple Tops 'Tech Support Showdown' List for Third Consecutive Year",
        "body": "Apple has topped Laptop Mag's Tech Support Showdown list for the third year in a row, receiving praise as \"the best tech support in the business,\" and beating out nine other computer-making companies in the process. Laptop Mag said that its list is aimed at helping customers see who has the most reliable and clear customer service in the tech industry.\nTo conduct the research, the magazine sent reporters undercover to make calls, query support chat online, and ask questions on social media, and accumulated data on the following top ten notebook makers: Apple, Microsoft, Acer, Razer, Dell, Lenovo, HP, Asus, Samsung, and MSI. Each company was given a grade on a 100-point scale, and Laptop Mag weighted 60 points towards online support and 40 points toward phone support.\nFor Apple's winning spot, the company received a 56 for its web support score and a 37 for its phone support score, resulting in an overall mark of 93 for the Cupertino company's tech support in 2017.\nLaptop Mag went more in-depth about its experience with Apple support in various forms, discussing a six minute response time from the @AppleSupport Twitter account and a positive, snappy experience with the new Apple Support iOS app. The site also put Apple to the test by calling three separate customer service reps to test their knowledge of the newest changes to macOS and the Touch Bar on the MacBook Pro.\nCall 1: Hayley then instructed me to disable iCloud Drive, and explained how to keep a local copy of the files. During the 2 minutes it took to download the files, I chatted with Hayley about the weather down in Florida, as he was positive and easy to talk to. At the end of our chat, I asked if there was some way to turn iCloud Desktop and Documents off without disabling iCloud Drive. Hayley said there was not, which is, unfortunately, not the case. The call took 8 minutes in total. Call 2: My next call connected me to Frank in Oregon, who explained that the physical fn key makes the Touch Bar show the Function keys. Frank also showed me how to set specific apps to use the Function keys in the Touch Bar, and he needed to place me on hold to ask colleagues if I could do the same for Finder. After telling me that there was no such option, Frank directed me to a feedback page where I could ask Apple to add this option in a future version. In total, the call took 15 minutes, but Frank solved my main question in only 3 minutes. Call 3: My last call connected me with the upbeat and chipper Letasha, who showed me the icon in the dock and menu bar that you click to activate Siri. Before we concluded, Letasha explained how to change the keyboard command used to start Siri. The call lasted 7 minutes. On average, it took Apple's reps 6 minutes per call to get answers — a minute less than its time last year.\nUltimately, Laptop Mag noted that while the customer service reps might have a few spots of incorrect knowledge about Apple's software and hardware, they still \"provided solutions in a speedy and positive manner.\" While Apple's web score was unrivaled at 56, the company's phone score of 37 was beat out by Acer at 38 points. In total, Acer came in second with a total score of 88 points, making it the \"top-rated Windows PC vendor for support\" and gaining ground on Apple's number one spot.\nIf Apple wants to improve its support, it should ensure support techs learn about all of the new features so that they can give completely accurate answers to questions on topics such as iCloud Documents. Its Twitter account could also improve by providing answers directly, instead of linking to posts where the content is found. Overall, though, Apple offers the best support of any laptop manufacturer, as it has for many years.\nLast November, Apple won the \"Gold\" #Customer award for its helpful responses from @AppleSupport on Twitter. According to Twitter, Apple ranked #1 among support accounts for average engagements and average engagements for followers, racking up 150,000 likes and retweets since its launch in March 2016.\nOn Twitter, users can ask Apple questions between 5:00 a.m. and 8:00 p.m. Pacific Time, and the company's support team normally responds within a few minutes. Although Laptop Mag said that it didn't award Apple \"any points for finally creating a Twitter support account,\" the site noted that it's one of the best parts of Apple's expansive customer support system and it applauded \"the team running that account for the timely, helpful replies.\"\nCheck out Laptop Mag's full report on Apple's customer service performance right here.",
        "sentiment": 0.11760925777977513
    }
}