{
    "article_0": {
        "title": "Apple switches from Bing to Google for Siri web search results on iOS and Spotlight on Mac",
        "body": "Apple is switching the default provider of its web searches from Siri, Search inside iOS (formerly called Spotlight) and Spotlight on the Mac. So, for instance, if Siri falls back to a web search on iOS when you ask it a question, you’re now going to get Google results instead of Bing. Updated below with a statement from Microsoft.\nConsistency is Apple’s main motivation given for switching the results from Microsoft’s Bing to Google in these cases. Safari on Mac and iOS already currently use Google search as the default provider, thanks to a deal worth billions to Apple (and Google) over the last decade. This change will now mirror those results when Siri, the iOS Search bar or Spotlight is used.\n“Switching to Google as the web search provider for Siri, Search within iOS and Spotlight on Mac will allow these services to have a consistent web search experience with the default in Safari,” reads an Apple statement sent this morning. “We have strong relationships with Google and Microsoft and remain committed to delivering the best user experience possible.”\nThis will change on iOS for the ‘I don’t know what you’re asking but here are web results’ Siri behavior as well as intentional ‘hey, Siri, search the web for…’ queries.\nThe search results include regular ‘web links’ as well as video results. Web image results from Siri will still come from Bing, for now. Bing has had more than solid image results for some time now so that makes some sense. If you use Siri to search your own photos, it will, of course, use your own library instead. Interestingly, video results will come directly from YouTube.\nAll of the search results that you see in these different cases will come directly from the search API, which means you’ll be getting the raw, ranked search results that start below all of the ads and Knowledge Graph stuff that appears on a regular Google home page. Worth noting, of course, that once you’ve clicked on a YouTube video, you’re still going to get served ads, so there is a revenue driver here for Google, even if it’s not direct.\nAs is expected with Apple now, searches and results are all encrypted and anonymized and cannot be attributed to any individual user. Once you click on the ‘Show Google results’ link, of course, you’re off to Google and its standard tracking will apply. Clicking directly on a website result will take you straight there, not through Google.\nThe timing of this rollout is interesting, coming after iOS has been released, but makes some sense given that High Sierra is releasing today. Mixing data providers like this is not unprecedented. Maps uses dozens of data providers including Yelp, Foursquare, Garmin and Tripadvisor for different locales and data types.\nBut, of course, this change has an additional dimension of interest given the years-long saga of Google being default on Apple devices including the iPhone. Google has famously made a bunch of money from iOS because of default search and because its apps and services are popular. At times those figures appeared to even exceed the amount of money that Google had made from Android.\nOne question that I do not have the answer to is whether this change comes completely from Apple wanting consistent results or whether it is a condition of the ~$3B deal that Google has in place to remain the default search provider on Apple devices. Perhaps a blend of the two.\nThe changes began rolling out at 9am PT and should roll out to the entire world by this afternoon.\nUpdate: A Microsoft spokesperson provided the following comment when asked about the altered shape of Bing on iOS.\nWe value our relationship with Apple and look forward to continuing to partner with them in many ways, including on Bing Image Search in Siri, to provide the best experience possible for our customers. Bing has grown every year since its launch, now powering over a third of all the PC search volume in the U.S., and continues to grow worldwide. It also powers the search experiences of many other partners, including Yahoo (Verizon), AOL and Amazon, as well as the multi-lingual abilities of Twitter. As we move forward, given our work to advance the field of AI, we’re confident that Bing will be at the forefront of providing a more intelligent search experience for our customers and partners.\nArticle updated to clarify that it’s Spotlight on the Mac, not Safari and that only Siri image results are Bing.",
        "sentiment": -0.10775501675465528
    },
    "article_1": {
        "title": "Apple does right by users and advertisers are displeased | Electronic Frontier Foundation",
        "body": "With the new Safari 11 update, Apple takes an important step to protect your privacy, specifically how your browsing habits are tracked and shared with parties other than the sites you visit. In response, Apple is getting criticized by the advertising industry for \"destroying the Internet's economic model.\" While the advertising industry is trying to shift the conversation to what they call the economic model of the Internet, the conversation must instead focus on the indiscriminate tracking of users and the violation of their privacy.\nWhen you browse the web, you might think that your information only lives in the service you choose to visit. However, many sites load elements that share your data with third parties. First-party cookies are set by the domain you are visiting, allowing sites to recognize you from your previous visits but not to track you across other sites. For example, if you visit first examplemedia.com and then socialmedia.com, your visit would only be known to each site. In contrast, third-party cookies are those set by any other domains than the one you are visiting, and were created to circumvent the original design of cookies. In this case, when you would visit examplemedia.com and it loads tracker.socialmedia.com as well, socialmedia.com would be able to track you an all sites that you visit where its tracker is loaded.\nWebsites commonly use third-party tracking to allow analytics services, data brokerages, and advertising companies to set unique cookies. This data is aggregated into individual profiles and fed into a real-time auction process where companies get to bid for the right to serve an ad to a user when they visit a page. This mechanism can be used for general behavioral advertising but also for “retargeting.” In the latter case, the vendor of a product viewed on one site buys the chance to target the user later with ads for the same product on other sites around the web. As a user, you should be able to expect you will be treated with respect and that your personal browsing habits will be protected. When websites share your behavior without your knowledge, that trust is broken.\nSafari has been blocking third-party cookies by default since Safari 5.1, released in 2010, and has been key to Apple’s emerging identity as a defender of user privacy. Safari distinguished between these seedy cookies from those placed on our machines by first parties - sites we visit intentionally. From 2011 onwards, advertising companies have been devising ways to circumvent these protections. One of the biggest retargeters, Criteo, even acquired a patent on a technique to subvert this protection . Criteo, however, was not the first company to circumvent Safari's user protection. In 2012, Google paid 22.5 million dollars to settle an action by the FTC after they used another workaround to track Safari users with cookies from the DoubleClick Ad Network. Safari had an exception to the third-party ban for submission forms where the user entered data deliberately (e.g. to sign up). Google exploited this loophole when Safari users visited sites participating in Google's advertising network to set a unique cookie.\nThe new Safari update, with Intelligent Tracking Prevention, closes loopholes around third-party cookie-blocking by using machine learning to distinguish the sites a user has a relationship with from those they don’t, and treating the cookies differently based on that. When you visit a site, any cookies that are set can be used in a third-party context for twenty-four hours. During the first twenty-four hours the third-party cookies can be used to track the user, but afterward can only be used to login and not to track. This means that sites that you visit regularly are not significantly affected. The companies this will hit hardest are ad companies unconnected with any major publisher.\nAt EFF we understand the need for sites to build a successful business model, but this should not come at the expense of people's privacy. This is why we launched initiatives like the EFF DNT Policy and tools like Privacy Badger. These initiatives and tools target tracking, not advertising. Rather than attacking Apple for serving their users, the advertising industry should treat this as an opportunity to change direction and develop advertising models that respect (and not exploit) users.\nApple has been a powerful force in user privacy on a mass scale in recent years, as reflected by their support for encryption, the intelligent processing of user data on device rather than in the cloud, and limitations on ad tracking on mobile and desktop. By some estimates, Apple handles 30% of all pages on mobile. Safari's innovations are not the silver bullet that will stop all tracking, but by stepping up to protect their users’ privacy Apple has set a challenge for other browser developers. When the user's privacy interests conflict with the business models of the advertising technology complex, is it possible to be neutral? We hope that Mozilla, Microsoft and Google will follow Apple, Brave and Opera's lead.",
        "sentiment": -0.2633725001574739
    },
    "article_2": {
        "title": "Apple Responds to Safari 11 Criticism From Advertising Groups: 'People Have a Right to Privacy'",
        "body": "Six trade and marketing organizations this morning published an open letter to Apple asking the company to \"rethink\" plans to launch new versions of Safari in iOS and macOS that block cross-site tracking, and this afternoon, Apple offered up a response, which was shared by The Loop.\nAccording to Apple, ad tracking companies are essentially able to recreate a person's web browsing history using cross site tracking techniques sans permission, something it's aiming to stop.\n\"Apple believes that people have a right to privacy - Safari was the first browser to block third party cookies by default and Intelligent Tracking Prevention is a more advanced method for protecting user privacy,\" Apple said in a statement provided to The Loop. \"Ad tracking technology has become so pervasive that it is possible for ad tracking companies to recreate the majority of a person's web browsing history. This information is collected without permission and is used for ad re-targeting, which is how ads follow people around the Internet. The new Intelligent Tracking Prevention feature detects and eliminates cookies and other data used for this cross-site tracking, which means it helps keep a person's browsing private. The feature does not block ads or interfere with legitimate tracking on the sites that people actually click on and visit. Cookies for sites that you interact with function as designed, and ads placed by web publishers will appear normally.\"\nIn the open letter, signed by the Data and Marketing Association and the Network Advertising Initiative, among others, the collective \"digital advertising community\" said it is \"deeply concerned\" because the update \"overrides and replaces existing user-controlled cookie preferences\" before going on to suggest that customers prefer targeted ads.\n\"Apple's unilateral and heavy-handed approach is bad for consumer choice and bad for the ad-supported online content and services consumers love,\" reads the letter. \"Blocking cookies in this manner will drive a wedge between brands and their customers, and it will make advertising more generic and less timely and useful.\"\nIn both macOS High Sierra and iOS 11, the Safari web browser is gaining new privacy features to prevent companies from tracking customer web browsing habits across websites. \"The success of the web as a platform relies on user trust,\" Apple says on the WebKit blog. \"Many users feel that trust is broken when they are being tracked and privacy-sensitive data about their web activity is acquired for purposes that they never agreed to.\"\nIn iOS 11, the toggle to turn off cross-site tracking is available by going to Settings --> Safari --> Prevent Cross-Site Tracking. With macOS High Sierra, the feature can be accessed by going to the Preferences section of the Safari app, choosing Privacy, and then checking \"Prevent Cross-Site Tracking.\"\niOS 11 will be released to the public next Tuesday, September 19, while macOS High Sierra will be released on the following Monday, September 25.",
        "sentiment": -0.3189065705108292
    },
    "article_3": {
        "title": "With the iPhones and iOS taking the limelight for the past week, let's not forget that tomorrow is the public release of macOS High Sierra",
        "body": "New mailbox features\nEasily unsend an email you just sent, schedule messages to be sent whenever you like, and get reminders to follow up or come back to a message later. You can also add rich links so your email has even more details at a glance. And if you forget to include an attachment or a recipient, Mail will catch those mistakes and ask if you want to add what’s missing.",
        "sentiment": 0.32699257135391235
    },
    "article_4": {
        "title": "Tim Cook says Apple is donating $1 million to earthquake recovery efforts in Mexico",
        "body": "Following the devastating 7.1 magnitude earthquake that struck Mexico City and surrounding areas on Tuesday, CEO Tim Cook has announced today that Apple will be contributing $1 million to recovery efforts in the country…\nTim Cook made the announcement in a tweet this afternoon, saying that “Mexico’s resilience is in its strength.” Earlier this week Cook offered thoughts and prayers to those affected by the earthquake:\nOur thoughts are with all those affected by the earthquake that Mexico suffered today. Praying for our friends and colleagues. While there is life there is hope. Mexico’s resilience is its strength. Apple is contributing $1M to recovery efforts.\nFollowing Hurricane Harvey’s devastation last month, Tim Cook said that Apple was donating $2 million to relief efforts while also matching employee donations two-for-one. The company later donated $5 million to Hand in Hand for Hurricane Irma and Harvey recovery efforts.\nMexico City was struck by a 7.1 magnitude earthquake on Tuesday afternoon, wrecking havoc on the city and surrounding areas. According to Reuters, the most recent death toll was at least 233 with over 1,900 injuries. The quake is the deadliest to hit Mexico in the last 32 years.\nMore than 50 survivors have been plucked from disaster sites in Mexico City since Tuesday afternoon’s 7.1-magnitude quake, and first responders, volunteers and spectators joined in chants of “Yes we can!” The death toll was at least 233, revised down from 237 earlier on Thursday, according to Mexico’s head of civil protection Luis Felipe Puente. In Mexico City 1,900 were injured.\nTim Cook’s tweets can be seen below:\nMientras hay vida, hay esperanza. Mexico’s resilience is its strength. Apple is contributing $1M to recovery efforts. #FuerzaMexico 🇲🇽 — Tim Cook (@tim_cook) September 21, 2017\nNuestros pensamientos están con todos los afectados por el terremoto que sufrió México hoy. Rezando por nuestros amigos y colegas. 🇲🇽 — Tim Cook (@tim_cook) September 19, 2017\nCheck out 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.3526479523806345
    },
    "article_5": {
        "title": "Ming-Chi Kuo does it again and 100% nailed the iPhone 8 and iPhone X and features back in February",
        "body": "Ming-Chi Kuo is an analyst with KGI Securities, which is a Taiwanese business group involved in a range of industries. Kuo covers technology with a focus on Apple.\nHis strong track record predicting Apple’s products and plans over the last several years has earned him titles like “The Most Accurate Apple Analyst in the World” and “The Analyst Who Reveals all of Apple’s Secrets.”\nIn 2011 Kuo started a string of correct predictions with the delayed white iPhone 4 release in April. Other claims about the 2012 MacBook Pro with Retina display and Touch ID and more iPhone 5s details in 2013 were also accurate.\nMore recently he correctly forecasted details about the iPhone SE as well as the Apple Watch Series 2 last year.\nImage via DigiTimes",
        "sentiment": 0.3814196524520715
    },
    "article_6": {
        "title": "TIL Apple products come with at least a partially charged battery because Steve Jobs noticed how consumers were frustrated to not being able to use their new toys because they had to wait to charge them first.",
        "body": "What Steve Jobs Taught Google’s Tony Fadell About Designing Simple Products\nFlickr user TED Conference\nAt the TED conference in Vancouver this year, one of the main designers of the iPod and founder of Nest, Tony Fadell, gave a few simple tips about creating awesome products. While most of us won’t be working on the next world-wide gadget phenomenon, his tips, especially those from the late great Steve Jobs, seemed delightfully practical for all sorts of projects.\nSince his time at Apple, Fadell has gone on to create the Nest thermostat and is now a lead designer at Google.\n1). “Staying Beginner”\nJobs insisted that his design team “stay beginner”: walk in the shoes of someone who has never experienced a product before. When a new Apple product came out, Fadell would wait in long lines at an Apple store, purchase it at the counter like everyone else, unbox it and try to get it working.\nThough he may have been involved in every aspect of the iPod, taking the trek of the consumer taught him to notice the little frustrations that can destroy an otherwise good idea.\nAs an example, he talked about shipping a product with a charged battery. Only a few years ago, it was all-to-common to unwrap a new MP3 player with the glee of christmas morning, only to find out we had to wait a few hours to charge the device.\nThis is a piss-poor first impression for a product. Now, Apple products, he says, come with at least a partially charged battery. The act of “staying beginner” helps us see the frustrations that we otherwise resign ourselves to believing are fate.\n“The more we’re exposed to something,” Fadell said, “the more we get used to it”.\nBreaking out of the mold by walking in a consumer’s shoes gives a new perspective.\n2). Put Young People on the team\n“If you have those young minds, they cause everyone to think young,” Fadell said. Young workers’ naïveté, he argues, is an asset. They don’t accept all the assumptions that we’ve become habituated to making. Even if their suggestions are completely unrealistic, they force all of the older folks on the team to question unexpected assumptions.\nThe data seems to support this idea that young people can be extraordinary for innovation. This year, there were a record 46 billionaires under the age of 40 on Forbes famous list of the rich and famous, mostly from technology. Snapchat’s Evan Spiegel, for instance, is a billionaire at just 24 years old.\nTechnology and the app economy has given young minds the ability to create products without permission — and, as a result, many have thrived.\nStaying beginner and staying young: two simple, practical ideas.",
        "sentiment": 0.25971627747640014
    },
    "article_7": {
        "title": "Apple says iPhone 7 and iPhone 8 do not contain FM radios or antennas, in response to FCC request",
        "body": "Apple has issued its first public response to growing pressure by the FCC and other groups to activate FM terrestrial radio features inside iPhones for end-users. In a statement, the company said it cares deeply about the safety of its users and directed users towards its emergency calling and Medical ID features.\nIt is not possible. iPhone 7 and iPhone 8 models do not have FM radio chips in them nor do they have antennas designed to support FM signals — Philip Schiller (@pschiller) September 28, 2017\nIt also revealed that is technically impossible for iPhone 7 and iPhone 8 to serve as an FM radio anyway, as they lack chips and antennas to support the signal.\nAlthough the statement doesn’t say it directly, it is pretty obvious that Apple is not interested in developing or supporting FM radio features for its devices.\nIn fact, it is taking the argument off the table by designing its newer phones in such a way that it could not add an FM radio even if it wanted to.\nApple does not address the technical feasibility of adding a FM radio to older devices, like the iPhone 6s which it still sells at the Apple Store. Of course, whilst it is believed to be possible on older phones, Apple has shown no interest in enabling terrestrial radio features.\nThe FCC referred to FM’s ability to broadcast information in light of the devastation caused by the recent hurricanes. Apple pointed to the presence of government emergency notifications on iOS, which serve as a reasonable alternative source for the same information. This includes weather warnings and AMBER alerts.\nUsers can check to see if they have these critical alerts enabled by going to Settings → Notifications on their iPhone and scrolling to the bottom of the list to find the ‘Government Alerts’ section. Just flick the switches to green to receive these alerts on your lock screen as they come in.\nUsers interested in listening to the radio can use the Radio section in Apple Music or the new Radio app in watchOS 4.1. It includes news stations like NPR as well as the music stations.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.16893389492350466
    },
    "article_8": {
        "title": "Apple will skip 'S' moniker, iPhone 8, iPhone 8 Plus and iPhone Edition to be unveiled on 12 September",
        "body": "A recent report from 9to5Mac suggests we've been calling the upcoming trio of iPhones the wrong name this whole time. While we've been referring to them as iPhone 7S, 7S Plus and iPhone 8, they will, according to Seth Weintraub, be iPhone 8, iPhone 8 Plus and iPhone Edition.\nPOCKET-LINT VIDEO OF THE DAY\nHis claim comes after speaking with case vendors at IFA in Berlin, one of which is a major supplier to Apple Stores, while the other has a large presence online. One of the case manufacturers has renamed its own internal SKUs, the code that identifies a company's products.\nWe've been referring to the new standard iPhones as 7S and 7S Plus, not just because of rumours but because of Apple's naming system ever since the iPhone 3GS. Moving on straight to iPhone 8 will mark the first time the 'S' moniker will be skipped.\nThe iPhone Edition meanwhile is set to be a much more premium device, with an all-front OLED screen, advanced facial recognition technology, a dual camera and for the first time on an iPhone, no Touch ID home button. It is also claimed that the iPhone Edition will support Qi wireless charging, although at a reduced rate.\nIt is therefore plausible that this model will have a special name, such as iPhone Edition. It's not the first time we've heard it called something other than iPhone 8, as it has also been referred to as iPhone X.\nWe won't know for sure what Apple intends to call the new models until the official unveiling on 12 September. With the launch being so close, we thought the majority of rumours had dried up, this goes to show that when it comes to Apple, nothing is certain.",
        "sentiment": -0.28978255577385426
    },
    "article_9": {
        "title": "Apple releases iOS 11.0.1 software update for iPhone and iPad",
        "body": "Apple has released the first software update to iOS 11 with iOS 11.0.1 for iPhone and iPad. The build comes in at 15A402 (or 15A403), up from 15A372 for iOS 11.0.\nAs a bug fix and performance improvements update, we don’t expect any feature changes in this release. These updates typically make everything run smoother and potentially help with battery life and any lingering bugs.\niOS 11.0.1 comes one week after the launch of iOS 11.0, a major update for iPad that includes loads of new features and changes for iPhone as well.\nDevelopers and public beta testers running iOS 11 may need to remove the beta profile from Settings → General → Profiles then reboot to see the latest official software update.\nToday’s release notes highlight “bug fixes and improvements for your iPhone or iPad.” We’ll update with any noticeable differences below.\niOS 11.0.1 mostly focus on Camera and Photos app. There's also some improvements for iMessage App Explorer and Springboard too. pic.twitter.com/pJkzmnKnLY — Filipe Espósito  (@filipekids) September 26, 2017\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.10643050918588415
    },
    "article_10": {
        "title": "The iPhone X’s notch is basically a Kinect - The Verge",
        "body": "Sometimes it's hard to tell exactly how fast technology is moving. \"We put a man on the moon using the computing power of a handheld calculator,\" as Richard Hendricks reminds us in Silicon Valley. In 2017, I use my pocket supercomputer of a phone to tweet with brands.\nBut Apple's iPhone X provides a nice little illustration of how sensor and processing technology has evolved in the past decade. In June 2009, Microsoft unveiled this:\nIn September 2017, Apple put all that tech in this:\nWell, minus the tilt motor.\nMicrosoft's original Kinect hardware was powered by a little-known Israeli company called PrimeSense. PrimeSense pioneered the technology of projecting a grid of infrared dots onto a scene, then detecting them with an IR camera and acsertaining depth information through a special processing chip.\nThe output of the Kinect was a 320 x 240 depth map with 2,048 levels of sensitivity (distinct depths), based on the 30,000-ish laser dots the IR projector blasted onto the scene in a proprietary speckle pattern.\nIn its day, the Kinect was the fastest selling consumer electronics device of all time, while it was also widely regarded as a flop for gaming. But the revolutionary depth-sensing tech ended up being a huge boost for robotics and machine vision.\nIn 2013, Apple bought PrimeSense. Depth cameras continued to evolve: Kinect 2.0 for the Xbox One replaced PrimeSense technology with Microsoft's own tech and had much higher accuracy and resolution. It could recognize faces and even detect a player's heart rate. Meanwhile, Intel also built its own depth sensor, Intel RealSense, and in 2015 worked with Microsoft to power Windows Hello. In 2016, Lenovo launched the Phab 2 Pro, the first phone to carry Google's Tango technology for augmented reality and machine vision, which is also based on infrared depth detection.\nAnd now, in late 2017, Apple is going to sell a phone with a front-facing depth camera. Unlike the original Kinect, which was built to track motion in a whole living room, the sensor is primarily designed for scanning faces and powers Apple’s Face ID feature. Apple’s “TrueDepth” camera blasts “more than 30,000 invisible dots” and can create incredibly detailed scans of a human face. In fact, while Apple’s Animoji feature is impressive, the developer API behind it is even wilder: Apple generates, in real time, a full animated 3D mesh of your face, while also approximating your face’s lighting conditions to improve the realism of AR applications.",
        "sentiment": 0.4845967506499667
    },
    "article_11": {
        "title": "iPhone 8 Plus reportedly splits open while charging, another claimed to arrive in same state",
        "body": "A Taiwanese iPhone 8 Plus owner has claimed that her device split open while being charged with the supplied cable and plug adapter. She posted photos which show damage consistent with a swollen battery.\nA Japanese owner has posted similar photos of his device, which he says arrived in this state …\nThe first device affected is being examined by Apple, reports ifeng (via TNW).\nThe phone belonged to a Ms. Wu, who recently renewed her phone contract and purchased a 64GB rose gold iPhone 8 Plus. The issue emerged five days after purchasing the phone. Wu placed her phone on charge, using the supplied cable and adaptor. After three minutes, she reported seeing the front panel bulge, and eventually lift completely from the device. According to multiple Taiwanese outlets, the phone was later recovered by the carrier, and has since been shipped to Apple for analysis.\nSome media reports are describing it as an ‘explosion,’ but there is no visible evidence of any burn marks, and much more extensive damage would be expected were this the case.\nThe Japanese owner tweeted photos of the damage to his device.\nWhile any incident affecting a new iPhone model is bound to attract media attention, it’s worth noting the usual disclaimers. First, any device manufactured in the millions will include some faulty models – the real news would be if this were not the case. Second, investigations into charging-related incidents often reveal that a third-party charger was used, even when an owner initially claims to have used the supplied Apple one.\nAny device with a swollen battery should be immediately removed to a safe place, as it can indicate a lithium battery at risk of bursting into flames.\nWe understand that Apple is aware only of these two instances, and that it always carefully investigates safety-related reports.\nCheck out 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.3413248757886536
    },
    "article_12": {
        "title": "Apple Acknowledges Siri Leadership Has Officially Moved From Eddy Cue to Craig Federighi",
        "body": "Apple has updated its executive leadership page to acknowledge that software engineering chief Craig Federighi now officially oversees development of Siri. The responsibility previously belonged to Apple's services chief Eddy Cue.\nCraig Federighi is Apple’s senior vice president of Software Engineering, reporting to CEO Tim Cook. Craig oversees the development of iOS, macOS, and Siri. His teams are responsible for delivering the software at the heart of Apple’s innovative products, including the user interface, applications and frameworks.\nApple's leadership page is only now reflecting Federighi's role as head of Siri, but the transition has been apparent for several months, based on recent interviews and stage appearances at Apple's keynotes.\nAt WWDC 2016, for example, Federighi and Apple marketing chief Phil Schiller joined Daring Fireball's John Gruber to discuss how Apple was opening Siri up to third-party developers with SiriKit later that year.\nAt WWDC 2017, Federighi was on stage to discuss improvements to Siri in iOS 11, including more natural voice, built-in translation capabilities, and advances in machine learning and artificial intelligence.\nCue continues to oversee the iTunes Store, Apple Music, Apple Pay, Apple Maps, iCloud, and the iWork and iLife suites of apps, and handing off Siri should allow him to focus more on Apple's push into original content.\nApple's updated leadership page also now lists profiles for recently promoted employees Deirdre O'Brien, Vice President of People, and Isabel Ge Mahe, Vice President and Managing Director of Greater China.",
        "sentiment": 0.40039767045527697
    },
    "article_13": {
        "title": "[PSA] Mac users who want to game on their Macs: you can get the GeForce Now for Mac beta for free and play games at 1080p @ 60+ fps. Games that are supported by GeForce Now are processed by GTX 1080s in the cloud",
        "body": "Tap into incredible PC gaming from your Mac and Windows PC and play at high resolutions and smooth frame rates. Just select games from your personal library of PC titles or purchase new ones from the digital store of your choice, like Steam® and Uplay™ PC. Log in and instantly play the biggest games, with new titles being added to the service continuously.",
        "sentiment": 0.2014803265531858
    },
    "article_14": {
        "title": "iOS 11 is available tomorrow",
        "body": "iOS 11 introduces a new way to help drivers stay more focused on the road with Do Not Disturb while driving. iPhone can detect when a user may be driving through vehicle movement or Bluetooth connections, and automatically silences notifications to keep the screen dark. Users have the option of sending an auto reply to their Favorites, contacts or recents to let them know they are driving and cannot respond until they arrive at their destination.",
        "sentiment": -0.040031835436820984
    },
    "article_15": {
        "title": "Ad industry complains Apple Safari update is 'unilateral and heavy-handed' against tracking",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nSix ad industry organizations have crafted an open letter complaining about changes coming to Apple's Safari browser, claiming that a new feature — \"Intelligent Tracking Prevention\" — will hurt both them and the public.\nThe technology's restrictions on cookies, including a 24-hour limit on ad retargeting, are \"opaque and arbitrary\" and could impact the \"infrastructure of the modern internet,\" Ad Week quoted the letter as saying. Some of the groups behind the statement include the Interactive Advertising Bureau, the American Advertising Federation, and the Data and Marketing Association.\n\"Apple's unilateral and heavy-handed approach is bad for consumer choice and bad for the ad-supported online content and services consumers love,\" the letter says. \"Blocking cookies in this manner will drive a wedge between brands and their customers, and it will make advertising more generic and less timely and useful. Put simply, machine-driven cookie choices do not represent user choice; they represent browser-manufacturer choice.\"\nIntelligent Tracking Prevention will be present in both iOS 11 and macOS High Sierra, launching Sept. 19 and 25, respectively. Apple has argued for the technology as an essential privacy measure, since people may not want their data captured for purposes they don't consent to.",
        "sentiment": -0.4112148847430944
    },
    "article_16": {
        "title": "iOS 11 makes it harder for someone else to get data off your phone",
        "body": "If someone takes your iPhone, can they get your data too?\nFor years, Apple has been working to make sure the answer is no. The iPhone’s local storage drive has strong encryption, and without a passcode or a fingerprint, there’s no way to get past the lockscreen. If the phone powers down or goes 48 hours without a login, it locks down even further, requiring a passcode to restart. It’s a huge problem for phone thieves — and, as the San Bernardino case demonstrated, makes life difficult for law enforcement too. It’s still possible to get cloud data held on Apple servers, and any data controlled by an app is another story — but if it’s stored locally on your phone, it’s tough to get without your permission.\nWith those protections in place, thieves and digital forensics experts have turned to the iPhone’s automatic backup system as the easiest way through. If your phone has registered your computer as a trusted device, it’s possible to trigger an automatic backup from the computer itself, which basically dumps all the phone’s data onto the computer in a nice package for investigators. Even if the computer isn’t a trusted device, all you need to establish a trusted device is a fingerprint login, which you could potentially spoof or 3D-print. Once you’ve made that login, you can pair the phone, dump the data, and start picking through.\nYou won’t be able to establish a pair with just a fingerprint; you’ll need the full passcode\nIn some ways, this sounds a lot like logging into the phone — but it gives a lot more access for a much longer span of time. Once a computer is registered as a trusted device for a particular phone, the computer can pull backups off that phone at any time in the future, even without logging in.\nThe process for establishing a trusted device is already a bit daunting — but with iOS 11, that system will get just a little bit tighter. A new post from ElcomSoft (which makes the forensic software that pulls data off those paired phones) details an overlooked feature in iOS 11 that will make that system a little bit harder to crack. Now, you won’t be able to establish a pair with just a fingerprint; you’ll need the full passcode, just as if you were unlocking the phone after a hard reset. It seems minor, but it’s potentially a serious problem for police, who are legally allowed to compel fingerprints but move into trickier legal territory when it comes to passcodes.\nIn the abstract, this is all something of a moot point. If you’re spoofing fingerprints, you’ve got enough to log into the phone itself (as long as it’s not locked down), at which point you can just open apps and get the data you need anyway. But backing up the phone to a trusted device is a huge part of modern forensics, and it’s one of the few ways for investigators to be sure they’ve gotten every piece of data they could. Under iOS 11, it will be harder to do that without the user’s permission, turning up the heat ever so slightly on the encryption debate.",
        "sentiment": -0.20159496627748014
    },
    "article_17": {
        "title": "Face ID works with sunglasses and can be disabled in a second to thwart thieves",
        "body": "Apple's new Face ID facial recognition feature will work with most sunglasses, according to Apple software engineering chief Craig Federighi.\n\"Most sunglasses let through enough IR light that Face ID can see your eyes even when the glasses appear to be opaque. It's really amazing!\" Federighi said in an email to MacRumors reader and developer Keith Krimbel (@yokeremote and @keithkrimbel on Twitter) who emailed the Apple exec with a list of questions this morning.\nWhile Apple's Face ID coverage has specifically said the feature works with hats, scarves, beards, glasses, makeup, and other items that might obscure the face, sunglasses were not specifically mentioned. Federighi's answer clears up one of the last major unknowns about Face ID.\nKrimbel also asked for details on what would prevent a thief from taking the iPhone X, pointing it at his face, and running off. In response, Federighi says there are two mitigations in place. \"If you don't stare at the phone, it won't unlock,\" he wrote. \"Also, if you grip the buttons on both sides of the phone when [you] hand it over, it will temporarily disable Face ID.\"\nIn addition to answering these questions, Federighi also commented on the now highly-publicized on-stage Face ID gaffe that saw the feature fail to recognize his face. According to Apple, the software failed because someone else had picked up the phone ahead of Federighi's demo. Federighi says it's not really an issue he had encountered before.\nThe bio-lockout that I experienced on stage would require several interacts by other people with your phone (where they woke up the phone). For those of us who have been living on the iPhone X over the last months this has never been a real problem (hence my shock when it happened to me on stage! :-)\nThe Face ID facial recognition feature is designed to replace Touch ID as the new de facto biometric authentication system. While it's limited to the iPhone X at this time, Apple has said it is the future of how we will unlock our smartphones.\nFor more on how Face ID scans your face, whether it can be fooled, how it works with Apple Pay, and the built-in privacy features, make sure to check out our Face ID post that covers all of the ins and outs of the new feature.",
        "sentiment": -0.20637561567127705
    },
    "article_18": {
        "title": "iPhone X: Six core A11 Fusion chip, wireless charging hints, Apple Pay + Face ID details, more",
        "body": "Update: Steve Troughton Smith clarifies the processor information:\nJust to clarify on the A11: it's two high-power Monsoon cores and four low-power Mistral cores, all independently addressable. No Fusion — Steve T-S (@stroughtonsmith) September 10, 2017\nLeaks continue today from the iOS 11 GM. Yesterday, we told you about iPhone X details such as the Face ID setup process, and now a handful of more details have emerged related to wireless charging, camera improvements, and more…\nWhile several reports have highlighted that the iPhone X will support wireless charging, the iOS 11 GM further corroborates that. Code strings show a few mentions of wireless charging in the ChargingViewService app. The strings here hint at some 3D animations that will show when the device is charging via wireless charging.\nPerhaps most notably, however, is that the code suggests that the new A11 Fusion chip is a six core processor. It appears as if Apple will pack four high performance, or “Mistral,” cores and two battery life efficient “Monsson” cores.\nFor comparison’s sake, the A10 Fusion processor in the iPhone 7 and iPhone 7 Plus pack two high performance cores and two high-efficiency cores. Meanwhile, the A10X in the iPad Pro features a 3+3 setup. This means that the new iPhone 8, iPhone 8 Plus, and iPhone X will be Apple’s most powerful iOS device by wide margin. Of course, one important thing to note here is that performance partially will depend on the clock speed of the processors, but either way we’re looking at a dramatic jump.\nAs far as the camera goes, the iOS 11 GM suggests that the iPhone 8 and iPhone X will support 4K video at 60 FPS, as well as 1080p video at 240 FPS. It was initially believed that these camera improvements would only apply to the flagship iPhone X, but the iOS 11 GM suggests it will come to both the iPhone 8 and iPhone X.\nFurthermore, it’s now believed that the new Portrait Lighting features will be available on both the iPhone 8 and iPhone X. As we reported yesterday, Portrait Lighting features settings for things like Contour Light, Natural Light, Stage Light, Stage Light Mono, and Studio Light. This feature will likely be related to flash and lighting during Portrait Mode shots.\nThe iOS 11 GM also offers a bit more information about the side power button, which is believed to be much larger on the iPhone X than on previous devices. It appears as if the power button will be integral to the Apple Pay process as Face ID will passively authenticate the payment, but you’ll have to double click the power button to confirm it.\nThe same code also hints that Face ID will come to the iPad at some point down the line. While this is likely a case of Apple future proofing the code, it’s still notable as it’s likely a look at what’s to come with next year’s iPad upgrades.\nThis is just the tip of the iceberg\nChargingViewService confirms wireless charging. It will even show some 3D animations when charging (not present in GM tho) pic.twitter.com/JLBd4HQLpS — Guilherme Rambo (@_inside) September 10, 2017\n4K 60fps and 1080p 240fps strings are also inside a generic \"d2x\" file. Probably will be available on iPhone 8 and X as well. pic.twitter.com/0p8CEOlBnM — Filipe Espósito  (@filipekids) September 10, 2017\nA11 Fusion is a 4+2 core device https://t.co/mqtIKcjBmG — Steve T-S (@stroughtonsmith) September 10, 2017\nAnd it appears that Face ID occurs automatically but you double click the side button to confirm payment pic.twitter.com/NcN0u9KKTt — Jeffrey Grossman (@Jeffrey903) September 10, 2017\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.06626954995509651
    },
    "article_19": {
        "title": "iPhone 8 Is World's Fastest Phone (It's Not Even Close)",
        "body": "Update 12/21: We've added results from the iPhone X.\nThe \"Bionic\" part in the name of Apple's A11 Bionic chip isn't just marketing speak. It's the most powerful processor ever put in a mobile phone. We've put this chip -- which powers the iPhone 8, iPhone 8 Plus and iPhone X -- to the test in both synthetic benchmarks and some real-world speed trials, and it obliterates every Android phone we tested.\nAs a quick primer, the A11 Bionic is a six-core CPU, with two performance cores that promise a 25-percent boost in performance and four high-efficiency cores that promise up to a 70-percent improvement over the iPhone 7's A10 Fusion chip. Last but not least is an Apple-designed GPU that's supposed to be 30 percent faster than before.\nLet's start with Geekbench 4, which measures overall performance. On the multicore portion of this test, the iPhone 8 hit 10,170. That's 54 percent faster than the score from Samsung's Galaxy Note 8 — currently the fastest Android phone. The iPhone X scored 10,357 on the same test.\nThe Android competition wasn't close. The Note 8 scored 6,564, and that's with an impressive 6GB of RAM paired with Qualcomm's fast Snapdragon 835 chip. How about the OnePlus 5 and its 8GB of RAM and Snapdragon 835? That handset got 6,542. With 4GB of RAM, the Galaxy S8 scored 6,295 with the same processor.\nThe iPhone 8 even edged out the score from the 13-inch Apple MacBook Pro with a 7th-generation Core i5 processor. That notebook notched 9,213. Is Geekbench 4 really comparable from phone to desktop? According to the founder of Geekbench, John Poole, “the short is answer is yes that the scores are comparable across platforms, so if an iPhone 8 scores higher than an i5, then the iPhone 8 is faster than the i5.”\nMORE: iPhone 8 Plus vs. Galaxy Note 8 Camera Face-Off - Why Apple Wins\nHowever, Poole provided the important caveat that laptops are better at delivering sustained performance over a longer period of time, as opposed to the shorter max burst performance that benchmarks like Geekbench 4 are designed to measure. In other words, the iPhone 8 simply doesn’t have the thermals and heat dissipation necessary to replace your laptop.\nNext up is 3DMark, which gauges graphics performance. The iPhone 8 scored an off-the-charts 62,212, and the iPhone 8 Plus managed an even higher 64,412. Compare that to the Note 8's 39,834 and the OnePlus 5's 39,576.\nIf you're wondering how all this translates to real-world performance, we have more good news for iPhone 8 shoppers — and bad news for everyone else. To really put the A11 Bionic chip through its paces, we put the same 2-minute video, shot in 4K by a drone, on the iPhone 8, Galaxy Note 8 and Galaxy S8+, and then added the same transitions and effects before exporting and saving the video.\nThe iPhone 8 and iPhone X finished this strenuous task in just 42 seconds, while the Note 8 took more than 3 minutes. The Galaxy S8+ took more than 4 minutes.\nHow about opening a large file? We downloaded a 5.1 MB map illustration PDF to both the iPhone 8 and Galaxy Note 8 and opened them from their native file managers: the Apple Files app and the My Files app. The iPhone 8 averaged under 0.8 seconds, while the Note 8 averaged 6.41 seconds.\nThe iPhone 8 also opened more demanding apps faster than its predecessor and the top Android phone right now, although those differences were less dramatic. It took the iPhone 8 11 seconds to fully load the Injustice 2 game, compared to 14.53 seconds for the iPhone 7 Plus and 19 seconds for the Note 8.\nOf course, there are lots of ways to measure performance, but based on our testing thus far, the iPhone 8 is easily the fastest phone ever. Now everyone else has to play catchup.\nIllustration: Tom's Guide/Shutterstock",
        "sentiment": 0.014170998228447779
    },
    "article_20": {
        "title": "Tim Cook says he stands behind the 250 Dreamers currently working for Apple",
        "body": "Tim Cook was among the top tech leaders who sat down with Trump ahead of inauguration in hopes of helping shape the new president’s tech policy. But like many of those who held a glimmer of hope for some post-election softening of campaign rhetoric, Apple’s CEO has found more than a few reasons to push back. In the wake of the violence in Charlottesville last month that ended in three deaths, Cook issued a statement highlighting his disagreement with Trump’s response.\nCook took to Twitter this morning, to expand on his support the Deferred Action for Childhood Arrivals (DACA) following news that Trump could end the program next week. Signed by President Obama in 2012, the “Dreamers” program protects undocumented young immigrants from threat of deportation. In his tweet, Cook explained that the company currently employs 250 Dreamers.\n250 of my Apple coworkers are #Dreamers. I stand with them. They deserve our respect as equals and a solution rooted in American values. — Tim Cook (@tim_cook) September 3, 2017\nTrump told the press this week that he’s been considering ending the program, with a press secretary adding that a decision would be announced on Tuesday of next week, just after the Labor Day holiday. The move would be an extension of the promises that fueled the President’s campaign from the outset, including including the kick-off event in which, he told the crowd that Mexico is “bringing drugs. They’re bringing crime. They’re rapists. And some, I assume, are good people.”\nNews that Trump was strongly considering ending the program prompted Cook, along with the heads of Amazon, Google, Netflix and other key tech companies to pen a letter this week asking Trump to continue DACA. “Dreamers are vital to the future of our companies and our economy,” the letter reads. “With them, we grow and create jobs. They are part of why we will continue to have a global competitive advantage.”\nThe letter noted the “780,000 hardworking young people” that would risk deportation, should DACA come to an end. With today’s tweet, Cook explained that the program is more than just abstract politics for the company. Ending it on Tuesday would have a tangible impact on Apple, along with the rest of the reported 72 percent of Fortune 500 companies that currently employ Dreamers.\nThe potential repeal has proven controversial even with leaders of Trump’s own party. On Friday, House Speaker Paul Ryan expressed concern about the move, telling reporters, “I actually don’t think he should do that. I believe that this is something that Congress has to fix.”",
        "sentiment": -0.004313355311751366
    },
    "article_21": {
        "title": "Leaked iOS 11 GM reveals several vibrant (and OLED black) new wallpapers and more",
        "body": "We’re only a few days from Apple’s big fall iPhone event, but the big news tonight is the leaked iOS 11 GM firmware that we received this evening. The iOS 11 GM firmware, which should be pushed next week to developers, includes several brand new wallpapers, three exclusive to the upcoming iPhone, including seven sure-to-be-popular retro-styled versions and an all-black wallpaper fit for OLED displays. Have a look at all of the new wallpapers inside…\nIn all, there are 16 new still wallpapers available on my iPhone 7 Plus. Wallpapers include several renditions of the Apple six color retro logo, along with six new flower wallpapers, and three new space wallpapers.\nWe are currently working on capturing a hands-on video to showcase each of these wallpapers in high resolution. Unfortunately, for fans of Live of Dynamic wallpaper, there are no new versions of those.\nWhat are you thoughts on the new iOS 11 wallpaper? Share your opinions down in the comment section.\nDownload full-res versions of the iPhone wallpapers here. iPad wallpapers can be found here.\nVideo walkthrough\nSubscribe to 9to5Mac on YouTube for more videos\nWe’re still digging around the leaked iOS 11 GM, but rest assured that we’ll share everything that we find as soon as we uncover it.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.040452976066332594
    },
    "article_22": {
        "title": "Apple isn't expected to catch up to iPhone X demand before first half of 2018",
        "body": "Apple isn't expected to catch up to iPhone X demand before first half of 2018\nArticle Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple is poised to be able to ship about 40 million iPhone X units before the end of 2017, which won't be nearly enough to meet consumer demand for the redesigned handset with edge-to-edge OLED display, according to analyst Ming-Chi Kuo.\nKuo, of KGI Securities, issued a note to investors on Friday, a copy of which was obtained by AppleInsider, offering positive reactions to the iPhone X unveiling earlier this week. Specifically, he believes that Apples facial recognition technology will set it apart from competitors, and the full-screen design and augmented reality advantages with iPhone X will further drive sales.\nIt's really just a question of how quickly Apple will be able to produce the iPhone X, as Kuo believes Apple won't be able to meet market demand before the first half of 2018.\nFurther, while he previously thought Apple might be able to build as many as 50 million iPhone X units before the end of this year, he has slashed that number down to about 40 million.\nAny handsets Apple is unable to build this year just translate to sales next year, however. Accordingly, Kuo has increased his 2018 shipment estimates to between 80 million and 90 million iPhone X units.\nRegarding Face ID, Kuo believes Apple's proprietary structured light technology will be able to provide a level of security that is consistent and acceptable. And he also said that users will be delighted with facial recognition capabilities integrated into new features like Animoji.\nHe also said that the iPhone X has the highest screen-to-body ratio on the market, which could make it the most appealing edge-to-edge handset available to consumers.\nAnd Apple's ARKit and new cameras and sensors on the iPhone X give it a significant lead in AR, marrying software and hardware integration into an experience that will be difficult for competitors to replicate.\nKuo cautioned that some investors may be concerned about market acceptance of both Face ID and the $999 starting price of the iPhone X. He doesn't share those same concerns looking longterm, however.\n\"Amid mixed market views, we expect shares of the Apple supply chain to be volatile or even corrected in the near future,\" he wrote. \"We recommend investors seize the opportunity to accumulate supply chain shares.\"\nBottlenecks for Apple and production of the iPhone X are said to include the new OLED edge-to-edge display, as well as the advanced front facing camera array that enables Face ID. Previously, Kuo indicated that Apple's current production levels of the iPhone X are limited to less than 10,000 units per day.",
        "sentiment": 0.19406863882699432
    },
    "article_23": {
        "title": "AirPods Shipping Estimates Improve to 3 to 5 Business Days",
        "body": "Apple is closing in on its aim to achieve supply/demand balance for its AirPods, with the popular earphones now shipping from the online Apple Store in just three to five business days in the United States, Canada, U.K., Australia, and several other countries around the world.\nAccording to Apple's U.S. website, AirPods ordered today will be delivered between October 4 and October 6, while U.K. customers ordering today are being quoted delivery dates between October 3 and October 5. These are the best estimates Apple has offered since the AirPods launched in December 2016.\nAirPods have been in extremely short supply since they became available for purchase, with a typical wait time of six weeks from order to delivery. Only in August did stock begin steadily improving, with shipping estimates dropping to four weeks and then two to three weeks. Earlier this month, estimates improved to one to two weeks, before hitting three to five business days today.\nDuring Apple's third quarter earnings call, Apple CEO Tim Cook said Apple had boosted AirPods production capacity and was \"working very hard\" to get AirPods to customers as quickly as possible.\nOccasionally, Apple retail stores have received stock and third-party retailers like Best Buy have been able to offer AirPods with faster shipping on a regular basis, but those stocks have usually run out fast.\nCosting $159, Apple's \"truly wireless\" AirPods have gained popularity due to their long battery life, capacious charge case, infrared sensors that detect when they're being worn, touch-based gestures, and a built-in W1 chip that improves Bluetooth connection. AirPods are also relatively inexpensive compared to rival \"truly wireless\" earbuds that have launched in recent months.",
        "sentiment": 0.017461342550814152
    },
    "article_24": {
        "title": "3D Touch App Switcher to return in future iOS 11 update.",
        "body": "Apple software engineering chief Craig Federighi has revealed that a popular 3D Touch gesture for accessing the App Switcher will apparently return in a future update to iOS 11.\nFederighi, replying to an email from MacRumors reader Adam Zahn, said Apple had to \"temporarily drop support\" for the gesture due to an unidentified \"technical constraint.\"\nQuestion from Zahn: Could we at least make the 3D Touch app switch gesture an option in iOS 11 so that I could retain the ability to switch apps that way instead of having to double tap the home button?\nResponse from Federighi: Hi Adam,\nWe regretfully had to temporarily drop support for this gesture due to a technical constraint. We will be bringing it back in an upcoming iOS 11.x update.\nThanks (and sorry for the inconvenience)!\n- craig\nOn devices that support 3D Touch running iOS 9 or iOS 10, users can press deeply on the left side of the screen, drag to the right, and release to quickly access the App Switcher. The gesture stopped working in the iOS 11 beta, and an Apple engineer later confirmed it was \"intentionally removed.\"\nMacRumors has verified this email exchange passed through mail servers with an IP address range linked to Apple's headquarters in Cupertino, California. Coupled with the fact Federighi has been replying to several customer emails since the iPhone X event last week, we're fairly confident in its accuracy.\nFederighi replies have also revealed that Face ID will work with most sunglasses and that Apple has considered a Nightstand mode for iPhone X.",
        "sentiment": -0.19155088587748734
    }
}