{
    "article_0": {
        "title": "Apple is acquiring music recognition app Shazam.",
        "body": "Update: this story has now been confirmed.\nAs Spotify continues to inch towards a public listing, Apple is making a move of its own to step up its game in music services. Sources tell us that the company is close to acquiring Shazam, the popular app that lets people identify any song, TV show, film or advert in seconds, by listening to an audio clip or (in the case of, say, an ad) a visual fragment, and then takes you to content relevant to that search.\nWe have heard that the deal is being signed this week, and will be announced on Monday, although that could always change.\nOne source describes the deal as in the nine figures; another puts it at around £300 million ($401 million). We are still asking around. Notably, though, the numbers we’ve heard are lower than the $1.02 billion (according to PitchBook) post-money valuation the company had in its last funding round, in 2015.\nIn all, Shazam has raised $143.5 million from investors that include Kleiner Perkins, London’s DN Capital, IVP and strategic investors Sony Music, Universal Music and Access Industries (which owns Warner Music). Kleiner Perkins also invested in competitor SoundHound.\nShazam last noted that it passed 1 billion downloads, but that was back in September 2016, meaning those numbers are likely higher now.\nBut in the world of apps, high numbers do not always translate into profits: In September 2017, Shazam reportedly made £40.3 million ($54 million) in revenues in its 2016 fiscal year, which was a turnaround from the declines between FY 2014 and 2015. It made a statutory pre-tax loss of £4 million ($5.3 million) in 2016, which was still a loss but significantly smaller than the £16.6 million loss in FY 2015.\nThe company’s CEO Rich Riley noted earlier this year, however, that operating at or near profitability is the intention as it’s been growing; and he also hinted that the company was, as a result, likely an acquisition target.\nShazam launched way back in 1999, well before the days of apps, as a service you reached by way of a SMS code — in fact, its first name was 2580, after the number you typed in the UK to access the service.\nSince those early days, it’s launched a number of related services. Artists on Shazam lets you follow famous people and see what music they are Shazamming.\nIts augmented reality brand marketing service lets you discover content based on pictures that you snap with the app. “You came for music, stay to experience McDonald’s Karaoke, MTN Dew VR Racing and much more,” is the company’s pitch on this feature.\nIt also integrates with other apps like Snapchat and Apple’s Siri, and it currently sends lots of traffic to other music apps like Spotify and Apple Music, which pays it when those clicks convert to purchases.\nIt’s not clear what will carry on post acquisition, and which of these might be something that Apple would integrate into its own business (and how), but it’s notable that much of what Shazam does is very synergistic with what Apple is working on already: AR, and more features to attract more users to the Apple Music platform.\nApple has made dozens of other acquisitions, and one of the biggest has been in the area of music: it acquired Beats for $3 billion in 2014, which became the basis for Apple Music. That service has around 30 million users as of September of this year. As a point of comparison, Spotify has over 60 million paying subscribers, with 140 million overall.\nWe’ve reached out to Shazam and Apple for comment.",
        "sentiment": 0.04631902164934824
    },
    "article_1": {
        "title": "Days after iPhone battery fiasco, lawsuits against Apple begin to mount",
        "body": "iFixit.\"/>\nSince news broke that Apple deliberately slows down the processor speed of iPhones as they age, the company has now been sued three times in various federal courts nationwide.\nThese proposed class-action lawsuits allege largely the same thing: that over time certain iPhones exhibited lower performance and that Apple fraudulently concealed this fact from owners. If those customers went to an Apple Store to investigate, they were encouraged to simply buy a new iPhone.\n\"Had Plaintiffs been informed by Apple or its technical/customer service support staff that a battery replacement would have improved the performance of the above devices, they would have opted to replace the batteries instead of purchasing new phones,\" one of the lawsuits, Abdulla et al v. Apple, which was filed Thursday in federal court in Chicago, alleges.\nThis case was brought by customers in Illinois, Indiana, Ohio, and North Carolina.\nA similar lawsuit, Bogdanovich v. Apple, which was filed in federal court in Los Angeles on Thursday, argues that Apple breached an \"implied contract\" and that the company trespassed on private property (namely, the already-sold iPhones) when it baked in a deliberate CPU slowdown.\nA third case, Harvey v. Apple, was filed in federal court in San Francisco, also on Thursday.\nApple did not immediately respond to Ars’ request for comment.",
        "sentiment": -0.5847469334387116
    },
    "article_2": {
        "title": "A Message to Our Customers about iPhone Batteries and Performance - Apple",
        "body": "All rechargeable batteries are consumable components that become less effective as they chemically age.\nAs lithium-ion batteries chemically age, the amount of charge they can hold diminishes, resulting in shorter amounts of time before a device needs to be recharged. This can be referred to as the battery’s maximum capacity — the measure of battery capacity relative to when it was new. In addition, a battery’s ability to deliver maximum instantaneous performance, or “peak power,” may decrease. In order for a phone to function properly, the electronics must be able to draw upon instantaneous power from the battery. One attribute that affects this instantaneous power delivery is the battery’s impedance. A battery with a high impedance may be unable to provide sufficient power to the system that needs it. A battery's impedance can increase if a battery has a higher chemical age. A battery’s impedance will temporarily increase at a low state of charge and in a cold temperature environment. When coupled with a higher chemical age, the impedance increase will be more significant. These are characteristics of battery chemistry that are common to all lithium-ion batteries in the industry.\nWhen power is pulled from a battery with a higher level of impedance, the battery’s voltage will drop to a greater degree. Electronic components require a minimum voltage to properly operate. This includes the device’s internal storage, power circuits, and the battery itself. The power management system determines the capability of the battery to supply this power, and manages the loads in order to maintain operations. When the operations can no longer be supported with the full capabilities of the power management system, the system will perform a shutdown to preserve these electronic components. While this shutdown is intentional from the device perspective, it may be unexpected by the user.",
        "sentiment": -0.3037860007847057
    },
    "article_3": {
        "title": "AT&amp;T wants you to forget that it blocked FaceTime over cellular in 2012",
        "body": "AT&T's push to end net neutrality rules continued yesterday in a blog post that says the company has never blocked third-party applications and that it won't do so even after the rules are gone.\nJust one problem: the blog post fails to mention that AT&T blocked Apple's FaceTime video chat application on iPhones in 2012 and 2013. Policy Director Matt Wood of advocacy group Free Press pointed out the omission in a tweet:\nI guess you can credit Bob Quinn & @ATTPublicPolicy for having the guts to lie so confidently. But when it says @freepress's 2010 #NetNeutrality predictions about mobile blocking were wrong, AT&T conveniently omits blocking FaceTime on cellular in 2012. https://t.co/zrl4cI2odn — (((Matt Wood))) (@mattfwood) December 1, 2017\nIn AT&T's new blog post, Senior Executive VP Bob Quinn refers back to a prediction Free Press made in 2010 when the first version of the Federal Communications Commission's net neutrality rules were adopted.\n\"The rules pave the way for AT&T to block your access to third-party applications and to require you to use its own preferred applications,\" Free Press said at the time. The 2010 rules imposed fewer restrictions on mobile carriers than on home Internet service providers, which is what raised concerns for Free Press back then.\nQuinn says now that Free Press's prediction was totally wrong.\n\"Of course, none of those predictions ever came true then and they won’t come true after the FCC acts here either,\" Quinn wrote yesterday.\nBut in fact AT&T did block FaceTime on its cellular network when users tried to access the application from certain data plans, such as unlimited data packages. Apple made FaceTime work over cellular networks in 2012 with the release of iOS 6, but AT&T said it would only \"enable\" FaceTime on cellular if you bought a \"Mobile Share data plan.\"\nAdvertisement\nSwitching to Mobile Share required unlimited data customers to give up that unlimited perk. Even AT&T customers with limited data plans couldn't access FaceTime on cellular if they weren't paying for one of the then-new shared plans. If you didn't have the right data plan, you had to use Wi-Fi for FaceTime.\nAT&T said it was reasonable network management\nThe 2010 net neutrality rules prohibited mobile broadband providers from \"block[ing] applications that compete with their voice or video telephony services.\" The rule applied except when blocking an application could be justified as \"reasonable network management.\"\nFree Press and other groups in September 2012 accused AT&T of violating the no-blocking rule, saying that the reasonable network management exception shouldn't apply. \"There is no technical reason why one data plan should be able to access FaceTime, and another not,\" Public Knowledge Senior Staff Attorney John Bergmayer said at the time.\nOf course, AT&T disagreed. There is no \"blocking issue\" because FaceTime is pre-loaded on iPhones, Quinn wrote in August 2012:\nThe FCC's net neutrality rules do not regulate the availability to customers of applications that are pre-loaded on phones. Indeed, the rules do not require that providers make available any pre-loaded apps. Rather, they address whether customers are able to download apps that compete with our voice or video telephony services. AT&T does not restrict customers from downloading any such lawful applications, and there are several video chat apps available in the various app stores serving particular operating systems.\nFree Press countered that \"AT&T is inventing words that are not in the FCC's rules in a weak attempt to justify its blocking of FaceTime.\" The word \"pre-loaded\" did not appear in the FCC's 2010 net neutrality order.\nAdvertisement\nAT&T also applied restrictions to Google Hangouts on Android phones.\nAT&T eased the restrictions on limited data plans a few months after the initial policy, but unlimited data customers were still blocked from using FaceTime. AT&T finally lifted all these limitations on pre-loaded video apps by the end of 2013.\nQuinn justified AT&T's decision to block FaceTime again in November 2012.\n\"[W]ith the FaceTime app already pre-loaded on tens of millions of AT&T customers' iPhones, there was no way for our engineers to effectively model usage, and thus to assess network impact,\" he wrote then.\nWho do you trust?\nBut in this week's AT&T blog post claiming that AT&T never blocked third-party applications, the FaceTime blocking did not even warrant a mention. We asked an AT&T spokesperson why this wasn't included, but the company simply pointed us back to its statements from 2012.\nAT&T's blocking of FaceTime was cited by the Federal Communications Commission in its 2015 decision to impose stronger rules on both home and mobile broadband providers. The current rules prohibit home and mobile ISPs from blocking or throttling any lawful Internet content, subject to reasonable network management.\nThose rules are about to be thrown out, as the FCC's Republican majority has scheduled a December 14 vote to get rid of the net neutrality rules. While Free Press contends that Internet users can't trust ISPs to play fair without the rules, Quinn says that isn't true.\n\"AT&T intends to operate its network the same way AT&T operates its network today: in an open and transparent manner,\" he wrote yesterday. \"We will not block websites, we will not throttle or degrade internet traffic based on content, and we will not unfairly discriminate in our treatment of Internet traffic.\"\nIn short, \"there will be no change in how your Internet works after the order is adopted,\" Quinn wrote.",
        "sentiment": -0.7861456981655665
    },
    "article_4": {
        "title": "Amazon Prime Video now out on Apple TV!",
        "body": "Watch movies, TV, and sports, including Amazon Originals like The Boys, The Marvelous Mrs. Maisel, and Tom Clancy’s Jack Ryan as well as recommendations just for you.\nApp features:\n• Download videos to watch offline.\n• Continue to watch your favorite movie, TV show or a live event via Picture-in-Picture (PiP) while interacting with other apps or websites.\n• Rent or buy new-release movies and popular TV shows (availability varies by marketplace).\n• Multi-user profiles allow creating personalized entertainment experiences.\n• Go behind the scenes of movies and TV shows with exclusive X-Ray access, powered by IMDb.\n• Watch on iPhone and iPad by downloading the separate iOS app (requires iOS 14 version or later).\n• Watch on Apple TV by downloading the separate tvOS app (requires Apple TV 3rd generation or later).\nIf you subscribe to Prime Video via iTunes (where available), payment is charged to your iTunes Account at confirmation of purchase and your subscription automatically renews monthly unless auto-renewal is turned off at least 24 hours before the end of the then current plan period. Your account is charged for renewal within 24 hours before the end of each plan period at the rate of your selected plan. Manage your subscription and turn off auto-renewal anytime by going to My Account or through iTunes.\nFor customers located within the European Union, United Kingdom, or Brazil: By using this app, you agree to the Amazon Conditions of Use and Prime Video Terms of Use at primevideo.com/ww-av-legal-home. Please see our Privacy Notice, our Cookies Notice, and our Interest-Based Ads Notice at primevideo.com/ww-av-legal-home.\nFor all other customers: By using this app, you agree to the Amazon Conditions of Use, Privacy Notice, and Prime Video Terms of Use at primevideo.com/ww-av-legal-home.",
        "sentiment": 0.29777365710054127
    },
    "article_5": {
        "title": "Geekbench data confirms suspicions posted here: Apple throttles CPU speed as battery degrades",
        "body": "A Reddit post from last week has sparked a discussion regarding iPhone performance as a function of battery age. While we expect battery capacity to decrease as batteries age, we expect processor performance to stay the same. However, users with older iPhones with lower-than-expected Geekbench 4 scores have reported that replacing the battery increases their score (as well as the performance of the phone). What’s going on here? How many phones are experiencing decreased Geekbench 4 score?\nTo answer these questions I’ve plotted the kernel density of Geekbench 4 single-core scores for the iPhone 6s and the iPhone 7 running different versions of iOS. Scores obtained in low-power mode are not included in the distribution.\niPhone 6s\nHere are the charts for the iPhone 6s:\nThe distribution of iPhone 6s scores for iOS 10.2.0 appears unimodal with a peak around the average score. However, the distribution of iPhone 6s scores for iOS 10.2.1 appears multimodal, with one large peak around the average and several smaller peaks around lower scores. Under iOS 11.2.0 the effect is even more pronounced.\niPhone 7\nHere are the charts for the iPhone 7:\nThe distribution of iPhone 7 scores under iOS 10.2.0, iOS 10.2.1, and iOS 11.1.2 appears identical. However, the distribution changes with iOS 11.2.0 and starts to look like the iPhone 6s distribution from 10.2.1.\nPerformance and Battery Age\nSo what’s going on here?\nFirst, it appears the problem is widespread, and will only get worse as phones (and their batteries) continue to age. See, for example, the difference between the distribution of iPhone 6s scores between 10.2.1 and 11.2.0.\nSecond, the problem is due, in part, to a change in iOS. The difference between 10.2.0 and 10.2.1 is too abrupt to be just a function of battery condition. I believe (as do others) that Apple introduced a change to limit performance when battery condition decreases past a certain point. Why did Apple do this? kadupse on Reddit offers the following explanation:\nMany iPhone 6s devices were shutting down unexpectedly, even after the battery replacement program (Which many people weren’t entitled to use). Because degraded batteries last much less and end up with a lower voltage Apple’s solution was to scale down CPU performance, it doesn’t solve anything and is a bad experience… but it’s better than having your device shutdown at 40% when you need it the most.\nApple acknowledged the sudden shutdown issue that affected the iPhone 6 and iPhone 6s earlier this year. However, does the same issue affect the iPhone 7? Apple appears to have added a similar change to iOS 11.2.0 for the iPhone 7.\nIf the performance drop is due to the “sudden shutdown” fix, users will experience reduced performance without notification. Users expect either full performance, or reduced performance with a notification that their phone is in low-power mode. This fix creates a third, unexpected state. While this state is created to mask a deficiency in battery power, users may believe that the slow down is due to CPU performance, instead of battery performance, which is triggering an Apple introduced CPU slow-down. This fix will also cause users to think, “my phone is slow so I should replace it” not, “my phone is slow so I should replace its battery”. This will likely feed into the “planned obsolescence” narrative.",
        "sentiment": -0.22693886163882737
    },
    "article_6": {
        "title": "Tim Cook now required to fly private as AAPL’s 2017 performance nets him $102M payout",
        "body": "Apple today published its most recent shareholder proxy statement, outlining some interesting details about its performance in 2017. As noted by Bloomberg, Tim Cook ended the year as a big winner, netting a 74 percent bonus thanks to the company’s strong performance in fiscal 2017…\nThe filing explains that Tim Cook received $9.33 million in incentive pay for the fiscal year ending September 30th. In addition to that, he received $3.06 million in salary and an equity award of $89.2 million. For the year, Cook’s total payout comes to just under $102 million.\nTim Cook has already said that he will be giving away the majority of his fortune during his lifetime in a systematic approach to philanthropy.\nCFO Luca Maestri, retail VP Angela Ahrendts, hardware technologies VP Johny Srouji, hardware engineering VP Dan Riccio, and former general counsel Bruce Sewell each received bonuses of $3.11 million, for total compensation of $24.2 million each.\nIn fiscal 2017, AAPL shares offered returns of 30 percent, which is double the rate of the S&P 500. Executives are compensated in part based on performance of AAPL in comparison to the S&P 500.\nAnother interesting detail from Apple’s proxy statement filling is that Tim Cook is now required to fly on private aircraft. This policy was implemented in 2017 and applies to Cook’s business related and personal travel. Apple’s board of directors made the call and says the policy is “in the interests of security and efficiency based on our global profile and the highly visible nature of Mr. Cook’s role as CEO.”\nCook accrued $93,109 worth of personal travel costs in 2017, which is considered extra compensation and taxable. Furthermore, the filing says that Apple paid $224,216 in “incremental” security costs for Cook, as reported by Business Insider.\nApple’s proxy statement comes after it announced that it will hold its annual share meeting on February 13th at Steve Jobs Theater. Due to limited capacity, Apple is requiring shareholders to register for the meeting on a first-come, first-served basis on January 22nd, 2018 at 8AM PT.\nApple’s full proxy statement can be found here on the SEC’s website.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.17987965414714482
    },
    "article_7": {
        "title": "iPhone X outsold by iPhone 8 and 8 Plus combined during first month of availability",
        "body": "While Apple has yet to breakdown just how many iPhone X units it has sold so far, that hasn’t stopped analysts from taking a stab at it. Today, Consumer Intelligence Research Partners (CIRP) is out with a new investor note in which it attempts to offer some color on the breakdown of how each iPhone model sold during the first month of iPhone X availability…\nCIRP’s research, which analyzes the first 30 days of iPhone X sales, shows that the device accounted for roughly 30 percent of total iPhone sales. The iPhone 8 and iPhone 8 Plus combined counted for around 40 percent of sales, with the former coming in at around 23 percent and the latter around 17 percent.\nNotably, the iPhone 7 and iPhone 7 Plus captured around 20 percent of sales, despite being over a year old at this point. For comparison’s sake, the iPhone 7 and iPhone 7 Plus accounted for over 70 percent of sales during the first month of availability last year. This data echoes similar analytics information earlier this month.\nCIRP explains that it’s hard to know whether the iPhone X met, exceeded, or missed expectations during the first month of availability as Apple has never launched three flagship phones like this. Seeing that this data is from the first month of availability, it’s possible that supply constraints limited iPhone X sales, as all supply worries are essentially gone at this point.\nUltimately, CIRP expects “some disappointment” given the iPhone X’s publicity:\n“It’s difficult to say whether iPhone X met, exceeded, or missed expectations, since Apple has never launched a phone in this way before,” said Josh Lowitz, CIRP Partner and Co-Founder. “Based on the heightened publicity, we suspect some disappointment, with iPhone X accounting for less than one-third of US unit sales immediately following the launch. Of course, early supply constraints may have diminished sales, although as of now supply appears plentiful.”\nFurthermore, CIRP explains that some buyers may have been holding out to see consumer response to the iPhone X and ultimately went for the more affordable models instead:\n“In addition, we think that some delayed iPhone 8 and 8 Plus demand contributed to the situation. After Apple announced the new phones in September, iPhone buyers waited to buy anything until after the release of the iPhone X. They evidently wanted to see what a thousand-dollar phone looks and feels like, and then in many cases bought the seven hundred dollar phone.”\nDuring Apple’s last earnings call, Tim Cook explained that even the company itself was unsure of what to expect in terms of selling breakdowns due to the fact that it has never launched three flagship devices in this sort of sequence. We’ll have to wait for Apple’s upcoming earnings call in late January for its thoughts.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.22481036865535906
    },
    "article_8": {
        "title": "Apple's Tim Cook says developers have earned $17 billion from China App Store",
        "body": "Apple Inc's chief executive Tim Cook said developers using its platform in China number 1.8 million and have earned a total 112 billion yuan ($16.93 billion), representing roughly a quarter of total global App Store earnings.\nCook shared the data on Sunday during a speech at China's top public cyber policy forum, organised by the Cybersecurity Administration of China (CAC), which oversees internet regulation including censorship.\nEarlier this year, Apple said that developers had earned roughly $70 billion in total revenue through the store.\nApple is facing criticism from local users and rights groups for bowing to pressure from Beijing cyber regulators after it decided to remove hundreds of apps from its Chinese store this year, including messaging apps and virtual private network (VPN) services, which help users subvert China's Great Firewall.\nApple counts China as its third-largest region by sales but it has lost market share in recent years as high-end handsets from local rivals continue to gain traction. The firm is hoping to regain momentum following the release of its iPhone 8 and iPhone X models which shipped in November.\nThe U.S. tech giant said earlier it had moved its Chinese cloud data onto the servers of a local partner in the Chinese province of Guizhou.",
        "sentiment": -0.3508102909129645
    },
    "article_9": {
        "title": "Phil Schiller: 'Face ID data isn't shared with third party developers'",
        "body": "It has been a big year for Apple. The highlight was the introduction of the iPhone X, the ten year anniversary phone that said goodbye to the iconic Home button and is Apple's template for smartphones for the next decade. But does the entire industry agree that this is a revolutional device, like it did with the original iPhone, or is this just Apple’s point of view?\nA person who might hold the answers is Phil Schiller, Apple's senior vice president of Worldwide Marketing. Schiller has been an Apple board member for the past fifteen years, and he's therefore one of the most powerful men of the world’s most powerful company. He is also known as one of the spokesmen during Apple product keynotes, during which he often speaks about the tech specs of new devices. He might be responsible for Apple's marketing, but Schiller’s is a techie through and through.\nIt was Schiller who claimed the iPhone X was 'the smartphone dictating the next ten years ' during its presentation at the new Apple Park in Cupertino. Does that apply to the entire sector or just Apple? Schiller answers cautiously: \"Oh, I’m thinking only of us. If we pick the right things and they work as expected, they end up influencing the whole sector. Because when we do things really good, others like to copy us\", he chuckles.\nFACE ID: \"Third parties don't have access to Face ID-data\"\nSchiller points out a couple of features to measure ​how much of a leader in the smartphone industry the iPhone is, according to Apple. The first one is Face ID, the new security technology that enables users to unlock the iPhone X with their face. \"Ultimately what we are doing there is making privacy security even easier to do so that we all want to do it\", says Schiller. According to Apple, Face ID is much safer than its predecessor Touch ID, that unlocks iPhones with a fingerprint. Schiller has a quick answer to the commentary that other smartphone makers had a face or iris recognition before Apple did: \"They all stink.\"\nHe nuances: \"They don’t work in all the ways we need Face ID to work. We're very aware that through the years this simple thing, the Home button, that started as the way you click to get to the Home screen, grew into doing so many things for us. We added Touch ID, it took you to the multitasking screen, paged Siri, activated Apple Pay. All through this one mechanical button. So for Face ID we needed the best way we know of to enable us to easily unlock our device with our face, in a protected way with the Secure Enclave, and support all these other things. We had to solve all of that. Other things that people have tried with face haven’t been anything like that. Face ID is a very unique implementation.\"\nApple has the reputation of caring more about privacy than other tech giants like Google or Facebook. The news that data from the TrueDepth-camera that's used for Face ID is being shared with third party developers, was met with concern. Schiller takes his time for this question. \"What data is being used? Where is it going? Who has access to it? What rights do I have? Those are questions as a society we should all be asking. We care deeply about this at Apple. We ask those questions all the time.\"\nRegarding Face ID: \"I think we’ve worked really hard to maintain the trust we have with users about how this information technology is and isn’t used. First of all, no Face ID data goes to third parties. So what you enroll with Face ID, what you use to unlock your phone, that's an algorithm that is created and encrypted by the Secure Enclave. No third party that uses the iPhone camera has your Face ID data. We did create an API so developers can use the cameras to track facial movements, to do things like wrap stickers on your face (like Snapchat, ed.) That’s different than Face ID. They don’t have all the access to the data that Face ID has for that.\nSchiller stresses the separate guidelines and strict policies developers have to adhere in order to get acces to that facial data. \"We thought ahead to the same concerns you raised. For example, developers must be clear in their user privacy policies that they are using face data and what they are doing with that. So that you know. You have a choice to make whether you want to do that or not. You are in control. And also, every application that want to use face data must go through a special level of app review. We look at them specifically to understand what they are using the data for and does the user understand that. So uphold developer to do the right job for customers and ultimately let the customer decide.\"\nSchiller is careful to answer whether a single notification window that asks a user permission for their facial data is enough. \"We will see. We think it is. Users need to understand that the camera is the way how their face information is being used and that they have control of that. And that they can turn that off, that feature, at any time. If it isn’t enough we will apply stricter guidelines and policies. We try to be vigilant on this stuff.\"\nAUGMENTED REALITY: \"A giant mainstream market\"\nBack to the future. Apple is betting big on augmented reality. Will AR reach the big audience where VR is still struggling? Schiller looks far ahead. \"With AR and VR, we spent a long time studying these technologies and how they will ultimately benefit users. They will both exist in the future. It’s not either or. We found VR to be a great solution for​ specific use cases and mostly right now for people who are creating VR content. It’s not a big end user market yet but the content creators are working on it. We think it’s important they will be able to do so on a Mac. Our first step is to create VR extension on macOS.\"\nWhen Schiller starts about AR though, he takes it up a notch. \"AR on the other hand is technology that has incredible broad mainstream applications and can have the potential to change almost every major software category that exists. Because here you’re bringing digital information into the real world around us. It’s a perfect application for a device like the iPhone that has the performance, the camera's and all the technology you need to do great AR and it’s with you out in the world. We have figured out that we needed to somehow light up the ability to do AR on hundreds of millions of iPhone and iPads. Our first step there of course was ARkit. With ARkit we’re creating a software foundation to make it easy for any developer to build AR into their apps. By doing this we’re enabling millions and millions of developers to experiment and test and discover collectively with all of us all the many uses of AR.\"\nSMART HOME: \"We need more time\"\nApple's only truly new product this year is the HomePod. The smart speaker was announced this summer by Phil Schiller at Apple's annual developer conference WWDC in San Jose. It would go for sale this month in the US, the UK and Australia, but Apple's had to delay it until early 2018. That doesn't happen to Apple often and it's painful. More so because many say Apple was already lagging behind Amazon with its Echo speakers with Alexa, and Google with Google Home.\n\"We feel bad we aren’t able to deliver Homepod for the holidays. We’re going to take the time to do it right and make sure it’s great when it comes out. We need more time to make it right.\" Schiller emphasises how important this new product category is for Apple. \"Music sits deep in Apple’s DNA and is at the center of what Homepod is about. The reason Homepod is called that way is because it’s a little hommage to the iPod. It’s about great design of speakers, great intelligence on how you can place it and get the best music quality out of it, it’s about Siri being even more knowledgeable about music so you can ask it even richer questions about styles and artists, it is deeply connected with Apple Music. As for the way it gets the music for you, it doesn’t use Bluetooth to your speaker from your iPhone or your computer, it get the music straight from the music library in the cloud. So when you talk to Homepod, it gets the music from the cloud service with a huge library and all of your playlists. You can literally just say to Homepod: play something I like.\"\nThat sounds like a smart speaker, but not as the linchpin of the smart home many had hoped for.\"Homepod is first and foremost a great music experience. It is also deeply integrated with Homekit. It isn’t either or. They’re equally important. It has a built-in home hub so if you have a Homepod you can now access all your Homekit equipment and stuff from outside the home because of Homepod. It plays the same role as Apple TV. It integrates with Siri to control all of your devices in your home. Our vision is you can just walk into a room, the Homepod will be there and you can just say turn on the lights, close the curtains and whatever you like to do and it will do that. It has a very important role to the smart home in the future for Apple.\"\nTHINK DIFFERENT: \"Be bold\"\nPhil Schiller had worked for six years at Apple before, but returned in 1997 when Apple-founder Steve Jobs came back and radically changed the course of the company. Apple was almost broke, their product range had lost its way and the trust of its customers had hit rock bottom. Jobs had to give a strong, clear signal. That became the Think Different campaign, which reminded both customers and employees what Apple stands for.\nThe company got its mojo back, introduced iconic products like the iMac, iPod and iPhone, lost its spiritual leader Jobs and might become the first company in history with a market value of over a trillion dollars. Does the motto Think Different need an update after twenty years? \"It had a lot of meaning for us all. The idea of Think Different is as important and true today as it was twenty years ago for Apple. The situation is different but the importance is the same. People were really wondering why Apple should exist. It is why Apple needed to work hard and get back into the game and survive and earn our customer’s trust in business. It was about innovation, it was about design, it was about taking responsibility for the whole user experience to create great hardware and software that worked together again. That was what Think Different was about.\"\nSchiller calls AirPods exemplary for the company's philosophy. \"So many customers call it their favorite Apple product of all time. It’s such a simple focused product. And they do such a simple thing, like you can take them out of your ear and the music automatically pauses. You can put them back in and the music starts again. But to make that possible, took an incredible amount of technology. They’re really two separate computers that you put in your ear. That’s quintessential Apple. We tapped into an eternal truth for Apple. It's about as core to the DNA of Apple as you can get. Think Different should stay very close to true for a long time.\"",
        "sentiment": 0.19139711405815824
    },
    "article_10": {
        "title": "iPhone X is the best phone you can buy right now according to The Verge",
        "body": "Modern flagship smartphones are little engineering marvels. And they should be since they start around $800 and can cost well over $1,000. They tend to last upwards of four or five years, so the high cost is a little easier to swallow, but it’s still a major purchase for most of us.\nTo make sure you get the most for your investment, we’ve picked out the best of the best. The phones highlighted below deliver excellent daily performance and great cameras and will keep on running well into the foreseeable future. They may be pricey, but you get what you pay for.\nIf you’re looking to spend a little less and still get the best smartphone on a budget, you can find something really good for under $500. For those recommendations, you can check out our guide to budget smartphones.\nThe best phones of 2023\nThe 6.7-inch Pro Max (left) and the 6.1-inch Pro (right) both introduce some worthwhile new features to the iPhone lineup. Photo by Amelia Holowaty Krales / The Verge\nBest iPhone to buy in 2023\nFor a lot of iPhone owners, this isn’t an upgrade year, especially if you’re coming from a 12 or a 13. But if you do need a new iPhone right now and you want the very best device, then Pro is the way to go. The iPhone 14 Pro and Pro Max usher in some new ideas from Apple that the standard 14 doesn’t get, like the “Dynamic Island,” a playful mash-up of hardware and software that turns the notch into a shape-shifting status indicator. There’s also a new high-resolution camera and an always-on display.\nThe iPhone 14 Pro, which starts at $999, is the very best iPhone you can buy right now. But it’s a bit of an early adopter special. There’s plenty that’s good but a lot of room for Apple to fine-tune and improve these features over the coming years. If you’re not ready to spend a thousand dollars on the first iteration of a new design, then look at the previous-gen iPhone 13. The standard iPhone 14 is an incremental upgrade over the 13 and doesn’t get you that much more; the 13 is still available and starts at $699. That’s our choice for most people, but the 14 Pro does have a lot to offer.\nThere’s plenty that’s good but a lot of room for Apple to fine-tune and improve these features\nThe 14 Pro comes with a 6.1-inch screen and the Pro Max has a 6.7-inch screen. They’re both ProMotion displays like the 13 models, with adaptive refresh rates that go up to 120Hz for smooth scrolling and animations. New to this generation is an always-on display: when you lock your phone, the screen dims and drops into a low-power mode, with frame rates as low as 1Hz, but the clock, widgets, and wallpaper all remain visible. This means you can check the time or see if you have notifications without having to wake the display.\nThe display’s other new trick is, of course, Dynamic Island. Apple took the notch — the area of the screen that houses the front-facing camera and Face ID sensors — and turned it into a pill-shaped cutout that appears to expand dynamically (get it?) to show system indicators and notifications. It’s a handy place to quickly see what your phone is doing, whether it’s playing back music, sending files via AirDrop, or using navigation. It’s nice but it’s something Apple and third-party developers will keep making more useful over the next few years — definitely not something to upgrade for right now.\nThe 14 Pro also has a new 48-megapixel main camera, which uses pixel binning to maximize light sensitivity and produce 12-megapixel images. The real-world improvements are subtle, with more fine detail in shadows and in low light, but the differences compared to a standard 12-megapixel sensor in the iPhone 14 are hard to see unless you’re looking really closely. The higher-resolution sensor also enables a 2x telephoto mode that’s essentially a 12-megapixel crop from the middle of the sensor. It’s the new default view for portrait mode, and it’s one that feels like a happy medium between the wide and 3x telephoto that have been the only options on iPhones past.\nOutside of the new stuff, there’s a lot that’s familiar. The phone’s battery gets through a moderate day of use, though it seems to run down a little faster than the 13 Pro. The camera may not be the leap forward in photography that Apple claims it is, but it’s still one of the best in the game and records stunning video clips. And the new A16 Bionic chipset handles intensive tasks like gaming without a problem.\niPhone 14 Pro $ 999 The iPhone 14 Pro ushers in some new ideas from Apple, making it kind of an early adopter special. If it’s time to upgrade and you want all the latest and greatest features, then you’ll need to go Pro. $999 at Apple$999 at Best Buy\niPhone 14 Pro Max $ 1099 The 14 Pro Max is the bigger sibling to the 14 Pro, with a large 6.7-inch screen. Otherwise, it shares the same features as the smaller model, including the new Dynamic Island status indicator and a 48-megapixel main camera. $1099 at Apple$1099 at Best Buy\nGoogle’s Pixel 7 Pro addresses its predecessor’s shortcomings and delivers consistently good photos. Photo by Amelia Holowaty Krales / The Verge\nThe best Android phone to buy in 2023\nThe Pixel 7 Pro feels like the phone its predecessor should have been. It’s better late than never: the 7 Pro (and the 7, in its own right) is a high-quality device with good battery life, a consistently excellent camera, and great daily performance. Best of all, at $899, it costs a little less than the thousand-dollar flagships.\nThere’s an updated version of Google’s custom chipset on board, called Tensor G2. It’s behind some minor improvements to the phone’s intelligence and speech recognition. But mostly, it just delivers seamless performance for everyday tasks. It’s battery-efficient, too. In our testing, it was hard to push the Pixel 7 Pro into single-digit percentages by the end of the day. Most users can easily call this all-day battery life, and only very heavy users will need to recharge to get to the end of the day.\nThe 6.7-inch screen is very big, and with a boost in peak brightness it’s comfortable to use even in direct sunlight. One of the best updates on the Pixel 7 Pro is a faster under-screen fingerprint scanner. It’s a tad faster than Pixel 6’s (sluggish) system, and it’s now joined by face unlock. It all makes for a smoother experience unlocking the phone, whether you use one or both of these methods.\nAs always, the software experience on the Pixel is among the best in Android\nThe Pixel camera system is still one of the best in the game. There’s a 50-megapixel main camera — no change from the previous generation there — and a telephoto camera, slightly boosted from 4x to 5x zoom. Google’s using a new sensor crop method to offer 2x and 10x zoom settings that don’t rely on digital zoom. The result is surprisingly good image quality; the 10x can’t quite match the true optical 10x lens on the Samsung S23 Ultra, but it’s good in a pinch.\nMost of all, the Pixel offers a consistent photography experience. While the Galaxy S22 series offers a better portrait mode, it’s harder to predict when it will go overboard with saturation and color shifts. The Pixel 7 Pro delivers photos that are a little more contrasty and cool and can lack the punchiness of Samsung and Apple’s photo processing, but you can rely on it to get good-quality shots even in very challenging circumstances.\nAs always, the software experience on the Pixel is among the best in Android — unsurprising given that it comes from the same company. It remains a strength, with timely updates arriving every month, three years of new OS versions guaranteed, and a healthy five-year software support policy. There are some gems among the intelligence-based software features, too, like the creepily good live transcription in the Recorder app. Other features fall a bit short of Google’s lofty claims. Magic Eraser, which tries to automatically remove distractions from the background of your images, isn’t that magical. Photo Unblur, which is new to the Pixel 7 series, is only sort of good at sharpening blurry photos. But more importantly, the Pixel 7 Pro gets the basics right — and at the right price.\nIf you aren’t concerned with getting the very latest features, then the iPhone 13 is a great buy in 2022. Photo by Vjeran Pavic / The Verge\nBest iPhone for most people in 2023\nThe iPhone 14 seems like the obvious choice for anyone who needs a new iPhone but doesn’t want to step up to the 14 Pro. But hear me out: the iPhone 13 does almost everything that the 14 does, and it’s $100 cheaper. Sure, if your carrier is offering you a good trade-in offer or dirt-cheap financing for the 14 or you want the (slight) year-over-year upgrades, then go ahead and get that one. It’s great! But if trade-in deal season is over or you’re paying out of pocket, we think the standard iPhone 13 is the better buy; the $799 14’s improvements are so minor that they’re not worth the extra money.\nBy opting for the 13, you don’t miss out on anything as far as the screen or processor is concerned. The iPhone 13 features a 6.1-inch screen with a standard refresh rate — no smooth-scrolling ProMotion here — as does the 14. There’s an A15 Bionic chipset in both phones, and although the 14’s is a slight upgrade with an extra GPU core, they both deliver excellent performance. They’re both MagSafe compatible for wireless charging and IP68-rated for robust water and dust resistance.\nUpgrading to the 14 does get you a slightly better camera system, but the improvements are subtle. The ultrawide and front-facing cameras do better in low light compared to the 13, and the main camera features a bigger sensor that’s able to hold on to detail in dim conditions a little better. But for the most part, you have to go looking for these differences in fine details — most people viewing their images at web- and social-media-friendly sizes won’t see what’s changed.\nBy opting for the 13, you don’t miss out on anything as far as the screen or processor is concerned\nYou’ll miss out on a couple of emergency features, too. The 14 includes a new Crash Detection feature that uses specialized sensors to recognize when a car crash has happened and automatically call emergency services. There’s a satellite-based emergency messaging service, too, for when you’re out of cell range. For a small group of people, these services might be worth upgrading for, but they’re likely things that most of us can do without.\nFrom the outside, the iPhone 14 and 13 look almost identical. There are some physical differences to note, though. The first is that you can’t just use an iPhone 13 case on the 14 because the camera bump is a bit bigger. And below the glass and aluminum surface of the iPhone 14, Apple made some changes that enable much easier repairs to the back panel. That means out-of-pocket repairs will likely cost less, and if you’re a DIYer, it’s a much less daunting task to take on yourself.\nThere are a handful of other interesting new iPhone features this time around, but they’re reserved for the Pro models. If you consider yourself an early adopter or you just want the best iPhone you can buy right now, it’s worth stepping up to the Pro. But if you’re just looking for a reliable device to get you through your day, take great photos and video, and keep the blue-bubble chat a-flowin’, then the iPhone 13 will serve you just as well as the 14 — for a little less money.\nApple iPhone 13 $ 699 With the introduction of the iPhone 14, Apple lowered the price on the 13 to $699. If you’re paying upfront rather than subsidizing your purchase with a carrier, then this is the best bang for your buck in 2022. $699 at Apple\nThe S22 Ultra inherits the Note’s boxy shape and built-in S Pen stylus. Photo by Allison Johnson / The Verge\nThe phone that does everything\nThe “Ultra” moniker in Samsung’s Galaxy lineup no longer means you’re just getting the biggest phone; now, it means you’re getting the biggest phone and everything but the kitchen sink. The S22 Ultra will likely be replaced very soon by the S23 Ultra, which is rumored to include a more advanced camera.\nIf you’re after the best of the best (and you probably are if you’re looking at the Ultra), then it’s probably best to hold off. But even with its successor on the way, the S22 Ultra will remain an extremely capable device for many years. It offers no fewer than five cameras, a huge, bright 6.8-inch OLED with up to a 120Hz refresh rate, and, oh yeah, a built-in stylus. It’s the successor to the Note series, but more than that, it feels like the endgame of slab-style smartphone development. Related: it costs a steep $1,200.\nAt the heart of the S22 Ultra is the Snapdragon 8 Gen 1 chipset paired with 8 or 12GB of RAM. Performance is, not surprisingly, excellent; you’ll rarely see the phone stutter or hesitate, even while running graphics-intensive games. Samsung is also promising up to four generations of OS version upgrades, so the Ultra should remain a very good phone for years to come.\nThe included S Pen stylus pops out of a dedicated silo on the bottom of the phone, and Samsung says it’s been improved with lower latency than the S Pens of previous years. It’s hard to judge a few milliseconds of improvement, but it’s certainly responsive and easy to use. You can go deep into the stylus features with handwriting-to-text recognition options and slightly gimmicky “Air Actions” that turn the stylus into a magic wand / remote control combo. Or you can just scribble notes to your heart’s content or ignore the stylus entirely. The choice is yours.\nIf you’re looking for a phone that can do just about anything, the S22 Ultra is in a league of its own\nThe cameras are largely the same as the S21 Ultra’s, including a 108-megapixel main camera accompanied by 3x and 10x telephoto lenses plus a couple of software-based improvements. The Ultra’s portrait mode photos are some of the best in the game, with excellent subject isolation, and you can use night mode with high-res mode or portrait mode now. But the bottom line is that the solid camera system the S21 Ultra offered is still just as good here, and 10x telephoto is about the best you’ll find on any smartphone, anywhere.\nWith so many power-hungry features, the S22 Ultra’s battery life is a bit lackluster. It will last a day of moderate use with a little in the tank, but power users may need to keep an eye on battery percentage and top off the 5,000mAh cell toward the end of the day. Fast 45W wired charging makes this a quick job, though.\nIf you know the stylus life is for you and you’d use a 10x zoom regularly, rather than a handful of times out of curiosity, then look no further than the S22 Ultra. Its specialty features are somewhat niche — if powerful — which is why it’s not our overall pick for the best mainstream Android phone. But if you’re looking for a phone that can do just about anything, the S22 Ultra is in a league of its own.\nThe iPhone 13 Mini has all the same cameras and features as its siblings but packs a smaller battery for light users. Photo by Vjeran Pavic / The Verge\nBest small smartphone in 2023\nThe iPhone 13 Mini is one of very few small phones on the market with top-tier features and specs; you don’t have to compromise on performance, build quality, or cameras. Apple didn’t announce a new Mini with the 14 series, instead opting for a big-and-bigger approach with the 6.1-inch 14 and 6.7-inch 14 Plus. The 13 Mini is likely your last shot at a small, highly functional iPhone, so get it while you can.\nThough it’s much smaller in size than pretty much every other modern smartphone, the Mini’s 5.4-inch screen is still big enough for text messaging, email, web browsing, apps, video, and games, and if you’re coming from an iPhone 6, 7, or 8, it will feel quite spacious. But it’s also small enough that most adults, even those with small hands, will be able to comfortably reach all of the screen with their thumb. You won’t need a PopSocket on this one.\nYou won’t need a PopSocket on this one\nOne important downside to a smaller phone: the iPhone 13 Mini has a smaller battery that probably won’t last a power user through a whole day without a charge. It’s really designed for someone who isn’t glued to their phone all day. Otherwise, the Mini is the same phone as the iPhone 13: it has the same design, processor, cameras, 5G support, and build quality as the larger model. It’s just smaller and has a smaller price tag — about $100 less.\nIf you prefer Android, the Asus Zenfone 9 is a good alternative. It’s a little bigger than the 13 Mini, with a 5.9-inch screen, and it doesn’t work on Verizon, but it’s otherwise a very similar proposition: great build quality, top-notch processor, and high-end features like a 120Hz screen are all tucked into a pocket-friendly device.\nApple iPhone 13 Mini $ 599 The iPhone 13 Mini has all the features and cameras of its bigger siblings, just in a smaller package. It has a 5.4-inch display, 128GB of storage, a smaller battery, and the same A15 Bionic chip as other iPhone 13s. $599 at Apple\nAsus Zenfone 9 $ 629 $ 699 10 % off $ 629 The Zenfone 9 features a relatively small 5.9-inch display and a unique camera stabilization system that mimics the action-smoothing effect of using a gimbal. $700 at Asus$629 at Amazon\nThe less expensive 6A offers most of what the pricier flagship models include, starting with the custom Tensor chipset. Photo by Vjeran Pavic / The Verge\nThe best phone under $500\nThe Pixel 6A follows the same budget phone recipe Google has used for years: deliver core Google features in a stripped-down device with just the basics. In previous years, that meant getting the same camera system as the flagships. That recipe changed slightly with the 6A. Now, you get the same Tensor custom chipset as the Pixel 6 and 6 Pro but an older camera system. It’s a recipe that works: the Pixel 6A is a great all-around budget device, and even without the latest hardware, it still offers one of the best cameras in its class. And although its processor is one generation behind the very newest Pixel phones, you’re not missing out on much in terms of new features, and performance is still top-notch.\nThe 6A includes a 1080p 6.1-inch screen with a standard 60Hz refresh rate, and this is one area where Google made a sacrifice to hit a lower price point. The 6 and 6 Pro feature faster refresh rate screens, and you’ll even find other budget phones with faster refresh rates, like the Samsung Galaxy A53 5G. This is only something you’ll miss if you’re coming from a phone with a high refresh rate screen, so don’t worry about it if your current phone has a regular ol’ 60Hz display. There’s also no wireless charging, and it’s rated IP67, so water resistance isn’t quite as robust as on the Pixel 6.\nSure, the 6A misses out on a few nice things, but it’s got it where it counts\nThe cameras are a step behind Google’s current flagships, but the stabilized main 12-megapixel camera and 12-megapixel ultrawide are still highly capable — especially compared to the rest of the midrange class. Google’s image processing is smart, and Tensor enables some interesting software features, like Face Unblur, which uses information from both rear cameras to keep human photo subjects looking sharp, even in dim lighting.\nMost of all, Tensor puts the Pixel 6A’s day-to-day performance on par with the 6 and 6 Pro. And it should keep up for a long time: the phone will get security updates through July 2027. Sure, the 6A misses out on a few nice things, but it’s got it where it counts.\nThe Flip 4 is a modern take on the classic flip phone format. Photo by Allison Johnson / The Verge\nBest flip phone of 2023\nWhen the Galaxy Z Flip 4 is flipped open, you get a big 6.7-inch screen that handles just like the slab-style smartphone you’re used to. But fold it in half, like the flip phones of yore, and you can use its small outer screen to see basic widgets and read notifications. It’s unconventional, but it’s also fun and kinda stylish. It’s a great choice if you’re feeling a little bit adventurous — it’s still the early days for this form factor — and you’d appreciate a way to quickly check info on your phone without having to fully engage with it.\nThe Flip 4 is the definition of an incremental upgrade, but when you’re talking about a phone that folds in half, that’s still a pretty impressive achievement. It’s the same basic size and shape as the Flip 3, with a slightly slimmer hinge and some squared-off corners. It’s still IPX8 water resistant (no dust resistance, so please don’t take it to the beach) and the cover screen is still a tiny 1.9 inches — big enough to read an email subject line or check the current weather but not big enough to do much more than that.\nThe Flip 4 is undeniably fun and different\nThe inner screen is protected by stronger ultrathin glass than the Flip 3. There’s a non-user-replaceable screen protector in place, as there was on the previous model, but the adhesive that attaches it is stronger this time around. That will hopefully avoid the bubbling problem seen by some owners of previous-gen foldables.\nThe Flip 4’s cameras are mostly the same as the Flip 3’s, and they’re still a bit behind what you’d expect from your garden-variety flagship phone. There’s a 12-megapixel main camera with slightly bigger pixels than the last one, a 12-megapixel ultrawide, and a 10-megapixel selfie camera. Most other phones priced at $999 will throw in a telephoto lens of some kind, but not the Z Flip 4. Still, it’s a lot of fun taking pictures and recording videos in the phone’s L-shaped Flex mode. (Just try and name another phone that comes with its own built-in kickstand.)\nIf you’re a Flip 3 owner, there’s nothing about the Flip 4 worth upgrading for. In fact, many of the new software-based features introduced with the 4 are already making their way to the 3. And there are still plenty of ways Samsung could improve on its design: making it slimmer, more durable, and increasing the size of the cover screen, for a start. The Flip 4 offers some valuable refinements over the 3 that make it feel like a more mature product and less of a concept. There are likely significant improvements coming down the line for the Flip series, but right now, it’s undeniably fun and different.\nThe Z Fold 4 is pricey, but there’s nothing else quite like it on the market. Photo by Allison Johnson / The Verge\nBest folding phone of 2023\nThe Fold 4 is Samsung’s latest folding phone, and it is a pricey multitasking powerhouse — a phone and a tablet wrapped up in one device. Like the Fold 3 before it, it’s sized like a skinny smartphone that fits in your pocket, but it unfolds to reveal a tablet-sized 7.6-inch display on the inside.\nThat inside screen makes everything from reading books and browsing the web to watching videos and playing games more enjoyable and immersive. When you’re done using it, just fold it back up and stick it in your pocket just like any other phone. You can use the 6.2-inch outer screen for simpler tasks like you would on a slab-style smartphone, but the big screen is there when you need it. The Fold 4 is undeniably a gadget person’s gadget, best suited for someone who wants to get the absolute most out of their mobile device, cost be damned.\nThe Fold 4’s outer screen looks and handles like any other slab-style smartphone screen; unfold the device and you’re looking at something quite different. For starters, there’s a non-user-replaceable screen protector glued to the inner display to protect against scratches — the ultrathin glass that allows it to fold is easily damaged without it. The whole device is IPX8-rated, meaning it offers robust water resistance but no dust resistance. Folding phones: not recommended for the beach.\nIt’s a device you could actually use as your daily driver — not just as a cool gadget that stays at home\nOn the software side, the Fold 4 provides a lot of ways to get the most out of that big screen. There are new multitasking interface options that make it easy to open apps in multiple windows or use it in an L-shape like a laptop. These features are already becoming available to the Fold 3, so nobody should run out and upgrade from the previous-gen folding phone just for the software improvements.\nThe Galaxy Fold 4 is just brimming with cameras, including a 3x telephoto zoom lens, upgraded from a 2x zoom on the outgoing model. There are also 12-megapixel standard wide and ultrawide cameras on the rear panel plus a 10-megapixel selfie camera on the outside and a 4-megapixel under-display camera on the inside. Image quality is on par with the S22 and S22 Plus, including a great portrait mode. You’d get a more powerful set of cameras on the significantly less expensive S22 Ultra, but the Ultra doesn’t fold in half.\nThe Fold 4 has evolved beyond the early hardware hiccups of the first Fold phones in the series, and it’s a device you could actually use as your daily driver — not just as a cool gadget that stays at home. The refinements over the Fold 3 are minor, like slightly wider aspect ratios on the screens and better adhesive on the non-user-replaceable inner screen protector, but they push the Fold a little closer to the mainstream. With apologies to the also-ran Microsoft Surface Duo 2, there’s just nothing else like it on the market — if you’re willing to pay the very high $1,800 premium.\nSamsung Galaxy Z Fold 4 (256GB, unlocked) $ 1800 The Fold 4 is a multitasking powerhouse that can be used tablet-style or as your daily driver smartphone. It’s a gadget person’s gadget with a high price tag to match. $1800 at Amazon\nThe OnePlus 10T includes wicked fast charging and a high-end processor. Photo by Allison Johnson / The Verge\nFlagship performance for a little less money\nThe 10T feels like OnePlus coming back to its premium-hardware-at-midrange-price roots. It’s a $649 phone with Qualcomm’s very latest mobile processor, the Snapdragon 8 Plus Gen 1, with a side of extremely fast wired charging. That’s its whole deal: top-tier performance and unreal charging speeds, all for less than $700.\nThe 10T includes a nice screen, too: a big 6.7-inch display with a top 120Hz refresh rate. But you can’t have everything on a sub-$700 phone, and the 10T lacks a few things you’ll find on the slightly pricier flagships. That list includes wireless charging and a robust water resistance rating (it’s IP54 only). Camera quality isn’t quite up there with the best, either. It can be inconsistent, though photos in good lighting generally look fine.\nYou’ll see the phone charge from zero to 30 percent in under five minutes\nWired charging is exactly as advertised: fast as heck. In the US, it’s capable of 125W charging, and you need to use the included USB-C cable and brick. With them, you’ll see the phone charge from zero to 30 percent in under five minutes. In 10 minutes it will charge up to 60 percent, and a full charge takes about 20 minutes. It’s downright impressive.",
        "sentiment": 0.34066748512642725
    },
    "article_11": {
        "title": "Apple to Invest $390 Million in Finisar, US Maker of iPhone X TrueDepth Camera Lasers",
        "body": "Apple announced on Wednesday its plans to invest $390 million in Finisar Corp, which supplies components for the vertical-cavity surface-emitting lasers (VCSEL) found in the iPhone X TrueDepth camera.\nThe investment will be used to build a plant in Texas to make more of the chips, and will be financed by Apple's $1 billion Advanced Manufacturing Fund, which the company created earlier this year to foster innovation and create jobs in the U.S.\n\"VCSELs power some of the most sophisticated technology we've ever developed and we're thrilled to partner with Finisar over the next several years to push the boundaries of VCSEL technology and the applications they enable,\" said Jeff Williams, Apple's chief operating officer. \"Technology is only as good as the people behind it, and Finisar is a company with a long history of putting its employees first and supporting the community it's a part of. We're extremely proud that our involvement will help transform another American community into a manufacturing powerhouse.\"\nAccording to Apple's statement, the award will enable Finisar to exponentially increase its R&D spending and high-volume production of VCSELs, which power some of the iPhone's X flagship features, such Face ID, Animoji and Portrait mode selfies, as well as the proximity-sensing capabilities of AirPods.\n\"We're excited to continue our innovation with Apple of a technology that has tremendous potential,\" said Jerry S. Rawls, CEO of Finisar. \"When you combine our proven ability to consistently manufacture exceptional products with our new state-of-the-art Sherman facility, we're confident we can achieve our shared goal of providing consumers with incredibly exciting features. Finisar has always been keenly aware it takes great people to power our work and that's why we're thrilled to be adding Sherman to our family.\"\nSeveral reports in the months running up to the launch of the iPhone X suggested Apple initially struggled to ensure the TrueDepth camera's components could be produced in large enough quantities to meet demand. The delicacy involved in producing the VCSEL lasers was said to be one of the reasons behind the supply constraints, so today's news should ensure future production can be ramped up more easily if and when required.\nApple is reportedly working on a new high-end 2018 iPad that will adopt many of the design elements from the revamped iPhone X, including built-in support for Face ID. The new tablet device, which is likely to be a \"Pro\" model, will reportedly do away with the Home button.\nA rumor last month from Apple's supply chain has also suggested future iterations of the HomePod could come with 3D-sensing cameras to support Face ID. Meanwhile, KGI Securities analyst Ming-Chi Kuo has said Apple's Face ID technology is years ahead of similar facial recognition techniques from Android smartphone makers, and the company's rivals are struggling to catch up.\nThe first and only other time Apple has dipped into its Advanced Manufacturing Fund was in May, when it announced a $200 million investment in Corning, which manufactures the glass used in iPhones and other Apple products.",
        "sentiment": 0.150333088884751
    },
    "article_12": {
        "title": "Apple addresses why people are saying their iPhones with older batteries are running “slower”",
        "body": "Because of a Reddit post and the loose interpretation of subsequent benchmark tests posted by Primate Labs’ John Poole, the “Apple throttles old iPhones” meme has reared its ugly head again.\nThe gist, as it always is, is that Apple is being super petty and trying to force customers to upgrade their phones by making their old phones run slower.\nAs always, the answer is no. It would be beyond stupid and incredibly short-sighted for Apple to do this and, if it was actually true, would likely lead to tangles of a governmental and legal nature that no company like Apple would ever want to happen.\nInstead, Apple is focusing attention on smoothing out the very high and quick peaks of power draw that can cause problems with older batteries.\nHere’s a statement that Apple provided when I inquired about the power profile that people were seeing when testing iPhones with older batteries:\nOur goal is to deliver the best experience for customers, which includes overall performance and prolonging the life of their devices. Lithium-ion batteries become less capable of supplying peak current demands when in cold conditions, have a low battery charge or as they age over time, which can result in the device unexpectedly shutting down to protect its electronic components. Last year we released a feature for iPhone 6, iPhone 6s and iPhone SE to smooth out the instantaneous peaks only when needed to prevent the device from unexpectedly shutting down during these conditions. We’ve now extended that feature to iPhone 7 with iOS 11.2, and plan to add support for other products in the future.\nThe short-form version of what Poole’s benchmarks are showing is the result of a power curve-smoothing algorithm that Apple rolled out last year to mitigate iPhone shutdown issues. I wrote about it here; you can read that and come back.\nBasically, iPhones were hitting peaks of processor power that the battery was unable to power and the phones were shutting off. Apple then added power management to all iPhones at the time that would “smooth out” those peaks by either capping the power available from the battery or by spreading power requests over several cycles. This is clearly shown in Poole’s charts in his post:\nAlso, to be clear, Poole’s charts appear to be accurate — nor is Apple saying this isn’t happening.\nSome users who have had older batteries replaced also said they’ve seen improved benchmarks after replacing their batteries. Well, yeah. Of course. As batteries age, they stop working as well. Period.\nAnd that age isn’t just about years or charge cycles — heat is a huge killing factor for batteries, for instance. If your iPhone gets left out in the sun a lot or gets hot a bunch, then your battery will kick the bucket a lot sooner.\nAs that battery ages, iOS will check its responsiveness and effectiveness actively. At a point when it becomes unable to give the processor all the power it needs to hit a peak of power, the requests will be spread out over a few cycles.\nRemember, benchmarks, which are artificial tests of a system’s performance levels, will look like peaks and valleys to the system, which will then trigger this effect. In other words, you’re always going to be triggering this when you run a benchmark, but you definitely will not always trigger this effect when you’re using your iPhone like normal.\nApple will continue to add this smoothing to more devices over time to avoid shutdown issues, freezing and other problems.\nIt’s important to note that this is a lithium-ion chemistry issue, not an Apple issue. Batteries just get crappy over time. This is an attempt to make your phone work for longer with less issues, not to get you to switch away from it.\nLast year, Apple also added a notification for the user when the battery gets to a really rough state, but it’s pretty conservative about that, so it will likely not trigger until well after iOS feels it should start capping the max power draw from batteries. Just as an FYI.\nBasically, if your phone is cold, has a low battery charge or has an aged battery, it will be unable to supply peak current. Period.\nI think there’s an argument here that many people will never, ever see this happening. It is applied only when maximum power draw is required of the battery, e.g. when you are doing something intense with your iPhone like playing a game or using 3D applications. But clearly some people are seeing a pervasive triggering of this limiter.\nThis will not affect the average performance of your device, and it is emphatically not throttling; it’s capping the peak demands and not allowing them to be as high — and spreading that work out over more cycles rather than one.\nHowever…\nI think one thing that can be argued here is that there is a balance to be struck between giving people too much information and not enough information. If you give a user enough rope they will hang themselves, so to speak, by replacing batteries too early or replacing phones that don’t need replacing.\nBut, as a matter of transparency, I think that beyond saying very publicly that they are doing this power management (which they have now done twice), there could be an avenue here to be more aggressive and transparent with the user about when their battery is directly affecting the peak performance of their iPhone.\n“I think users who experience significant slowdowns due to battery wear would want Apple to be more transparent about this issue,” says Poole. “A notification stating that the battery needs service would be a simple way to reduce users’ concerns and help them address this problem.”\nRoughly, the three points for possible improvement I see here are as follows:\nApple should examine whether the gap is too large between when the algorithm starts smoothing out the peaks of performance and when they’re notified that their performance is taking a hit due to battery age. If a person is noticing (and it seems they are, given the discussion threads and social activity on this) that their phone is running slower, then they need to know why.\nThe point at which iOS will tell you that your battery has gone to hell is currently very, very conservative. Perhaps this can be set to be more aggressive. Then, of course, users will complain that Apple is cash-grabbing on battery replacements, but humans will remain humans.\nIt’s clear that people just didn’t understand that protecting an iPhone with an older battery was going to directly affect performance. Perhaps this is a failing of Apple messaging or a failure of myself (and other journalists) in not explaining it as clearly as possible.\nLargely, I think, the controversy that has hit this week could have been mitigated significantly by Apple having a direct conversation with its users via the device that they’re actually using. I know these things are hard (and I get to say “do it” without actually having to do it), but these kinds of conversations are not always best conducted via a third party.",
        "sentiment": -0.16510420114568927
    },
    "article_13": {
        "title": "Latest 4K drone footage of Apple Park shows it's starting to live up to its name",
        "body": "Matthew Roberts‘ latest 4K drone footage of Apple Park shows the campus starting to live up to its name, with a great many trees and grass areas now in place. It looks very much closer to the ‘building amid nature’ image seen in the early renders …\nTrees also surround the large pond, and the visitor center – but not high enough to block the view of the main spaceship building from its roof terrace atop the on-site Apple Store. We got our own tour of the visitor center and accompanying AR app last month.\nThe Steve Jobs Theater, too, looks to be more nestled among the trees, almost giving it the appearance of a modern bandstand in a park.\nWe can see an outside dining terrace area, with shade, just outside the atrium.\nThere are, though, other areas that still look very much like a construction site, with bare earth and mounds of dirt. This is especially evident in the area between the main ring and the fitness center.\nCheck out the video below.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.24497632309794426
    },
    "article_14": {
        "title": "Apple Reportedly Planning to Release Most Affordable 9.7-inch iPad Ever in Late 2018",
        "body": "With the new device, the sources expect the tablet market to witness a new wave of price competition among first-tier players including Samsung Electronics, Amazon, Huawei and Lenovo.\nThe sources pointed out that Apple's new iPad may arrive in the second quarter of 2018 and in addition to regular consumers Apple is also looking to expand the inexpensive iPad into the industrial and service sectors. Click to expand...\nApple is \"considering\" releasing an updated low-cost 9.7-inch iPad next year with a starting price that's $70 cheaper than its existing equivalent, according to sources from upstream suppliers.In March 2017, Apple released its most affordable iPad, a $329 entry-level 9.7-inch device with internal specs similar to the iPad Air 2, but with a thicker and heavier enclosure. According to, Apple's 2018 version of the 9.7-inch iPad could cost even less at around $259, in a bid to attract more demand from price-oriented consumers and maintain its current tablet shipments of 10 million units a quarter.In its November earnings call , Apple reported double-digit unit growth in iPad sales for the second consecutive quarter, but did not provide a breakdown of sales across tablet models. Prior to that, in June, the company reported sales of 11.4 million iPads , an increase of 15 percent compared to the year-ago quarter. iPad revenue was also up, but only 2 percent year over year, suggesting Apple was selling a lot of new lower-priced 9.7-inch iPads in particular.The worldwide tablet market declined for a tenth straight quarter on a year-over-year basis during the first months of 2017. When the news broke in May, Apple reported that it sold 8.9 million iPads in the quarter, down from 10.2 million iPads in the same period the year previous, marking the 13th consecutive quarter that it had sold fewer iPads on a year-over-year unit basis.According to the sources cited today, Apple's aggressive pricing strategy with the next 9.7-inch iPad aims to offset the continuing overall decline, which has seen most second- and third-tier brand vendors already step out of the market.According to the same sources, Apple is likely to outsource the production of the new 9.7-inch iPad to Compal Electronics, while giving the device's PCB orders to Compeq and Unitech Printed Circuit Board. However, all the companies declined to comment on their orders or clients.Article Link: Apple Reportedly Planning to Release Most Affordable 9.7-inch iPad Ever in Late 2018",
        "sentiment": 0.04730151364436516
    },
    "article_15": {
        "title": "MacOS update undoes root bug fix",
        "body": "When a company like Apple rushes out a software patch for a critical security bug, it deserves praise for protecting its customers quickly. Except, perhaps, when that patch is so rushed that it's nearly as buggy as the code it was designed to fix.\nEarlier this week, Apple scrambled to push out a software update for macOS High Sierra, to sew up a glaring hole in the operating system's security measures: When any person or malicious program tried to log into a Mac computer, install software, or change settings, and thus hit a prompt for a username and password, they could simply enter \"root\" as a username, no password, and bypass the prompt to gain full access to the computer. Apple's initial patch came out about a 18 hours after the bug was first reported.\nBut now multiple Mac users have confirmed to WIRED that Apple's fix for that problem has a serious glitch of its own. Those who had not yet upgraded their operating system from the original version of High Sierra, 10.13.0, to the most recent version, 10.13.1, but had downloaded the patch, say the \"root\" bug reappears when they install the most recent macOS system update. And worse, two of those Mac users say they've also tried re-installing Apple's security patch after that upgrade, only to find that the \"root\" problem still persists until they reboot their computer, with no warning that a reboot is necessary.\n\"It’s really serious, because everyone said 'hey, Apple made a very fast update to this problem, hooray,'\" says Volker Chartier, a software engineer at German energy firm Innogy who was the first to alert WIRED to the issue with Apple's patch. \"But as soon as you update [to 10.13.1], it comes back again and no one knows it.\"\n'That is bad, bad, bad.' Thomas Reed, Malwarebytes\nEven if a Mac user knew to reinstall the security patch after they upgraded High Sierra—and in fact, Apple would eventually install that update automatically, as it has for other users affected by the \"root\" bug—they could still be left vulnerable, says Thomas Reed, an Apple-focused researcher at security firm MalwareBytes. After Reed confirmed that 10.13.1 reopened the \"root\" bug, he again installed Apple's security fix for the problem. But he found that, until he rebooted, he could even then type \"root\" without a password to entirely bypass High Sierra's security protections.\n\"I installed the update again from the App Store, and verified that I could still trigger the bug. That is bad, bad, bad,\" says Reed. \"Anyone who hasn't yet updated to 10.13.1, they’re now in the pipeline headed straight for this issue.\"\nMac administrator Chris Franson, a technical director at Northeastern University, tells WIRED that he repeated that sequence of events and found that the \"root\" bug persisted, too. But he noted that rebooting the computer—after updating to 10.13.1 and then re-installing the security fix—did cause the security update to finally kick in and resolve the issue, which MalwareBytes' Reed confirmed. They both note, however, that Apple's security update doesn't tell users to reboot after installing it. \"You could easily have someone who doesn't reboot their computer for months,\" says Reed. \"That's not a good thing.\"",
        "sentiment": -0.5955152571910903
    },
    "article_16": {
        "title": "Ad targeters are pulling data from your browser’s password manager",
        "body": "Nearly every web browser now comes with a password manager tool, a lightweight version of the same service offered by plugins like LastPass and 1Password. But according to new research from Princeton's Center for Information Technology Policy, those same managers are being exploited as a way to track users from site to site.\nThe researchers examined two different scripts — AdThink and OnAudience — both of are designed to get identifiable information out of browser-based password managers. The scripts work by injecting invisible login forms in the background of the webpage and scooping up whatever the browsers autofill into the available slots. That information can then be used as a persistent ID to track users from page to page, a potentially valuable tool in targeting advertising.\nThe plugins focus largely on the usernames, but according to the researchers, there’s no technical measure to stop scripts from collecting passwords the same way. The only robust fix would be to change how password managers work, requiring more explicit approval before submitting information. “It won't be easy to fix, but it's worth doing,” says Arvind Narayanan, a Princeton computer science professor who worked on the project.\nThe Princeton research showed that information was also being funneled back to Acxiom, a massive consumer data broker. Contacted by The Verge, AdThink disputed that data was shared specifically with Acxiom, although the company acknowledged that data is routinely shared with third parties.\n“The particular piece of code discussed in this study was experimental and is responsible for only a very tiny fraction of the data collected globally,” the company said in a statement. “At the time of writing this statement, this code has already been deleted with absolutely no impact on our advertising business.”\nFor Narayanan, most of the blame goes to the websites who choose to run scripts like AdThink, often without realizing how invasive they truly are. “We'd like to see publishers exercise better control over third parties on their sites,” Narayanan says. “These problems arise partly because website operators have been lax in allowing third-party scripts on their sites without understanding the implications.”",
        "sentiment": -0.46710844039916993
    },
    "article_17": {
        "title": "AirPods with a smaller quartz component arriving in the second half of 2018",
        "body": "AirPods with a “smaller quartz component” arriving in the second half of 2018\nRevered Apple analyst Ming-Chi Kuo of KGI Securities has predicted that Apple may begin shipping its second-generation AirPods sometime in the second half of next year.\nIn a note to clients issued Tuesday, seen by MacRumors, the analyst wrote that the second-generation AirPods will feature a “smaller quartz component“ without providing specifics.\nHere’s an excerpt from his analyst note:\nMedia reports over the past few days on brisk AirPods demand and Apple struggling to keep up with holiday season demand align with our findings and positive predictions on AirPods in several previous reports. We forecast the average selling price of radio frequency printed circuit boards for upgraded AirPods in the second half of 2018 may increase, further benefiting business momentum of Unitech and Compeq.\nComponents for AirPods should be sourced from suppliers like Unitech, Compeq, TXC and HLJ, with Taiwanese manufacturer Inventec providing assembly services.\nInventec is currently the sole manufacturer of AirPods. Kuo in an earlier note wrote he expected AirPods shipment to double in 2018 to 26-28 million units.\nApple has promised to release a standalone inductive AirPods charging case in 2018 that will permit owners of the first-generation earphones to charge them using any Qi wireless charger, including Apple’s own AirPower charging mat coming in 2018, too.\nAirPods are the perfect gift this holiday season, but they unfortunately sold out for Christmas.\nArticle Source : iDownloadBlog.com",
        "sentiment": -0.012666412111785676
    },
    "article_18": {
        "title": "Apple Acquires Shazam",
        "body": "Apple today announced it has agreed to acquire music recognition service Shazam, marking the company's highest-profile purchase since it acquired headphone maker Beats for $3 billion in May 2014.\nApple did not disclose financial terms this time, but when TechCrunch broke news of the acquisition plans last week, one of its sources said the deal could be worth around $400 million. Shazam was valued at $1 billion in January 2015.\nApple confirmed the acquisition plans in a statement provided to MacRumors and several other media outlets today:\nWe are thrilled that Shazam and its talented team will be joining Apple. Since the launch of the App Store, Shazam has consistently ranked as one of the most popular apps for iOS. Today, it's used by hundreds of millions of people around the world, across multiple platforms. Apple Music and Shazam are a natural fit, sharing a passion for music discovery and delivering great music experiences to our users. We have exciting plans in store, and we look forward to combining with Shazam upon approval of today's agreement.\nShazam issued the following statement:\nWe are excited to announce that Shazam has entered into an agreement to become part of Apple. Shazam is one of the highest rated apps in the world and loved by hundreds of millions of users and we can't imagine a better home for Shazam to enable us to continue innovating and delivering magic for our users.\nShazam is a popular service that can identify the name and lyrics of songs, music videos, TV shows, and more. The company has standalone iPhone, iPad, Mac, and Apple Watch apps, while the service is also built into Siri on iOS 8 and later.\nShazam is integrated with Apple Music, allowing subscribers to identify a song and then tap to play it directly via the streaming music service. Shazam also has an iMessage app for identifying and sharing songs in the Messages app.\nShazam isn't just a big part of Apple. The service is built into Snapchat, allowing users to recognize, discover, and share music with friends. In the app, simply press and hold on the camera screen to identify a song with Shazam.\nIn September 2016, Shazam announced that its mobile apps had been downloaded more than 1 billion times since launching. Shazam released its original iPhone app when the App Store launched in 2008.\nShazam's machine learning algorithms used to identify audio clips, and its augmented reality feature that enables users to discover content based on pictures captured with its app, could be valuable technologies to Apple.\nApple said it is not disclosing further details at this time, so we'll have to wait and see exactly how it uses Shazam's technologies and talent.",
        "sentiment": 0.4199193737780054
    },
    "article_19": {
        "title": "Goodbye, net neutrality—Ajit Pai’s FCC votes to allow blocking and throttling",
        "body": "The Federal Communications Commission voted today to deregulate the broadband industry and eliminate net neutrality rules that prohibit Internet service providers from blocking and throttling Internet traffic.\nThe repeal of net neutrality rules became a near-certainty about a year ago when Donald Trump won the presidency and appointed Republican Ajit Pai to the FCC chairmanship. Pai and Republican Commissioners Michael O'Rielly and Brendan Carr provided the three votes necessary to overturn the net neutrality rules and the related \"Title II\" classification of broadband providers as common carriers.\nDemocrats Mignon Clyburn and Jessica Rosenworcel provided bitter dissents in today's 3-2 vote. Despite the partisan divide in government, polls show that majorities of both Democratic and Republican voters supported the rules, and net neutrality supporters protested outside the FCC headquarters before the vote.\n“New power... to block websites, throttle services, and censor online content”\nGoing forward, home Internet providers and mobile carriers will be bound not by strict net neutrality rules but by whatever promises they choose to make. ISPs will be allowed to block or throttle Internet traffic or offer priority to websites and online services in exchange for payment.\n\"The Internet is the greatest free market innovation in history,\" Pai said before today's vote. \"What is responsible for the phenomenal development of the Internet? It certainly wasn't heavy-handed government regulation.\"\n\"Following today's vote, American consumers will still be able to access the websites they want to visit,\" he also said.\nPai repeated his claim that \"under title II, investment in high-speed networks has declined by billions of dollars.\" He did not mention that major broadband providers themselves have told investors that Title II hasn't harmed their investment. He also has not provided data to support a new claim that a few small Internet providers were hurt by the rules.\nAdvertisement\nPai said that today's decision will achieve regulatory parity in the \"Internet economy,\" putting Internet providers under a regulatory regime similar to the one that governs search engines and other online platforms. He compared Twitter blocking certain tweets to ISPs blocking websites. \"These are very real, actual threats to the open Internet,\" he said.\nThe FCC will have to defend its decision in court, as pro-net neutrality groups plan to appeal. Advocates are also pushing Congress to reinstate net neutrality rules.\nToday's vote occurred after a short delay due to an apparent security threat.\nDemocratic dissent\nAs long as ISPs publicly disclose the blocking, throttling, or paid prioritization, they won't be violating any FCC rules. The Federal Trade Commission could punish ISPs if they make promises and then break them, but there's no requirement that the ISPs make the promises in the first place.\n\"As a result of today’s misguided action, our broadband providers will get extraordinary new power from this agency. They will have the power to block websites, throttle services, and censor online content,\" Rosenworcel said. \"They will have the right to discriminate and favor the internet traffic of those companies with whom they have pay-for-play arrangements and the right to consign all others to a slow and bumpy road.\"\nEven though broadband providers may say they won't do such things, \"they have the technical ability and business incentive to discriminate and manipulate your Internet traffic\" and now have the legal green light to do so, she said.\nPai titled his repeal order, \"Restoring Internet Freedom.\" Clyburn says it should be called \"Destroying Internet Freedom.\"\nAdvertisement\n\"I dissent. I dissent from this fiercely spun, legally lightweight, consumer-harming, corporate-enabling Destroying Internet Freedom Order,\" she said.\nThe FCC \"is handing the keys to the Internet... over to a handful of multi-billion dollar corporations,\" she continued. The repeal plan has drawn a bipartisan outcry \"because the large majority of Americans are in favor of keeping strong net neutrality rules in place,\" she said.\nBroadband networks may become congested again when \"a high-traffic video provider\" is forced to pay for network interconnection, as happened with Netflix before the rules were enacted, Clyburn said. She continued:\nMaybe several providers will quietly roll out paid prioritization packages that enable deep-pocketed players to cut the queue. Maybe a vertically integrated broadband provider decides that it will favor its own apps and services. Or some high-value Internet-of-things traffic will be subject to an additional fee. Maybe some of these actions will be cloaked under non-disclosure agreements and wrapped up in mandatory arbitration clauses so that it will be a breach of contract to disclose these publicly or take the provider to court over any wrongdoing. Some may say, \"Of course, this will never happen.\" After today’s vote, what will be in place to stop them?\nO'Rielly said that there aren't enough examples of ISPs acting badly to justify the net neutrality rules.\n“The FCC is not killing the Internet”\n\"I am simply not persuaded that heavy-handed rules are needed to protect against hypothetical harms,\" O'Rielly said. \"In all this time, I have yet to hear recent unquestioned evidence of demonstrable harm to consumers that demand providers be constrained by the completely flawed regulatory invention. I still cannot endorse guilt by imagination.\"\n\"This is a great day for consumers, for innovation, and freedom,\" Carr said. \"Title II did not create the open Internet, and Title II is not the way to maintain it.\"\n\"The FCC is not killing the Internet,\" Carr also said.",
        "sentiment": -0.4432103050791699
    },
    "article_20": {
        "title": "Apple Maps gets indoor mapping for more than 30 airports...",
        "body": "As of this morning, Apple Maps has expanded to include indoor layouts of 30 airports across the globe. The company has primarily hit American cities thus far, covering what looks to be most of the big cities across the contiguous U.S. There are some key international airports, as well, including Hong Kong International, Amsterdam, Geneva, two in London and Berlin and a handful of Canadian locations.\nIt’s a big roll out, all in one fell swoop, that appears to have taken quite some time in the making. Each location requires close cooperation with airlines and the airports themselves, along with in-person surveyors. People have been recording the data in-person — sort of a human stand-in for those street mapping cars that Apple and Google deploy to get a lay of the land.\nIf an airport is included in the list, it will now sport the words “Look Inside” on the map. Tapping that will pop up a bird’s-eye view layout of the inside of the terminal. It’s that standard mapping grid view — in spite of sending human surveyors to collect data, there’s nothing here akin to Satellite or Street View. Not that most airport terminals are really all that much to look at in the first place.\nThe grid view highlights each gate in yellow, with a few key destinations populating the map — things like check-ins, baggage and airport lounges. Drilling down from there reveals other spots in more detail, including restaurants, restrooms and the like. Tap on a restaurant, for instance, and you’ll get a tab with data just like you would outside the airport. It offers the terminal name and floor number, phone number, hours and reviews pulled from a third-party review platform like Yelp.\nTapping on the number in the upper-right corner toggles between terminal levels. Swiping up with two fingers, meanwhile, offers up a 3D view of the space, with added depth. This lay of the land was gathered using CAD files provided to Apple by the individual airports, to give the user a better sense of place while wandering around the terminal.\nWe had the opportunity to test the new feature at JFK’s Terminal 5 earlier today, which was like going through all of the travel rigmarole without actually getting to go anywhere. I will say, however, that I was pleasantly surprised at how good a job the system does triangulating a phone indoors. The location accuracy is within a couple of meters, which is impressive inside, where GPS data is a crapshoot, at best.\nApple accomplishes this by using Wi-Fi points throughout the terminal. That triangulation is equally accurate whether or not you’re on the Wi-Fi — which I suspect many travelers aren’t, given the number of airports that still charge for access.\nIt should prove a handy feature for those planning out an hour or two in the airport — time I tend to spend wandering down terminal halls in search of slightly less terrible food options. There’s still a lot of room for potential growth here, too. After all, Apple has started incorporating flight data into other pieces of iOS, so this would be a no-brainer.\nBeing able to see which gate a flight is leaving from directly inside the map app could be supremely useful. Ditto for figuring out which carousel your luggage is on. No word on when that information is coming — that after all, is a pretty unwieldy additional stream of data layer to add in.\nMeantime, you can find the full list of participating airports on Apple’s site.",
        "sentiment": 0.12843586960142211
    },
    "article_21": {
        "title": "Apple classifies 2011 Mac Mini as obsolete",
        "body": "Apple this week added all Mac mini models released in mid 2011 to its public-facing vintage and obsolete products list.\nMid 2011 models have officially been classified as vintage or obsolete as of November 30, 2017, according to an internal memo distributed to Apple Authorized Service Providers and later obtained by MacRumors.\nThe distinction means that Apple and Apple Authorized Service Providers will no longer repair or service the 2011 Mac mini, given over five years have passed since it was last manufactured, except where required by law.\nThe only regions exempted include California and Turkey, where customers may still obtain service for up to two additional years.\nApple repairs and services products for up to five years after they are no longer manufactured, and 2011 Mac mini models have now eclipsed that coverage period after being discontinued in late 2012.\n2011 Mac mini models were the first with a Thunderbolt port, and the first without an optical disc drive for CDs/DVDs.\nIt has been over 1,100 days since Apple last refreshed the Mac mini, according to the MacRumors Buyer's Guide. The computer is still powered by Intel's dual-core Haswell processors, now five generations old.\nWhen Apple announced plans for a modular Mac Pro, Apple marketing chief Phil Schiller said the Mac mini \"is an important product\" in the company's lineup, but he didn't confirm if a new machine is in the works.\nApple CEO Tim Cook likewise said the Mac mini will be an \"important part\" of Apple's product lineup going forward in a recent email.",
        "sentiment": -0.0007374791428446769
    },
    "article_22": {
        "title": "Source code for Apple’s legendary Lisa operating system to be released for free in 2018",
        "body": "You’ll soon be able to take a huge trip down memory lane when it comes to Apple’s computer efforts. The Computer History Museum has announced that the source code for the Lisa, Apple’s computer that predated the Mac, has been recovered and is being reviewed by Apple itself…\nThe announcement was made by Al Kossow, a Software Curator at the Computer History Museum. Kossow says that source code for both the operating system and applications has been recovered. Once that code is finished being reviewed by Apple, the Computer History Museum will make the code available sometime in 2018.\nWhile you’ve been able to run emulators of the Lisa operating system before, this is notable as it’s not just a third-party hack solution, but rather Apple is directly involved and the full code will be available for everyone.\nKossow explains:\nJust wanted to let everyone know the sources to the OS and applications were recovered, I converted them to Unix end of line conventions and spaces for Pascal tabs after recovering the files using Disk Image Chef, and they are with Apple for review. After that’s done, the code that is cleared for release by Apple will be made available in 2018. The only thing I saw that probably won’t be able to be released is the American Heritage dictionary for the spell checker in LisaWrite.\nThe Lisa was released back in 1983 for $10,000, which as Gizmodo notes, is around $25,000 when adjusted for inflation. The machine was notable for being the first to feature a graphical user interface and support for a mouse, but ultimately only sold 10,000 units.\nDespite its flop on the market, the Lisa is a major piece of Apple history. It’s largely the reason Steve Jobs left Apple and caused a huge rift between Jobs and Microsoft’s Bill Gates. After Lisa’s rather public failure, Jobs founded NeXT Computer – which was ultimately acquired by Apple, bringing him back to the company.\nOnce the code for Lisa’s operating system and applications is released next year, everyone will be able to tinker with it and try it out. Some details remain unclear as Apple reviews the code, but we’ll keep you updated. Are you excited for this release? Let us know down in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.08265743909501716
    },
    "article_23": {
        "title": "The iPhone is Apples last product on a 500 cycle battery, the Macbooks down to the Watch are on 1000 cycle batteries",
        "body": "We’ll recycle your battery responsibly.\nPutting batteries directly in the trash is dangerous for the environment. Apple and all our authorized service providers are committed to recycling and disposing of batteries with the utmost respect for the earth. So recycle your device with us. Or drop off a battery from your AirTag. We’ll take it from there. On top of doing the right thing, your device may even qualify for a credit toward a new Apple product.\nLearn more about Apple’s recycling program",
        "sentiment": -0.20402260018246515
    },
    "article_24": {
        "title": "Civilization VI just released on iPad for „Free“ with $30/ $60 in-App purchase",
        "body": "TouchArcade Rating:\nSid Meier’s Civilization VI (Free) just popped up on the App Store for iPads bringing the full game rebuilt for touch to the iOS platform. The last few weeks have been crazy on iOS with ports of big games and one massive scam game (I apologize for that once again). Today, Aspyr Media has brought the full Civlization VI game to iPads. Civilization VI for iPad will run on iOS 11.1.2 or later and only be playable on iPad Air 2, iPad 2017, or any of the iPad Pros. Those are some hefty requirements but given this is a modern Civilization game that has been ported fully and not a spinoff or mobile first game, the demands are reasonable. Watch the iPad launch trailer for it below:\nThe pricing for this port is quite surprising. Aspyr Media has released it for free and you can play up to 60 turns for free. It will require a one time unlock after that will cost $60. Yes that isn’t a typo. It will be interesting seeing the response to what has become the norm for AAA pricing in the PC and console industry on iOS. The good news about the pricing is, you can buy the unlock for 50% off up till January 4th. Civilization VI has touch controls and will not support controllers at this time. Aspyr Media is looking to bring the DLC and expansions in the future but have no timeline for any other content right now. They are also looking into Android and iPhone but for now it is iPad only. The one downside to the port is the multiplayer is LAN only and there is no cross platform multiplayer for the Steam version. You can check it out on the App Store right now for free. I hope they add online support in the future.",
        "sentiment": -0.19449604985614619
    }
}