{
    "article_0": {
        "title": "The App Store now requires developers to use the official API to request app ratings. Custom prompts are not allowed.",
        "body": "The App Review guidelines were updated this week to accommodate App Store policy changes and new rules for usage of frameworks introduced in iOS 11, like MusicKit.\nOne change is the addition of section 1.1.7. This new paragraph requires developers to use the official in-app rating UI added in iOS 10.3 and states that they ‘will disallow custom review prompts’ going forward …\nWhen the new App Store rating API was introduced in the iOS 10.3 beta period at the start of the year, adoption was optional but Apple warned that it would eventually become mandatory.\nIt seems that time has come. Here’s the relevant addition to the App Store Review guidelines:\nUse the provided API to prompt users to review your app; this functionality allows customers to provide an App Store rating and review without the inconvenience of leaving your app, and we will disallow custom review prompts.\nThe language is pretty clear-cut, use the Apple API and stop using custom implementations. The change to the Apple API has some advantages and drawbacks for developers and users.\nDevelopers like the new API because it allows customers to provide a rating without leaving the app; custom implementations would pop an alert that ultimately navigated to the App Store. The integrated Apple rating prompt lets users pick 1-5 stars and press Done, without losing the context of what they were doing in the third-party app.\nHowever, Apple also imposes limits on how often the rating prompt can be displayed. The alert can only be presented three times a year (and this is enforced by the system). If a user leaves a rating, the app can not show the alert for at least a year afterwards and after a new version has been released. This behavior is an obvious response to customer complaints of a subpar App Store experience where apps beg for reviews and ratings far too frequently.\nThis is naturally user-friendly but some developers are not happy with the constraints. For example, soliciting a review after a major feature-changing update is not possible if the user already rated the app a few months earlier.\nUsers are also given more control about whether they want to be asked to review apps at all. In Settings, there is a global switch to suppress these alerts from ever appearing (Settings → iTunes & App Store → In-App Ratings & Reviews).\nThere is still the open question of how stringently app review enforces the rule, of course. There are many clauses in the App Review Guidelines that are consistently violated by apps and allowed to slip through the net seemingly forever.\nIt’s worth pointing out that as part of the iOS 11 App Store redesign, Apple has addressed one of the top complaints developers had when it came to reviews. In the past, releasing an app update would reset the app’s star rating in the store back to zero (as it was based on reviews for the current version rather than the all versions aggregate). From iOS 11, developers can preserve their star ratings across app updates.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.1563919009640813
    },
    "article_1": {
        "title": "Apple Is Trying To Make Your iMessages Even More Private. Apple wants to make its cloud as secure and private as its devices, starting with iMessage.",
        "body": "Apple might have figured out a way to close what some privacy activists saw as a major loophole that undermined the security and privacy of some users of its popular chat app iMessage.\nBack in 2011 Apple launched iMessage, a then-new messaging service that, among a myriad of features, also promised \"secure end-to-end encryption.\" That, in other words, is a type of encryption that in theory only allows the sender and the receiver of the messages—and no one else, including Apple or the cops—to read them. It was two years before Edward Snowden warned of NSA surveillance and popularized the importance of encrypting all the things and inadvertently accelerated the race to put end-to-end encryption in every chat app you can think of.\nAdvertisement\nBut, as several security and privacy researchers warned over the years, there's always been a major, somewhat overlooked catch: If you back up iMessages to iCloud, then Apple—or authorities who can force the company to turn the back ups over—can still read those messages, which to some extent defeats the purpose of the encryption.\nWith Apple's new mobile operating system, that might not be the case anymore.\nThis week at WWDC, the company announced that it was moving iMessage onto the iCloud platform with iOS 11. During the WWDC keynote, the company's Senior Vice President of Software Engineering Craig Federighi presented it as a user experience improvement.\nStarting with the upcoming iOS11 all your conversations in iMessage will be automatically synchronized across your iPad, iPhone, Mac and whatever other iGizmo you own, he said. As anyone who uses iMessage knows, that's something that you can't do right now. And it leads to annoyances such as having to manually delete messages on all your devices if you want to get rid of an embarrassing message, or having to restore a full backup if you want old iMessages on a newer iDevice.\nBut if iMessages, which are supposed to be end-to-end encrypted, now sync, doesn't that mean Apple can decrypt and read them at some point? Apple says that soon won't be the case.\nAdvertisement\n\"Even if [users] store information in the cloud, it's encrypted with keys that Apple doesn't have.\"\nDuring an interview with Apple blogger and Daring Fireball's owner John Gruber, Federighi said that the company has figured out a way to do syncing while still remaining unable to read your iMessages. Here's what he said (this exchange is around the 01:05:30 timestamp in the video):\n\"Our security and encryption team has been doing work over a number of years now to be able to synchronize information across your, what we call your circle of devices—all those devices that are associated with the common account—in a way that they each generate and share keys with each other that Apple does not have.\"\n\"And so, even if they store information in the cloud, it's encrypted with keys that Apple doesn't have. And so [users] can put things in the cloud, they can pull stuff down from the cloud, so the cloud still serves as a conduit—and even ultimately kind of a backup for them—but only they can read it.\"\nIt's unclear exactly how Apple is able to pull this off, as there's no explanation of how this works other than from those words by Federighi. The company didn't respond to a request for comment asking for clarifications. It's possible that we won't know the exact technical details until iOS 11 officially comes out later this year.\nMeanwhile, cryptographers are already scratching their heads and holding their breath.\n\"The $6 million question: how do users recover from a forgotten iCloud password? If the answer is they can't, that's a major [user experience] tradeoff for security. If you can, maybe via email, then it's [end-to-end] with Apple managed (derived) keys,\" Kenn White, a security and cryptography researcher, told Motherboard in an online chat.\n\"If recovery from a forgotten iCloud password is possible *without access* to the device (or possibly the keychain via the Secure Enclave), it's not truly [end-to-end encryption],\" White said.\"It's encrypted, but decryptable by parties other than the two people communicating. In that sense, it's closer to the default security model of Telegram than that of Signal.\"\nThe quote at the end of this post has been updated to amend a technical error Kenn White made in his analysis.",
        "sentiment": -0.246252430988283
    },
    "article_2": {
        "title": "Easily share your WiFi with friends on iOS 11, automatically sends passwords to nearby devices",
        "body": "iOS 11 includes many automatic features regarding first-time setup and account login. This extends to WiFi networks too. If a friend comes over with an iPhone running iOS 11, you can automatically log them in to your WiFi in one tap.\nThe UI looks like the AirPods pairing process. When the WiFi password screen pops up on the new device, other nearby iOS devices that are already on the network will try to help …\nIn my example, the iPad is already on the WiFi network and the iPhone is the new device. With iOS 11 installed on both, attempting to join the WiFi network on the iPhone displays the password field as normal.\nThen, if you bring the iPhone ‘nearby’ to the iPad, the iPad will display a pop-up card that says an iPhone is trying to join the network.\nWith a single button tap, you can send the WiFi password over-the-air to the phone. After a short delay, the iPhone password field will be populated on the iPhone and it will be instantly connected to the network.\nThis new flow means you don’t have to go find the WiFi password on the back of the router anymore. Just tell your guests to tap on the network name and accept them with a tap on your personal device. The only requirement is that the iPad/iPhone that knows the password must be nearby and unlocked.\nIt’s a small thing that you will only use a few times yourself, and then occasionally when new friends come over with iPhones or iPads, but it’s a great example of continuous refinements and improvements seen across iOS 11. This update isn’t just about flagship features like Drag and Drop or the redesigned Control Center.\nCheck out 9to5Mac on YouTube for more Apple news!\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.1061300293487661
    },
    "article_3": {
        "title": "Tim Cook was right to fight the FBI",
        "body": "Marty is the founder, president, and CEO of Atlantic.Net. Marty’s strengths as a leader and visionary have helped him lead a successful busi (show all) Marty is the founder, president, and CEO of Atlantic.Net . Marty’s strengths as a leader and visionary have helped him lead a successful business for over two decades.\nIn this day and age of fast food journalism, with technology pundits vapidly expunging their opinions on that day’s technology fare, we sometimes miss something that is truly seminal that happened in our industry. That “something” would be Tim Cook’s refusal to turn over the keys to the kingdom – the security of the iPhone itself – to Federal authorities.\nThe goal of these government agencies was to secure a skeleton key that would allow unfettered access to Apple devices, in important cases that would help solve crimes. Ultimately, it is widely believed that recent leaks of software backdoors made famous by Wikileaks originated with federal agencies of the US government.\nWhat’s odd is that in normal times, we would see a mea culpa from someone. Yet, we hear almost nothing about it. So I’ll say it – Tim Cook was right about the dangers of entrusting a master key that could unlock Apple devices to anyone, including a government agency for fear that it could leaked or be misused.\nIn December 2015, a day after the horrific San Bernardino shootings happened, the FBI was able to recover a single working iPhone used by the terrorists from their apartment. Because the iPhone hadn’t synced recently with its iCloud counterpart, the recent data on the phone was of keen interest to the federal agents. However, the phone was locked and they didn’t have the passcode, and the person who did was dead. Apple puts in a failsafe where if the wrong passcode is entered 10 times, the device automatically erases itself.\nThe FBI’s solution was to ask Apple to create a special version of iOS, the software that runs the iPhone, without this limit so the FBI could try all combinations until the phone was unlocked. As CEO of Apple, Tim Cook made the very hard decision (both morally and ethically) to deny this request. A few months later, the FBI obtained a court order from a federal judge that would compel Apple to create this specialized version of iOS for the government to use. Ultimately, the FBI dropped its case against Apple, claiming it had found another way into the particular phone in question.\nThis may have been the end of it, or so most people thought…\nEarlier this year, a hacker group by the name of The Shadow Brokers published several leaks containing hacking tools believed to have originated from the National Security Agency (NSA), including several vulnerabilities that were brand new, frequently referred to as zero-day exploits. These exploits targeted Microsoft products.\nWithin a few weeks of these exploits becoming public, a now famous ransomware known as “WannaCry” infected thousands of computers. When a computer is infected with ransomware, it encrypts all the data on the computer and requires a payment to gain the ability to decrypt it. WannaCry caused mass upheaval for many of the world’s largest entities. Today, it is believed to be contained. WannaCry is the direct result of leaking a backdoor that is believed to have been put in by the NSA.\nIt is important to note, however, that this exploit didn’t affect Apple products. While that may just be plain luck – the NSA isn’t telling us what exploits it has for Apple devices, but it does open Pandora’s Box when it comes to trusting government. While the existential threat of a government agency accidentally leaking exploits they might be using to maintain national security was possible, it wasn’t plausible. Therein lies the problem, you can’t go back.\nThe government cannot ever again legitimately claim that methods designed for their exclusive use to defeat security measures for national security purposes will be only used for that. But, when Tim Cook made his decision, Pandora’s Box was still closed. Only Mr. Cook knew that given enough time, that someone would pry it open. He deserves credit for that.\nOne positive outcome from all this is that the Apple brand is stronger than ever. What technology company do you trust with your information? Google? Facebook? Since they don’t charge you anything to use their products, their sole source of revenue is monetizing your information. Apple remains the only “mega tech” company that has proven through its difficult choices, that it values its customers trust, and that its customers can trust it.\nThis is an enormous halo that will only grow as the Internet grows, and customer data can be weaponized for malfeasance. In addition, since it actually charges customers to use its products, it’s not reliant on slicing and dicing customer data to be sold in advertising marketplaces.\nTim Cook made a hard decision to not cooperate with the FBI a few years back, and yet no one is giving him credit for it. It turned out he was right, that entrusting anyone, even a supposedly secure government agency could turn out badly. Imagine the havoc that we may have narrowly dodged if a similar tool, with Apple’s blessing, had leaked and was exploited to disable or abuse millions or hundreds of millions of iPhones.\nSometimes, it’s a win when you dodge a catastrophe, and while we may never know for sure what bad things might have happened, Mr. Cook’s action decidedly reduced Apple’s contribution to something like that happening. At the same time, Mr. Cook would never want to be in a position to see crimes happen and not be able to intercede or help. It was a difficult call, but in hindsight, he made the right one. Yet amazingly, we see almost no coverage. No talk or discussion about what could have been one of the biggest decisions in the tech space. But, ultimately we all should acknowledge it.\nTim Cook, you were right.",
        "sentiment": -0.32694289082098965
    },
    "article_4": {
        "title": "Apple's Tim Cook asked President Trump for coding requirement at US schools",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nAt a Monday technology summit with U.S. President Donald Trump, Apple CEO Tim Cook reportedly suggested making programming a mandatory subject in the country's schools.\nCook was one of several major tech executives who offered ideas at the first gathering of the White House's American Technology Council, according to Recode. In other examples, Amazon CEO Jeff Bezos suggested making more use of commercial technology, while Palantir CEO Alex Karp pointed to ways \"big data\" could be used to catch fraudulent federal spending. Palantir specializes in large-scale data analysis, and already counts the federal government as a close client, particularly its military and spy agencies.\nThe American Technology Council — led by Trump's advisor and son-in-law, Jared Kushner — was formed in May, and directed to \"transform and modernize\" government use of IT and digital services. Some other people at today's summit included the heads of Adobe, Google, Intel, Microsoft, Oracle, and Qualcomm, and investor Peter Thiel, a well-known Trump supporter.\nConspicuously absent was Tesla/SpaceX's Elon Musk, who withdrew after Trump decided to pull the U.S. out of the Paris climate agreement. Cook was among other CEOs who backed the accord but chose to participate in the Council, despite earlier saying he hadn't joined any Trump advisory group.\nHe has also opposed Trump on issues like immigration and LGBT rights, but argued that he should exert influence instead of boycotting the White House.\nCook and Apple have regularly called for programming to be taught in schools. Last month the company in fact put a free Swift curriculum on iBooks, which will also be brought to some colleges and high schools.",
        "sentiment": -0.0179888599862655
    },
    "article_5": {
        "title": "Apple Supplier Confirms New iPhone Models Will Be Waterproof With Wireless Charging",
        "body": "iPhone assembler Wistron has confirmed that at least one of Apple's next-generation iPhone models will be \"waterproof\" and include wireless charging capabilities, according to Japanese website Nikkei Asian Review.\n\"Assembly process for the previous generations of [iPhones] have not changed much, though new features like waterproof and wireless charging now require some different testing, and waterproof function will alter the assembly process a bit,\" [Robert] Hwang, [Wistron CEO], told reporters after the company's annual shareholders' meeting on Wednesday.\nApple analysts Jeff Pu of Yuanta Investment Consulting and Arthur Liao of Fubon Securities claim Wistron is splitting orders for the upcoming 5.5-inch iPhone with a flat display with larger Apple manufacturing partner Foxconn, so it's likely that Wistron is referring to the so-called \"iPhone 7s Plus.\"\nGiven the higher-end \"iPhone 8\" is expected to be a premium smartphone, positioned above the iPhone 7s Plus, that model will likely feature wireless charging and improved water resistance as well. That leaves the next 4.7-inch iPhone, which is already rumored to have wireless charging, and it's reasonable to assume the smaller model will have improved water resistance too.\niPhone 7 and iPhone 7 Plus models are already splash- and water-resistant with an IP67 rating, but Apple's fine print warns that \"splash, water, and dust resistance are not permanent conditions and resistance might decrease as a result of normal wear.\" iPhone water damage is not covered by Apple's warranties.\nNevertheless, many iPhone 7 and iPhone 7 Plus users use their smartphones in the shower, for example, without issue.\nA report earlier this year said Apple's next iPhone models will feature improved IP68-rated water resistance. In the IP68 rating, the \"6\" means the next iPhone would remain effectively dustproof, with \"no ingress of dust\" and \"complete protection against contact,\" while the \"8\" means the device will be even more water resistant.\nSamsung's Galaxy S8, which already has IP68-rated water resistance, is able to withstand 1.5 meters of water for up to 30 minutes.",
        "sentiment": -0.1070482304150408
    },
    "article_6": {
        "title": "Apple confirms sales of Apple Watch Pride Edition band will support LGBTQ groups.",
        "body": "Apple began publicly selling its Pride Edition Woven Nylon band for Apple Watch during WWDC week earlier in June, one year after it handed out a similar band to its employees at Pride events in San Francisco.\nDuring its first few weeks up on Apple.com, the company made no mention as to whether any portion of the profits made off of the band would go towards LGBTQ organizations, but a new change made to the band's webpage has confirmed that Apple will be helping out such advocacy groups with profits made from the rainbow-emblazoned Pride band.\nAs spotted by Redditor N-Code, the new Product Information section of the Pride Woven Nylon band confirms that a portion of proceeds from its sales in the United States will help benefit LGBTQ groups including GLSEN, The Trevor Project, the Human Rights Campaign, and PFLAG. Internationally, ILGA will see the same donations. A new banner referencing the donation support was also added to the main Apple Watch page on Apple.com.\nThe changes were made yesterday, with the Wayback Machine internet archive providing a point of comparison dating back to this past Saturday, June 17.\nApple's full statement on the Pride band donations reads as follows:\nApple is proud to support LGBTQ advocacy organizations working to bring about positive change, including GLSEN, the Human Rights Campaign, PFLAG and The Trevor Project in the U.S. and ILGA internationally. A portion of the proceeds from Pride Edition band sales will benefit their important efforts.\nApple runs similar donation initiatives with many of its product lines, most popularly being (PRODUCT)RED. Apple devices sold with that banner have a portion of their proceeds donated to the Global Fund to help raise awareness and fight HIV/AIDS. Last year marked Apple's tenth year anniversary in supporting (PRODUCT)RED'S causes.\nAt the time, Apple CEO Tim Cook commented on the company's support of causes such as (PRODUCT)RED and pro-LGBTQ organizations, addressing critics who believe his and Apple's public stances are made to endear millennial customers into buying products in the Apple ecosystem, among other criticisms. In response Cook said, \"We haven't shied away from being visible on a number of topics, and if it's something in our wheelhouse, we'll always be visible and stand up to protect as well as advance people's rights.\"",
        "sentiment": 0.11972189852251457
    },
    "article_7": {
        "title": "Apple removes 58,000 apps from App Store",
        "body": "U.S. tech giant Apple removed around 58,000 Chinese apps from the company’s official app store between June 10 and 21, 33.5 percent of which were gaming apps.\nAccording to Thepaper.cn, ASO 100, a Beijing-based data analysis platform, detected the anomaly in the Chinese version of the Apple app store in the past two weeks. On June 15, 22,000 apps were removed, a number that is six to 10 times greater than Apple’s daily removal quota. ASO 100 suggested that such a large-scale removal means Apple is cleaning up and regulating the Chinese app market on its iOS system.\nUsers and experts expressed their discontent, noting that the mass removal of apps might be a counterattack by Apple on its Chinese counterpart Tencent; Tencent owns WeChat, whose cash rewards feature was blocked on the iOS platform in April. Apple had made no comment on the incident as of press time.\nAccording to ASO 100, Apple’s move didn’t intentionally target the Chinese app's tip service, nor was it trying to single out the special loophole that helps developers bypass Apple’s vetting process when deploying patches and updates to users’ devices. Instead, the overhaul was reportedly intended to merely get rid of bad-quality apps, as well as those that violated regulations.\nASO 100 pointed out that Apple routinely removes a selection of apps every two or three months, so it's not advisable to read too much into this incident.",
        "sentiment": -0.5845107094384729
    },
    "article_8": {
        "title": "Apple releases first iOS 11 public beta for iPhone and iPad",
        "body": "Apple has released the first iOS 11 public beta for iPhone and iPad. This allows users who are not registered developers to test pre-release versions of iOS with new features for free.\nPrior to the public beta availability, iOS 11 has only been available to test with a $99/year developer account.\nIn terms of stability, the same warnings apply to any pre-release software: apps may crash, battery life won’t be optimal, and expect performance to be sluggish.\nStill tempted to try the iOS 11 public beta? Check out our guide for how to install the iOS 11 public beta on your iPhone, iPad, or iPod touch here. For more on iOS 11, check out our continuing coverage here.\nFor a comprehensive look at everything new in iOS 11 so far, check out our hands-on video below:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.024073162943952613
    },
    "article_9": {
        "title": "21% of Windows users plan to switch to Mac, says survey â\u0080\u0093 against 2% Mac to Windows",
        "body": "A survey of U.S. computer owners found that 21% of Windows laptop users planned a future switch to Mac, while just 2% of Mac owners intended to switch to Windows …\nThe number was higher among Windows desktop users, where a full quarter planned to make the switch to Mac within the next 6-24 months.\nUnsurprisingly, those planning a move to Mac were mostly in the higher income brackets, with interest greatest among those earning $150k plus. There was also high interest among lower earners in their teens and twenties, who may be anticipating a switch as their income grows.\nThe survey was carried out by Verto Analytics.\nConsumers are not the only ones to see the value in switching to Mac. When IBM allowed its staff to choose between Windows and Macs back in 2015, it reported a dramatic drop in support calls. It subsequently calculated that IBM saved $270 per employee among those who made the switch.\nPhoto: ITPro\nCheck out 9to5Mac on YouTube for more Apple news!\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.09045530520379544
    },
    "article_10": {
        "title": "Tim Cook confirms Apple's long secretive autonomous vehicle project",
        "body": "For years, Apple has kept its autonomous car plans under wraps. And while there have been a few breaking stories here and there on various tech media platforms regarding the same, an official word from Apple on the same has never come out.\nUntil now.\nIn an exclusive interview with Bloomberg, that happened on June 5th, Apple CEO Tim Cook agreed and in fact elaborated on Apple’s autonomous systems. He further laid stress, that since car projects form a major part of these systems, thus Apple is indeed working on the same and we could see some tests happening soon.\nIn Cook’s own words,\nWe are working on autonomous car systems and clearly, one purpose of autonomous drive systems is autonomous car. There are others. We sort of see it as the mother of all AI projects.\nApart from autonomous car projects in particular, Apple is also working on a host of other AI projects. But clearly, autonomous car systems is a major focus by some distance, made apparent by Cook, via his remarks.\nApple’s autonomous car project has been a long kept secret. However, we’ve had glimpses of the technology and the fact that Apple is working on such a thing, both from leaks and official Apple news.\nFor example, a couple of months back, there were reports wherein folks had sighted the test vehicle currently being used by Apple to test its technology. The clip came after a major report, that Apple isn’t planning to jump in by designing its own car, but will instead develop its own technology (very much like Google) and tie-up with third party car makers to install the same. The car spotted as the test bed was a Lexus SUV, fitted with all sorts of 3rd party hardware. You can read more about the spotting, here.\nPost that, Apple was among a list of manufacturers and tech companies, granted permission in California, to test its autonomous fleet. The list included the likes of Volkswagen’s American subsidiary, Tesla, Google, Mercedes among others.\nAccording to another report, the Cupertino giant has also developed its own driver training document, to train drivers who will be testing its self driving test vehicles. The failsafe technology used for these tests is called “Apple Automated System” in the document.\nAccording to the documents, Apple drivers are required to pass seven different tests. Each safety driver has two practice runs and three trials to pass each test. They need to be ready to take manual control of the vehicle.\nApple has applied for a permit for six drivers to drive three Lexus RX450h SUVs. Apple’s drivers who are named in the application, are mostly Ph.Ds specializing in machine learning. Few of them have also previously worked for companies like Bosch and Tesla.\nApple’s plans came into highlight last December, when Steve Kenner, Apple’s director of product integrity, scribed a letter to the National Highway Traffic Safety Administration revealing the company’s interest in automotive technology. It became public when it was published on a federal website. In the letter, Kenner wrote about the company’s excitement surrounding the potential for automated systems in fields like transportation.",
        "sentiment": 0.3238194376851122
    },
    "article_11": {
        "title": "This 82-Year-Old Woman Is WWDC’s Oldest Attendee: \"I didn't see any apps for the elderly, so I decided to create my own.\"",
        "body": "Retired banker Masako Wakamiya was frustrated by the lack of mobile games that catered to the elderly, who have a tougher time keeping up with the action-packed games that are popular with teens. So the 82-year-old from Japan started taking online tutorials to learn how to write software code.\n“I didn’t see any apps for the elderly, so I decided to create my own,” Wakamiya told Fortune.\nWakamiya, who first started using computers when she was 60-years-old, ultimately created a game in March that is based on the Japanese doll festival, Hinamatsuri, a holiday that celebrates the health and well-being of girls. And to appeal to older players, its pace is slow and its narrator speaks slowly.\nGet Data Sheet, Fortune’s technology newsletter.\nWakamiya will be the oldest developer attending WWDC, Apple’s annual developer conference that starts Monday in San Jose, Calif. Like many of her fellow attendees, Wakamiya’s free app, called Hinadan, is available in Apple’s App Store, and she is eager to create more.\nIn contrast, the youngest attendee at this’s year’s WWDC is Yuma Soerianto, a 10-year old boy from Melbourne, Australia who started coding at age six by following online courses on Code.org and from Stanford University that he found on Apple iTunes U, which provides free college courses online. In four years, he has created four apps for Apple’s App Store, including Weather Duck, a weather app for kids.\nDuring his nearly 20-hour journey to San Francisco for the conference, Soerianto created another app that lets users easily calculate the sales tax on what they’re thinking of buying.\nWakamiya and Soerianto are attending WWDC this year as part of an Apple scholarship program that gives hundreds of free tickets to developers worldwide who create apps for Apple devices. Apple has been making a big effort to increase diversity at WWDC, which like most tech conferences, has mostly attended by white and Asian males.\nThis year’s WWDC is the most international yet, according to Apple, and has the most students from elementary, middle and high schools. But the company declined to provide any numbers around the increase in international attendees or students.\nStill. Apple feels it’s making progress.\n“I feel like we are really starting to making a change,” Esther Hare, Apple’s senior director of developer marketing at Apple, said in an interview with Fortune.\nThe scholarships are also part of Apple’s push to get younger people to use Apple products and services. In 2016, Apple released a new iOS app called Swift Playgrounds that teaches children and young adults how to create mobile apps using Apple’s own developer language, Swift. A few weeks ago, Apple announced that it had created a course for learning Swift at six U.S. community colleges.\nFor Apple, the benefit of attracting young engineers to develop iOS apps is similar to convincing them to use the latest iPhone and MacBook. The company wants to attract loyal developers who will create interesting apps for iOS and expand the technology giant’s mobile app ecosystem. These developers can also be evangelists for Apple’s services.\nIt’s already happening with 10-year-old Soerianto. In August 2016, he created his own YouTube channel called “Anyone Can Code,” where he posts video tutorials about how to create iOS apps using Swift.\n“It used to be that you were cool if you had the latest and greatest thing, and now it’s cool to actually be creating the greatest thing,” said Hare.\nBut it’s not just youth that Apple is looking for. “We need developers from all different backgrounds,” Hare added, which is why she’s excited about Wakamiya’s passion for creating apps.\nAlthough she only debuted her first app a few months ago, Wakamiya says she already has other ideas for mobile apps. And she hopes to learn more about how to write the code for it during the coming week at WWDC.\n“Technology has now become my new hobby, ” Wakamiya said.",
        "sentiment": 0.2754827143653529
    },
    "article_12": {
        "title": "Developer access to iPhone's NFC chip coming in iOS 11.",
        "body": "Developers coding for iOS 11 will be able to create apps that can read NFC tags, opening the door for the wireless exchange of information between an iPhone and various connected devices in a user's environment.\nThe NFC chip in the iPhone is currently only used to handle contactless Apple Pay transactions and Passbook check-ins, but a new framework detailed in a developer resource published shortly after Apple's Worldwide Developers Conference keynote on Monday lays the foundation for multiple use cases by third-party apps.\nCalled \"Core NFC\", the framework will allow apps to read Near Field Communication tags that are compatible with the NFC Data Exchange Format (NDEF), which is supported by iPhone 7 and iPhone 7 Plus handsets. The developer support document overview describes the possibilities afforded by the new framework like so:\n\"Your app can read tags to give users more information about their physical environment and the real-world objects in it. For example, your app might give users information about products they find in a store or exhibits they visit in a museum.\"\nApple has limited third-party access to NFC hardware since it first appeared in the iPhone 6, and has closely guarded the technology, as evidenced in the company's ongoing spat with Australian banks eager to use Apple's Wallet NFC implementation in their own apps.\nHowever, the possibilities for NFC outside of banking look set to expand with Apple's next-generation mobile operating systems. Indeed, Apple also demonstrated a new use case for NFC in Watch OS 4, which will allow the Apple Watch to interface with gym equipment and transfer fitness data like heart rate and calorie burn between devices in real time.\nHow privacy concerns surrounding NFC interfacing will be overcome remains to be seen, but it should be interesting to see the various use cases developers can come up with once iOS 11 launches in the fall.\n(Via Engadget.)",
        "sentiment": 0.028872599452733995
    },
    "article_13": {
        "title": "China uncovers massive underground network of Apple employees selling customers' personal data",
        "body": "Chinese authorities say they have uncovered a massive underground operation involving the sale of Apple users’ personal data.\nTwenty-two people have been detained on suspicion of infringing individuals’ privacy and illegally obtaining their digital personal information, according to a statement Wednesday from police in southern Zhejiang province.\nFile photo: Wikicommons.\nOf the 22 suspects, 20 were employees of an Apple “domestic direct sales company and outsourcing company”.\nThe suspects allegedly used an internal company computer system to gather users’ names, phone numbers, Apple IDs, and other data, which they sold as part of a scam worth more than 50 million yuan (US$7.36 million).\nThe statement referred to “domestic employees of Apple” but it was unclear whether they were directly employed by the company or by Apple suppliers or vendors. It also did not specify whether the data belonged to Chinese or foreign Apple customers.\nAn Apple spokesman declined to comment on the matter. The local police did not respond to requests for comment.\nSee also: China users complain of iPhone 6s Plus catching fire or exploding, consumer watchdog says\nFollowing months of investigation, the statement said, police across more than four provinces — Guangdong, Jiangsu, Zhejiang, and Fujian — apprehended the suspects over the weekend, seizing their “criminal tools” and dismantling their online network.\nThe suspects allegedly charged between 10 yuan (US$1.50) and 180 yuan (US$26.50) for pieces of the illegally extracted data.\nThe sale of personal information is common in China, which implemented on June 1 a controversial new cybersecurity law aimed at protecting the country’s networks and private user information.\nIn December, an investigation by the Southern Metropolis Daily newspaper exposed a black market for private data gathered from police and government databases.\nReporters successfully obtained a trove of material on one colleague — including flight history, hotel checkouts and property holdings — in exchange for a payment of 700 yuan (US$100).\nAFP have corrected this piece to clarify that the suspects concerned were not directly employed by Apple.",
        "sentiment": -0.5055246044571201
    },
    "article_14": {
        "title": "OnePlus Mocks Removal of Headphone Jack in iPhone 7 While Copying its Design for New OnePlus 5",
        "body": "OnePlus today introduced its new flagship device, the OnePlus 5. During the event where the new phone was announced, OnePlus threw some shade at Apple, mocking the removal of the headphone jack in the iPhone 7 and the iPhone 7 Plus.\n\"On the bottom, you'll notice that we ditched the 3.5mm headphone jack. The elegance of the overall design is instantly heightened. And who needs a headphone jack anyway? That's why Bluetooth exists, right?\" deadpanned Diego Heinz, a designer at OnePlus. \"Just kidding. Of course the OnePlus 5 has a headphone jack.\"\nClip courtesy of iPhone Addict\nHeinz goes on to pull up a tweet on the subject of headphone jacks, displaying a poll where 88 percent of 8,000 responders said they \"like headphone jacks.\"\nAhead of the launch of the OnePlus 5, there was a lot of discussion on whether OnePlus would follow in Apple's footsteps and remove the headphone jack from the device. There were early design leaks and cases that featured no headphone jack, sparking speculation and leading to the on-stage joke.\nThis isn't the first time an Apple competitor has mocked the company's design decisions. When Samsung introduced the now-defunct Galaxy Note 7 in August of 2016, Samsung marketing VP Justin Denison made sure to point out the device's headphone jack. \"Want to know what else it comes with?\" he asked. \"An audio jack. I'm just saying.\"\nUnlike many of Apple's design choices, the decision to eliminate the headphone jack from the iPhone 7 and the iPhone 7 Plus has not caught on with other smartphone manufacturers, likely due to the negative reaction from consumers. Though Apple has introduced wire-free AirPods and included Lightning-based EarPods along with the iPhone 7 and 7 Plus, many iPhone customers continue mourn the loss of the headphone jack.\nThough the OnePlus 5 still has a headphone jack, the company has adopted many other design elements from Apple, with curved edges, rounded rear antenna bands, a dual camera complete with Portrait Mode, and a \"Slate Gray\" or \"Midnight Black\" casing. In fact, The Verge called it \"a slightly smaller iPhone 7 Plus that runs Android.\"\nThe OnePlus 5, which is priced starting at $479 for 64GB of storage, features a 5.5-inch AMOLED display, a high-end Snapdragon 835 processor, up to 8GB RAM, fast charging, haptic feedback, a 16-megapixel wide-angle camera, a 20-megapixel telephoto camera, and a 16-megapixel front-facing camera.",
        "sentiment": -0.024233332227753555
    },
    "article_15": {
        "title": "PayPal CEO claims Apple Pay’s person-to-person payment service will struggle to compete",
        "body": "PayPal CEO Dan Schulman has dismissed the person-to-person Apple Pay service coming to iOS 11 later this year. He said that it would struggle to compete against PayPal’s own Venmo app …\nSchulman made the comments in an interview with the Telegraph.\nMr Schulman suggested it would struggle to gain traction because it is not available on non-Apple devices, unlike PayPal. “We’re technology agnostic,” he said in an interview with The Telegraph. “Many individuals are [a] multi-operating system; they can have an Android phone, a Microsoft PC and an Apple tablet. You don’t want a different payment methodology on each of those things … you want a consistency across that.”\nHe also claimed that Apple is at a disadvantage as it is not a payment processor itself, having to work with other companies.\nWe own the full value proposition, Apple can never do that because they don’t do the risk associated with it, they don’t do the onboarding, they can only provide what they hope is a good user interface.\nSchulman’s remarks of course fall into the ‘he would say that, wouldn’t he’ category.\nThe detail of what Apple plans for its own peer-to-peer payment service isn’t yet known. I made a feature request back in March for a bar tab/restaurant bill feature.\nCheck out 9to5Mac on YouTube for more Apple news!\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.4342420235542314
    },
    "article_16": {
        "title": "First Alleged iPhone 8 Part Leaks Surface",
        "body": "Our first glimpse at components that could be destined for the much-rumored 5.8-inch \"iPhone 8\" and its 4.7 and 5.5-inch companion devices surfaced this morning in a post on reddit. The images are said to be sourced from a case manufacturer who received them from a glass supplier in China.\nThe first photo depicts what is said to be the front and back panel of the iPhone 8, with the front panel featuring a super thin bezel around all sides along with a top bar that could perhaps house a front-facing camera, microphone, and speaker. There's been some question on how Apple will handle the front-facing camera and mockup devices and renderings haven't offered a clear picture.\nSome design renderings have shown a section at the top of the device similar to the front panel in this image, while others seem to feature a bar that extends fully across the top of the device.\nThe rear panel features a vertical dual-lens camera and a separate protruding lens component, with no rear Touch ID in sight, in line with rumors suggesting Apple has indeed figured out how to build Touch ID into the display of the device.\nA second photo depicts the two alleged iPhone 8 components next to alleged components for the 4.7-inch iPhone 7s and the 5.5-inch iPhone 7s Plus, two devices that are rumored to be launching alongside the OLED iPhone 8. All three rear shells are said to be made from glass in order to support wireless charging, and that all three devices will get wireless charging is a rumor we've heard before from KGI Securities analyst Ming-Chi Kuo.\nWhile these images are in line with many rumors that we're heard about Apple's upcoming devices, there's no way to verify their authenticity. They could very well be from a clone device or a dummy device created based on the iPhone 8 design leaks and rumors that have circulated.\nEven if fake, these panels are based on supply chain information and rumors and do perhaps provide an idea of what actual iPhone 8 components might look like. Still, it's best to view these leaks with some skepticism until we begin to see more part leaks to corroborate the design.",
        "sentiment": -0.4542004824616015
    },
    "article_17": {
        "title": "From 1st of July and forward, the police in Norway can force a person to use your finger to unlock Touch-ID. Unacceptable?",
        "body": "Du må bruke tommelen hvis politiet ber om det\nMen du kan ikke straffes for å nekte å oppgi PIN-koden din.\nKamera Finn Jarle Kvalheim, Tek.no, Domstol.no , Cornelius Poppe / NTB Scanpix\nEr du en av de mange som bruker tommelen til å låse opp mobilen din? Det gir enkel og kjapp sikkerhet hvis uhellet er ute og mobilen mistes. Men hvis telefonen eller nettbrettet ditt er sikret med fingeravtrykk kan politiet nå pålegge deg å bruke tommelen.\nDet er nettstedet Politiforum.no som melder om stortingsvedtaket som endrer Straffeprosessloven, og endringen går altså ut på at politiet nå skal kunne ransake låste og krypterte datasystemer på lik linje med åpne.\nKan kun kreve fingeravtrykk, ikke pin-kode\nMen hva betyr egentlig lovendringen? Vi tok kontakt med tingrettsdommer i Oslo Tingrett, Ina Strømstad.\nDette har politiet lov til å tvinge deg til fra 1. juli dersom de ønsker å ransake telefonen din. Kamera Finn Jarle Kvalheim, Tek.no\n– Det betyr at politiet fra og med 1. juli kan, eventuelt ved bruk av tvang, pålegge vedkommende å åpne telefonen, svarer Strømstad.\n– Det virker å være en del som mener at PIN-kode eller passord ikke omfattes av dette, men vil det ikke kunne være straffbart å nekte å åpne produktet på den måten?\n– Det er ikke gitt hjemmel for å straffe manglende medvirkning.\n– I hvilke typer saker er tvang aktuelt?\n– Det kan være aktuelt i alle typer saker der politiet har tatt telefoner eller nettbrett i beslag, for eksempel narkotikasaker, drap, voldtekt eller økonomiske straffesaker.\n– Hva skjer dersom telefonen er sikret med PIN og ikke de nødvendige opplysningene gis?\nTingrettsdommer og medlem av Dommernes mediegruppe, Ina Strømstad, forklarer at du kan tvinges til å bruke tommelen, men ikke straffes for å nekte å oppgi passord. Kamera Lise Åserud, Scanpix/NTB\n– Dersom politiet for eksempel tar beslag i en PC med passordbeskyttelse og vedkommende ikke gir passordet, må politiet selv åpne PC-en, men dersom den er låst med biometrisk kode har de altså fått hjemmel til å bruke tvang.\n– Finnes det noen tilfeller der det kan være legitimt å nekte likevel?\n– Telefonen kan inneholde opplysninger som politiet ikke har krav på å få, for eksempel helseopplysninger og advokatbetroelser som er omfattet av lovbestemt taushetsplikt.\n– Hva skjer da?\n– I slike tilfeller skal beslaget sendes retten for sortering og gjennomgang.\n– Når tas det beslag?\n– Politiet foretar en ransaking på ferske spor eller en beslutning av påtalemyndighet eller retten lenger ut i etterforskningen. Det de tar under ransakingen kalles beslag. Dersom beslaget inneholder taushetsbelagt materiale, for eksempel fra en lege eller en advokat, skal beslaget sendes retten. Retten foretar en gjennomgang og sortering av innhold, avslutter tingrettsdommer Ina Strømstad.\nOvergrepssak utløste lovendringen\nUtgangspunktet for lovendringen er saken mot en serieovergriper i fjor, der politiet tvang frem åpning av den mistenktes telefon. Men omtrent samtidig slo høyesterett fast i en annen sak at politiet ikke kunne bruke denne metoden, hvorpå overgrepssaken ble satt i bero.\nPolitikerne kom raskt på banen og mente at dette burde politiet få lov til, og det er den lovendringen som nå trår i kraft om en ukes tid.\nForsvarer sterkt kritisk\nMarius Oscar Dietrichson er leder for Forsvarergruppen i Advokatforeningen. Han stiller seg kritisk til den nye lovendringen. Kamera Cornelius Poppe / NTB scanpix\nMarius O. Dietrichson, leder av forsvarergruppen i Advokatforeningen, mener imidlertid lovendringen går for langt.\n– Tvangsmessig tilgang til biometriske låsingsdata burde vært begrenset til fingeravtrykk, ikke biometri generelt. En ting er å tvinge tommelen til mistenkt borti telefonen slik at den låses opp. Det må den mistenkte kan hende finne seg i, sier Dietrichson.\nProblemet er ifølge ham at også andre biometriløsninger blir med på lasset, og de kan kreve andre former for tvang for å åpne.\n– Det som er verre er at politiet med fysisk makt skal tvinge annen biometri som for eksempel data fra øyepupillen, som krever dyp gjennomlysing av øyet, tatt med en mekanisme som over tid blir holdt tett inntil øynene med åpne øyelokk. Skal dette gjøres med tvang, skjønner alle at alvorlig skade fort kan oppstå.\n– Når det ikke er dokumentert behov for innhenting av slike låsingsdata, kun fingeravtrykksdata, så burde ikke loven vært utformet så generelt.\nDietrichson lurer også på hvorfor enhver borger kan rammes av denne typen tvang, og ikke bare de som er under etterforskning for et straffbart forhold, og fremhever at det vi har på telefonene våre både kan være sensitivt og personlig.\n– Det er en betydelig mangel ved lovforslaget at grensene for den fysiske maktbruken ikke er nærmere trukket opp.\n– Med tanke på at lovhjemmelen er i spenn mot andre grunnleggende rettigheter, som rett til å bli behandlet med verdighet, og siktedes rett til å ikke bidra med informasjon til politiet i sak mot en selv, er det underlig at beslutningsmyndigheten er lagt til påtalemakten og ikke til retten, avslutter Dietrichson.\nLes også: Bruker du ansiktsgjenkjenning på Galaxy S8 kan den lures med et bilde »",
        "sentiment": 0.25484496862330336
    },
    "article_18": {
        "title": "Apple finally gives iOS a proper file management system with new Files app",
        "body": "Mix is a tech writer based in Amsterdam that loves cinema and probably hates the movies that you like. Tell him everything you despise about (show all) Mix is a tech writer based in Amsterdam that loves cinema and probably hates the movies that you like. Tell him everything you despise about his work on Twitter .\nFollowing some speculative chatter in the Twitterverse, Apple has at long last introduced a much-needed file management application for iOS that gives iPhone and iPad users significantly more control over their files.\nAccording to an announcement made during the company’s flagship software WWDC keynote, the app will be called Files. The management system will come with support for nested folders and spring loading. It will additionally offer a search option as well as a dedicated ‘Favorites’ tab for easy access.\nThis is a massive move for the Big A as it virtually transforms iOS from a mobile operating system to something with legitimate desktop potential.\nThe closest thing to a file management system iOS previously had was iCloud drive as well as third-party solutions like Dropbox. With the launch of Files, the company is giving iPhone and iPad users more flexibility to use their mobile devices as improvised desktop stand-ins – as far as file management goes at least.\nThe good thing about the app is that it will continue to work with iCloud and third-party apps like Dropbox, Adobe Creative Crowd and more.\nIn addition to the update to Files, Apple is also updating the file management system on macOS. The new High Sierra will land with a revamped file system with built-in crash protection measures, ‘Safe’ document saving functionality and native encryption.\nAmong other things, the newly introduced Apple File System (APFS) will support instant file and directory cloning, zero copy snapshots and fast directory sizing.\nFollow the rest of our coverage from WWDC17 here.",
        "sentiment": 0.06132227728764216
    },
    "article_19": {
        "title": "Apple releases iOS 11 beta 2 to developers",
        "body": "[UPDATE 6/26: Apple has released a second iOS 11 beta 2 build labeled 15A5304j following 15A5304i last week. The new version is not available OTA but listed on Apple’s developer portal.]\nFollowing up on last week’s release of the first iOS 11 developer beta, Apple has begun rolling out the second beta. iOS 11 is jam-packed with a ton of features, enough to be packed into our 100+ new features videos.\nDevelopers looking to update to the latest update can do so through their iOS settings or by downloading the beta through Apple’s Developer Center.\nWe’ll be digging into iOS 11 beta 2 throughout the day, but be sure to catch up on everything we’ve seen thus far with the previous posts below:\nApple has announced that a public beta preview of iOS 11 will be out later this month through beta.apple.com. If you’re thinking about installing the beta on your personal device, you’ll want to read this first…\niOS 11 beta 2 Release Notes\nGeneral New Features • AddedAVRoutePickerViewtotheAVKitframeworkandAVRouteDetectortothe AVFoundation framework for enabling users to choose the route for playing content when multiple routes are available. Use AVRouteDetector to determine if multiple routes are available when route detection is enabled. If multiple routes are available, use AVRoutePickerView to present an interface for the user to choose the routes. 32-bit Apps Resolved Issues • Selecting Learn More from the prompt after tapping an already installed 32-bit app now opens the Settings App. (32340711) Known Issues • Syncing 32-bit apps via iTunes leaves a placeholder for the app. (32356790) • iOS apps may target iOS 10 or earlier to continue including a 32-bit slice. (31597913) Deprecations • 32-bit apps will not run on future betas of iOS 11. (26402174) 3D Touch Resolved Issues • Using 3D Touch with data detectors (phone numbers, addresses, and so on) now works correctly. (30504832) 3rd Party Apps New Issues Tweetbot may not be able to post tweets containing photos that have been recently taken. (32569113)\nVSCO may throw an error when importing photos that have been recently taken. (32582234)\nSquare Cash may crash on or shortly after launch. (30926902)\nCiti Mobile may crash on launch. (31336493)\nAirplay may not work in some third-party apps. (32819077)\nKakaoTalk may crash on launch or after typing. (32320793)\nSlingTV may play back only the audio. (32649488)Resolved Issues• Kindle books now sync as expected. (30878446) • Facebook Messenger now launches when the Facebook app is not installed. • The video playback controls in Amazon Video should now work correctly. (32056010) • Navigation bars should now look correct. (32076094) • Tencent Video should no longer crash on launch. (32343324) • Third-party keyboards should now work if not allowed full access. (32494032) • The audio should no longer drop during Skype calls. (32434672) Known Issues • DirectTV may crash on launch. (29533442) • MobileIron Mobile@Work may crash on launch. (31929650) • Users may be unable to log in to Pinterest using their email address. (31866166) Android Migration Resolved Issues • Migrating from your Android phone now works correctly. (31816854) App Analytics Resolved Issues • Non product page view impressions are now captured correctly. (31561060) App Icons Known Issues After restoring a device from an iTunes backup, some app icons on the Home screen may appear white. Reboot the device to show the correct app icon. (32303701)\nThe prompt that appears while changing an icon displays a placeholder instead of the alternative app icon image. (32165847)App StoreNew Issues• Promoted in-app purchases do not use the developer-specified sort order. (30877083)Resolved Issues• Apps over 100 MB should no longer download over Cellular connection after acknowledging the warning prompt. (32235051)Known Issues\nLaunching the App Store stops other audio. (32043325)\nAttempting to run TestFlight without an active AppStore Apple ID results in a login failure. (32230818) After restoring from an iTunes backup, previously offloaded apps do not appear on the Home screen, and must be manually downloaded from the App Store. User data for the app is not affected, and is present when app installation completes. (31968368)\nAfter restoring from an iTunes backup, applications may get stuck in a waiting state. (32442832Apple IDNew Issues Some accounts using a phone number as the Apple ID may be unable to add certain payment types. (31677442)\nAccounts using a phone number as the Apple ID may not be able to create an Apple ID for a child family member. (32130392)Apple PayNew Issues• ApplePaySession.canMakePaymentsWithActiveCard returns false even when the merchant identifier is valid and appropriate payment methods are available. (32613797)ARKitKnown Issues\nContinuingfromabreakpointwhiledebugginganARSessionmayresultinVIObreaking. Any visual objects placed in the world/anchor are not visible. (31561202)\nARSessionConfiguration is only supported on iOS devices with an A9 or later processor and will be enabled for all iOS 11 devices in a future beta.\nARWorldTrackingSessionConfiguration is only supported on iOS devices with an A9 or later processor.AVFoundationResolved Issues\nThevaluesofthelensDistortionLookupTableand inverseLensDistortionLookupTable properties of AVCameraCalibrationData are now centered properly. The 0 value represents no elongation or shrinkage. (32339695)\nTheCGImageRepresentationandpreviewCGImageRepresentationmethodsof AVCapturePhoto now return the correct values. For more information, see the documentation. (31392054)\nAVCapturePhoto now returns the correct result when accessing the fileDataRepresentation property of an uncompressed buffer (420f/420v/BGRA), instead of a TIFF file format representation. (31902960) Known Issues ThecameraCalibrationDatapropertyofAVCapturePhotoreturnsnilwhen cameraCalibrationDataDeliveryEnabled is set to true, unless you also set depthDataDeliveryEnabled to true. In a future beta, you’ll be able to request dual photo capture and camera calibration data capture and receive wide and telephoto buffers plus the camera calibration data for both (without being zoomed to 2x and delivering depth data to the photo). (32209427)\nStill capture requests fail and the video stream stops producing a buffer when using the 720p30 video format with the depthDataDeliveryEnabled property of AVCapturePhotoSettings set to true. (32060882)\nDepthvaluesinthenondefault160x120and160x90depthdataformatsarehalfofthe expected values, and disparity values are twice the expected value. (32363942)BluetoothResolved Issues Connection issues for Bluetooth accessories using Wireless iAP protocol are now more reliable. (31439542)\nBeta 2 adds full functionality for the LE L2CAP channel feature. (32493297)CalendarNew Issues\nButtons for Day, Week, Month, and Year may not trigger on the first tap. Subsequent taps should function as expected. (31883496)\nAfter reinstalling Calendar, the icon may be blank until the device is restarted. (31613835)CarPlayResolved Issues• Users should no longer get an error message when selecting Don’t Reply after reading a message in CarPlay. (32099700)CloudKitKnown Issues\nCloudKit does not support unsigned long long values with the high-order bit set. (30567424)\nApplicationsthatuseCKModifyRecordsOperationshouldspecifyanappropriate value for CKModifyRecordsOperation.isAtomic. If your client is compiled against watchOS 4.0, operations enqueued against the default CKRecordZone have new behavior because atomic is true by default. If the operation hits a “preflight” failure (most commonly, a network issue uploading a CKAsset, or a malformed CKRecord), the entire operation is canceled. (30838858) Connectivity New Issues iPad prepaid data plan purchases made on the device may fail on a cellular connection.Workaround: Purchase the data plan while connected to Wi-Fi.\nSome devices may take up to 30 seconds to connect to a cellular network after restartingor powering on. (32727321)\nTo activate a Sprint Cellular data plan on iPad, open Settings and choose General > Reset > Subscriber Services, enter your password, and select Reprovision Account in the dialog that appears. (32600925)\nReader mode utilizing NFC may not function as expected on all devices. (32721033)Control CenterResolved Issues\nThe expanded Wi-Fi UI in Control Center now updates the network name when transitioning between networks. (32280116)\nThe Bluetooth button behavior in Control Center now mirrors that of the Wi-Fi control. (32300000)Core SpotlightResolved Issues• Indexer file dragging no longer fails for both package file types or for files whose URL doesn’t have a matching absoluteString and path. (32354867)Do Not DisturbResolved Issues• Do Not Disturb While Driving is enabled starting with beta 2. (32232545) EventKit Known Issues • Storing data to a non default event store in EventKit may not work. (31335830) Family Sharing New Issues\nIf payment verification is required, Family setup may not launch after the purchase of an Apple Music family membership. (32056496)Workaround: Invite family members from Family Sharing settings.\nPending invitations may not show in Family Sharing settings. Family members will appearonce they accept their invitations. (32602074)\nAfter sharing iCloud storage with family members, the confirmation screen may not close. (32458127) Sharing your location with family members may not turn on location sharing. (32746961)Workaround: Share your location from Family Sharing settings.\nWhen creating an Apple ID for a child, the Terms & Conditions acceptance screen may freeze even though the Apple ID has been created. To use Settings, force quit and then open the app. (32365952)Files AppResolved Issues\nQuicklook thumbnails provided by QuickLook thumbnail extensions for custom UTI types now show the appropriate thumbnail. (32354934)\nVoiceOver now interacts correctly with Done, List, and Share buttons when VoiceOver is enabled and a user opens any document in the Recents tab. (32362561)Known Issues• The Files app may not be able to display a QuickLook for iWork documents. (32353448)FoundationNew Features\nAdded support for multipath TCP interactive and aggregate support.The multipathServiceType property of NSURLSessionConfiguration now supports the interactive as well as the aggregate mode on iOS. The interactive mode provides low latency for interactive flows. The aggregate mode increases the throughput by sending over both Wi-Fi and Cellular. The aggregate mode is available only for experimentation and can be enabled in the Developer settings. For more information, see the documentation. (32252152)\nAddedaschedulingAPItoURLSessionTaskthatallowsbackgroundURLSession clients to schedule tasks in the future, enabling easy background app refresh semantics for apps, watchOS complications, and more. The API also allows developers to update requests before transmission to address cases where the request has become stale when scheduled in the future. Additions include the earliestBeginDate, countOfBytesClientExpectsToSend, and countOfBytesClientExpectsToReceive properties of URSessionTask, and the URLSession:task:willBeginDelayedRequest:completionHandler method of URLSessionTaskDelegate protocol. (27866330)\nURLSessionTask adopts the ProgressReporting protocol providing a consistent mechanism for URLSession clients to track the progress of URLSessionTask using the new progress property. (30834550)\nAddedanAdaptableConnectivityAPItoURLSessionthatenablestaskstoautomatically monitor and wait for satisfactory network connectivity, instead of immediately failing with an error when connectivity is unsatisfactory. Additions include the waitsForConnectivity property of URLSessionConfiguration and the URLSession:taskIsWaitingForConnectivity: method of the URLSessionTaskDelegate protocol. • Added support for HTTP brotli content encoding to URLSession. By default, HTTP requests contain a br value (in addition to gzip and deflate) for the Accept-Encoding HTTP header, informing the web server that the user agent supports brotli encoding. The web server can send an HTTP body with Content-Encoding: br in the HTTP header to indicate that the content is brotli-encoded. URLSession automatically decompresses the HTTP body data and passes the decoded data back to the client in the same way it does for Content-Encoding: gzip. For binary compatibility reasons, URLSession brotli support is enabled only for apps built using the iOS 11 SDK. (27724985) Resolved Issues • Reads and writes on a secure connection that uses the new authenticating HTTPS proxy feature of URLSessionStreamTask now work correctly. (31916868) Known Issues ThefractionCompletedpropertyoftheProgressobjectreturnedby NSItemProvider does not advance in proportion to the data provider’s progress. (32385051)\nThesuggestedNamepropertyofNSItemProviderisnotusedwhenanNSData representation is requested as an open-in-place file. Instead, a temporary file name is used. (32342544)\nThevisibilityparameterinNSItemProviderisnotenforced.Allrepresentations are visible to all processes. (32233127)\nSupportforusingtheStringandURLtypeswithNSItemProviderisabsentinthis beta. (32138540)Workaround: Substitute String and URL with a different type.\npreferredPresentationSize is not available in this beta. (32501502)HapticsNew Issues• Performing a forced refresh on iPhone 7 and iPhone 7 Plus may produce an unexpected pop or sound. (32635793)HealthKitResolved Issues• Attempting to finish a workout route when no location data is inserted no longer throws an exception. (32307523) HomeKit New Issues • Siri may not recognize a HomeKit setup in devices upgraded to iOS 11 beta. (32338077) Workaround: Disable and then reenable the “Press for Siri” option in the settings for Siri, or make a change to a Home, such as creating a room or modifying an accessory name. • When multiple home hubs are configured, there may be issues when attempting to read from or write to Bluetooth accessories. (32578105) iBooks New Issues After deleting a book purchased from the store, a subsequent attempt to download again may fail. (32775084)Workaround: Open the task switcher by double-tapping the Home button, and force quit iBooks. After relaunching iBooks, download the book from the Purchases list.\niBooks may freeze when adding or removing a bookmark in a PDF document. (32625432)Workaround: Open the task switcher by double-tapping the Home button, and the force quit iBooks and relaunch iBooks.Resolved Issues Dropping PDFs and books into iBooks now works correctly. (32328715)\nAudiobooks now appear in the library after purchasing or after downloading again. (32150156)iCloudNew Issues • After restoring from an iTunes backup, some users may not be able to authenticate their iCloud credentials during setup. (32721872) Workaround: After competing setup, open Settings and choose iCloud to complete authentication. Resolved Issues When restoring from iCloud Backup in Setup Assistant, you should now see the correct list of backups. (31739878)\nSome services should now sync correctly on initial iCloud login. (32407057)Known Issues• Device Enrollment Program iPads do not support iCloud backups. (32027587)iTunesKnown Issues • After installing the beta, users who were logged in to separate iTunes and iCloud accounts may be logged out of their iTunes account and logged in to the same account as iCloud. (32228993) Workaround: Sign out of iTunes, and then sign back in with your original iTunes account. Managed Devices Resolved Issues • A user accepting a VPP invitation should now work correctly. (31509239) Known Issues MDM communication may not work correctly after restoring from a backup. To avoid this, make sure to back up your device after a new MDM enrollment. (32206090)\nFor MDM devices, entering an incorrect Apple ID password the first time during an app installation causes subsequent attempts to fail. Use the MDM install command again to complete installation. (31870510)\nMDM/VPP apps may become stuck in waiting. (32267165)\nUnenrolled Managed Devices may re install MDM apps upon restore. (32387929)MediaResolved Issues Elapsed time is now updated when touching play or pause, or when seeking during video content playback. (32065281)\nSong metadata now syncs correctly with iTunes. This includes play counts, skip counts, and associated timestamps. Smart Playlists that use these criteria, such as Recently Played, do not update. This does not affect Star Ratings or Love/Dislike. (31488141)\nIn Podcasts, selecting a station with multiple episodes may navigate to a blank screen. (32320460)Known Issues When a user revokes an application’s access to Media & Apple Music in Settings > Privacy > Media & Apple Music, the Music User Token is not revoked and can still be used with MusicKit REST APIs. (31932361)\nSettingthenowPlayerItempropertyofMPMusicPlayerControllerdoesnotwork. (32258814)\nMusic may not accept correctly entered iTunes Credentials. If this happens, sign in to your iTunes account via Settings before going back into Music. (31426701)Deprecations • requestPersonalizationTokenForClientToken is deprecated in iOS 11. Use getUserTokenFromDeveloperToken instead. In the current build, requestPersonalizationTokenForClientToken returns an error. In a future build, it will return valid music user tokens without requiring a change to your app. (32065560) Messages Resolved Issues When testing the new Message Filter app extension feature, if the first incoming message from an unknown recipient is marked as spam by the extension, they are now delivered to the user. (31986503)\nMessages on iCloud should now be available after a device has been offline. (32224851)Known Issues\nAttemptingtoinsertanMSMessageusingMFMessageComposeViewController results in a compose window with a blank staging area. (32087732)\nThelocalParticipantIdentifierandselectedMessagepropertiesarenilfor an MSMessage of style MSMessageLiveLayout when inserted into the transcript. (31374415)Music appNew Issues• When connected to certain car head units, it may be possible to play back only the first track in the Music library. (31974455)Resolved Issues• Notifications should now function as expected. (32463538)Known Issues • Turning off “Show in my Profile” for a playlist may still show the playlist name and artwork in your profile. (32560995) Networking New Issues • Wi-Fi password sharing and Personal Hotspot sharing on beta 2 don’t work with devices running beta 1. (32500217) Notes Known Issues\nIf a user restores from a backup in which the Notes app is deleted, the app may not work properly after being re installed. (32499971)\nUnder some circumstances, rotating an iOS device may cause Apple Pencil to become unusable. (32020094)On Demand ResourcesResolved Issues• When debugging On Demand Resources, if the target is configured to use asset packs embedded in the Product Bundle, the assets are now found. (32437929) Phone Resolved Issues Phone app should no longer crash when a voicemail message is deleted. (32394726)\nFor certain carriers in certain geographies, some services, such as Voicemail, Messaging, Call Wait, Call Forwarding, and so on, on Wi-Fi calling-enabled devices now work correctly. (32433588)Known Issues• An SOS notification may be sent out even if the user cancels it. (32413903)PhotosResolved Issues Thumbnails in the Photos import view and Image Capture app should now appear correctly. (32318758)\nRAW+JPG photos imported using the camera connection kit are now imported in the correct format. (32260701)\nCreating a new Photos or Kaleidoscope Watch Face from the Create Watch face share option in Photos no longer exits unexpectedly. (32011772)\nAirDrop sharing of Live Photos no longer results in an error when importing to Photos. (31971874)\nPhotos captured on iOS 11 now show the correct orientation on versions of macOS earlier than 10.13. (32311412)Known Issues• Editing a photo in Simulator does not work. (32298353) • Portrait images may change slightly while in Edit mode. (31889782) • Some third-party apps may not fully support HEVC and HEIF. (30292869)PopoverResolved Issues Immediately pressing Home from a popover-enabled app should no longer cause touch to become unresponsive. (32435759)\nLaunching a popover-enabled app from the Dock no longer flashes the popover or the Dock during the launch animation. (32429615)Quick LookResolved Issues • QuickLookthumbnailextensionscannowaccessthefileURLparameterof QLFileThumbnailRequest inside the provideThumbnailForFileRequest:completionHandler method of the QLThumbnailProvider protocol. (32354934) Safari New Features SFSafariViewController has improved the UI for 3D Touch previews by collapsing the toolbars to show just the domain, and by adding default preview actions. (27222648)\niOS 11 adds a new sync system for your Safari Bookmarks and Reading List to provide better syncing and security. Migration to the new sync system occurs silently after all the devices signed in to your iCloud account are running iOS 11. (22936727)New Issues When opening some links in Safari, it is possible to end up in a loop where Safari and another app repeatedly open each other. (32518579)Workaround: Press the home button and switch to another app to break out of the loop, and then force-quit Safari.\nSafariViewController goes blank when opening multiple tabs. (32337105) Workaround: Move the client into the background and then into the foreground to returnthe view to the previous page.\nWhen using WebRTC it may not be possible to route the audio to speakerphone. (32059254)Known Issues• The amount of memory used to load Safari Content Blocker rules has temporarily increased. This may cause your extension to exceed its memory limits. (32330531)Workaround: Use fewer Content Blocker rules until the memory issue is resolved. SettingsNew Issues• The Settings app may crash when adding or deleting keyboards. (32716997)• The Settings app may crash when deleting Podcasts from device storage. (32408313) Resolved Issues\nThe Offload App feature now works for apps that are shipped with the OS. (32283120)\nPersonal hotspot data usage is now included in the cellular data usage UI when the device acts as the host on T-Mobile US devices. (32262043)\nStorage graph and size information in Settings now updates correctly. (32295963)Known Issues\nSocial accounts have been removed from Settings in iOS 11. Third-party apps no longer have access to those signed-in accounts. (31687059)\nWhen installing a profile for the first time, there may be no response after tapping Install. (32249534)Workaround: Force-quit settings and then retry the profile installation. Setup Assistant New Issues • There is a UI issue affecting Sync on Reset and the Guide User to Backup feature. Users will see that the progress bar appears to stop at 90% even though the data sync has complete successfully. (32715751) Siri New Features • Added Hindi Dictation to iOS. Both English and Hindi words can be spoken and recognized. Three keyboards (Hindi, Hindi transliteration, Hinglish) are supported. The feature can be turned on by enabling the Hindi, Hinglish, and Hindi – Transliteration keyboards in Settings > General > Keyboards, and pressing the mic button on one of the newly added keyboards. (28833099) New Issues Using Siri to disambiguate between multiple phone numbers for a contact sometimes does not work. (32591639)Workaround: Tap a selection in the UI.\nWhen there are multiple contacts with the same first name and only the first name is used in a request to Siri to make a call, occasionally Siri places the call without disambiguating the contact. (32112055)Workaround: Include both the first and last name when requesting Siri to call a contact.\nWhen there are multiple unread messages in CarPlay, the Read Again button doesn’tfunction until Siri has read all messages so Siri moves on to the next thread. (32620799)Workaround: Wait for Siri to read all messages before tapping Read Again.\nSiri may confirm that a message has been sent even if it is not sent. (32836568)Resolved Issues\nSiri results for Weather, Stocks, and Movies queries are now legible. (32327773)\nSwitching Siri’s voice from the Settings screen no longer plays a different voice from the default voice. (32332081)\nThe Lists & Notes domain implementation for non-English languages should now work in the same way as US English. (30457023)Known Issues\nAdded new voices for both genders of Brazilian Portuguese, Canadian French, Dutch, and Swedish. Added new female voices for English and Mexican Spanish, and upgraded the voice for both genders of Japanese and Chinese. (32221950)\nAdded support for translation requests from English US to Chinese, Spanish, German, French, and Italian. (32221937) Weather snippets currently show a sash icon from the iOS Weather app. The snippet should show the icon for The Weather Channel. It is also missing an attribution that opens The Weather Channel app. (31429437)\nUsers may encounter disambiguation issues while using Siri for Phone and Messages. (32477407)\nSiri UI may not be dismissed automatically from the screen while using Messages with CarPlay. (32428580)\nThe spelling corrections feature provides users with the ability to correct Siri by spelling words when Siri makes mistakes recognizing speech. Spelling corrections can be triggered in the follow up utterances by phrases such as “It is spelled …”, “[No] I said/ meant Akane [spelled] A K A N E”. (28537116)SiriKitNew Issues\nSiriKit testing doesn’t work in Simulator. (32721342)Workaround: Test SiriKit on a device.\nSiri can go into an infinite loop when trying certain SiriKit Notes queries to mark areminder. (32398834)Workaround: The following queries work around the issue: • Mark the reminder with [App name]. • Mark a reminder as complete using [App name]. • Modify a reminder using [App name].• Modify a reminder with [App name].Resolved Issues\nIf the user does not mention the app name in the initial utterance, tapping the app in the disambiguation no longer launches the app instead of other possible Siri actions. (32361047)\nINImage objects constructed with URLs or image names now display correctly in the Siri UI. (31585381)Known Issues• When a user verbally tries to disambiguate between two or more SiriKit apps in a disambiguation list, Siri opens the app directly instead of asking for permission or for more details. (32188589)UIKitResolved Issues• SettingthedelaysContentTouchespropertyofUITableViewtofalsenowworks correctly and results in cells highlighting immediately on a touchdown event. (27102830) ImportingadocumentusingUIDocumentPickerViewControllernowreturnsa copy of the document. (32358695)\nIn drag and drop, move operations are supported only when the drag and the drop both happen within the same app. Starting in beta 2, the value of UIDropSession.allowsMoveOperation is set to false. (32416557)\nTheviewargumentofthelocationInView:methodofUIDragSessionand UIDropSession is no longer nullable. The declaration of the method has changed to location(in view: UIView). (31714683)Known Issues\nUIDocumentBrowserViewController does not show UIDocumentPickerExtensionViewController app extensions in the list of sources. While these will be re enabled in a future beta, consider using an NSFileProviderExtension instead, as they are integrated in UIDocumentBrowserViewController instead of being presented in a separate sheet. (31975976)\nSettingthetextContentTypetousernameorpasswordforUITextFieldinthe previewProvider property of UIDragItem is not fully implemented. During the drag session, each change to the previewProvider causes an immediate update, regardless of which app changed it. In addition, clearing the previewProvider does not cause the preview to go back to its non-overridden state. (30385458)\nSettingthepreviewProviderpropertyofUIDragItemimmediatelyafterthedrag item is created has no effect. (32284908)Workarounds:Implement dragInteraction:previewForLiftingItem:session: in your drag interaction’s delegate to change the lift preview. The preview carries over to the drag session.Change the preview during the drag session by setting previewProvider after the delegate’s sessionWillBegin is called. If you are using UITableView or UICollectionView, there is no direct equivalent of that method, so you may use a delay instead.\nThecanLoadObjectsOfClasses:methodofUIDragDropSessionwillberemoved in a later seed. Use canLoadObjectOfClass: instead. (32242367)\nWhen dragging more than five items, the drop/cancel animation uses a default animation. The system calls the dropping/canceling preview calls for the first five of these items, even though they are not used. In a later beta, the system will not make these calls, and instead provides an additional API for animating alongside items for which a custom animation cannot be applied. (32299785)\nDonotusetheclassUIURLDragPreviewViewbecausewillberemovedinalaterbeta. To make drag previews of URLs, use UIDragPreview and UITargetedDragPreview. (32306613) Table views in Interface Builder documents compiled with Xcode 9.0 may have fixed heights for rows, section headers, and section footers, and may not self-size by default. (32188814)Workaround: Set the table view rowHeight, sectionHeaderHeight, or sectionFooterHeight to UITableViewAutomaticDimension after the table view has been instantiated.\nUITableView has a new system gesture for quickly selecting rows. A two-finger tap on table views that support multiple selection sets the table view to editing, if it is not already, and selects the tapped row. Unlike a single-finger tap, which toggles selection, the two- finger tap always selects the tapped row and has no effect if the row is already selected. This new gesture is enabled only in apps built for iOS 11. (29127664)\nUITableView has a new property, separatorInsetReference, that changes how a custom value set in the separatorInset property is interpreted. By default, the value is .fromCellEdges, which means that custom separatorInset values are always interpreted as an inset from the edges of the cell, even in cases where table view would normally use larger automatic insets for the separator, such as a very wide table view when the cellLayoutMarginsFollowReadableWidth property is true.Set the separatorInsetReference to .fromAutomaticInsets to use the separatorInset as a fixed distance from the automatic inset that a table view would normally use.Note that you can always use UITableViewAutomaticDimension for any edge of the separatorInset that you set, to receive the automatic inset on that edge. (31000402)\nTable views now use estimated heights by default, which also means that cells and section header/footer views now self-size by default. The default value of the estimatedRowHeight, estimatedSectionHeaderHeight, and estimatedSectionFooterHeight properties is now UITableViewAutomaticDimension, which means the table view selects an estimated height to use. You should still provide a more accurate estimate for each property if possible, which is your best guess of the average value of the actual heights. If you have existing table view code that behaves differently when you build your app with the iOS 11 SDK, and you don’t want to adopt self-sizing, you can restore the previous behavior by disabling estimated heights by setting a value of zero for each estimated height property. (30197915)\nAddingcustomsubviewsdirectlytoUITableViewisnotsupportedandmightbreakina future iOS release. (29094519)\nThe behavior of the delete swipe action has been changed.When implementing commitEditingStyle: to delete a swiped row, delete the row in the data source and call deleteRowsAtIndexPaths: on the table view to show the swipe delete animation. Not calling deleteRowsAtIndexPaths inside of this method results in the swiped row resetting to its resting position. Do not display a confirmation dialog in the implementation of this method, and support undo to allow canceling a deletion. To show a confirmation dialog, use a UIContextualAction instead (described next). When implementing a destructive UIContextualAction, delete the row in the data source and call the completion handler with true. Do not call deleteRowsAtIndexPaths: in this case. If the deletion fails, call the completion false to cancel the deletion. Although it should generally be avoided, you can show a confirmation dialog to confirm the deletion, and then call the completion handler with true if the user confirms (after deleting the row from its data source), or with false if the user cancels. It is also advised to disable performsFirstActionWithFullSwipe on the UISwipeActionsConfiguration in this case. Note that the completion handler must be called in all cases. (31588888) When the user selects one of the Accessibility Larger Text content sizes as their preferred content size, UITableViewCell uses a new default layout that is optimized for the larger sizes. The numberOfLines property of UITableViewCell labels (both textLabel and detailTextLabel) changes to 0 (unlimited) by default when the Accessibility content sizes are in use. You may override this by explicitly setting the numberOfLines property. The standard image view and accessory views are aligned with the first line of text in the cell, and cell text wraps around the image in order to maximize the amount of text displayed per line. For the Value1, Value2, and Subtitle styles, the detailTextLabel is arranged underneath the standard textLabel. For UISwitch accessory views, the switch is located below the labels and aligned with the leading edge of the text. Because of these changes, which increase the height of the cell content at Accessibility content sizes, it’s important to use self-sizing cells to ensure that the row height increases as necessary, and to avoid using a fixed row height for all content sizes. (28102750)\nTheimageNamed:inBundle:compatibleWithTraitCollection:classmethod of UIImage now properly infers the UIDisplayGamut trait if it is not explicitly provided.If you are deploying to earlier versions of iOS, to provide the UIDisplayGamut trait in the trait collection, you pass to imageNamed:inBundle:compatibleWithTraitCollection:. You can obtain the correct value of this trait from the window or view that will display the image. Failing to provide the value can result in images failing to load on devices with P3 displays if the sRGB renditions of those images had been thinned out of the asset catalog. (29915518)\nUINavigationItem.searchController appears only for view controllers that use a UIScrollView. (32511772)Workaround: Set UINavigationItem.hidesSearchBarWhenScrolling to false.\nBy default, UIKit logging occurs only when unsatisfiable constraints are detected. Use the UIConstraintBasedLayoutThrowExceptionOnUnsatisfiableConstraints launch argument to add an assertion for early detection of the problem. The launch argument works in iOS 11 and later. (28123998)\nAUIViewthatmakesvisualchangesbothbyoverridingdrawRect:andbysettingthe layer contents may result in visual artifacts or other errors in iOS 11. Apps should use only one of the methods to make visual changes to a view. (31350188) Vision Resolved Issues TheRectangleTrackerAPIshouldshouldnolongerstoprespondingunexpectedly. (32332200)\nThe Vision API is now available from the macOS 10.13 and iOS 11 SDKs even if DEPLOYMENT_TARGET is set to a version earlier than the current OS.Known Issues• Facial landmarks identified by the Vision framework may flicker in temporal use cases such as video. (32406440)watchOSNew Issues Pairing an iPhone running a beta of iOS 11 and an Apple Watch running a version of watchOS earlier than 4.0 may fail. (32587160)Workaround: Attempt to pair the Apple Watch again.\nIn the Watch app, changes to Mail > Include Mail are not saved. (32553544)Resolved Issues\nOn an Apple Watch running a version of watchOS earlier than 4.0, location activity now correctly sets the location arrow in the status bar or in Settings. (31496053)\nwatchOS email alerts now use the configured settings. (32332614)\\\nChanges we’ve discovered in iOS 11 beta 2 thus far New orange color seen in Messages Echo effect (Thanks secDJ!)\nNew search options within Apple Music External locations are now seen in Files\nDo Not Disturb While Driving is enabled in beta 2\nYou can now select multiple items in Photos (similar to selecting multiple home screen icons) (Thanks Rida Rais!)\nIf you find anything new in iOS 11 beta 2 that we have yet to discover, let us know in the comments below!\nCheck out 9to5Mac on YouTube for more Apple news!\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2115918413553649
    },
    "article_20": {
        "title": "Ikea and Apple building AR app that’ll let you try out virtual furniture at home",
        "body": "Ikea is co-building a new augmented reality app together with Apple that will allow customers to try out virtual furniture at home, and then buy it.\nBuilt on ARKit, Apple’s new framework for powering augmented reality experiences on iOS devices, the app will basically superimpose tables, chairs and other furniture on top of your room, as seen through the lens of an iOS device’s camera.\nThe app leverages ARKit’s scene understanding and lighting estimation features that permit it to automatically find horizontal planes like tables and floors in a scene, as well as track and place objects on smaller feature points. ARKit even applies the correct amount and type of light to any virtual objects to match the current lighting conditions in your room.\nAccording to a local report in Di Digital, the app is launching in the Fall of 2017, shortly after iOS 11 releases for public consumption.\n“This will be the first augmented reality app that will enable you to make buying decisions,” said Michael Valdsgaard, Leader of Digital Transformation at Inter Ikea, to Di Digital. The executive couldn’t promise that the in-app payment feature will work in the first version of the app.\nThe app will launch with 500-600 products available in AR. “When we launch new products in the future, they will first appear in the AR app,” Valdsgaard says.\nIkea said recently that its LED bulbs and other smart lighting products would soon gain compatibility with HomeKit, Apple’s smart home management platform.\nAt WWDC 2017, Apple announced a number of improvements for HomeKit, including software-based encryption that could enable existing non-HomeKit-compliant devices to gain support for HomeKit via a simple firmware update.",
        "sentiment": 0.6152700331400741
    },
    "article_21": {
        "title": "Apple halves 2TB iCloud plan to $9.99 a month",
        "body": "Among the many announcements at WWDC yesterday, Apple cut the cost of its 2TB iCloud storage plan in half — from $19.99 a month to $9.99. This replaces the now-defunct 1TB plan that was previously offered at that price point.\nThat leaves three options for iCloud pricing now: $0.99 per month for 50GB of storage, $2.99 per for 200GB, and $9.99 per month for 2TB. Free storage (unfortunately) is stuck at a mere 5GB for now.\nThat 2TB plan is also potentially more useful, given that Apple also announced that family members using iCloud Family Sharing together will be able to split a single subscription for iCloud storage across every member of the family in iOS 11 and macOS High Sierra.\n$9.99 for 2TB of storage is a pretty good deal\n$9.99 for 2TB of storage is a pretty good deal when compared to competitors: Google Drive and Dropbox charge a similar $9.99 per month, but for only 1TB of storage, while Microsoft OneDrive maxes out at 1TB for $6.99 a month (although that also includes a copy of Office 365).",
        "sentiment": -0.07933490040401618
    },
    "article_22": {
        "title": "Apple’s AR is closer to reality than Google’s",
        "body": "Apple has often been accused of acting like it invented things that others have been doing for years. That complaint is not without merit, however Apple can lay claim to transforming existing things into mainstream successes, which takes no small amount of invention in its own right. Fingerprint authentication and contactless payments are just two recent examples, having both existed in Japan and on niche devices for over a decade before Apple raised them to global prominence with the iPhone.\nNext up on Apple's agenda is augmented reality, the act of superimposing digital data and visuals atop a live video feed of your surroundings — something that Google, Microsoft, and many others have been experimenting with for a long time. Apple is far from being able to claim it invented AR, but its new ARKit in iOS 11 is already showing signs to suggest that Apple will help bring AR into the mainstream faster and better than anyone else.\nThe chronic problem with augmented reality has always been one of practicality. You could have the most basic forms of AR on your regular phone, as provided by apps like Layar, which has been around since 2009, but those have never been particularly compelling. Or you could have more sophisticated and appealing augmentations, as presented by Google's Tango project, but you'd need a big fat phablet to lug around to make them happen. Apple's difference is to combine the convenience of your daily phone with the appeal of advanced AR.\nLooking at this distance-measuring app, it seems so simple and obvious. Of course your super-powered, multi-core phone should be smart enough to measure out basic distances, and there have indeed been many wonky apps trying to do that in the past. But measuring with AR, as already shown off by Google Tango phones, allows you a much more intuitive method for doing it. Having the phone actually aware of the three-dimensional space in its view allows for precise measurements, which can be represented with a neat hologram of a measuring tape. Apple’s advantage in the contest for doing this best is simple: while Google Tango demands special hardware, ARKit requires only that you have a recent iOS device. At WWDC earlier this month, Craig Federighi described ARKit as \"the largest AR platform in the world,\" and he was right.\nApple's AR will immediately reach millions of people who already have the requisite hardware. And while it looks to be functionally as flexible and capable as Google's Tango (check out some early examples of fanciful experiments with ARKit), its broader audience makes it much more enticing for serious developers to invest their time and money into. Google's Tango is about the future whereas Apple's ARKit is about the present.\nConsidering how little time it took to develop two convincingly accurate AR measuring apps with the iOS 11 beta, and reading the comments from their makers, Apple also appears to have an advantage in the ease of development with ARKit. It's exciting to think that there are still three months before the release of the next iPhone and the accompanying finalization of iOS 11, by which time Apple's big-budget app developer partners are likely to have a deluge of AR-enabled apps for people to play with. That's how stuff goes mainstream: as a big wave of change that touches everyone from casual Pokémon Go players to serious home DIY geeks figuring out how to arrange their living room furniture.",
        "sentiment": 0.22334162026111568
    },
    "article_23": {
        "title": "iPhone 8 Expected to Include Faster 10W USB-C Wall Charger",
        "body": "Earlier this year, Apple analyst Ming-Chi Kuo of KGI Securities said the widely rumored 5.8-inch iPhone with an OLED display will feature a Lightning connector with USB-C Power Delivery that enables fast charging capabilities.\nLending credence to that rumor, Barclays analyst Blayne Curtis today in a research note said the so-called \"iPhone 8\" will come bundled with a 10W power adapter with a USB-C connector and an integrated USB-C Power Delivery chip.\nCurtis said the USB-C Power Delivery chips built into both the iPhone and 10W power adapter will be supplied by Cypress Semiconductor. The research note suggests it'll be the same CYPD2104 chip used in the new 10.5-inch iPad Pro.\nAn excerpt from the Barclays research note distributed to clients, obtained by MacRumors and edited slightly for clarity:\nWe believe that in the iPhone 8, Apple likely includes Cypress Semiconductor's USB-C Power Delivery chip in the phone and an additional chip within the power brick in box (likely a new 10W, which would use a more integrated solution with Cypress Power Delivery).\nLike the new 10.5-inch and 12.9-inch iPad Pro, the so-called \"iPhone 8\" would be capable of fast charging with a Lightning to USB-C cable connected to the new 10W power adapter or Apple's 29W USB-C power adapter for MacBook.\nApple will presumably include a Lightning to USB-C cable in the box if it's going in this direction, possibly instead of the traditional Lightning to USB cable. Apple could also opt to include a female USB-C to male USB-A adapter in the box.\nApple's current 5W Power Adapter for iPhone and 12W Power Adapter for iPad both have slower USB-A ports.\nGiven the \"iPhone 8\" is expected to have around a 2,700 mAh L-shaped two-cell battery pack, faster charging would be a welcomed addition. The device is also widely rumored to feature wireless charging on top.",
        "sentiment": -0.033485217527909714
    },
    "article_24": {
        "title": "Swift Creator Chris Lattner Quits Tesla After Only Six Months in the Job",
        "body": "newyorksole said: This whole situation is weird to me. He left the largest company in the world to got to Tesla, left after 6 months and now wants someone else to hire him?\nI'm sure he got a lot of info from Tesla. Isn't the next company going to be a little weary of hiring him?\nYou would think people would be skeptical. He just seems carefree. Click to expand...\nHe quit? Tesla said he was not a good fit, something that they would not have volunteered to the press if Chris Lattner had quit. They would have said something like, we are sorry to see him leave, etc.I actually was surprised at him going there in that position in the first place (and was roundly told by some Apple fanboys that he was a god and not to question).... since he has more experience in compilers, tools etc. but I could find no history of AI or Machine Learning (I could be wrong on that one). I have always been impressed with the work he did with regards to LLVM and it's creation, found him to be a little hard headed with regards to Swift direction -- and felt he might be a square peg with a history of being in icon at his existing company.... going into a round hole. So I am not surprised it did not work out, just surprised it was this quick.[doublepost=1498042129][/doublepost]I doubt he voluntarily \"left\".... he was just a bad fit and it took Tesla 6 months to figure it out.... does not mean that he would be a bad hire for another company in another position. There is no doubt that in certain areas he is very talented.[doublepost=1498042237][/doublepost]The company also commented on Lattner’s departure:“Chris just wasn’t the right fit for Tesla, and we’ve decided to make a change. We wish him the best.”[doublepost=1498042804][/doublepost]Worse case scenario, Tesla will be an interesting acquisition when another company perfects autonomous driving",
        "sentiment": -0.21948944085410663
    }
}