{
    "article_0": {
        "title": "iPhone owners are about 21 times more likely to negatively judge a date who uses an Android phone",
        "body": "To a certain type of gadget user, an Android smartphone is a symbol of defiance. These users see Google’s software — its customization options, hardware affordability, and no-frills design — as the perfect refutation of the sterile, mass-marketed appeal of Apple’s iPhone. Your Tinder date, however, doesn’t care about any of that, according to cold, raw data. In fact, your date is judging you, and so are their friends, family, and likely everyone sitting in and around your table at dinner and then later on at the bar.\niPhone owners are far more likely to hate on Android phones\nAccording to a study conducted by Match.com and Research Now, iPhone owners are about 21 times more likely to negatively judge a date who uses an Android phone. On the flip side, Android owners are only 15 times as likely to negatively judge a date for opting for iOS.\nWhat this says about iPhone users isn’t really clear. Perhaps they’re haughty, condescending elitists who see technology as a badge of social status, and an $800 cellphone as a way to lord that over others. Or maybe they just really have no idea why your text messages are green and not blue. This confusing deviation from the norm could really freak them out — or in the case of this writer, get you coyly made fun of until the overwhelming shame forces you to trade in your Nexus. (We’ll leave the Google Pixel, an excellent and pricey Android smartphone, out of this debate.)",
        "sentiment": -0.5662414075976069
    },
    "article_1": {
        "title": "Firm That Helped FBI Break Into San Bernardino iPhone Gets Hacked, Tools Leaked Online",
        "body": "Now the hacker responsible has publicly released a cache of files allegedly stolen from Cellebrite relating to Android and BlackBerry devices, and older iPhones, some of which may have been copied from publicly available phone cracking tools.\nIn January, Motherboard reported that a hacker had stolen 900GB of data from mobile phone forensics company Cellebrite. The data suggested that Cellebrite had sold its phone cracking technology to oppressive regimes such as Turkey, the United Arab Emirates, and Russia.\nThe hacker claimed to have taken the newly released data from a remote Cellebrite server, and said they had extracted them from UFED images. They told Motherboard that the files were encrypted, likely in an attempt to protect Cellebrite's intellectual property, but that they managed to bypass the protections.\nCellebrite is an Israeli firm which specializes in extracting data from mobile phones for law enforcement agencies. The company's flagship product, the Universal Forensic Extraction Device (UFED), typically comes as a small, laptop-sized device, and can pull SMS messages, emails, and more from thousands of different mobile phone models. The investigator needs to have physical access to the phone to analyze it.\n\"It's important to demonstrate that when you create these tools, they will make it out. History should make that clear,\" they continued.\n\"The debate around backdoors is not going to go away, rather, its is almost certainly going to get more intense as we lurch toward a more authoritarian society,\" the hacker told Motherboard in an online chat.\n\"The ripped, decrypted and fully functioning Python script set to utilize the exploits is also included within,\" the hacker wrote in a README file accompanying the data dump. The hacker posted links to the data on Pastebin.\nIt's not clear when any of this code was used in the UFED. Many of the directory names start with \"ufed\" followed by a different type of phone, such as BlackBerry or Samsung.\nIn their README, the hacker notes much of the iOS-related code is very similar to that used in the jailbreaking scene—a community of iPhone hackers that typically breaks into iOS devices and release its code publicly for free.\nJonathan Zdziarski, a forensic scientist, agreed that some of the iOS files were nearly identical to tools created and used by the jailbreaking community, including patched versions of Apple's firmware designed to break security mechanisms on older iPhones. A number of the configuration files also reference \"limera1n,\" the name of a piece of jailbreaking software created by infamous iPhone hacker Geohot. He said he wouldn't call the released files \"exploits\" however.\nZdziarski also said that other parts of the code were similar to a jailbreaking project called QuickPwn, but that the code had seemingly been adapted for forensic purposes. For example, some of the code in the dump was designed to brute force PIN numbers, which may be unusual for a normal jailbreaking piece of software.",
        "sentiment": -0.5862614870891862
    },
    "article_2": {
        "title": "WSJ reporting Apple will ditch lightning connector in favor of USB-C in next iPhone",
        "body": "Apple’s lineup this year will come 10 years after the first iPhone hit the market. The iPhone 7 was introduced in September 2016.\nTOKYO— Apple Inc. has decided to adopt a flexible display for one model of the new iPhone coming out this year and has ordered sufficient components to enable mass production, people familiar with the matter said.\nApple had been studying flexible organic light-emitting diode, or OLED, screens similar to those used by rival Samsung Electronics Co. and had asked suppliers for prototypes, The Wall Street Journal reported in November.",
        "sentiment": 0.19617323018610477
    },
    "article_3": {
        "title": "Apple, Facebook, Google, and 94 others file opposition to Trump's immigration ban",
        "body": "A host of big-name tech companies including Apple, Facebook, Google, Twitter, and Microsoft have filed an amicus brief in a Washington state court opposing Donald Trump’s executive order on immigration. A total of 97 firms put their names to the document, which supports the state of Washington in its battle against what is widely considered a Muslim ban, each one stating that their “operations are affected” by the executive order.\n“The Order represents a significant departure from the principles of fairness and predictability that have governed the immigration system of the United States for more than fifty years,” the brief reads, indicating a philosophical objection from the signees. But they also present an economic argument, saying that the order also “inflicts significant harm on American business, innovation, and growth,” disrupting current operations, and making it “more difficult and expensive for US companies to recruit, hire, and retain some of the world’s best employees.”\nFull list of companies (1/2): pic.twitter.com/YfQ5dDeXM5 — Brian Goldman (@briangoldman) February 6, 2017\nAs well as established tech giants, the list of companies who signed the document includes newer power players such as Netflix and Uber, as well as successes like Spotify and Kickstarter. Amazon — which has its headquarters in Washington state — is not on the list, but was one of the first companies to support the state’s lawsuit against the order. Amazon refrained from joining the latest amicus because the state’s attorney general preferred that it remain part of the original complaint.\nConspicuously absent from the list is Tesla; its CEO Elon Musk has already shown an inclination to work with Donald Trump rather than push back against his hastily drawn-up policies. Musk notably asked Twitter for advice on how to tweak the immigration order, arguing that revoking it was impossible, and attended the president’s recent economic forum.\nWashington is the spearhead against the order\nWhile several federal courts across the United States issued temporary halts on president Trump’s immigration order, it’s Washington state that has mounted the strongest legal attack on the ruling. Bob Ferguson, the state’s attorney general, has led a strong campaign against the order, calling it “unlawful and unconstitutional,” and stating that it would have detrimental effects to Washington itself.\nToday’s Amicus brief shows that some of the United States’ biggest and most dynamic companies agree with Ferguson’s message. And as companies come to terms with how many of their own employees are affected by the travel ban, their support for Washington’s legislation shows a more hardline attitude than previously displayed. Indeed, by signing the brief, many of these firms are making their strongest statement yet on the Trump administration’s immigration order, and throwing their weight behind the best chance yet to have it scrapped.",
        "sentiment": -0.4729245568315188
    },
    "article_4": {
        "title": "Apple's Tim Cook: If You Work Only For Money, You Will Never Be Happy",
        "body": "Apple (AAPL) CEO Tim Cook delivered a message Wednesday to students at Scotland’s University of Glasgow, where he was awarded an honorary degree: “Don’t work for money.”\nThe millionaire tech boss, known for his comfortable yet measured speaking style, warned that being driven by money “will wear out fast, or you’ll never make enough and you will never be happy,” reports CNBC.\n“You have to find the intersection of doing something you’re passionate about and at the same time something that is in the service of other people,” Cook said, adding that “if you don’t find that intersection, you’re not going to be very happy in life.”\nAfter the ceremony, Cook joined students for what the university called a “fireside chat.” While encouraging students to find work they love instead of pursuing pure profit, Cook also acknowledged that he had been “fortunate” in landing his career, which last year earned him some $8.5 million, according to CNBC.\nDuring a Q&A session, Cook also reiterated his opposition to President Donald Trump’s immigration policy, the BBC reports. Apple was one of more than 120 tech companies that filed a legal brief condemning Trump’s executive order banning refugees and travel from seven predominantly Muslim countries.\nFor more on tech companies opposing Trump’s travel ban, watch Fortune’s video:\nCook reminded the audience that Apple was founded by Steve Jobs, the son of a Syrian immigrant, and said the ban had an immediate effect on international tech firms. A number of Apple employees were initially denied entry to the U.S. when the order, which has been temporarily stayed by a legal battle, was first implemented.\n“If we stand and say nothing it’s as if we’re agreeing, that we become a part of it,” the BBC quoted Cook as saying. “It’s important to speak out.”",
        "sentiment": 0.3881775044243444
    },
    "article_5": {
        "title": "Samsung strikes a $4.3B supply deal with Apple for OLED panels",
        "body": "Samsung Display, a subsidiary of Samsung Electronics, finalized a deal with Apple to supply the Cupertino-based company with 60 million OLED panels for the next-generation iPhone.\nThis is the second deal between the sides - previously they signed an arrangement that will see Samsung Display supply 100 million OLEDpanels for the upcoming iPhone.\nAccording to the source and Apple’s financial results, since 200 million iPhones were sold in 2016, the combined 160 million displays will make up about 80% of all shipments. Industry sources hinted about an OLED display only in the premium Apple model, but this deals suggest otherwise.\nNeither company has publicly commented on the deal so far.\nSource",
        "sentiment": -0.1445364449173212
    },
    "article_6": {
        "title": "Fake news is 'killing people's minds', says Apple boss Tim Cook: Apple chief calls on governments and technology companies to crack down on misinformation in public discourse",
        "body": "Fake news is “killing people’s minds”, Tim Cook, the head of Apple, has said. The technology boss said firms such as his own needed to create tools that would help stem the spread of falsehoods, without impinging on freedom of speech.\nCook also called for governments to lead information campaigns to crack down on fake news in an interview with a British national newspaper. The scourge of falsehoods in mainstream political discourse came to the fore during recent campaigns, during which supporters of each side were accused of promoting misinformation for political gain.\n“We are going through this period of time right here where unfortunately some of the people that are winning are the people that spend their time trying to get the most clicks, not tell the most truth,” Cook told the Daily Telegraph. “It’s killing people’s minds, in a way.”\nHe said: “All of us technology companies need to create some tools that help diminish the volume of fake news. We must try to squeeze this without stepping on freedom of speech and of the press, but we must also help the reader. Too many of us are just in the ‘complain’ category right now and haven’t figured out what to do.”\nHe said that a crackdown would mean that “truthful, reliable, non-sensational, deep news outlets will win”, adding: “The [rise of fake news] is a short-term thing. I don’t believe that people want that.”\nWhile instances were seen among supporters of both sides of the recent US election battle, Donald Trump’s campaign was seen by many as a particular beneficiary of fake news reports.\nAnd the US president’s team has been caught sending aides out to insist that a huge crowd had attended his inauguration, when the evidence showed a relatively modest audience was there.\nTrump’s spokesman, Sean Spicer, insisted that the event had attracted “the largest audience ever to witness an inauguration ” and Trump said he believed the crowd went “all the way back to the Washington Monument”.\nImages from the moment Trump was taking the oath showed the crowd was relatively small and went nowhere near as far back down Washington’s National Mall as the monument. Other evidence suggested a relatively small crowd in attendance.\nSenior aide Kellyanne Conway later characterised the Trump administration’s falsehoods as “alternative facts”.\nFake anti-Trump stories during the election included one in which it was falsely claimed that he had groped the drag queen and television presenter RuPaul. Hillary Clinton was scrutin ised over her claim that there was “no evidence” her emails had been hacked because the FBI director, James Comey, had concluded it was likely they had been.\nA study by economists at Stanford University and New York University published two months after November’s US presidential election found that in the run-up to the vote, fake anti-Clinton stories had been shared 30 million times on Facebook, while those favouring her were shared eight million times.\nIt said: “The average American saw and remembered 0.92 pro-Trump fake news stories and 0.23 pro-Clinton fake news stories, with just over half of those who recalled seeing fake news stories believing them.”\nBut it called into question the power of fake news reports spread on social media to alter the outcome of the election, saying that, “for fake news to have changed the outcome of the election, a single fake article would need to have had the same persuasive effect as 36 television campaign ads”.\nNevertheless, Cook demanded action to decrease the reach of fake news. “We need the modern version of a public service announcement campaign. It can be done quickly, if there is a will.”\nHe added: “It has to be ingrained in the schools, it has to be ingrained in the public. There has to be a massive campaign. We have to think through every demographic... It’s almost as if a new course is required for the modern kid, for the digital kid.\n“In some ways kids will be the easiest to educate. At least before a certain age, they are very much in listen and understand [mode], and they then push their parents to act. We saw this with environmental issues: kids learning at school and coming home and saying why do you have this plastic bottle? Why are you throwing it away?”",
        "sentiment": -0.6229046960361302
    },
    "article_7": {
        "title": "TIL Steve Jobs had 323 patents under his name. The founders of Google and Microsoft combined have less than 30.",
        "body": "Steve Jobs’s Patents\nThe 323 Apple patents that list Steven P. Jobs among the group of inventors offer a glimpse at his legendary say over the minute details of the company’s products — from the company’s iconic computer cases to the glass staircases that are featured in many Apple stores.",
        "sentiment": 0.9975423812866211
    },
    "article_8": {
        "title": "Apple patents screen tech capable of reading fingerprints without dedicated sensor",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nAn Apple patent grant on Tuesday suggests the company is looking to leverage its LuxVue acquisition to integrate display technology capable of reading a user's fingerprint without a dedicated sensor, a design feature rumored to see release with \"iPhone 8.\"\nAs published by the U.S. Patent and Trademark Office on Tuesday, Apple's U.S. Patent No. 9,570,002 for an \"Interactive display panel with IR diodes\" details a touch display that incorporates micro-LED sensing technology instead of the ubiquitous active matrix hardware seen on most mobile devices.\nThe IP was reassigned to Apple last April from LuxVue, a small company specializing in highly efficient micro-LED displays and associated technology. Apple purchased the firm for an undisclosed sum in 2014.\nAmong other facets, including the ability to completely replace bulky capacitive sensor components with strategically placed infrared light emitters and sensors, today's patent lays out a design for incorporating touch panels and fingerprint sensors using largely similar hardware. Interestingly, some embodiments jibe with rumors surrounding a rumored \"iPhone 8\" with full-face display, specifically rumblings about an \"invisible\" home button and Touch ID sensor.\nApple's current fingerprint sensing technology requires a capacitive drive ring to be in contact with a user's finger during operation. To create a completely clean display surface, as hinted at in multiple iPhone rumors, the company would need to fully integrate, or more likely remove, said drive ring from the fcover glass.\nIt is possible that Apple is looking to ditch Touch ID altogether as it moves to a new, more advanced system. For example, a touchscreen capable of acting as an input device and fingerprint scanner would save space and grant greater design flexibility. Finding a working technology, however, is difficult, as fingerprint sensor readings need to be highly accurate, much more so than a traditional touchscreen.\nLuxVue believes it solved the puzzle, or is at least on its way to doing so. According to the patent, micro-LEDs can be used as a surrogate for standard capacitive touch arrays. Specifically, separate IR emitting and sensing diodes connect to driving and selection circuitry to create a subpixel circuit. Due to their small size, these IR diodes can be embedded into a display substrate alongside RGB LEDs or on a microchip mounted to said substrate.\nDubbed \"interactive pixels,\" the subpixel arrangement could incorporate red, green, blue, IR emitting and IR sensing LEDs (RGBIRSIR), as well as other color arrays, in an extremely high resolution panel. In some embodiments, the system can be calibrated to perform any number of operations based on sensing component input. For example, the circuit might act as a traditional ambient light sensor to brighten or dim displays, or perform proximity detection tasks to shut off touch input during phone calls.\nMore advanced features like touch detection and determining the surface profile of a target (fingerprint recognition) are also outlined. Germane to rumors of Apple's rumored iPhone, these latter embodiments operate by bouncing IR light off of a user's finger and back to sensing diodes.\nDuring operation, rows, or in some cases dedicated areas, of a display containing interactive pixels scan for a user's finger. When an object comes within sufficient proximity for sensing, a bitmap is generated to inform the system of proximate positioning data.\nIn some cases, bitmaps can include information about the intensity of incoming light, allowing deeper analysis of the object and its surface. For example, by examining dark and bright spots of the bitmap a sample system can detect corresponding ridges and grooves in a user's fingerprint.\nAddressing the issue of security, the patent notes certain areas of the display might include sections that have a higher density of interactive pixels and supporting chips. Additional emitting and sensing circuits means greater pixel densities, which in turn translates into more accurate fingerprint readings.\nAlternatively, the proposed screen might contain a sufficient number of interactive pixels to turn the entire surface into a fingerprint reader.\nOther embodiments note the use of IR light allows sensing components to remain active even when it appears as though the screen is off, beneficial in saving power and operating the device in low-light environments.\nWhether Apple intends to bring the micro-LED technology to iPhone or another future product remains unknown. The company is widely rumored to launch an \"iPhone 8\" model this year with an edge-to-edge display. Such a design would require the company to move, hide or delete features incorporated into its contemporary handsets, including proximity and ambient light sensors, and the Touch ID fingerprint module.",
        "sentiment": 0.12533025370176995
    },
    "article_9": {
        "title": "Apple park opens to employees in April",
        "body": "Cupertino, California — Apple today announced that Apple Park, the company’s new 175-acre campus, will be ready for employees to begin occupying in April. The process of moving more than 12,000 people will take over six months, and construction of the buildings and parklands is scheduled to continue through the summer.\nEnvisioned by Steve Jobs as a center for creativity and collaboration, Apple Park is transforming miles of asphalt sprawl into a haven of green space in the heart of the Santa Clara Valley. The campus’ ring-shaped, 2.8 million-square-foot main building is clad entirely in the world’s largest panels of curved glass.",
        "sentiment": 0.9551949773449451
    },
    "article_10": {
        "title": "Apple climbs past Samsung as world's top phone vendor",
        "body": "Apple is back on top.\nThe company overtook Samsung as the world's top smartphone vendor in the final three months of 2016, according to Strategy Analytics. The iPhone maker captured 18 percent of the global market in the December quarter, said the firm.\nApple on Tuesday reported it sold 78.3 million iPhones in the fourth quarter, snapping a three-quarter streak of iPhone unit sales declines. The results, fueled by sales of the iPhone 7 and iPhone 7 Plus, pushed Apple to its highest-quarter revenue and per-share earnings ever.\nSamsung, which faced a massive Note 7 recall due to faulty batteries, dropped to second place, said Strategy Analytics. Samsung shipped 77.5 million smartphones worldwide during the fourth quarter, according to the firm, a 5 percent drop from the 81.3 million phones it shipped in the final three months of 2015.\n\"This was the iPhone's best performance for over a year, as Apple capitalized on Samsung's recent missteps,\" Neil Mawston, executive director at Strategy Analytics, said in a statement. \"Samsung will be banking on the rumored Galaxy S8 model in a few weeks' time to reignite growth and return to the top spot in quarterly smartphone shipments.\"\nOverall, global smartphone shipments grew 3 percent to hit 1.5 billion units in 2016. Rounding out the top five phone vendors for the fourth quarter were Huawei, OPPO and Vivo. The global smartphone market, which has been sluggish in recent years, recovered some due to stronger demand in developing markets like China and Africa, said the firm.\nDoes the Mac still matter? Apple execs tell why the MacBook Pro was over four years in the making, and why we should care.\nTech Enabled: CNET chronicles tech's role in providing new kinds of accessibility.",
        "sentiment": 0.07701414972543716
    },
    "article_11": {
        "title": "Dr. Dre is actually a huge force at Apple — he talks with Jimmy Iovine every morning",
        "body": "Dr. Dre plays a key role in one of Apple 's most important businesses, Apple Music chief Jimmy Iovine told Variety in an issue published on Tuesday.\nRapper and producer Dre (Andre Young) rarely speaks in the course of his duties at Apple, but he talks to Iovine every morning, Iovine said in the interview.\n\"Dre's purpose in life is to come up with something that moves the needle,\" Iovine told Variety. \"He's done that really seriously a bunch of times. And now he's experimenting with video. And what he does will be unique, and he will get there. My responsibility to Apple and to him is to put him in that position where he can.\"",
        "sentiment": 0.6133655581091132
    },
    "article_12": {
        "title": "FBI must reveal cost of San Bernardino iPhone hack, argue three news organizations",
        "body": "The San Bernardino iPhone hack story rumbles on, with three news organizations insisting that there is no good reason for the FBI to withhold the cost of accessing the phone. Associated Press, Vice Media and USA Today have asked a US judge to force the FBI to reveal the information, reports the BBC …\nThe FBI had been criticized for spending what was reputed to be around a million dollars to access the work phone of one of the shooters. Given the care the pair took to destroy their own phones and computers, it had always seemed unlikely they would have left evidence on the iPhone in question, and the FBI later admitted that nothing of interest was found. It did, however, argue that the lack of information was still helpful.\nThe three news organizations sued the FBI for the information, following which the agency released 100 pages of documents. However, the fee paid to access the phone was redacted.\nIn the court filings, the organisations said that there was “no adequate justification” for the FBI to continue to withhold the information. They added that they did not seek information that would jeopardise national security.\nThere has been much speculation on the cost of the hack. It was originally suggested that it may have cost as little as $15k, before FBI director James Comey said it cost “more than I will make in the remainder of this job, which is seven years and four months.” This led to an estimate of $1.3M before the FBI said that it was ‘less than a million‘ but declined to reveal the actual cost.\nImage: TechCrunch\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.7430353929790167
    },
    "article_13": {
        "title": "Apple Said to Debut New iPad Pro Lineup, 128GB iPhone SE, and Red iPhone 7 and 7 Plus at March Event",
        "body": "Apple will host a March event to introduce a new iPad Pro lineup and other products, according to Japanese website Mac Otakara.\nIn terms of the iPad Pro lineup, the report claims Apple will announce new 7.9-inch, 9.7-inch, 10.5-inch, and 12.9-inch models. The 10.5-inch model may not ship until May, while the other sizes are said to ship in March.\nIf the report is accurate, it would suggest Apple plans to refresh the iPad mini 4 with a new 7.9-inch iPad Pro model, update its existing 9.7-inch iPad Pro and 12.9-inch iPad Pro models, and introduce an all-new 10.5-inch iPad Pro, which is rumored to feature a narrow bezel design, possibly without a Home button.\nMac Otakara previously said the 10.9-inch iPad Pro—it now says 10.5-inch—will have the same overall footprint as the current 9.7-inch iPad Pro thanks to its narrow bezel design. The earlier report said the top bezel will remain in order to provide space for the front-facing FaceTime camera, but it will likely be slimmer.\nThe blog also previously said the 12.9-inch iPad Pro will feature a 12-megapixel rear camera and True Tone display like the current 9.7-inch model, using advanced four-channel ambient light sensors to automatically adapt the color and intensity of the display to match the light in the surrounding environment.\nMeanwhile, it said the 7.9-inch iPad Pro will feature a Smart Connector, True Tone display, four speakers, and a 12-megapixel rear-facing iSight camera with True Tone flash, as Apple works to standardize features across its tablet lineup. All new iPad Pro models will reportedly gain quad microphones as well.\nThree months ago, Barclays analysts predicted Apple will release a trio of new iPad Pro models in March, including 9.7-inch, 12.9-inch, and edge-to-edge 10.9-inch models, but not a 7.9-inch iPad Pro. Instead, their research note said Apple will continue to produce and sell the iPad mini 4, released in September 2015.\nKGI Securities analyst Ming-Chi Kuo has likewise said Apple is planning a new 9.7-inch, 10.5-inch, and 12.9-inch iPad Pro lineup for 2017. He did not mention a 7.9-inch model. He said the 10.5-inch and 12.9-inch models are likely to feature a faster Apple A10X processor, while the \"low-cost\" 9.7-inch model will sport an A9X chip.\nDigiTimes expects a 10.5-inch iPad Pro as well, making that four separate sources reporting similar. The math checks out too: the width of a 10.5-inch iPad Pro would match the height of the iPad mini screen, while it would have the same resolution as the 12.9-inch model and the same pixel density as the iPad mini.\nToday's report also claims Apple may add a 128GB storage option for the iPhone SE, alongside the smartphone's existing 16GB and 64GB capacities, and add a new red color—(PRODUCT)RED?—option for the iPhone 7 and iPhone 7 Plus. The blog previously said the red color would be for the iPhone 7s and iPhone 7s Plus.\nThe report also calls for new Apple Watch bands at the event in line with last year's Spring refresh. Apple introduced the iPhone SE, 9.7-inch iPad Pro, and new Apple Watch bands at its March 2016 event last year.\nMac Otakara has a good but not perfect track record in terms of Apple rumors.",
        "sentiment": 0.018993132239715618
    },
    "article_14": {
        "title": "Awesome OS X Command Line",
        "body": "Awesome macOS Command Line / Awesome Command-Line Apps\nDue to personal changes, GitHub changes, a desire of not wanting to continue to deal with mostly very low-effort contributions, entitled behavior and low quality, I've permanently moved these projects to my personal Git instance, where they will live from now on.\nhttps://git.herrbischoff.com/awesome-macos-command-line/about/\nhttps://git.herrbischoff.com/awesome-command-line-apps/about/\nThis is not least because of a substantially lacking readiness to donate even a single dollar — despite hundreds of daily visitors and almost 30k combined stars. Instead, these repositories are being linked to from large corporate intranets as a free source of knowledge, at times even from inside Apple. There have been two notable exceptions over the last six years: one donation to the NGO of a dear friend and a single GitHub sponsor for a couple of months. 100% were forwarded to the NGO as well. My thanks go out to you, you know who you are.\nAvailable under the same license it has always been, you can still contribute and are encouraged to do so by sending a git am style patch via email. This is intentional to keep the lazy ones out and I much prefer working mostly in the shell. Please invest the five minutes to figure out how to if you think your contribution matters. You can clone this repository, you can find out my email address.\nBonus link: https://git-send-email.io",
        "sentiment": -0.005805435280005137
    },
    "article_15": {
        "title": "Apple CEO Tim Cook: 'You Will See Us Do More in the Pro Area'",
        "body": "During a Q&A session at today's shareholder meeting held at Apple's Cupertino campus, Apple CEO Tim Cook reassured investors that Apple is still very much focused on its professional customers and has plans to \"do more\" in the pro area.\n\"You will see us do more in the pro area,\" Cook said. \"The pro area is very important to us. The creative area is very important to us in particular.\"\nCook's comments were directed towards the Mac, Apple Watch, services, and iPad, but may reassure those who are worried that Apple is abandoning its desktop Mac lineup, especially the Mac Pro. The Mac Pro has not been updated since December of 2013, going more than 1,100 days without a refresh.\nOther desktop Macs have also gone more than a year without an update. The iMac last saw a refresh in October of 2015, more than 500 days ago, while the Mac mini was last updated in October of 2014, over 860 days ago.\n\"Don't think something we've done or something that we're doing that isn't visible yet is a signal that our priorities are elsewhere,\" Cook also told investors.\nThere have been no hints that a Mac mini or Mac Pro refresh is on the horizon, but Apple is rumored to be planning to introduce new iMacs in 2017, perhaps as early as March. Future iMacs are expected to be updated with USB-C ports and AMD graphics chips.\nAt the meeting, Cook was also questioned about a potential convergence between the Mac and iPad lines, in the form of a touchscreen Mac. While Cook said he didn't want to comment on future product plans, he again reiterated that he sees the iPad and the Mac as two separate product lines that serve different purposes.\n\"Expect us to do more and more where people will view it as a laptop replacement, but not a Mac replacement - the Mac does so much more,\" he said. \"To merge these worlds, you would lose the simplicity of one, and the power of the other.\"\nMuch of the rest of the shareholder meeting consisted of voting on several proposals and reiterating information that was previously shared during Apple's January earnings call. While no shareholder proposals passed - including those calling for increased diversity and more transparency about donations - Apple reelected its board of directors, approved board compensation, and approved Ernst and Young as the company's accounting firm.",
        "sentiment": 0.12075151081251748
    },
    "article_16": {
        "title": "Warren Buffett grows Berkshire Hathaway AAPL stake to 133 million shares worth $17 billion",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nChairman and chief executive of Berkshire Hathaway Warren Buffett proclaims in an interview that his firm purchased around 120 million AAPL shares just in 2017, with a total value of more than $17 billion.\nBuffett CNBC on Monday morning that Apple has a \"sticky product\" when he trumpeted the deal, saying that it was a good hedge against a stock market that could \"go down 20 percent tomorrow.\" He cited Apple CEO Tim Cook's \"terrific job\" at the main driver behind his confidence in the company.\nThe firm's holdings now exceed 133 million shares. The new AAPL purchases are part of a $20 billion stock buy the titan has made since just before the November election.\nBuffett has historically shied away from tech sector stocks. In May 2016, Berkshire purchased its first shares of Apple with a 9.81 million share buy which at the time was worth more than $1 billion. The fund increased holdings to the aforementioned 15.2 million AAPL shares in the September quarter\nBerkshire made a series of big Apple buys in the tail end of 2016 with the firm ending 2016 with a significant increase in holdings in the stock since originally getting on board.",
        "sentiment": 0.2225245096617275
    },
    "article_17": {
        "title": "Apple’s Tim Cook: Steve Jobs’ philosophy will be at Apple in 100 years",
        "body": "Steve Jobs held up the new iPhone during his keynote address at MacWorld Conference & Expo in San Francisco on Jan. 9, 2007.\nThe philosophy of Apple's late founder Steve Jobs will run through the company 100 years from now, Chief Executive Tim Cook said on Wednesday.\nAddressing students at the University of Glasgow in Scotland, Cook said that Jobs was the person who had influenced him the most \"by far\".\n\"Steve's DNA will always be the core of Apple. Steve is deeply embedded in the company. We celebrate him and we celebrate his philosophy. His philosophy … will be at Apple 100 years from now …The philosophy is sort of passed down with every generation … so yes, he's very much at Apple,\" Cook said.\nThe Apple boss moved onto the topic of Jobs after being asked about the Apple Pencil – a stylus like device the company released in 2015. Jobs was known for not liking styluses.\n\"Yuck. Nobody wants a stylus, so let's not use a stylus,\" Jobs said during the launch of the first iPhone in 2007.\nCook responded to the question from the audience about why Apple introduced the Pencil, saying that it did not contradict Jobs' thoughts.\n\"The truth is Steve did hate styluses. But if you have ever used the Apple Pencil, the Apple Pencil is the furthest thing from a stylus that has ever existed,\" Cook said.\n\"Designers historically, and many still do, carry sketchbooks … because they don't know when they're going to have inspiration. And when they have it, you want your tool there … With Apple Pencil, you have the best of all worlds. Because unlike a sketch that you have to do many times to try out many different looks, whether it's colors or specific lines, etc, with the Apple Pencil, you can quickly try out any number of designs.\"\nCook also used the talk at the University of Glasgow to address President Donald Trump's ban on immigration from seven Muslim-majority countries. Read what he said here.",
        "sentiment": 0.2896262062713504
    },
    "article_18": {
        "title": "Apple Music randomly skipping songs? You are not alone",
        "body": "A weird little bug has made its way into Apple Music over the last day or so that makes the service randomly skip songs during playback. I first noticed this last night while playing music on my Apple TV, and earlier today on both my iPhone and Mac.\nA quick Twitter search showed that was indeed not the only one in this boat, and after contacting Apple, I have learned that the company is aware of the issue and should fix the problem in the next 72 hours.\nThe symptoms are pretty obvious. While you’re listening to songs that are being streamed from Apple Music, certain tracks will just stop playing at random times and skip to the next song. If you’re lucky, the next song will play in its entirety. If you aren’t, it will just skip at random as well.\nFrom what I could gather, this seems to be a caching issue that prevents the whole track from being cached and stalls the streaming past a certain point. If that is indeed correct, a server side update will likely remedy this.\nThe Apple representative I talked to seemed to indicate this was a widespread problem, and since the company is already aware of it and working on a fix, it should take no more than 72 hours to get fixed.\nIn the meantime, how about giving Tidal a try? jk",
        "sentiment": -0.3883693932809613
    },
    "article_19": {
        "title": "BlackBerry Hits '0%' Market Share Nearly Ten Years After iPhone Launched",
        "body": "Nearly ten years after Apple launched the iPhone, which completely upended the smartphone industry, the device has effectively helped to wipe out one of its major predecessors: the BlackBerry.\nBlackBerry has at last fallen to a rounded 0.0% share among smartphone operating systems after shipping just 207,000 smartphones last quarter, following an over seven year decline from its peak market share of approximately 20% in 2009, according to the latest quarterly data from research firm Gartner.\nThe demise of the smartphone that was once the poster child of Canadian innovation has been a long one in the making, but one that was inevitable now that BlackBerry has shifted its focus to software and sold the global rights to future BlackBerry-branded smartphones to Chinese company TCL Communication.\nBlackBerry actually continued to grow for around two years after the iPhone launched in June 2007, taking market share away from then-leader Nokia. BlackBerry's market share among all smartphone operating systems was 9.6% in 2007, 16.6% in 2008, and 19.9% in 2009, according to Gartner. Then, the decline started.\nBy 2011, the surging popularity of iPhones and Samsung Galaxy smartphones led iOS and Android to leapfrog BlackBerry and Nokia to form a duopoly in the smartphone market that exists to this day. iOS and Android combined for a record 99.6% market share last quarter, according to Gartner.\nWorldwide Smartphone Sales to End Users by Operating System in 4Q16 (Gartner)\nWindows 10 Mobile was the only other platform to make any sort of dent last quarter, recording an insignificant 0.3% market share, according to Gartner. Windows 10 Mobile fell from 1.1% in the year-ago quarter. A group of unnamed \"other\" operating systems captured the remaining 0.1% share.\niOS adoption is still low compared to Android, with the platforms capturing 17.9% and 81.7% worldwide market share respectively in the fourth quarter. iPhones mainly target the premium smartphone market, however, while there are Android-based smartphones at all price points sold by dozens of brands.\nWhat's next for BlackBerry? In addition to focusing on software, the company is also doing self-driving vehicle research, while its rumored \"Mercury\" smartphone by TCL will be unveiled on February 25 at Mobile World Congress.",
        "sentiment": -0.09389906028906504
    },
    "article_20": {
        "title": "Apple Tells Lawmaker that Right to Repair iPhones Will Turn Nebraska Into a ‘Mecca’ for Hackers - Motherboard",
        "body": "Apple is inventing new and interesting arguments to prevent you from fixing your iPhone: It's lobbying Nebraska lawmakers to kill \"right to repair\" legislation, telling them unauthorized repair will turn the state into a \"mecca\" for hackers.\nRight to repair bills, which are currently making their way through eight states (Nebraska, New York, Tennessee, Wyoming, Minnesota, Kansas, Illinois, and Massachusetts), would require electronics manufacturers to make repair parts and diagnostic and repair manuals available to independent repair professionals and consumers, not just \"authorized\" repair companies. Electronics right to repair legislation is modeled on a 2012 Massachusetts law that preserved the right to repair cars.\nAdvertisement\nThe most logical reason for manufacturers to oppose the bills is that it would democratize the repair economy, making it possible for consumers to fix their own things and cutting into the profits of repairs done at, for example, the Apple store.\n\"They said that doing this would make it very easy for hackers to relocate to Nebraska.\"\nBut the prospect of a Cupertino-based megacorporation losing business to local repair shops isn't a very sympathetic argument at the Nebraska statehouse. And so Apple has tried a slew of other tactics, according to state Sen. Lydia Brasch, who was recently visited by Steve Kester, an Apple state government affairs specialist.\n\"Apple said we would be the only state that would pass this, and that we would become the mecca for bad actors,\" Brasch, who is sponsoring the bill, told me in a phone call. \"They said that doing this would make it very easy for hackers to relocate to Nebraska.\"\nBrasch, a farmer who also works remotely for a software company in Atlanta, Georgia, has a background in computer science and said Kester wasn't prepared for her to defend the bill she's sponsored.\n\"I think they were surprised to learn I've worked in the technology field the last 15 years even though I'm a farmer,\" she said.\n\"They said just take out the 'phone' part of the bill and we'll go away\"\nRight to repair bills in each state require manufacturers to provide software tools to bypass locks that prevent repair. For example, John Deere tractors contain software that prevent even basic repairs unless \"authorized\" by the company. Last year, a software update to iOS caused Apple's infamous \"Error 53,\" which bricked iPhones that had been repaired by consumers or independent repair shops. Apple did not respond to a request for comment, and Kester, reached by phone, told me he is not authorized to speak to the press.\nAdvertisement\n\"The rationale is that an independent mechanic ought to be able to bypass things like Error 53 that are designed to prevent repair,\" Kyle Wiens, CEO of iFixit, told me. \"If you look, the same exact text is in the Massachusetts auto right to repair law, and it's not causing car thefts or hackers to move to Massachusetts.\"\nKester was joined by Alexi Madon of CompTIA, a trade organization that nominally represents repair professionals (it stewards the A+ computer repair certification) but has, in recent years, partnered with Apple and other electronics manufacturers.\nBrasch said the representatives made two other main arguments: They said repair could cause lithium batteries to catch fire, and said that there are already enough authorized places to get iPhones repaired, such as the Apple store.\n\"When you're talking about safety, there's a greater chance I'll fall down and hit my head. I told them until you have an app that defies gravity, I don't think we have to worry about safety. There's always a risk and there's always a disclaimer,\" she said. \"I have an Apple computer and to get it repaired, I have to bring it to Omaha and I have to make an appointment with a Genius on their schedule. Omaha is 80 minutes from here and there's no Best Buy in a town of 600.\"\nBrasch told me she primarily proposed the legislation because farmers have been inconvenienced by John Deere's \"authorized\" repair requirements, which has taken a self-reliant profession and forced them to get even simple repairs done by John Deere's dealers. But she realizes she's hit a nerve with electronics companies, too.",
        "sentiment": -0.40025080947412384
    },
    "article_21": {
        "title": "iPhone 8 Said to Pack Battery Capacity of Current 5.5-Inch Model Into 4.7-Inch Form Factor",
        "body": "The so-called \"iPhone 8\" will adopt a higher-cost stacked logic board design to support longer battery life, according to KGI Securities analyst Ming-Chi Kuo.\nKuo said the stacked logic board, also known as a \"substrate-like PCB mainboard,\" will result in the \"iPhone 8\" with an OLED display having similar dimensions to a 4.7-inch iPhone, yet comparable battery life to a 5.5-inch iPhone. He expects the device to have around a 2,700 mAh L-shaped two-cell battery pack.\nAs battery material tech isn’t likely to see major breakthroughs in the next 3-5 years, mainboard area can only be reduced via stacked SLP, which makes space for larger battery and extended usage time. Thanks to stacked SLP, we expect the OLED iPhone to have similar dimensions to a 4.7” TFT-LCD iPhone, and have comparable battery capacity (equipped with around 2,700 mAh L-shaped 2-cell battery pack) to a 5.5” TFT-LCD iPhone. The battery life of the OLED iPhone could be better than that of the 5.5” TFT-LCD model as OLED panels are more energy-efficient than their TFT-LCD counterparts.\nKuo added that the battery life of \"iPhone 8\" with an OLED display could be better than that of a 5.5\" model with a traditional LCD display, as OLED panels are more energy-efficient than their LCD counterparts. For comparison, the iPhone 7 has a 1,960 mAh battery and the iPhone 7 Plus has a 2,900 mAh battery.",
        "sentiment": -0.5085388459265232
    },
    "article_22": {
        "title": "10.5 and 12.9 iPads not expected to shit until June.",
        "body": "The 10.5-inch and 12.9-inch iPads that Apple is expected to debut at a March event aren't expected to ship until May or June, supply chain sources tell DigiTimes. An entry-level 9.7-inch iPad, however, is expected to ship within close proximity of the March event.\nIn January, DigiTimes reported that the 10.5-inch and 12.9-inch iPads were expected to enter mass production in the Q2 of 2017 while the 9.7-inch iPad would enter mass production in Q1 2017. The potential release dates partly line up with a recent report from Mac Otakara, which said the 10.5-inch iPad may not be ready to ship until May. However, that report said the three other iPad models rumored to debut at the March event, new 7.9-inch, 9.7-inch and 12.9-inch iPads, are expected to ship in March.\n12.9-inch iPad shipments have been drying up around the world in recent weeks, slipping to shipping estimates of 2-3 weeks in the United States, Canada, Australia, France, Germany and Japan. While increasing shipping times are a sign of an impending refresh, in this case it seems to be a supply issue.\nDuring Apple's latest earning call, CEO Tim Cook said that the company underestimated iPad demand in the past quarter and had an issue with one of its suppliers. Cook said the issue would probably not be resolved this quarter, likely leading to shriveling 12.9-inch iPad stock. Similarly, the supply issue could keep the refreshed 12.9-inch iPad from shipping before May.\nThe new 10.5-inch model is expected to be the flagship model in Apple's new iPad lineup, sporting an edge-to-edge display on the same footprint as the current 9.7-inch iPad. Alongside new iPads at a March event, Apple is also expected to debut a 128 GB iPhone SE and red iPhone 7 and 7 Plus color variations.",
        "sentiment": -0.20802357451369366
    },
    "article_23": {
        "title": "YouTube for iOS gets Chromecast lock screen controls",
        "body": "YouTube for iOS gets Chromecast lock screen controls You can now access YouTube controls on the Apple Watch, as well.\nMariella Moon | @mariella_moon | February 2, 2017 3:01 AM\nIt can be annoying having to unlock your phone screen and sift through all the open apps to pause, forward or rewind what you're casting on TV. Good thing YouTube has finally made things easier for iOS users. The latest version of the app for iPhones and iPads adds lock screen controls not just for Chromecast, but also for smart TVs and other devices. If you have an Apple Watch, you'll now be able to access play, pause, prev, next and volume controls on your wearable, as well. The upgrade is now available from iTunes, just in time for this weekend's YouTube binge watch session.\nAll products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission. All prices are correct at the time of publishing.",
        "sentiment": 0.25629608482122423
    },
    "article_24": {
        "title": "Apple says iOS 10.2.1 has reduced unexpected iPhone 6 &amp; iPhone 6s shutdown issues by 80%",
        "body": "Over the past couple of iPhone versions users have complained of “unexpected” shutdowns of their devices. Some iPhone 6, 6s, 6 Plus and 6s Plus devices could basically go dark unexpectedly, forcing a user to have to plug them into an outlet to get them to power back on.\nApple has been working on this very annoying bug and it says it has come up with a fix of sorts that should mitigate the problem on a majority of iPhone 6 and iPhone 6s devices. The fix is actually already on your iPhone if you have installed iOS 10.2.1 — something that around 50 percent of iOS users have already done. After letting the fix simmer on customer devices, Apple now has statistics to share on how it has improved the issue, citing 80 percent reduction on iPhone 6s and 70 percent reduction on iPhone 6 devices.\nCurrently, iPhone 7 devices are not impacted by this issue. It’s also important to note that there was a similar but different issue that had the same unexpected shutdown symptoms late last year that resulted in a battery recall of some devices. These are not the same issue or fix.\nHere is the comment they provided to TechCrunch today:\nWith iOS 10.2.1, Apple made improvements to reduce occurrences of unexpected shutdowns that a small number of users were experiencing with their iPhone. iOS 10.2.1 already has over 50% of active iOS devices upgraded and the diagnostic data we’ve received from upgraders shows that for this small percentage of users experiencing the issue, we’re seeing a more than 80% reduction in iPhone 6s and over 70% reduction on iPhone 6 of devices unexpectedly shutting down. We also added the ability for the phone to restart without needing to connect to power, if a user still encounters an unexpected shutdown. It is important to note that these unexpected shutdowns are not a safety issue, but we understand it can be an inconvenience and wanted to fix the issue as quickly as possible. If a customer has any issues with their device they can contact AppleCare.\nAs far as I’m able to understand what happened here, Apple found that sudden spikes of activity to the maximum power draw could cause older batteries, which had some mileage on them, to deliver power in an uneven manner, which would cause an emergency shutdown of the devices. Brand new batteries would not be affected, but as most phone batteries run through charge cycles they get less effective (this is a well-known byproduct of lithium-ion technology and one reason everyone wants to get rid of it as soon as someone figures out something better) and more susceptible to these kinds of triggering spikes.\nWhatever tweaks Apple made to its power management system have enabled them to reduce the shutdowns heavily — but not eliminate them entirely. For those cases where a device still shuts down, folks will be able to restart without having to plug it in on iPhone 6s and 6s Plus devices.\nIt’s also my understanding that there is a fix in on the newer beta versions of iOS that should allow the auto-restart in iPhone 6 Plus and iPhone 6 models, as well.\nAt some point a battery will be so worn out that it will need to be replaced, as Apple outlines on its site. A new “your battery needs service” message is also coming to the battery info screen inside Settings on iOS 10.2.1 over the next few days. This will only show up for batteries that Apple feels need it — which will add a bit more transparency to people wondering when Apple considers the battery worn down enough to get swapped out. Though the exact metrics by which it decides that a battery has reached end-of-life are still opaque, Apple does give some hints on its own page about maximum charges and lifetime.\nWhile the issue has not been killed off entirely, this should provide some sort of relief for users who were annoyed by the problem.\nArticle updated to clarify auto-restart details.",
        "sentiment": -0.16856222222226538
    }
}