{
    "article_0": {
        "title": "Join the battle for net neutrality!!! We don’t wanna have to pay for reddit!! Do you part!",
        "body": "Since then there have been a slew examples of how why we need net neutrality: Verizon throttled traffic for California firefighters during massive wildfires, putting people in danger; ISPs have decided to leave poor, rural, and communities of color behind by cutting them out of broadband expansion; and other Internet providers have charged bogus fees and forced customers to watch advertisements in order to get online. And as the COVID-19 pandemic spread across the U.S., people were at the mercy of Internet companies to get online to work, go to school, and access lifesaving information. Repealing net neutrality has given Internet providers the power to decide whether we can get online or not.\nThroughout all this we’ve kept fighting. A federal court ruling has opened up a path for net neutrality laws at the state and national level. California passed a gold-standard net neutrality law at the state level, the Senate passed a bipartisan resolution to undo the FCC’s repeal, and Congress introduced the Save the Internet Act that can enshrine net neutrality into law once and for all.\nIn order to win back net neutrality protections for everyone, we need to push the FCC to reinstate the Open Internet Order, and then we need to get Congress to pass legislation that will protect net neutrality once and for all. This is our battle.",
        "sentiment": -0.03843254595994949
    },
    "article_1": {
        "title": "Over 300 iPhone X models stolen from San Francisco Apple Store",
        "body": "Well, that's one way to skip the iPhone lines.\nThree \"husky\" men in hoodies driving a white Dodge van broke into a UPS truck Wednesday while it was parked outside a San Francisco Apple Store.\nIt was delivering 313 of Apple's new iPhone X devices, according to a police report. The theft happened between 11:15 a.m. and 11:30 a.m. PT.\nThe total value of the stolen merchandise was estimated to be more than $370,000. The iPhone X, which becomes available in stores Friday, starts at $999 apiece. The suspects haven't yet been caught.\nEach phone was cataloged with a description and serial number, which meant the police report was one of the \"fattest\" Sgt. Paul Weggenmann had ever seen, he said.\nPeople who planned to pick up their preordered iPhones at the Stonestown store will still get their devices on time, a person familiar with the matter said.\nStealing iPhones has long been a lucrative business, but Apple's \"Find My iPhone\" and remote lockout feature have caused a drop in stolen devices. For enterprising thieves, the key is getting an iPhone before those services have been set up.\nIt's unclear if the stolen phones will work, or if Apple will be able to disable them. The company declined to give information about its security capabilities.\nWhat makes this theft especially notable is that it comes just before the launch of the iPhone X, one of Apple's most high-profile products in years. Apple bills the gadget as the \"future of the smartphone.\"\nThe device may end up becoming the hottest Apple has ever sold. Customers preordered about 25 percent as many iPhone X units in the first four days than the previous record holder, the iPhone 6, according to data from Slice Intelligence. It set that record despite reportedly sparse supplies, which have pushed some preorder deliveries to mid-December. Nov. 3 availability for the iPhone X disappeared within minutes when preorders began early Oct. 27.\nAs for the theft, the UPS driver had locked the cargo area after parking outside the Stonestown Galleria mall in the southwest Lakeside neighborhood of San Francisco, according to the police report. A janitor spotted the suspects unloading boxes from the UPS truck and into a Dodge van and snapped a photo.\n\"It's suspicious they were able to get that large a haul on that day,\" he said.\nUPS said it's working with law enforcement investigating the theft.\nThe theft was earlier uncovered by local San Francisco television station, KTSF.\nUpdate, Nov. 3 at 1:50 p.m. PT: Add information about lack of clarity on whether the phones will work.\nCorrection, Nov. 3 at 12:50 p.m. PT: To revise Slice Intelligence market data on iPhone X preorders.\nThe Smartest Stuff: Innovators are thinking up new ways to make you, and the things around you, smarter.\niHate: CNET looks at how intolerance is taking over the internet.",
        "sentiment": -0.272226525865721
    },
    "article_2": {
        "title": "Apple has officially been served with a search warrant for access to the iPhone SE used by the man responsible for the Sutherland Springs, Texas shooting.",
        "body": "Apple has officially been served with a search warrant for access to the iPhone SE used by the man responsible for the Sutherland Springs, Texas shooting. The move comes after an earlier fumble that saw the Texas Rangers and FBI fail to act within 48 hours to unlock the device in question with Touch ID…\nAs detailed in a report from Fast Company, the Texas Rangers served Apple with a warrant for access to David Kelley’s iPhone SE and his iCloud account, though it’s unclear if one exists at this point. Furthermore, the Rangers want access to a second phone used by Kelley, a cheap LG-made feature phone.\nApple stated earlier this month that it contacted law enforcement officials roughly 48 hours after the shooting to see if it could be of any help. During that first 48 hours, when Touch ID would have still been enabled, law enforcement made no efforts to ask Apple for help or to use Touch ID to unlock the phone. Instead, it shipped the device off to a crime lab in Quantico, Virginia.\nAs for the iCloud data, Apple generally helps law enforcement access that data, providing the iCloud data, as well as the tools needed to decrypt it. On the other hand, don’t expect Apple to create the tool necessary to unlock the iPhone SE used by Kelley.\nThis is a similar situation to the showdown between law enforcement and Apple related to the San Bernardino shooter’s iPhone. Apple was asked for help unlocking the iPhone 5C in question, but it said creating a tool necessary to do so would compromise the security of every iPhone. In the end, the FBI used a tool created by a third-party to unlock the phone, but no information was found.\nApple has yet to officially respond to the search warrant from the Texas Rangers, but we’ll be sure to update when they do.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.19043997582048178
    },
    "article_3": {
        "title": "TIL Apple Music compensates musicians twice what Spotify does.",
        "body": "Some artists say they’re not earning enough from music streaming. But streaming companies like Deezer, Spotify and Napster are still making a loss. How much do the streaming apps pay the music industry? Can musicians really even simply earn a minimum wage anyway?\nSpotify Billionaires\nAs Spotify prepares to float itself on the stock market with a valuation of between $6-$20 billion, who will be receiving a slice of the cash?\nSpotify are only required to divulge shareholders owning more than 5%. So here are our best estimates and guesses on the breakdown, according from official stock market filings and other sources.\nBetween them, the big four record-companies may own as much as 16% of Spotify, which could mean a windfall payout of up to $650 million.\nRelated: How $1 Flows From Spotify to Recording Artists, from the New York Times.\nWhich they will no doubt immediately share with all the musicians and artists who have made Spotify such a desirable platform, right?\n» See the data",
        "sentiment": -0.7415691494941712
    },
    "article_4": {
        "title": "Security Update for High Sierra regarding Root Login Problem is out",
        "body": "For our customers' protection, Apple doesn't disclose, discuss, or confirm security issues until an investigation has occurred and patches or releases are available. Recent releases are listed on the Apple security updates page.\nFor more information about security, see the Apple Product Security page. You can encrypt communications with Apple using the Apple Product Security PGP Key.\nApple security documents reference vulnerabilities by CVE-ID when possible.",
        "sentiment": -0.2949442882090807
    },
    "article_5": {
        "title": "YouTube iOS App Causing Battery Drain, Overheating Issues for Some Users",
        "body": "YouTube has confirmed it is working to resolve a bug in its mobile app that causes significant battery drain on Apple devices, even when the app is running in the background.\nFirst covered by tech blog PiunikaWeb, the issue has been noted by several MacRumors forum members, as well as on Reddit and Twitter, and appears to be mainly affecting devices running iOS 11.1.1.\nImage via PiunikaWeb\nIn addition to battery drain, some iPhone users have reported that the YouTube app is causing their device to run much hotter than usual when watching videos, although the two issues don't seem to occur together in every case.\nHi there! Appreciate the report, this is something we're actively working on. Thanks for your patience. — Team YouTube (@TeamYouTube) November 12, 2017\nYouTube says it is aware of the problem and is \"actively working\" to come up with a fix for the app, although no timeframe was given. In the meantime, affected users are advised to watch YouTube videos in their web browser of choice.",
        "sentiment": -0.020776115357875824
    },
    "article_6": {
        "title": "Two Major Cydia Hosts Shut Down as Jailbreaking Fades in Popularity",
        "body": "ModMy today announced it has archived its default ModMyi repository on Cydia, which is essentially an alternative App Store for downloading apps, themes, tweaks, and other files on jailbroken iPhone, iPad, and iPod touch devices.\nA jailbroken iPhone running iOS 6 via New Atlas\nZodTTD/MacCiti also shut down last week , meaning that two out of three of Cydia's major default repositories are no longer active as of this month. ModMy recommends developers in the jailbreaking community use the BigBoss repository, which is one of the last major Cydia sources that remains functional.\nThe closure of two major Cydia repositories is arguably the result of a declining interest in jailbreaking, which provides root filesystem access and allows users to modify iOS and install unapproved apps on an iPhone, iPad, or iPod touch.\nWhen the iPhone and iPod touch were first released in 2007, jailbreaking quickly grew in popularity for both fun and practical reasons. Before the App Store, for example, it allowed users to install apps and games. Jailbreaking was even useful for something as simple as setting a wallpaper, not possible on early iOS versions.\nEven in later years, jailbreaking remained popular for a number of popular tweaks that Apple has eventually implemented into iOS, such as system toggles, lock screen widgets, quick reply for text messages, screen recording, multitasking, picture-in-picture mode on iPad, and keyboard trackpad mode.\nWith many of those features now available out of the box, the allure of jailbreaking is considerably less for many people.\n\"What do you get in the end?\" asked Cydia creator Jay Freeman, in an interview with Motherboard. \"It used to be that you got killer features that almost were the reason you owned the phone. And now you get a small minor modification.\"\nOne downside to jailbreaking is that it has always been a violation of Apple's End User License Agreement that every iOS user agrees to. While not illegal in the United States, due to an exemption in the Digital Millenium Copyright Act, jailbreaking also technically voids your device's warranty coverage.\nIn a statement provided to Cult of Mac back in 2010, Apple said jailbreaking can \"severely degrade the experience\" of an iPhone.\nApple's goal has always been to insure that our customers have a great experience with their iPhone and we know that jailbreaking can severely degrade the experience. As we've said before, the vast majority of customers do not jailbreak their iPhones as this can violate the warranty and can cause the iPhone to become unstable and not work reliably.\nApple's cat-and-mouse game with jailbreaking has been ongoing for over a decade, and it may be finally winning the battle given advancements in iOS security and decreasing interest in jailbreaking.\niOS 11 is the first major version of Apple's mobile operating system that has not been publicly jailbroken. A few developers have claimed to exploit iOS 11 at various security conferences, but no Mac or PC tool like Pangu has been released for the public to download and jailbreak their own devices with.\nThe lack of a public jailbreak for the latest iOS version after several months has fueled a so-called \"death spiral\" for jailbreaking.\n\"When you get fewer people bothering to jailbreak, you get fewer developers targeting interesting things, which means there's less reasons for people to jailbreak,\" said Freeman. \"Which means there's fewer people jailbreaking, which causes there to be less developers bothering to target it. And then you slowly die.\"\niOS users still interested in jailbreaking can visit our Jailbreaks and iOS Hacks forum section and /r/jailbreak on Reddit.",
        "sentiment": -0.38507086020679426
    },
    "article_7": {
        "title": "iPhone X – We need a better way to invoke the Control Centre",
        "body": "iPhone X – We need a better way to invoke the Control Centre\nAfter a couple of days using the iPhone X, I love it. But my biggest concern –prior to, and now after extensive use– is how awkward it is to invoke the Control Centre.\nObviously the traditional swipe up from the bottom gesture has been replaced to allow navigation to the Home Screen & App Switcher. Moving the Control Centre gesture so far away from reach makes for a compromised user experience for such a critical feature.\nOne handed access to the Control Centre is now only possible using Reachability. While useful in essence, it’s incredibly unintuitive for this purpose –and crucially– often a hit and miss affair, quite literally. Nb. Reachability isn’t an option while on the unlock screen.\niOS Control Centre\n3D Touch\nBottom Edge Bar\nAccessing the Home Screen and App Switcher is great on the iPhone X. So much easier and more fluid than using a physical Home button.\nThe Control Centre is something I use so often, this is becoming a real issue for my overall satisfaction with the device. There needs to be a better solution…\nA suggested solution\nI’d suggest offering an optional setting to allow a 3D Touch press on the bottom edge bar to invoke the Control Centre rapidly.\nIn addition to the critical gestures, the bottom edge bar also allows switching open apps by swiping left / right. This is a smart new UI feature on the iPhone X.\nInvoking the Control Centre by swiping from the top right of the screen is a compromise too far. Adding a 3D Touch gesture to the mix would work extremely well, adding to the useful functionality of the bottom edge bar.\nI’ve suggested this to Apple via their feedback form today and really hope they’ll consider it.\nDo you agree?",
        "sentiment": -0.16818918648641557
    },
    "article_8": {
        "title": "iOS 11.2 Public Beta Update Introduces Apple Pay Cash",
        "body": "Apple plans to introduce Apple Pay Cash in iOS 11.2 and watchOS 4.2, and starting today, the feature is available for beta testers in the United States. Apple Pay Cash is included in the new iOS 11.2 public beta that is being provided to public beta testers this morning. Some developers running iOS 11.2 are also seeing Apple Pay Cash appear as an option in the Messages app this morning.\nSince the beginning of October, Apple employees have been testing Apple Pay Cash in a special version of iOS 11.1 that allowed the feature to be enabled through an internal device certificate. The test was initially limited to corporate employees, but later expanded to retail employees. Apple Pay Cash did not end up shipping in iOS 11.1, but it is apparently ready for iOS 11.2.\nApple Pay Cash works through the Messages app and is designed to allow for quick person-to-person money transfers, much like Square Cash or Venmo. It's available as a dedicated iMessage app in the built-in Messages app, with cash transferred through iMessage transactions. Though most Apple Pay Cash coverage has focused on the iPhone, money can also be sent using an Apple Watch.\nCash can be sent from a linked debit or credit card, while received cash is stored in an Apple Pay Cash card in Wallet that can be used for purchases or sent to a bank account. Sending cash through a credit card incurs a 3% fee, while sending cash from a debit card is free.\nThe Apple Pay Cash card available in Wallet is being made available through a partnership with Green Dot, a company that offers prepaid Discover cards. For Apple Pay Cash to work, both parties need to have the feature enabled and activated. Money can only be sent in a one-on-one message, with Apple Pay Cash not available in group messages.\nApple Pay Cash will also be available on the Apple Watch with watchOS 4.2, and users can send cash directly from the Messages app on the wrist-worn device.\nTo use Apple Pay Cash in today's beta, both people will need to be running the iOS 11.2 public beta. $10 minimum must be loaded onto the Apple Pay Cash card in Wallet, two-factor authentication must be turned on, and an iPhone 6 or later is required. Apple Pay Cash is limited to the U.S. at this time.\nApple first announced person-to-person Apple Pay as an iOS 11 feature at its Worldwide Developers Conference in June, but it was not implemented in any of the iOS 11 betas and towards the end of the beta testing period, Apple confirmed it would be coming in a future iOS 11 update.",
        "sentiment": -0.17181417385214254
    },
    "article_9": {
        "title": "Apple iPhone X beats Samsung Galaxy Note 8 in benchmark comparison",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nThe consumer wars between Apple and Samsung will go on as long as both companies are around, as will the debates around which flagship device is more powerful. AppleInsider gets both the iPhone X and the Galaxy Note 8 on our test bench, and put them both through their paces.\nThe truth is, both devices are more than powerful enough for our daily needs, but since we got our hands on both of them, AppleInsider decided to run some benchmarks to compare the two devices.\nAs far as the hardware goes, the iPhone X's A11 Bionic processor has six cores total, with two high performance cores, and four efficiency cores. It also has a three-core graphics chip and 3GB of RAM.\nThe Note 8 has an eight-core processor, with four high performance cores and four more efficient cores. It also has 6GB of RAM — twice as much as the X. It's worth noting that the Note 8 is pushing more pixels, which takes more power to render.\nMore cores doesn't always mean more performance. There are a limited amount of apps that can actually put up to six and eight cores to use. A lot of apps actually use one or two cores, with apps only slowly transitioning into using more, efficiently.\nStarting with the Antutu benchmark, The iPhone X comes in at around 31 percent faster than the Note 8. In Basemark OS 2, the iPhone X is 17 percent faster.\nIn 3DMark's Sling Shot Extreme benchmark, the scores were very similar, with the Note 8 gaining a small advantage.\nLet's move onto a couple browser benchmarks. Keep in mind that it's not purely based on the device, but also on the browser. Chrome is now the default for the Note 8, and of course Safari remains the standard for the iPhone X.\nIn Antutu's HTML5 test, the iPhone X was 62 percent faster than the Note 8.\nThe iPhone X completely destroyed the Note 8 in the Jetstream 1.1 javascript benchmark. This may be due to optimization issues with Chrome, so don't give the iPhone X by itself too much credit.\nNow let's finally get to the popular Geekbench 4 benchmark. For the single core test, the iPhone X blew the Note 8 out of the water, with over double the score.\nApple's iPhone line is known for strong single-core performance, and since most applications benefit more from powerful single cores than multiple weaker cores, even dual-core iPhone's were able to keep up in performance when Android devices were already moving up to four and more cores.\nMoving on to the multi-core test, the iPhone X is actually 53 percent faster than the Note 8, even though the Note 8 has eight cores, compared to six on the iPhone X.\nFinishing off with the GPU benchmark, the iPhone X was 59 percent faster than the Note 8, but that's using Metal on the iPhone. Keep in mind that even though the GPU shows that much of a performance boost, the more realistic Slingshot Extreme benchmark scores were similar.",
        "sentiment": 0.0954799974958102
    },
    "article_10": {
        "title": "Apple Ranked as 'Clear Leader' in its Efforts to Source Conflict-Free Minerals From Supply Chain",
        "body": "Apple has been designated the \"clear leader\" in its methods of supporting a conflict-free minerals trade throughout its supply chain. The title was awarded to the company in a report published by the Enough Project, called the 2017 Conflict Minerals Company Rankings, in which Apple sits at the #1 spot. Rounding out the top 5 spots are Alphabet/Google at #2, HP at #3, Microsoft at #4, and Intel at #5.\nThe new Conflict Minerals Company Rankings look at 20 of the world's largest companies in two of the industries that the Enough Project says \"consume the most\" tin, tungsten, tantalum, and gold: consumer electronics and jewelry retail. These minerals are referred to as conflict minerals because they're most often related to being sourced within war-torn countries that mine the minerals with little to no respect for workers' rights.\n- Conducting Conflict Minerals Sourcing Due Diligence and Reporting\n- Developing a Conflict-Free Minerals Trade and Sourcing Conflict-Free Minerals from Congo, Particularly Gold\n- Supporting and Improving Livelihoods for Artisanal Mining Communities in Eastern Congo\n- Conflict-Free Minerals Advocacy\nThe Enough Project gathered these top 20 companies and awarded points to each based on the policies and practices that they enact regarding responsible mineral sourcing, with the lowest on the list designated as companies most in need of \"considerable and urgent need for more action.\" In total, the companies were ranked based on four core categories:\nIn its full report, Apple is placed in the \"Outstanding Company Efforts\" section, which represents the companies \"going above and beyond to get more directly at the heart of maintaining robust due diligence practices and sourcing conflict-free minerals from Congo.\" Specifically, Apple is the only company to receive full credits for identifying and following up with supply chain incidents reported to it by suppliers and other sources. Apple has \"clearly demonstrated its commitment\" to scouring for red flags related to these reports and taking action by dropping suppliers and others in its supply chain that turn out to be noncompliant with its standards.\nAfter developing its Risk Readiness Assessment program in order to help identify conflict minerals sourcing in its supply chain, among other risk-related sourcing factors, Apple partnered with the Responsible Business Alliance in order to make this program widely accessible to other companies. According to the Enough Project, this put Apple above and beyond all other companies ranked on the list.\nApple not only has found better ways of addressing incidents within its own supply chain, but it has also helped develop shared centralized platforms for risk assessment that other companies can use. This extra effort contributes to the overall strengthening of conflict minerals supply chain due diligence.\nThe Enough Project's report follow a separate study published by Amnesty International earlier this week, which described Apple as the industry leader in responsible cobalt sourcing. That report said Apple has taken \"adequate\" action in terms of sourcing conflict-free minerals, earning a top ranking alongside Samsung in the same category.\nApple annually discusses this part of the supply chain in its Supplier Responsibility Reports, which typically come out around February and March. This year's report highlighted cobalt supplier audits in the Congo, its \"highest ever\" work hour compliance, and discussed the success of Apple's Supplier Education Program. These reports are intended to show the strides that Apple takes to improve the work lives of its device manufacturing employees, who work to create products including the iPhone, iPad, Mac, and more.\nTo see more of the Enough Project's 2017 Conflict Minerals Company Rankings, visit the project's website here.",
        "sentiment": 0.5926131222299055
    },
    "article_11": {
        "title": "iOS 11.2 Supports Faster 7.5W Charging on iPhone 8, 8 Plus and X From Qi-Based Wireless Charging Accessories",
        "body": "Starting with iOS 11.2, the iPhone 8, iPhone 8 Plus, and iPhone X are able to charge at 7.5 watts using compatible Qi-based wireless charging accessories.\nCurrently, on iOS 11.1.1, the three devices charge at 5 watts using Qi wireless chargers, but Apple promised that faster speeds would become available in a future update. It appears that update is iOS 11.2.\nMacRumors received a tip about the new feature from accessory maker RAVpower this evening, and tested the new charging speeds to confirm. Using the Belkin charger that Apple sells, which does support 7.5W charging speeds, the iPhone X was charged from 46 to 66 percent over the course of thirty minutes.\nThe same iPhone charged from 46 percent to 60 percent over 30 minutes when using a wireless charging accessory that does not offer 7.5W charging speeds. Our testing was intended to emulate real world conditions, with a case on and Airplane Mode not activated.\nWith support for 7.5W charging speeds, the iPhone 8, 8 Plus, and iPhone X will be able to charge more quickly over a wireless connection, and it appears 7.5W wireless charging speeds are faster than the speeds you get with the standard wired 5W power adapter.\nAt 7.5 watts, Apple's wireless iPhones do not support the same wireless charging speeds that are available on some other Qi-based smartphones, as the current Qi 1.2 standard allows for up to 15W of wireless charging power. Still, 7.5 watts is better than 5 watts and should offer some noticeable improvements for iPhone 8, 8 Plus, and X owners.\nBoth the Mophie Wireless Charging Base and the Belkin Boost Up Wireless Charging Pad that are available from Apple support the faster 7.5W wireless charging speeds.\nSeveral other Qi-based wireless charging accessories from other third-party manufacturers also support the higher speeds, such as the RAVpower Fast Wireless Charger, but there are accessories out there that don't, so you'll want to look for 7.5W charging speeds as a listed feature when making a purchase.\niOS 11.2 is limited to developers and public beta testers at this time, but as we're on the third beta, a public release could come in a few weeks to a month.",
        "sentiment": -0.007553990863795791
    },
    "article_12": {
        "title": "Apple pushes HomePod release to early 2018",
        "body": "So much for the holiday rush. Apple announced this morning that its premium HomePod smart speaker won’t be making the company’s initial December ship date. According to a brief statement issued by the company, the production process needs “a little more time” to bake.\nA spokesperson told TechCrunch, “We can’t wait for people to experience HomePod, Apple’s breakthrough wireless speaker for the home, but we need a little more time before it’s ready for our customers. We’ll start shipping in the US, UK and Australia in early 2018.”\nOf course, it’s always smart to spend a little extra time getting things right, rather than rushing into production — a lesson numerous tech co’s have learned in recent years. But this delay has got to be a a bummer for a product Apple was banking on for the holidays. The $350 speaker is the first home device to feature Siri baked in, a high-end competitor to Echo and Assistant offerings from Amazon and Google.\nWe had a chance to experience the smart speaker first hand when Apple unveiled it at WWDC back in June. It wasn’t a full hands-on opportunity, but the HomePod definitely sounds great as advertised, featuring 360-degree sound, and full, room-filling audio. Unlike earlier takes on the category, the HomePod emphasizes the speaker part of the smart speaker category first.\nOf course, since that initial announcement, the competition has introduced similar offerings. Amazon announced and started shipping a new version of the standard Echo, improving upon the earlier product’s audio with Dolby sound, coupled with a 2.5-inch subwoofer and 0.6-inch tweeter. Google, meanwhile, introduced an even more direct competitor in the Home Max, a $399 smart speaker that appears to still be in line for a release next month.\nThere are also a number of third party offerings from the likes of Sony and JBL — Harman Kardon even made sure poor old Microsoft Cortana was represented this holiday season with the Invoke. Perhaps the suddenly crowded playing field was enough to convince Apple to spend a little more time in the kitchen with HomePod.\nThe move echoes a similar decision by the company last year to delay the launch of its wireless AirPod earbuds last year (something Google might have considered). Initially planned for an October release, the headphones finally arrived in December — in that case, just squeaking in before Christmas.\nApple hasn’t specified whether hardware or software is the root of the problem, though it’s not entirely a surprise given that this is a first-gen product for the company. It’s also the device that will set the stage for Siri’s life outside of the phone/desktop — at $350 a pop, it’s important to get things right the first time.",
        "sentiment": 0.22964310636743904
    },
    "article_13": {
        "title": "Whenever I read about people spending hundreds of dollars and several hours to fool FaceID I think of this.",
        "body": "Security\nA Crypto nerd's imagination: Guy [[Holding Laptop]]: His laptop's encrypted. Let's build a million-dollar cluster to crack it. Other guy: No good! It's 4096-bit RSA! Guy: Blast! Our evil plan is foiled! What would actually happen: Guy [[Holding money tag and wrench]]: His laptop's encrypted. Drug him and hit him with this $5 wrench until he tells us the password. Other guy [[taking the wrench]]: Got it. {{Alt-Text: Actual Actual Reality: Nobody really cares about his secrets. (Also, I would be hard pressed to find that wrench for $5.)}}\nPermanent link to this comic: https://xkcd.com/538/ Image URL (for hotlinking/embedding): https://imgs.xkcd.com/comics/security.png",
        "sentiment": -0.10397631846941434
    },
    "article_14": {
        "title": "Apple breaks file sharing on Macs while fixing 'huge' password security flaw | Technology",
        "body": "In its haste to fix the macOS High Sierra bug that allowed anyone to take control of a Mac computer with a blank password, Apple broke file sharing for some users.\nHaving been notified of the “huge” security hole on Tuesday, the company’s security engineers raced to fix the problem, releasing an update that was pushed out to users of macOS High Sierra on Wednesday afternoon.\nUnfortunately, that fix introduced another bug, this time within the file sharing system of macOS, preventing some users from authenticating with or connecting to file shares, which are used both in business and on home networks.\nThe company quickly acknowledged the problem, releasing a support document guiding users through how to fix the problem caused by the critical bug patch. Unfortunately, to perform the necessary repair, users have to use an advanced feature of the operating system called the Terminal and perform command line actions:\nOpen the Terminal app, which is in the Utilities folder of your Applications folder. Type sudo /usr/libexec/configureLocalKDC and press Return. Enter your administrator password and press Return. Quit the Terminal app.\nDespite the straightforward explanation and commands provided by Apple, many Mac users will not have experience of running commands within Terminal, a program designed to give advanced users direct, text-based access to underlying systems within macOS. Some took to Twitter to vent their frustration.\nI'm looking forward to having to explain to my family why they have to use the terminal to fix file sharing they use at home or at work because of Apple's fucking incompetence. — Olivier Charavel (@charavel) November 30, 2017\nOthers were more pragmatic, saying that breaking file-sharing tools was better than leaving the root-access bug unpatched for longer.\nOof, the cost of rushing out a macOS update overnight. Acceptable losses, all things considered https://t.co/Dupn7jpnl1 — Steve Troughton-Smith (@stroughtonsmith) November 29, 2017\nApple apologised on 29 November for the original bug, saying that security was still a top priority for the company and that it had “stumbled” with macOS High Sierra. A spokesperson said: “We greatly regret this error and we apologise to all Mac users, both for releasing with this vulnerability and for the concern it has caused. Our customers deserve better. We are auditing our development processes to help prevent this from happening again.”",
        "sentiment": -0.6704022481830584
    },
    "article_15": {
        "title": "YouTube v12.45 | Fixed an issue with battery usage",
        "body": "Get the official YouTube app on iPhones and iPads. See what the world is watching -- from the hottest music videos to what’s popular in gaming, fashion, beauty, news, learning and more. Subscribe to channels you love, create content of your own, share with friends, and watch on any device.\nWatch and subscribe\n● Browse personal recommendations on Home\n● See the latest from your favorite channels in Subscriptions\n● Look up videos you’ve watched, liked, and saved for later in Library\nExplore different topics, what’s popular, and on the rise (available in select countries)\n● Stay up to date on what’s popular in music, gaming, beauty, news, learning and more\n● See what’s trending on YouTube and around the world on Explore\n● Learn about the coolest Creators, Gamers, and Artists on the Rise (available in select countries)\nConnect with the YouTube community\n● Keep up with your favorites creators with Posts, Stories, Premieres, and Live streams\n● Join the conversation with comments and interact with creators and other community members\nCreate content from your mobile device\n● Create or upload your own videos directly in the app\n● Engage with your audience in real time with live streaming right from the app\nFind the experience that fits you and your family (available in select countries)\n● Every family has their own approach to online video. Learn about your options: the YouTube Kids app or a new parent supervised experience on YouTube at youtube.com/myfamily\nSupport creators you love with channel memberships (available in select countries)\n● Join channels that offer paid monthly memberships and support their work\n● Get access to exclusive perks from the channel & become part of their members community\n● Stand out in comments and live chats with a loyalty badge next to your username\nUpgrade to YouTube Premium (available in select countries)\n● Watch videos uninterrupted by ads, while using other apps, or when the screen is locked\n● Save videos for when you really need them – like when you’re on a plane or commuting\n● Get access to YouTube Music Premium as part of your benefits\nNote: If you subscribe via Apple, payment will be charged to App Store Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Account will be charged for renewal within 24 hours prior to the end of the current period at the rate of the selected plan. Subscriptions and auto-renewal may be managed by going to Account Settings after purchase.\nMonthly price: $15.99 USD (US, TC) / $19.99 AUD / $20.99 NZD / $155MXN / £15.99GBP / €15.99 EUR (IE, DE, AT, FR, FI, IT, ES, BE, NL, LU) / $15.99 CAD / 149 kr SEK / 149 kr NOK / 249 ₽ RUB / 149 kr. DKK / R$27.90 BRL / CHF19.90 CHF / ¥1,550 JPY / USD$4.99 (UA, AR) / COP$22,900 / CLP$5,500 / S/.26.90 PEN / €10.99 EUR (PT, CY, GR, MT, EE, LT, LV) / ₹169.00 INR / R94.99 ZAR / USD$9.49 (CR, EC, DO, UY, GT, BO, HN, SV, PY, NI, PA, VE, BY, BM, KY) / 32.99 zł PLN / RON34.99 / 239.00 Kč CZK / Ft2,390.00 HUF / lev14.99 BGN / USD$10.99 (MK) / €9.49 EUR (SK, SI) / ₺21.99 TRY / USD$18.59 (IS) / kn99.99 HRK / ₪31.90 ILS / dh32.99 AED / Rial32.99 SAR / Rial32.99 QAR / USD$7.99 (BH, KW, OM, LB, PG) / Rp79,000 IDR / NT$230.00 TWD / ฿209.00 THB / ₱209.00 PHP / $88.00 HKD / RM23.90 MYR / $15.98 SGD / ₦1,500.00 NGN / £79.99 EGP\nYouTube paid service terms: https://www.youtube.com/t/terms_paidservice.\nPrivacy policy: https://www.google.com/policies/privacy",
        "sentiment": -0.04022233818586056
    },
    "article_16": {
        "title": "Apple CEO Tim Cook says social media is being used to manipulate and divide us — in an interview on NBC Nightly News this evening.",
        "body": "Apple CEO Tim Cook doesn’t have a high opinion of platform-owning social media and advertising companies, most of which are now embroiled in an ongoing controversy about Russian interference in the 2016 US election. Cook, in an interview with Lester Holt on NBC Nightly News this evening, said the big issue isn’t the advertisements targeting groups and individuals, but the overall nature of social media as a tool for misinformation and manipulation.\n“I don’t believe the big issue are ads from foreign governments. I believe that’s like .1 percent of the issue,” Cook says. “The bigger issue is that some of these tools are used to divide people, to manipulate people, to get fake news to people in broad numbers so as to influence their thinking. This to me is the No. 1 through 10 issue.”\nFollowing a second day of Capitol Hill testimony from members of Google, Facebook, and Twitter, Congress has taken an increasingly aggressive and adversarial stance on Silicon Valley’s ability to reign in the abuse of its products and keep them free of bad actors and foreign governments. In the past couple of months, it’s been revealed that Russia-linked advertising was prevalent in Google search and YouTube ads, as well on both Facebook and Twitter’s ad platforms. And in the past week, following the disclosure of new reports from all three tech companies, we know these ads reached many more users than previously thought, in some cases having more than 10 times the initial reported impact.\nCook addressed the congressional hearings, saying that the social media companies have “learned along the way a lot,” and that “we'll probably learn more in those hearings as to the particulars.” He went on to say that just as all New York companies aren’t all the same — and all media companies aren’t the same — well, all technology companies aren’t the same, either. They have different values, different principles, different business models.”",
        "sentiment": -0.6228272531713758
    },
    "article_17": {
        "title": "Apple is $100 Billion Away From Becoming World's Only Trillion Dollar Company",
        "body": "Apple shares are currently trading for around $175, giving the iPhone maker a market cap of roughly $900 billion. The valuation puts Apple within $100 billion of becoming the world's only trillion dollar company.\nApple shares will have to rise to around the $195 mark for the company to reach a trillion dollar valuation, depending on the rate of its share buybacks, and an increasing number of Wall Street analysts think that will happen.\nDrexel Hamilton analyst Brian White, who is extremely bullish about Apple, has a lofty 12-month price target of $235 for the company's stock. In other words, he forecasts that Apple could be a $1.2 trillion company within a year.\nWith a market cap of over $900 billion, we believe Apple is on its way to becoming a \"trillion dollar baby\" as reflected in our price target. We were the first on Wall Street to project that Apple would reach a $1 trillion market cap as reflected by a price target; our current price target of $235.00 equates to approximately a $1.2 trillion market cap.\nRBC Capital Markets analyst Amit Daryanani has also said Apple has the potential to achieve a trillion dollar market cap, and even surpass that valuation, by the end of 2018. His current price target for Apple shares is $190.\nApple could be the world's only trillion dollar company, but it wouldn't be the first. The spice trading Dutch East India Company, founded in 1602, was the first to go public and at one point was valued at over $7 trillion when adjusted for inflation.\nWall Street analysts, including White, have been prognosticating Apple becoming a trillion dollar company since as early as 2012.",
        "sentiment": 0.32251136082534987
    },
    "article_18": {
        "title": "Apple Now Letting Apple IDs With Third-Party Email Addresses Be Updated to Apple Email Addresses",
        "body": "Apple today made a small change to the way Apple IDs work, and for the first time, Apple customers who have an Apple ID that uses a third-party email address can update that Apple ID to use an Apple @icloud.com, @me.com, or @mac.com email address.\nPrior to today, an Apple ID that used a third-party email address could be changed to another third-party email address, but there wasn't an option to use one of the Apple email accounts that are created when an Apple ID is made.\nThe change was outlined by MacRumors reader Dillon, who sent an email to several executives earlier this month asking for the problem to be changed. Dillon was contacted by Apple Executive Relations last week and was told Apple's engineering team would look into the problem. He received a second phone call today, letting him know the issue had been fixed. From Dillon:\nFor a long time if you had an Apple ID that used a 3rd party email address as your Apple ID you were unable to change it to an Apple email address... even if the Apple address was on the same account. I couple of weeks ago I sent an email addressed to Tim Cook, Craig Federighi, Phil Schiller, and Eddy Cue. I explained the situation and asked if they could fix it. Last week I received an email and phone call from someone at Apple Executive Relations. The women I spoke to told me that the problem would be sent to an engineering team and would be addressed. Today I got another call and email informing me that the issue had been resolved. I tried it out and sure enough... I can finally set my Apple email as my Apple ID!\nApple's \"Change Your Apple ID\" support document was today updated to reflect the updates made to the Apple ID, and it now includes a section confirming a third-party email address can be changed to an @icloud.com, @me.com, or @mac.com email address.\nWhen swapping from a third-party Apple ID email address to an email address ending in @icloud.com, @me.com, or @mac.com, Apple warns that there is no way to change it back to a third-party email account.\nIf you enter a new Apple ID that ends with @icloud.com, @me.com, or @mac.com, you see a message to confirm. When you change your Apple ID to an @icloud.com, @me.com, or @mac.com account, you can't change it back to a third-party email account. Your former Apple ID that ends with a third-party email, becomes an additional email address for your Apple ID account.\nThis should be a welcome change for all Apple customers who have wanted to change their Apple ID addresses to an official Apple email address. Those who want to go ahead and swap should read Apple's support document and follow all of the steps, which include signing out of all iOS devices before making the change.\nUpdate: While this feature is working for some users, others report being unable to change their Apple IDs. It's possible this feature has not yet rolled out to all users, or that it's not fully functional as of yet. It's unclear at this point why it's not working for some people.",
        "sentiment": -0.2816351870582862
    },
    "article_19": {
        "title": "6 million iPhone X units sold over Black Friday weekend, buyers favor more expensive 256 GB model",
        "body": "Apple appears to have done very well out of the Black Friday promotions. Regarding iPhone sales performance, analysts at Rosenblatt believe Apple saw around 6 million iPhone X sales over the Black Friday weekend, out of a total of 15 million iPhones sold.\nThe 256 GB iPhone X was twice as popular as the base 64 GB model according to the analysts, a positive sign for Apple’s bottom line.\nThe 64 GB iPhone X sells for $999 in the United States. The 256 GB model is functionally equivalent aside from an additional 192 GB of flash storage. Apple charges an additional $150 for this model; it naturally has higher revenue and higher profit margins than the base model.\nOverall, the report indicates around 30 million iPhone X will be shipped in the current holiday quarter. Apple’s own earnings guidance suggests Apple will sell more than 80 million iPhones in the period, a new revenue and unit record.\nThe analysts believe iPhone X production is around 3 million units a week currently and could rise to 4 million per week in December. We have seen shipping times fall on Apple.com for iPhone X but Rosenblatt remain confident that underlying demand is strong. KGI’s Ming-Chi Kuo made similar comments last week.\nAn earlier report indicated iPads and AirPods topped overall Black Friday shopping lists.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.21195517560201033
    },
    "article_20": {
        "title": "iPhone X Is King of OLED Screens: See for Yourself",
        "body": "So much has been made of the iPhone X's infamous notch, but its 5.8-inch display is notable for other reasons. With the introduction of its first handset with an OLED panel, Apple joins the ranks of Samsung and LG; in fact, Samsung has been putting the technology in its phones since way back in 2008.\nGoogle Pixel 2 XL, Apple iPhone X and Samsung Galaxy Note 8 (left to right).\nApple has some catching up to do, and we were interested in seeing how its efforts compared to its two closest competitors running OLED displays: the Samsung Galaxy Note 8 and the Google Pixel 2 XL. Here's what we saw.\nUpdate Nov. 3: We’ve updated this story with additional context around how we measure screen brightness.\nThe brightest display in typical scenarios\nTo get a better read on each phone, I enlisted the help of a few of my colleagues. The first thing they all pointed out was just how bright the iPhone X’s 5.8-inch display gets in comparison to its Android-powered rivals.\nMORE: iPhone X Full Review - Here's the Pros and Cons\nFor testing, we dialed each phone's brightness to the maximum setting in manual mode, navigated to a completely white screen in their respective browsers, and recorded the results with our light meter. The iPhone X led the pack at 574 nits, compared to 438 nits from the Pixel 2 XL and 408 nits from the Note 8. The smartphone average is 433 nits.\nThe fact that the Note 8 isn't far and away the leader here may come as a surprise, especially after it was reported by DisplayMate that the device could reach a peak brightness of 1,240 nits. Indeed, the Note 8 can get brighter than the iPhone X, but only in extremely specialized conditions where a very small portion of the display is active. Owners are not likely to ever encounter such a scenario in typical usage, so when viewing full-screen content, Apple's phone actually performs better.\nBrightness is a key component of any display, but it's especially important on OLED panels, which are typically much dimmer than their LCD counterparts due to the lack of a backlight. Screen makers have improved in this regard over the years, but the iPhone X looks to be a serious step up from the previous standard-bearer up to this point, Samsung's Galaxy S line.\nMORE: Top Big-Screen Phones (5.5 Inches or Larger)\nHaving a display this bright lifts every part of whatever content you have on-screen. Darker tones present more detail and subtle color. Edges universally appear crisper. Contrast becomes less drastic but still striking because of OLED's capability to deliver true blacks. It's perhaps the greatest strength of the iPhone X's screen that makes a profound first impression.\nNot very saturated for an OLED, but very natural\nApple's never been one to tout super vivid colors, nor has it offered a variety of viewing modes on its handsets as many phone makers do. As a result, we weren't surprised to find that the iPhone X struck a balance between the Note 8 and Pixel 2 in terms of color representation.\nComparing a still image from Wonder Woman on all three displays, the Samsung quickly re-confirmed its reputation for oversaturated hues in the phone's stock Adaptive Display mode. Tom's Guide's Caitlin McGarry noted it was the least realistic-looking of the bunch, while Andrew Freedman remarked on the unnatural intensity of the blue sky. However, it can be toned down in favor of a cinema, movie, or basic mode in the settings.\nGoogle Pixel 2 XL, Apple iPhone X, and Samsung Galaxy Note 8 (top to bottom).\nUsers who prefer the punchier colors of the Note 8 will probably come away with the impression that Apple's rendition of OLED isn't much more immersive than the LCD screens offered in the iPhone 8 and 8 Plus. The iPhone X covered 123 percent of the sRGB gamut in our testing, compared with the Pixel 2 XL's 130 percent and the Note 8's impressive 204 percent range.\nIn terms of realism, the Pixel 2 XL is a more worthy adversary. Google tuned its LG-sourced 6-inch panel to an sRGB color profile that's more muted compared to what you find in most phones. But then the Pixel goes too far, attempting to achieve lifelike visuals by toning down the contrast and casting a beige filter that permeates everything from Wonder Woman's skin to the sea beyond. (Google says a future software update will bolster color saturation, though at the expense of accuracy.)\nUltimately, the iPhone X took the victory here, as it better handled the contrast between the sky and water. The increased brightness also helped illuminate more of the shadowy details in the scene, like the braids in Wonder Woman's hair.\nBetter white balance\nThanks to its True Tone display, the iPhone X can adjust its white balance to ambient lighting conditions. But even with True Tone off, our unit struck a perfect medium between the warmth of the Pixel 2 XL and the cool shift of the Note 8 in our office.\nMORE: iPhone X vs. Galaxy Note 8\nFurther testing also indicated that True Tone actually improves color accuracy. With the feature off, our iPhone X recorded a Delta-E score of 0.28. (Numbers closer to 0 are better.) With the True Tone on, that was improved to 0.21. That's comparable to the score from the Pixel 2 XL (0.26) and a bit better than the reading from the Note 8 (0.5).\nSuperior viewing angles\nThere's a common complaint about OLED displays: They don't fare well when viewed off-center. Most present a blue tint along with a drop in brightness that can be slight or severe. All three phones in this comparison are subject to this flaw, but the iPhone X handles these shortcomings the best.\nGoogle Pixel 2 XL, Apple iPhone X and Samsung Galaxy Note 8 (left to right).\nApple's panel does a much better job of maintaining its brightness as you tilt the phone from left to right, and top to bottom. It does get a few shades cooler as you turn it, but not quite to the degree of the Note 8, and definitely not to the extent of the Pixel 2 XL.\nIt's not quite as sharp\nThis is not something you're likely to notice in typical usage, but it should be said nevertheless: The iPhone X's display carries fewer pixels per inch (438 ppi) than either the Note 8 (521 ppi) or the Pixel 2 XL (538 ppi).\nIf you squint, you can see fine aliasing around text and UI elements that is harder to pin down on Samsung's device. The issue is somewhat exacerbated by viewing 16:9 formatted content — like pictures and videos — in the iPhone X's full-screen view that crops out the top and bottom of the frame. The YouTube app on iOS already has a toggle for this, and it made the trailer for Justice League I was watching ever so slightly blurrier, though the effect was much more immersive, even despite the notch.\nBottom Line\nIt took Apple an awfully long time to jump on the OLED bandwagon, but as usual, the company knocked it out of the park when it finally made the move. But is it better than the competition? The answer to that question will depend on what you like to see.\nIf it's realism you want, the iPhone X's supremely bright screen and exquisite white balance provide a sense of color accuracy you simply don't get from other handsets. But if you want hues that truly pop, the Galaxy Note 8 is still king. Ironically, Samsung is responsible for producing the OLED panels in both phones, but differences in tuning have resulted in two of the year's very best, albeit very different, smartphone displays.\nCredit: Shaun Lucas/Tom's Guide",
        "sentiment": 0.036223777756094935
    },
    "article_21": {
        "title": "Jony Ive says iPhone X will evolve and be able to ‘do things it can’t do now’ in a year’s time",
        "body": "Apple’s Chief Design Officer, Jony Ive sat down with design magazine Wallpaper* for a wide-ranging interview following the release of the iPhone X. In the piece, Ive talks about the company’s new Apple Park headquarters, what he likes most about iPhone X, and much more.\nArguably, the most interesting comments from Ive in this piece relate to the iPhone X. Apple debuted its iPhone X back in September and officially released it to consumers just last week. The iPhone X features an all-new design that puts the 5.8-inch OLED display at the forefront.\nIve remarks in the interview that what he views as the best iPhone X feature is how it can adapt over time. He explains that the entire functionality of the device is determined by software – in large part thanks to the new screen-centric design. He even goes as far as to say that the iPhone X will look completely different in a year’s time as software progresses:\n“I’ve always been fascinated by these products that are more general purpose. What I think is remarkable about the iPhone X is that its functionality is so determined by software. And because of the fluid nature of software, this product is going to change and evolve. In 12 months’ time, this object will be able to do things that it can’t now. I think that is extraordinary. I think we will look back on it and see it as a very significant point in terms of the products we have been developing.”\nWhen asked if he misses the physical buttons and clicks of a device like the first iPod, Ive said what’s more important is how a device evolves and “changes its functionality profoundly” after it’s created:\n“So while I’m completely seduced by the coherence and simplicity and how easy it is to comprehend something like the first iPod, I am quite honestly more fascinated and intrigued by an object that changes its function profoundly and evolves. That is rare. That didn’t happen 50 years ago.”\nOn a broader scale, Apple’s design chief explains that the goal of the design team is to “get design out fo the way. We try to define a solution that seems so inevitable that it does recede.”\nIve also talked about the new Apple Park campus, remarking that what he’s most excited about is how well it promotes collaboration across different teams and departments:\n“That’s one of the things that I am absurdly excited about. At the moment, there are a number of physically really disconnected design studios, and now we can share the same studio. We can have industrial designers sat next to a font designer, sat next to a sound designer, who is sat next to a motion graphics expert, who is sat next to colour designer, who is sat next to somebody who is developing objects in soft materials. And adjacent to every set of closed offices there is a very large open area of collaboration. It’s not just a corridor; these are large spaces that are repeated all the way around the building.”\nIve doesn’t expect the open and communicative new building to affect Apple’s secrecy, though:\n“The way that we work is quietly,’ Ive says. ‘We are conspicuously different in that and it is an important part of who we are.”\nAs for what the future holds, Ive wouldn’t talk about specific plans. He notes, however, that Apple’s design group is full of “designers who are absurdly curious and constantly looking for alternatives.” Some design ideas currently exist beyond the possibilities of the technology, even:\n“We are a fairly tenacious group of designers who are absurdly curious and constantly looking for alternatives. Some of them we can understand right here, right now. Some of them are beyond the technology of the moment. They exist as ideas, they exist to galvanise the development of technology. And some will bear fruit and others won’t.”\nThe full interview is definitely worth a read and can be found here. Also check out the Jony Ive-designed cover of Wallpaper’s December issue:\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.3763165180430268
    },
    "article_22": {
        "title": "Analyst predicts Apple will launch Netflix rival service in 2018",
        "body": "As part of CCS Insight’s predictions for 2018, analysts for the firm suggest that Apple will launch a video subscription service, designed to compete with Netflix.\n“Everyone is jostling for position and everyone is jumping in on the area of video. When you look at Apple, it has a very strong hardware offering and their services business is on the march,” Paolo Pescatore, vice president of multiplay and media at CCS Insight, told CNBC.\nShould Apple go down the streaming video service route, CCS Insight suggests that Apple’s original content, currently in development, will play a major role.\n“The real battleground is in the area of original content, but original content would feature prominent and Apple would be very well placed to do that,” Pescatore noted.\nIt’s not clear exactly what the firm’s predictions are based upon, although this certainly isn’t the first time such rumors have been voiced. Way back in 2011, the Wall Street Journal suggested Apple was considering attempts to launch a subscription TV service.”\nDuring Apple’s earnings call in January, Tim Cook said that, “With our toe in the water, we are learning a lot about the original content business, and thinking about ways that we could play in that.”\nHaving led the pack in terms of digital video dating back to the 1980s, Apple would be a natural company to jump into this area. Although its first efforts in original content, the reality TV shows Planet of the Apps and Carpool Karaoke: The Series, have been critical flops, Apple is supposedly readying $1 billion to spend on launching additional shows.\nInitially it seemed that Apple’s original content would be exclusive to Apple Music, but more recent reports have suggested that it would be distinct from it.\nWould you be willing to pay a monthly subscription to watch iTunes movies and Apple’s original shows? Do you see this happening in 2018 or will it take Apple longer to get a streaming service up and running? Let us know your predictions below.\nSource: CNBC",
        "sentiment": 0.0337739985303155
    },
    "article_23": {
        "title": "Tim Cook’s record-crushing tenure as Apple CEO is the most under-appreciated story in business",
        "body": "It's been a monumental few months for Apple, with the release of the iPhone X -- the biggest redesign of Apple's most important product since it launched in 2007 -- plus the iPhone 8 and 8 Plus, a new Apple Watch with cellular connectivity, a new Apple TV, new Macs, and the forthcoming HomePod \"smart\" speaker.\nAll of these products were hatched under the watch of Apple's understated CEO, Tim Cook. But Cook, who took over in August 2011 after a couple of interim-CEO stints, has not inspired the same level of devotion as his predecessor, Apple co-founder Steve Jobs.\nJobs did bring Apple back from the brink of bankruptcy to turn it into the most valuable company in the world. But Cook's job in some ways is harder. Jobs was starting almost from zero. Cook has to maintain Apple's growth from an absolutely massive revenue and profit base, while answering critics who long for another world-changing product like the iPhone turned out to be.\nAn Alabama native with both business and engineering degrees, Cook spent 12 years at IBM in its heyday and is known as a tough negotiator with strong senses of discipline and integrity who relies on both logic and intuition to make decisions. In his biography, Jobs said he and Cook \"wanted the same thing\" and had \"the same vision\" for Apple at a high strategic level.\nSo how's he doing?",
        "sentiment": 0.2188104547560215
    },
    "article_24": {
        "title": "iPhone X pre-orders sell out in minutes in South Korea, Samsung's home turf",
        "body": "The iPhone X may have greater levels of availability in Apple Stores than many predicted, but there’s one place you’ll struggle to get your hands on one: South Korea.\nAccording to a new report, Samsung’s home turf experienced a massive surge of orders for the iPhone X when it was made available for pre-order, ahead of its November 24 launch. In total, the allocated iPhone X shipments for the country sold out within minutes.\nLeading mobile carrier SK Telecom said it sold all of its allocated iPhone X phones in three minutes, compared to 20 minutes for the iPhone 7 last year. In particular, the silver iPhone X sold out in just one minute.\nOther carriers including KT Corp and LG Uplus also say they sold out of their pre-order iPhone X handsets within minutes. “The initial inventories were … too low to meet the demand,” an official from one mobile carrier said.\nIt appears that whoever divvied up the next-gen iPhone handsets misjudged demand in South Korea, where the iPhone X is considerably pricier than it is in the U.S. — with the entry level iPhone X retailing for $1,237 in a country where wages are also typically lower.\nIndustry watchers say the total number of iPhone X handsets for South Korea was 150,000, compared to more than 200,000 for the iPhone 8 and 8 Plus.\nThe high demand for the iPhone X is especially good news for Apple given that a lot of the South Korean tech press, which often favors its home-grown Samsung brand, has dedicated plenty of space to critizing the high price of the device — and even nonsensically suggested a recall of the devices could be carried out at one point.\nSource: Yonhap News",
        "sentiment": -0.30707555152475835
    }
}