{
    "article_0": {
        "title": "Apple Doesn't Deliberately Slow Down Older Devices According to Benchmark Analysis",
        "body": "Benchmarking company Futuremark recently set out to debunk long-running speculation that Apple intentionally slows down older iPhones when it releases new software updates as a way to encourage its customers to buy new devices.\nStarting in 2016, Futuremark collected over 100,000 benchmark results for seven different iPhone models across three versions of iOS, using that data to create performance comparison charts to determine whether there have been performance drops in iOS 9, iOS 10, and iOS 11.\nThe first device tested was the iPhone 5s, as it's the oldest device capable of running iOS 11. iPhone 5s, released in 2013, was the first iPhone to get a 64-bit A7 chip, and iOS 11 is limited to 64-bit devices. Futuremark used the 3DMark Sling Shot Extreme Graphics test and calculated all benchmark scores from the iPhone 5s across a given month to make its comparison.\nThe higher the bar, the better the performance, and based on the testing, GPU performance on the iPhone 5s has remained constant from iOS 9 to iOS 11 with just minor variations that Futuremark says \"fall well within normal levels.\"\niPhone 5s CPU performance over time was measured using the 3DMark Sling Shot Extreme Physics test, and again, results were largely consistent.\nCharts for other devices, including the iPhone 6, 6s, and 7, show some mild dips and increases when it comes to GPU performance. In the iPhone 6 and 7, GPU performance is up compared to previous-generation versions of iOS.\nCPU performance across those three devices has dropped slightly, something Futuremark attributes to \"minor iOS updates or other factors.\" \"A user would be unlikely to notice this small difference in everyday use,\" says the site. Based on its benchmarking comparisons, Futuremark claims \"there are no signs of a conspiracy.\"\nOur benchmarking data shows that, rather than intentionally degrading the performance of older models, Apple actually does a good job of supporting its older devices with regular updates that maintain a consistent level of performance across iOS versions.\nRaw CPU and GPU power across devices does not offer a complete picture of performance on an older device that's updated to a new operating system, however, nor are benchmarks an accurate measure of real world performance. Apple may not be deliberately slowing down older devices with its software updates, as some have speculated, but there are other factors to take into account.\nNew features that eat up more system resources can make a device feel slower, as can more system intensive design elements and other tweaks and changes designed for newer devices that are more powerful.\nApple's operating system updates also introduce more advanced APIs and technology for its newest devices, leading to built-in and third-party apps that are aimed at more powerful devices and may not be optimized on older devices, resulting in an older device feeling more sluggish than a newer device following an iOS update.\nSometimes, there are also early bugs in the software that need to be worked out through additional updates. For example, we've seen complaints of app slowdowns and performance drops from users who have installed iOS 11, issues that may be resolved as Apple tweaks and updates the iOS 11 operating system.",
        "sentiment": -0.2118302244496973
    },
    "article_1": {
        "title": "Apple to Charge $279 for iPhone X Screen Repairs and $549 for Other Damage Outside of Warranty",
        "body": "Apple has updated its website with non-warranty service pricing for the iPhone X, which became available to pre-order starting today.\nIn the United States, Apple will charge flat rates of $279 for iPhone X screen repairs and $549 for any other damage to the device, unless it is a manufacturing defect covered by Apple's standard one-year limited warranty. The fees vary in other countries, such as Australia, Canada, Germany, and the United Kingdom.\n• Australia: $419 for screen repairs, $819 for other damage\n• Canada: $359 for screen repairs, $709 for other damage\n• Germany: €321 for screen repairs, and €611 for other damage\n• United Kingdom: £286 for screen repairs, £556 for other damage\n• United States: $279 for screen repairs, $549 for other damage\nThese prices do not apply to customers who purchase AppleCare+ for the iPhone X, which costs $199 upfront in the United States.\nAppleCare+ is an optional warranty plan that extends an iPhone's coverage to two years from the original purchase date of the device. The plan adds up to two incidents of accidental damage coverage, each subject to a lower service fee of $29 for screen repairs, or $99 for any other damage.\nIf you shatter your iPhone X's screen once during its lifetime, for example, you would pay $279 out of warranty. With the upfront cost of AppleCare+ coupled with the screen repair incidental fee, you would pay $228, so purchasing the plan can save you money in the long run if an accident happens.\nIf you shatter your iPhone X's back glass, having AppleCare+ is even more worthwhile. Apple's flat rate is $549 for this type of damage, while the upfront cost of AppleCare+ coupled with a $99 incidental fee totals $298.\nAppleCare+ for iPhone also provides 24/7 priority access to AppleCare advisors via online chat or phone for up to two years after the device's original purchase date. Without the plan, iPhone owners are covered by a limited one-year warranty and an initial 90 days of complimentary telephone support.",
        "sentiment": -0.15494031459093094
    },
    "article_2": {
        "title": "Apple's supply chain confirms that they'll meet iPhone X demand for the holiday season",
        "body": "Yesterday Patently Apple posted a report titled \"Apple Reportedly begins shipping iPhone X to Stores with Foxconn Production now up to 400,000 Units per Week.\" The report noted that Apple's iPhone X production had increased 4X per week from 100,000 units to 400,000. In the coming weeks production is likely to continue to make dramatic increases. Today more news is surfacing to explain why production is finally ramping up and will continue to ramp up. A new supply chain report published today states that yield rates for certain iPhone X components have improved and are becoming more stable. The shipments of the iPhone X are set to grow substantially after October, sources confirm.\nThe report further noted that with production yield rates for certain key components such as 3D sensing modules improving, shipments of the device have increased gradually and will meet Apple's demand ahead of the Christmas and New Year's holidays, the sources indicated,\" contrary to the doom and gloom rumor reports that have plagued the Apple blogosphere for weeks.\nThe report added that \"Chip deliveries for the iPhone X have been on schedule up to now, according to sources at analog IC vendors, which claimed they started to fulfill their orders for the device as scheduled in the third quarter. They were not aware of any production delays or shipment cutbacks as alleged in media reports, according to the sources.\nOn the whole, chip orders for new iPhone devices will grow through the fourth quarter of 2017, and will begin to slow down in the first quarter of the following year, the sources continued.\nLastly the report cautioned that \"the later availability of the iPhone X may not follow the same pattern if pre-orders for the device exceed expectations, other industry sources have remarked. There is still uncertainty about actual demand for the new Apple product, according to the sources.\"\nAbout Making Comments on our Site: Patently Apple reserves the right to post, dismiss or edit any comments. Those using abusive language or negative behavior will result in being blacklisted on Disqus.",
        "sentiment": 0.09180142278117794
    },
    "article_3": {
        "title": "Apple CEO Tim Cook: Mac Mini Will Be 'Important Part' of Future Product Lineup",
        "body": "Apple's Mac mini celebrated its third birthday this week, marking three years since the device was last updated. The lack of attention Apple has given to the Mac mini has left many Mac users wondering about the future of the machine and whether there are updates to come.\nMacRumors reader Krar decided to email Apple CEO Tim Cook to get an update on the Mac mini and he received a response. Cook said it was \"not time to share any details,\" but he confirmed that the Mac mini will be an important part of the company's product lineup in the future.\nCook's response echoes a similar statement from Apple marketing chief Phil Schiller, who commented on the Mac mini when Apple's plans for a new Mac Pro were unveiled. \"The Mac mini is an important product in our lineup and we weren't bringing it up because it's more of a mix of consumer with some pro use,\" he said.\nPositioned as a \"bring your own peripherals\" machine that comes without a mouse, keyboard, or display, the Mac mini is Apple's most affordable desktop machine. The current version is woefully outdated though, and continues to use Haswell processors and integrated Intel HD 5000/Intel Iris Graphics.\nIt's not clear when Apple will introduce a new Mac mini, and aside from a single rumor hinting at a new high-end Mac mini with a redesign that \"won't be so mini anymore,\" we've heard no rumors about work on a possible Mac mini refresh.\nWith 2017 coming to a close, we're not likely to see a new Mac mini until 2018 at the earliest. A refreshed machine could use Kaby Lake Refresh chips, and as all chips appropriate for the Mac mini feature four cores, a new machine would likely reintroduce quad-core performance.",
        "sentiment": 0.023780912499536167
    },
    "article_4": {
        "title": "[PSA] Apple Says 'KRACK' Wi-Fi Vulnerabilities Are Already Patched in iOS, macOS, watchOS, and tvOS Betas",
        "body": "Apple has already patched serious vulnerabilities in the WPA2 Wi-Fi standard that protects many modern Wi-Fi networks, the company told iMore's Rene Ritchie this morning.\nThe exploits have been addressed in the iOS, tvOS, watchOS, and macOS betas that are currently available to developers and will be rolling out to consumers soon.\nA KRACK attack proof-of-concept from security researcher Mathy Vanhoef\nDisclosed just this morning by researcher Mathy Vanhoef, the WPA2 vulnerabilities affect millions of routers, smartphones, PCs, and other devices, including Apple's Macs, iPhones, and iPads.\nUsing a key reinstallation attack, or \"KRACK,\" attackers can exploit weaknesses in the WPA2 protocol to decrypt network traffic to sniff out credit card numbers, usernames, passwords, photos, and other sensitive information. With certain network configurations, attackers can also inject data into the network, remotely installing malware and other malicious software.\nBecause these vulnerabilities affect all devices that use WPA2, this is a serious problem that device manufacturers need to address immediately. Apple is often quick to fix major security exploits, so it is not a surprise that the company has already addressed this particular issue.\nWebsites that use HTTPS offer an extra layer of security, but an improperly configured site can be exploited to drop HTTPS encryption, so Vanhoef warns that this is not a reliable protection.\nApple's iOS devices (and Windows machines) are not as vulnerable as Macs or devices running Linux or Android because the vulnerability relies on a flaw that allows what's supposed to be a single-use encryption key to be resent and reused more than once, something the iOS operating system does not allow, but there's still a partial vulnerability.\nOnce patched, devices running iOS, macOS, tvOS, and watchOS will not be able to be exploited using the KRACK method even when connected to a router or access point that is still vulnerable. Still, consumers should watch for firmware updates for all of their devices, including routers.\nAhead of the release of the update that addresses the vulnerabilities, customers who are concerned about attacks should avoid public Wi-Fi networks, use Ethernet where possible, and use a VPN.",
        "sentiment": -0.3387339226901531
    },
    "article_5": {
        "title": "Geekbench Creator Says the iPhone Is Miles Ahead of Android",
        "body": "You know the iPhone is a raging-fast machine when the creator of the popular benchmarking application Geekbench has nothing but praise for Apple’s revolutionary mobile phone. In an interview, he states that Android is still unable to reach the performance of these powerful computing devices.\nGeekbench Creator States That Android Performance Has Started to Lag on the Android Side - No Big Leaps Forward\nJohn Poole, founder of Primate Labs and creator of Geekbench stated in an interview that Android’s performance has started to stagnate and he is unable to comprehend what is happening. If you take a look at the scores that Qualcomm’s latest Snapdragon 835 is able to register, those figures do not even come close to the points obtained by the A11 Bionic SoC.\n“The thing that I don't fully understand is why performance has seemed to stagnate on the Android side. Where you don't see these big leaps forward. I don't understand what's happening there.”\nThough the iPhone takes advantage of the polished iOS platform, he goes on to say that you’re pretty much experiencing desktop-class performance on a smartphone.\n“At this point, you've got desktop-class performance in a handset. There's no way of looking at it any other way. I wouldn't have thought to use my first-generation iPhone to edit video. I would've thought you were crazy. Everybody looks at the A11 scores and they go, ‘Holy crap, this is . . . what does this mean? Are these even comparable?’ Well, yes, they're comparable, but at the same time, you're not going to use your phone to render a huge video because, simply, the form factor doesn't lend itself to it.\"\nBear in mind that the development of the A11 Bionic chipset started all the way back when Apple unveiled its iPhone 6 and iPhone 6 Plus, which features the A9 SoC.\nLots of our readers will argue that the iPhone 8 Plus was not able to best the Galaxy Note 8 in the latest real-world speed test results, but it is also possible that the latest iOS 11.01 update was not running on the handset, and as experienced from before, the first update of Apple’s latest iOS release was plagued with problems which were then addressed by the following update.\nYou might also like to check out:\nNews Source: Tom’s Guide",
        "sentiment": -0.19742200411856176
    },
    "article_6": {
        "title": "Apple releases iOS 11.0.2 for iPhone, iPad and iPod touch",
        "body": "Apple has just released iOS 11.0.2 for iPhone, iPad and iPod touch devices. This marks the second bug fix update since iOS 11 launched in September. The build number is 15A421.\nIt looks to be another round of bug fixes and performance improvements, including a fix for crackly audio during phone calls on iPhone 8, a bug that caused some photos not to show up in user’s libraries and resolves an issue relating to attachments in encrypted email …\nApple says the iOS 11.0.2 brings various ‘bug fixes and improvements for iPhone and iPad’.\nThe minor update is available now for all iOS 11 devices (including the sixth-generation iPod touch).\nApple released iOS 11 on September 19, followed by iOS 11.0.1 a week later. iOS 11.0.1 addressed problems relating to Microsoft email accounts not being able to connect to the server in the stock Mail app.\nTo update, open Settings on your iOS device and navigate to General → Software Update. You will need at least 50% battery to perform the update, or be connected to a power outlet.\nWe’ll keep an eye out for any other changes and enhancements in this latest version of iOS 11. No word yet on battery drain or adverse effects on performance, but we’ll report back if something does arise.\nApple has had a busy few weeks as far as its software roadmap is concerned. As well as these couple of bug-fix updates, Apple has also seeded iOS 11.1 to developers which includes some small interface changes.\nA bigger update for Apple Watch, watchOS 4.1, is also currently in beta which adds Apple Music streaming and a new Radio app to the watch.\nCheck out 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.06667413469403982
    },
    "article_7": {
        "title": "The iPhone X just sold out in 20 minutes",
        "body": "The initial stock of Apple’s iPhone X sold out online in less than 20 minutes Friday, forcing many devotees of the brand to wait at least six weeks before they receive the new smartphone.\nAlternatively, some new models are available on eBay — for as much as $10,000.\nDemand for the cutting-edge X was always likely to be high despite its $999 price tag, but reports that Apple’s supply was severely constrained due to production issues made securing one by launch day almost impossible.\nAdvertisement\nPre-orders opened at 3 a.m. ET on Friday. Within 10 minutes, the 256GB models were already out of stock, and 10 minutes later the 64GB models were gone.\nShipping times quickly slipped from the Nov. 3 launch date to several weeks. Consumers ordering the iPhone X now face a six-week wait for delivery.\nThe phones will go on sale next week in 55 countries amid reports that Apple’s supply would not meet demand. A report this week from the Nikkei said the brand would have only half the number of new smartphones it initially wanted for the critical launch period — which includes the holiday season.\nFor those who can’t wait six weeks, there are other options.\nThe phones go on sale in stores Nov. 3, and Apple confirmed this week retailers would have supply — though how much is unclear. The high demand for the iPhone X means we can expect long queues outside Apple stores ahead of opening times — something that didn’t happen for the iPhone 8 last month.\nThere are already dozens of listings for confirmed iPhone X pre-orders on eBay with sellers asking for considerable markups on the recommended retail price.",
        "sentiment": -0.5595815601448219
    },
    "article_8": {
        "title": "Wells Fargo Adds Apple Pay Support to More Than 5,000 ATMs",
        "body": "Wells Fargo today announced that NFC functionality is now available at more than 5,000 of its ATMs across the United States.\nThe technology enables customers to initiate an ATM transaction by holding their smartphone or wearable device with mobile payment functionality near an NFC-enabled ATM terminal and inputting their PIN.\nSupported digital wallets include Apple Pay, Android Pay, Samsung Pay, and the bank's own Wells Fargo Wallet for Android.\nCustomers that have added their Wells Fargo debit card to Apple Pay, for example, can simply hold their iPhone near the ATM, enter their PIN, and complete a transaction, with no physical plastic card required.\nWells Fargo said it plans to upgrade the rest of the company's more than 13,000 ATMs with NFC by 2019. NFC-enabled terminals are marked with the universal contactless card symbol.\nEarlier this year, Wells Fargo launched a separate one-time access code feature that lets customers authenticate at an ATM by entering an 8-digit code generated from the Wells Fargo app, along with their PIN, for card-free access.\nBank of America also began rolling out Apple Pay support for withdrawing cash from hundreds of its ATMs last year.",
        "sentiment": -0.007723962888121605
    },
    "article_9": {
        "title": "Apple's Craig Federighi Confirms There's No October Event in the Works",
        "body": "This shouldn't come as any surprise given that it's already the 20th of October, but Apple has no plans to hold an event to introduce new products this month. Apple software engineering chief Craig Federighi confirmed there will be no October event in an email to MacRumors reader Luke.\n\"Will we see an October keynote event?\" Luke asked. \"I think we're all Keynoted out for the season! :-)\" Federighi replied.\nSome people were expecting an event to take place this October because there was a Mac-centric event in October of 2016 that saw Apple unveil the Macbook Pro with Touch Bar, but there have been no rumors of a second 2017 event, nor are there any new products on the immediate horizon.\niPads and Macs were both refreshed in June, and while Apple is still planning to introduce the HomePod and the iMac Pro this year, those products are set to debut in December.\nApple is not likely to hold an event for the release of the HomePod or the iMac Pro as the two devices were previously introduced in June at the Worldwide Developers Conference. Instead, Apple will probably launch both via a press release, with no additional events to take place in 2017.\nAside from a \"December\" debut date listed for both the HomePod and the iMac, there's no further word yet on when we might see them during the month.",
        "sentiment": 0.10137592780996453
    },
    "article_10": {
        "title": "Samsung Expected to Earn $4B More Making iPhone X Parts Than Galaxy S8 Parts",
        "body": "Samsung looks on course to earn around $4 billion more in revenue making parts for the iPhone X than from the parts it makes for its own flagship Galaxy S8 handset, according to new research revealed on Monday.\nAn analysis conducted by Counterpoint Technology for The Wall Street Journal based its prediction on projected sales in the 20 months after the new iPhones go on sale November 3. According to CounterPoint, the reason for the chosen time window is that the majority of sales for a new smartphone typically occur in the first 20 months after its debut.\nCounterpoint expects Apple will sell 130 million iPhone X units, earning Samsung $110 on each through the summer of 2019, while Galaxy S8's global sales are expected to be 50 million, earning Samsung $202 each from components such as displays and chips in its first 20 months of sales, according to estimates based on a projected bill of materials. The Counterpoint analysis includes parts sales from Samsung Electronics plus two Samsung affiliates that make batteries and capacitors.\nApple and Samsung are expected to be the world's two most profitable companies in 2017, excluding Chinese banks, according to S&P Global Market Intelligence. Samsung's components operation stands to make billions of dollars supplying the OLED screens and NAND flash memory chips for the new iPhone. Meanwhile, Apple hopes its new iPhone 8 and iPhone X range will boost its smartphone sales, which accounted for two-thirds of the company's $215.64 billion revenue in fiscal 2016, according to investment bank CLSA.\nWSJ reports that Apple and Samsung's close association can be traced back more than a decade to when Lee Jae-yong — the grandson of Samsung's founder — personally negotiated with Apple co-founder Steve Jobs to provide flash memory for iPods, according to people familiar with the matter.\nThat enduring relationship has strengthened in recent months, but mostly out of pure necessity. Samsung is one of only a small number of semiconductor makers that can make large amounts of NAND flash memory, and remains the only significant manufacturer of the OLED displays adopted by Apple for the iPhone X, tightening the dependence of the two companies on each other.\nAt meetings, Samsung executives are known to tell attendees who pull out iPhones: \"It's OK. They're our best client,\" according to people familiar with the matter. Samsung employees often refer to Apple with code names. One of the most popular is \"LO,\" short for \"Lovely Opponent,\" people familiar with the matter said. Apple's descriptor for Samsung, meanwhile, is Samsung, according to people with knowledge of the situation. Employees at the iPhone maker are often critical of its rival's devices, pointing out software and hardware flaws behind closed doors.\nThe business relationship, however, hasn't been without its ups and downs. In 2011, Apple sued Samsung over alleged patent infringement of its smartphones, leading Samsung to counter-sue with its own infringement allegations. Steve Jobs famously called the dispute – which remains unresolved to this day – a \"thermonuclear\" legal war.\nKGI Securities analyst Ming-Chi Kuo has claimed OLED iPhone panel supply is \"controlled wholly by Samsung\", which may have contributed to the $999 iPhone X's high price. In a bid to reduce its dependency on Samsung parts going forward, Apple has recently encouraged OLED production by rival suppliers like Sharp and Japan Display, while also pursuing alternative sources of NAND flash, most recently by agreeing with Bain Capital and others to acquire Toshiba's chip plant in a deal reportedly worth $17.7 billion.",
        "sentiment": 0.19979847798293288
    },
    "article_11": {
        "title": "Nearly Two-Thirds of Americans Now Own at Least One Apple Product",
        "body": "A new survey conducted by CNBC has found that 64 percent of Americans own an Apple product of some kind, a number that's increased from 50 percent in a similar survey published in 2012. The average American household owns 2.6 Apple products, which is \"up by a full Apple product\" from the previous survey. The All-America Economic Survey polled 800 people across the United States in late September, and CNBC said that the survey has a margin of error of plus or minus 3.5 percentage points.\nApple device ownership rates dip below 50 percent in the 2017 survey for Americans with incomes under $30,000, retirees, and women over the age of 50. CNBC reported that the \"wealthiest Americans\" own 4.7 Apple products per household, while the \"poorest\" have one. Other statistics include 3.7 devices per household in the West of the United States, while households in the South owned 2.2 devices on average.\n\"I cannot think of any other product — especially any other product at a high price point — that has that kind of permeation with the public and level of growth,'' said Jay Campbell, pollster with Hart Research, which conducted the survey along with Public Opinion Strategies.\n64 percent of those surveyed claimed that the time they spend on an iPhone is \"mostly productive and useful,\" while 27 percent said that it's \"mostly unproductive.\" On average, the time spent on an iPhone was \"dominated\" by phone calls, emails, and texting, followed by social media. Most Americans surveyed said that they were less likely to spend time watching videos, playing games, and shopping on their iPhone.\nCampbell said it could be people are understating how much they use their phones for entertainment and how much time they waste. \"But overall,\" he said, \"it continues to be the case that the smartphone is really helping the American worker, helping the American family be efficient with their time and really accomplish more than they could otherwise and I think people recognize and appreciate that.\"\nIn a separate study conducted by Piper Jaffray earlier in 2017, it was found that 76 percent of teens polled owned an iPhone, increasing from 69 percent in the same period a year prior. 81 percent of teens also said that they plan to purchase an iPhone as their next smartphone, up from 75 percent in 2016. Piper Jaffray's survey polled 5,500 teens in the United States with the average age of 16.",
        "sentiment": -0.1773826743165652
    },
    "article_12": {
        "title": "The Pixel's missing headphone jack proves Apple was right",
        "body": "When it launched the iPhone 7 a year ago, Apple confidently declared the headphone jack obsolete technology that we could learn to live without. I disagreed with the necessity of its removal then, and I disagree with it now, but with Google joining the ranks of jack-less phone makers, I think it’s time to accept the inevitability of the 3.5mm port’s demise. According to the two towering US giants of mobile tech, the future is wireless (or, in emergencies, dongle-shaped) and even though that will make our lives less convenient and our tech less compatible, we should all just come along for the ride.\nI’m not okay with this, but it isn’t my choice to make.\nPerhaps this is the resignation stage of grief that I’m going through. I just can’t summon the passion to be enraged by Google omitting what I consider to be one of my favorite things in the world. Plugging in a new pair of headphones is, to me, part of the ceremony of discovering great new sound. It’s a tactile and auditory preamble to the enjoyment of music. But the truth of headphone jacks on phones is that not all of them were made equal. A lot of them have actually served as portals to hellishly bland, flat music reproduction that let the user down. The original Pixel was among the number of phones with really underwhelming headphone audio.\nApple’s bet in removing the headphone jack was that we could stomach some short-term inconvenience for the longer-term benefits of freeing up valuable real estate inside the phone. It was a calculated risk, intended in part to also force the development of better wireless and digital gear by headphone makers. Audeze, Bowers & Wilkins, and Shure have all responded by developing their own Lightning cables, which ensure their headphones sound their best when playing stuff from an iPhone. Everyone else in the consumer audio space now considers wireless as the default area of focus, and Apple’s influence in this respect should not be underestimated.\nSlowly but surely, Apple’s Android rivals are falling in line with its jack-less vision of the future\nLooking at how other mobile makers like HTC, Motorola, Xiaomi, and Google — and soon probably Huawei too, given that CEO Richard Yu told me in January that the company was planning a 2017 flagship phone without a 3.5mm jack, which is shaping up to be the upcoming Mate 10 Pro — are following suit, things are panning out exactly as Apple anticipated. A whole bunch of people are carrying stupid, annoying, easy-to-misplace dongles for their “legacy” wired headphones, nobody is especially overjoyed about the change, but we’re all adapting.\nThe end of the headphone jack has not been the end of the world for iPhone users.\nGoogle initially mocked Apple’s decision, poking fun at it with marketing materials that described the 2016 Pixel’s headphone jack as “satisfyingly not new.” But companies take cheap shots at one another all the time, and that was then, this is now, and now Google thinks it has higher priorities than audio. The Mountain View company’s own justification for why it’s removing the analog port was given to TechCrunch after the Pixel 2 launch event:\n“The primary reason [for dropping the jack] is establishing a mechanical design path for the future,” Google product chief Mario Queiroz told TechCrunch after the event. “We want the display to go closer and closer to the edge. Our team said, ‘if we’re going to make the shift, let’s make it sooner, rather than later.’ Last year may have been too early. Now there are more phones on the market.”\nAt first blush, this seems like a flimsy excuse when you look at the Samsung Galaxy S8 and LG V30, both gorgeous, almost bezel-less phones with headphone jacks present. But extend the timeline beyond this year or the next, think about it in the context of a world where even more internal phone components are integrated or obviated. As phones have been shrinking, the proportion of internal space that the headphone jack commands inside them (and not just the jack itself, there’s also the audio amplifier and digital-to-analog converter circuitry to consider) has been growing. If we’re just talking about the near term, I’m unconvinced by Apple and Google’s arguments that the jack had to go to make room for better, more integrated design. However, over the long run, these companies are probably right.\nPhoto by James Bareham / The Verge\nIf Google were removing truly awesome sound, such as you’d get from the quad-DAC LG G6 or LG V30, I might have been more upset. If Google were one of the top two smartphone makers in the world, as Apple is, I might also feel like it’s rushing in too quickly with a change it could probably make and justify better in future models. But the fact is that LG will still be out there offering high-end integrated audio in its phones for audiophiles like me, and Google’s Pixel ventures remain on an almost experimental scale relative to the broader phone market. That being said, we shouldn’t mistake the small beginnings of Google’s time as a hardware maker and its comparatively puny Pixel phone sales for a lack of influence.\nSoon we’ll be choosing between ‘Made for Google’ and ‘Made for iPhone’\nIn the wake of the Pixel 2 event, I got word from Libratone and AIAIAI, a couple of Danish consumer audio brands, both annoucing that they’ve developed “Made for Google” models of their headphones and cables. These are tailored to work well with Google’s Pixel lineup of phones and Chromebook and include new “fast pairing” functions. Libratone and AIAIAI are just two of 25 partners that Google has already signed up as it seeks to emulate Apple and its famous “Made for iPhone” label.\nThe difference between Google’s currently small-scale efforts and those of previous mobile contenders like BlackBerry and Microsoft is the direction of travel. Others have had control over their operating system and hardware before, but they weren’t in the position to capitalize on that in the same way that Google, purveyor of the world’s most popular mobile OS, is. Google has openly declared that its hardware business is no longer a hobby, and its future is only going to be more influential and impactful. Accessory companies are falling in line and cooperating early with a company they’d be foolish to doubt.",
        "sentiment": -0.057956663028496065
    },
    "article_13": {
        "title": "iOS 11 Overtakes iOS 10, Now Installed on 47% of Devices",
        "body": "A little over three weeks after being released to the public, iOS 11 adoption has reached its 47 percent, successfully overtaking iOS 10, according to data collected by analytics company Mixpanel.\nWith iOS 11 installed on 47 percent of devices, iOS 10 is now installed on 46 percent of devices. 6.7 percent of devices also continue to run iOS 9 or earlier.\niOS 11 adoption has been much slower than iOS 10 adoption during the same timeframe last year. It took just two weeks for iOS 10 to overtake iOS 9, while iOS 11 was only installed on 38.5 percent of devices at the two week mark.\nAdoption rates have been steadily increasing, though. At 24 hours, iOS 11 was installed on 10 percent of devices, and at one week, it was installed on 25 percent.\nApple has released three minor updates to iOS 11 so far to fix bugs and issues discovered since its launch. The most recent update, iOS 11.0.3, came out just yesterday.\nThe first major update to iOS 11, iOS 11.1, is in the works and that update may spur people running iOS 10 to upgrade to iOS 11. iOS 11.1 introduces new emoji characters, often popular with users, and it reintroduces a 3D Touch gesture that lets the App Switcher be accessed with one hand.",
        "sentiment": -0.25617969206844765
    },
    "article_14": {
        "title": "Apple Watch notification helps save man's life: 'It would have been fatal'",
        "body": "An Apple Watch notification helped save a man’s life after it alerted him to needing immediate medical attention for a blood clot in his lungs.\nJames Green, a podcast producer and reporter, from Brooklyn, New York, tweeted: “Never thought a stupid lil wrist computer I bought two years ago would save my life.\n“Saw my heart rate go up, ended up being a pulmonary embolism.”\nThe 28-year-old says he owes his life to the HeartWatch app, which monitors a person’s heart rate constantly throughout the day and notifies them when it goes above or below a certain threshold.\nHe told The Telegraph his doctor was glad he called, telling him that if he had waited any longer “it would have been fatal”.",
        "sentiment": -0.2390160348266363
    },
    "article_15": {
        "title": "Sonos is adding AirPlay 2 support for Apple devices in 2018",
        "body": "Sonos just announced that it’ll be adding support for Apple’s new AirPlay 2 standard to its speakers next year. In addition to making it easier to play music from iOS devices, AirPlay 2 means that — much like the recently announced Alexa support — users will be able to use Siri on iOS devices and eventually Apple’s HomePod to control their Sonos systems.\nAirPlay 2 also enables multi-room support for AirPlay speakers, meaning that you’ll be able to integrate Sonos devices with other AirPlay 2 speakers for a seamless experience across your home — including Apple’s HomePod, which was originally announced as a competitor to Sonos’ devices.",
        "sentiment": 0.5428382183114687
    },
    "article_16": {
        "title": "iPhone X takes over Apple’s homepage ahead of pre-orders",
        "body": "The iPhone X officially goes up for pre-order on Friday morning and Apple has dramatically overhauled its homepage tonight to better showcase the upcoming flagship. Apple.com now features nothing but the iPhone X, with a slew of images and animations touting various features of the device.\nIf you head to Apple.com right now, you’ll see a large banner up top with Apple reminding visitors that the iPhone X goes up for pre-order on Friday at 12:01 PT. Below that are a slew of boxes, each highlighting a different feature of the device. One showcases the bezel-less design, while another showcases Face ID and another the TrueDepth camera.\nOne of the boxes highlights camera features such as Stage Light for Portrait Mode shots, while another showcases the new OLED display. Finally, Apple is also touting its upcoming AirPower charging mat, which lets users charge their iPhone, Apple Watch, and AirPods at once.\nClicking on any of the boxes takes you to Apple’s full iPhone X webpage for a description of each feature, while you can mouse over for a brief overview of each. Apple had previously advertised the iPhone X and various other products on its homepage, including the iPhone 8 and new Apple Watch. Today’s overhaul, however, makes it all about the iPhone X ahead of pre-orders on Friday.\nApple this morning issued a new press release regarding the iPhone X release. In the press release, Apple noted that its retail stores will have launch day availability of the device next Friday, November 3rd – but it was quick to tell customers they need to arrive early if they wish to secure one. Carriers have also started preparing for the release with trade-in deals and changes to their web pages and apps.\nRead more about iPhone X below and check out Apple’s all-new webpage right here.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.19167246494907886
    },
    "article_17": {
        "title": "Iphone X Face ID years ahead of rivals, analysts say",
        "body": "THE Apple iPhone X is “years” ahead of its Android competitors, it has been claimed.\nA celebrated Apple expert called Ming-Chi Kuo said that the gadget’s advanced facial recognition system would not be matched on Android phones for up to two and a half years.\nThe X features a system called Face ID which unlocks the device by scanning its owner’s face.\nIt is particularly clever because it uses Apple’s TrueDepth camera to scan the face in three dimensions, making it significantly more secure than competing models which only use 2D images and can be fooled by showing the phone a picture of its owner’s lovely mug.\nKuo is quoted as saying that this system is so far ahead of the competition that it could prompt Android lovers to become iPhone users.\nPhil Schiller, Apple's senior vice president of worldwide marketing, announces features of the new iPhone X, including Face ID. Picture: Marcio Jose Sanchez\nHe also reportedly claimed that the production process required to build the X was very tricky, meaning that Apple may not be able to build enough smartphones to match sky-high demand.\nThis could mean that people who don’t preorder the gadget will have to wait weeks or even months to get their hands on one.\nBut according to the reliable Apple website 9to5Mac, Kuo said the “outlook for 2018-2019 iPhone growth is still positive”.\nIt wrote: “He adds an estimate that Android devices are now likely 1.5-2.5 years behind Apple when it comes to matching its TrueDepth camera experience.\n“If this pans out, this could put Apple in a better position to continue its iPhone growth by giving users more reason to switch from Android.”\nClick here for our guide to the iPhone X, which is released on November 3.\nThis article originally appeared on The Sun.",
        "sentiment": -0.08799070950884086
    },
    "article_18": {
        "title": "Apple Receives FCC Approval for iPhone X Ahead of October 27 Pre-Orders",
        "body": "Apple today received approval from the United States Federal Communications Commission for its upcoming iPhone X models, meaning the devices have passed all of the requisite tests and are cleared for sale.\nSince the iPhone X was introduced, Apple's iPhone X product pages have included the following footnote noting that FCC approval had yet to be obtained:\niPhone X has not been authorized as required by the rules of the Federal Communications Commission. This device is not, and may not be, offered for sale or lease, or sold or leased, until authorization is obtained.\nThe FCC must approve all radio-transmitting devices before they are able to be legally sold in the United States, including all iPhones. The FCC's program is designed to ensure that RF devices in the United States \"operate effectively,\" do not cause harmful interference, meet human RF exposure limits, and comply with other FCC rules.\nThree iPhone X models have been approved for sale by the FCC, so Apple will now be able to remove that wording from the iPhone X site. FCC approval for the iPhone X comes just over three weeks ahead of when Apple will accept pre-orders for the device.\niPhone X pre-orders will start on Friday, October 27 ahead of an official launch date on November 3.\nSupplies of the iPhone X are expected to be heavily constrained due to production issues with the TrueDepth camera used for facial recognition, so the device is likely to be hard to come by for the remainder of 2017 and into the early months of 2018.",
        "sentiment": 0.01883713176680936
    },
    "article_19": {
        "title": "iPhone 8 users are already ditching their month old phone for the iPhone X",
        "body": "The long-awaited iPhone X may have some unexpected buyers—at the expense of the one-month-old iPhone 8.\nElectronics recycling site Decluttr.com says it has received more trade-ins of the iPhone 8 and 8 Plus than any other previous new iPhones. It appears that users lured by the new features of the coming iPhone X are trying to cash in on their iPhone 8 and 8 Plus while the value is still relatively high.\nJames Bell, digital marketing manager for Decluttr, told Yahoo Finance that he wasn’t expecting people to trade in their iPhone 8 at all, even after the iPhone X is officially released on Nov 3.\n“We thought it would be just iPhone 7 [for trade-in], but it seems people aren’t necessarily satisfied with the iPhone 8. This just doesn’t happen. We never have that many iPhones within the month of the release.”\nThe site says 7% of thousands of the iPhones it bought in the past month were iPhone 8s, while in the same period last year the percentage of then-released iPhone 7 was only 1%. A 256GB iPhone 8 can be traded at up to $500, less than one-third of the retail price of $849. After October 27, the pre-order date of the iPhone X, the trade-in price is expected to drop by 30%.\nWill iPhone 8 follow the fate of iPhone 5c?\nThe market reaction to the iPhone 8 has been a bit disappointing compared to previous releases. In China, where people usually go crazy for the new iPhone and are willing to pay for a huge markup for it, the iPhone 8 is already sold at discount.\nAt its major press event in September, Apple unveiled its 10th anniversary iPhone, the iPhone X, alongside the iPhone 8 and 8 plus. The iPhone 8 takes better photos than its predecessors but seems to be overshadowed by the $999 iPhone X. With the biggest starting price tag in iPhone history, the iPhone X features FaceID and a full-width phone screen without the traditional home button.\n“Our customers found the iPhone 8 was very similar to 7, and they’re excited about the face recognition technology, especially when the iPhone X is almost envisioned as a limited edition product,” Bell said.\nStory continues\nIt’s not the first time that Apple chose to release two iPhones at the same time. In 2013, both iPhone 5s and iPhone 5c were released in September, and data from Consumer Intelligence Research Partners showed that the iPhone 5s outsold the iPhone 5c by more than double. A 16GB iPhone 5c was released for $99 with a two-year contract, $100 cheaper than iPhone 5s.\nApple (AAPL) CEO Tim Cook attributed the iPhone 5c’s lackluster sales to people’s preference for the advanced iPhone 5s features like the new Touch ID fingerprint sensor.\n“People are really intrigued with Touch ID,” Cook said on an earnings call in 2014. “It’s a major feature that has excited people. And I think that, associated with the other things that are unique to the 5S, got the 5S to have a significant amount more attention and a higher mix of sales.”\nNow we’ve come to the Face ID this year. To analysts who predict a “supercycle” for the iPhone this year, they argue the disappointment in the iPhone 8 could be good news as it may suggest a boom in the more expensive iPhone X.\nBut unlike iPhone 5c, which was Apple’s attempt to enter the low end of the smartphone market, iPhone 8 is still a premium phone. And the shortage in supply of the iPhone X could hurt Apple’s profits in the next quarter.\nRosenblatt Securities analyst Jun Zhang suggests that Apple may consider making fewer iPhone 8s. “We understand this does not reflect the iPhone 8 cycle as a whole since the iPhone X has not yet officially launched,” Zhang wrote in a note to clients, “but we are concerned.”\nKrystal Hu covers tech companies in the global economy for Yahoo Finance. Follow her on Twitter.\nRead more:\nThe iPhone 8 is already selling at a discount in China\nThink you’re buying on Amazon? It’s actually from Alibaba\nHow Amazon is eclipsing Walmart’s best efforts to dominate e-commerce\nAlibaba’s Jack Ma: We have to ’embrace the physical world’",
        "sentiment": -0.21273012771721808
    },
    "article_20": {
        "title": "Apple Says iPhone X Will Be Available for Walk-In Customers at Stores on Launch Day",
        "body": "Apple today announced that stores will have iPhone X available for walk-in customers, who it encourages to arrive early, on launch day. Presumably, this will include both Apple's own retail locations and select authorized resellers.\niPhone X will go on sale in more than 55 countries and territories on Friday, November 3. On the same day, the first deliveries will begin to customers. iPhone X pre-orders begin this Friday, October 27 at 12:01 a.m. Pacific Time.\nDue to a mix of reported production issues and strong demand, in-store availability of iPhone X will likely be extremely limited. Prospective buyers should be prepared for the possibility of waiting in long lines.\nIn a recent interview with BuzzFeed News, Apple CEO Tim Cook said \"we'll see what happens\" in regards to iPhone X availability. \"We'll be working as hard as possible to make as many as possible,\" he added.\n• Andorra\n• Australia\n• Austria\n• Bahrain\n• Belgium\n• Bulgaria\n• Canada\n• China\n• Croatia\n• Cyprus\n• Czech Republic\n• Denmark\n• Estonia\n• Finland\n• France\n• Germany\n• Greece\n• Greenland\n• Guernsey\n• Hong Kong\n• Hungary\n• Iceland\n• India\n• Ireland\n• Isle of Man\n• Italy\n• Japan\n• Jersey\n• Kuwait\n• Latvia\n• Liechtenstein\n• Lithuania\n• Luxembourg\n• Malta\n• Mexico\n• Monaco\n• The Netherlands\n• New Zealand\n• Norway\n• Poland\n• Portugal\n• Puerto Rico\n• Qatar\n• Romania\n• Russia\n• Saudi Arabia\n• Singapore\n• Slovakia\n• Slovenia\n• Spain\n• Sweden\n• Switzerland\n• Taiwan\n• United Arab Emirates\n• United Kingdom\n• United States\n• U.S. Virgin Islands\nHere's the full list of countries and territories where iPhone X launches November 3:\nThe majority of Apple's retail stores will open at 8:00 a.m. local time on November 3.",
        "sentiment": 0.16051094131544233
    },
    "article_21": {
        "title": "Today in Apple history: Scott Forstall forced out of Apple",
        "body": "October 29, 2012: Scott Forstall, Apple’s senior vice president of iOS software, is ousted from the company after the disastrous Apple Maps launch.\nApple divvies up the roles previously handled by Forstall, who once seemed on a path to the top, among other high-level execs. Jony Ive assumes leadership of the Human Interface team. Craig Federighi becomes head of iOS software. Eddy Cue takes control of Maps and Siri. And Bob Mansfield “unretires” to lead a new technology group.\nScott Forstall and his rise at Apple\nForstall’s departure triggered one of the biggest executive shakeups at Apple since Steve Jobs’ return in 1997. An ambitious young employee, Forstall quickly rose through the ranks in Cupertino. As he accumulated power behind the scenes, he also began appearing more regularly at Apple events.\nForstall worked for Jobs his entire career. He had been hired at NeXT, the company Jobs founded during his wilderness years outside Apple, straight out of Stanford University. With a master’s degree in computer science, Forstall worked on the NeXTStep operating system.\nHe joined Apple along with a number of senior staffers when the company bought NeXT in 1996, an acquisition that brought Jobs back to Apple. Jobs immediately put Forstall in charge of designing user interfaces for the new, improved Mac line. His big contribution? The liquid-inspired Aqua user interface, which incorporated design elements like translucent icons and reflections.\nForstall then took charge of OS X, which was based on NeXTStep technology, before becoming one of the leading figures in iOS development. In late 2011, he got onstage at the iPhone 4s keynote to show off Siri for the first time.\nThe beginning of the end for a rising star\nForstall modeled himself on Jobs, even driving the same type of silver Mercedes coupe as Apple’s iconic co-founder. He also exhibited extreme attention to detail and a similar type of charisma. (Forstall was more confident than many tech types, having been a child actor.) As evidence of the former, he kept a jeweler’s loupe in his office, allowing him to examine each pixel on a user interface in detail.\nOutside Apple, some people assumed Forstall could eventually become CEO of the company. But after Jobs’ passing, Forstall seemed to lose momentum within Cupertino’s halls. One possible reason? A power struggle with Ive, probably Apple’s most valued human asset after Jobs. In particular, Ive and Forstall clashed over skeuomorphism, which Forstall loved and Ive hated.\nNew CEO Tim Cook also preferred a more harmonious atmosphere within Apple than Jobs ever did. Whereas Jobs liked strong personalities who clashed, Cook reportedly does not.\nApple Maps launch leads to Forstall’s ouster\nThe inciting incident that resulted in Forstall’s firing was Apple’s disastrous Apple Maps software. Probably Apple’s most notable software failure of all time, the app proved buggy and undeveloped compared to its rivals.\nIn addition to that, iOS 6 featured a clock app that illegally borrowed a Swiss railway design, resulting in Apple paying out $20 million.\nWith Maps garnering Apple plenty of bad press, an agreement was made to write a formal apology letter — which Forstall refused to sign. This move supposedly convinced Cook that Forstall should go.\nScott Forstall after Apple\nAfter leaving Apple, Forstall remained largely off the radar — with the exception of co-producing a Broadway play and advising Snapchat. In May 2015, he made one of his few public comments about Apple to The Wall Street Journal, saying he was “delighted” that Cupertino still makes great products.\nIn 2017, Forstall also gave several interviews to mark the 10th anniversary of the iPhone launch.\nWhat are your memories of Scott Forstall at Apple? Let us know your thoughts in the comments below.",
        "sentiment": 0.12498680019798951
    },
    "article_22": {
        "title": "iOS Privacy: steal.password - Easily get the user's Apple ID password, just by asking",
        "body": "Do you want the user’s Apple ID password, to get access to their Apple account, or to try the same email/password combination on different web services? Just ask your users politely, they’ll probably just hand over their credentials, as they’re trained to do so 👌\nDisclaimer\nThis is just a proof of concept, phishing attacks are illegal! Don’t use this in any of your apps. The goal of this blog post is to close the loophole that has been there for many years, and hasn’t been addressed yet. For moral reasons, I decided not to include the actual source code of the popup, however it was shockingly easy to replicate the system dialog.\nWhy does this work?\niOS asks the user for their iTunes password for many reasons, the most common ones are recently installed iOS operating system updates, or iOS apps that are stuck during installation.\nAs a result, users are trained to just enter their Apple ID password whenever iOS prompts you to do so. However, those popups are not only shown on the lock screen, and the home screen, but also inside random apps, e.g. when they want to access iCloud, GameCenter or In-App-Purchases.\nThis could easily be abused by any app, just by showing an UIAlertController, that looks exactly like the system dialog.\nEven users who know a lot about technology have a hard time detecting that those alerts are phishing attacks.\nHow can you protect yourself\nHit the home button, and see if the app quits: If it closes the app, and with it the dialog, then this was a phishing attack If the dialog and the app are still visible, then it’s a system dialog. The reason for that is that the system dialogs run on a different process, and not as part of any iOS app.\nDon’t enter your credentials into a popup, instead, dismiss it, and open the Settings app manually. This is the same concept, like you should never click on links on emails, but instead open the website manually\nIf you hit the Cancel button on a dialog, the app still gets access to the content of the password field. Even after entering the first characters, the app probably already has your password.\nInitially I thought, faking those alerts requires the app developer to know your email. Turns out, some of those auth popups don’t include the email address, making it even easier for phishing apps to ask for the password.\nProposal\nModern web browsers already do an excellent job protecting users from phishing attacks. Phishing within mobile apps is a rather new concept, and therefore still pretty unexplored.\nWhen asking for the Apple ID from the user, instead of asking for the password directly, ask them to open the settings app\nFix the root of the problem, users shouldn’t constantly be asked for their credentials. It doesn’t affect all users, but I myself had this issue for many months, until it randomly disappeared.\nDialogs from apps could contain the app icon on the top right of the dialog, to indicate an app is asking you, and not the system. This approach is used by push notifications also, this way, an app can’t just send push notifications as the iTunes app.\nI’ve reported this as a radar, which you can dupe: rdar://34885659 👍\nSometimes iOS shows the following notification on the lock screen, which opens up the iCloud Settings screen, this is a much better approach than to ask for the password directly:\nComplexity\nShowing a dialog that looks just like a system popup is super easy, there is no magic or secret code involved, it’s literally the examples provided in the Apple docs, with a custom text.\nI decided not to open source the actual popup code, however, note that it’s less than 30 lines of code and every iOS engineer will be able to quickly build their own phishing code.\nQ&A\nImagine if everybody read this before posting a comment on HackerNews/Reddit #oneCanDream :)\nBut, I have 2-factor enabled, I’m safe, right?\nGood for you, everybody should use 2-step verification obviously, however many people don’t. At the same time, even if your Apple account is 2FA protected, many users still use the same username/password combination on most web services, meaning if hackers know your Apple ID password, chances are high, they’re gonna try the same combination on other common services.\nAlso, even with 2FA enabled accounts, what if the app asked you for your 2 step code? Most users would gladly request a 2FA-token and ask for it, and directly pipe it over to a remote server.\nApple would never accept such an app, right?\nApple is doing a great job protecting users from dangerous third party apps, that’s why the App Store is built and provided like it is, that’s why we code sign our application ( not really, but kind of).\nHowever, it’s rather easy to run certain code only after the app is approved, those are not new ideas, but just to give you some ideas:\nUse remote code (which is not allowed by itself, except for JavaScript), React Native or a custom JS bridge is your friend\nUse the iTunes search API to compare the current version number with the App Store version number (example request), this way the app can automatically enable malicious code after it got approved.\nUse a remote configuration tool to enable a feature only after an app is approved by Apple\nUse a time-based trigger: just skip running certain code for the first week after submitting the binary, meaning the code will only run once the app is either approved or rejected.\nPull an Uber and don’t run certain code when the location is near Cupertino (it’s probably fixed by Apple by now)\nThe things above is public knowledge, most iOS developers are aware, and I strongly advise against using any of this, Apple will eventually catch you and block your account.\nThe point of this list is: While the review process provides a basic safety filter, organisations with bad intent will always find a way to somehow work around the limitations of a platform.\nPhishing on mobile? Is that a thing now?\nThis area will become more and more relevant, with users being uninformed, and the mobile operating systems not yet clearly separating system UI and app UI. This is kind of related to detect.location, where apps would write their own, custom image picker to provide a better “experience”, but in reality, with that, they also get full access to your image library, and optionally also your camera (related to watch.user).\niOS should very clearly distinguish between system UI and app UI elements, so that ideally it’s even obvious for the average smartphone user that something seems off. This is a tricky problem to solve, and web browser are still tackling it, you still have websites that make popups look like macOS / iOS popups, so that many users think it’s a system message.\nBut, but, but, why is the . symbol within the “, is this all fake?\nNope, actually, that’s how the system dialog looks like, the . is within the “string notation, so I designed the phishing dialog to also include the same style.\nSimilar projects I’ve worked on\nI published more posts on how to access the camera, the user’s location data, their Mac screen and their iCloud password, check out krausefx.com/privacy for more.",
        "sentiment": -0.37015316251665353
    },
    "article_23": {
        "title": "iPhone X production increases from 100,000 to 400,000 units per week",
        "body": "Poor 3D sensor yield rates are expected to impact iPhone X’s launch supply as Rosenblatt analyst Jun Zhang pegs current production volume at just 400,000 units per week.\nIn an interview with StreetInsider.com, the analyst said that the figure is actually a substantial increase from the previous estimate of 100,00 units per week.\nDespite the increase, Jun maintained his production estimates of 20 million and 50 million iPhone X units for the December and March quarters, respectively. In other words, Apple may be unable to meet demand for iPhone X until 2018 at the earliest.\nHe does not see further order push outs for the OLED phone in October.\nJapanese publication Nikkei said today that the sophisticated 3D sensor in Apple’s TrueDepth camera, which enables Face ID and other features, remains the biggest production bottleneck.\nCiting a tech executive familiar with iPhone X production, Nikkei says manufacturers are still struggling to perfect 3D sensors and dot projectors in the TrueDepth camera.\nThe person could not pinpoint the exact manufacturing problem.\nIn September 2017, analyst Jeff Pu also identified the dot projector, supplied by Lumentum, as the troublesome component holding back mass production of iPhone X. A report this morning stated that Himax has now started shipments of TrueDepth’s wafer-level optics to Apple.\nWhile this is good news, each and every part that goes into the handset must be manufactured in volume and on time for Apple to meet its self-imposed targets.\nThe delay is already hurting companies that have been contracted to assemble the phone. Semiconductor foundry TSMC and contract manufacturer Foxconn, for instance, both reported a drop in revenue in September due to the iPhone X manufacturing delay.\nThe anticipated OLED device goes for preorder on October 27 ahead of November 3 launch.",
        "sentiment": -0.43620488412964803
    },
    "article_24": {
        "title": "New York City subway will replace MetroCard with Apple Pay tap-to-pay starting in 2018",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nThe New York City Metropolitan Transportation Authority on Monday approved a new $573 million contract that will see subway turnstiles support contactless payment services, including Apple Pay on iPhone and Apple Watch.\nThe MTA's new plan appears to move away from the MetroCard system, where funds are stored on a swipeable card, in favor of a pay-per-use model using existing NFC payment technology. That will include Apple Pay, as well as Android Pay, Samsung Pay, and NFC-equipped credit cards, according to The New York Times.\nCurrently, New York's MetroCard system requires users to pre-fill a card that can be swiped at the turnstile. Moving away from the system should expedite travel, as users will no longer receive swipe errors, nor will they need to visit a kiosk to refill their card.\nHowever, the MetroCard will remain for the foreseeable future, working in tandem with the new tap-to-pay functionality through at least 2023.\nIn the interim, The MTA will begin phasing in the new NFC payment terminals at 500 subway turnstiles and 600 buses by late 2018. The more than half-billion-dollar contract calls for all subway stations and buses to have support for Apple Pay by late 2020.\nThe MTA first put out a call for proposals for a new fare payment system in April of 2016.",
        "sentiment": -0.1984723001718521
    }
}