{
    "article_0": {
        "title": "No tracking, no revenue: Apple's privacy feature costs ad companies millions",
        "body": "Internet advertising firms are losing hundreds of millions of dollars following the introduction of a new privacy feature from Apple that prevents users from being tracked around the web.\nAdvertising technology firm Criteo, one of the largest in the industry, says that the Intelligent Tracking Prevention (ITP) feature for Safari, which holds 15% of the global browser market, is likely to cut its 2018 revenue by more than a fifth compared to projections made before ITP was announced.\nWith annual revenue in 2016 topping $730m, the overall cost of the privacy feature on just one company is likely to be in the hundreds of millions of dollars.\nDennis Buchheim, general manager of the Interactive Advertising Bureau’s Tech Lab, said that the feature would impact the industry widely.\n“We expect a range of companies are facing similar negative impacts from Apple’s Safari tracking changes. Moreover, we anticipate that Apple will retain ITP and evolve it over time as they see fit,” Buchheim told the Guardian.\n“There will surely be some continued efforts to ‘outwit’ ITP, but we recommend more sustainable, responsible approaches in the short-term,” Buchheim added. “We also want to work across the industry (ideally including Apple) longer-term to address more robust, cross-device advertising targeting and measurement capabilities that are also consumer friendly.”\n‘Sabotage’\nITP was announced in June 2017 and released for iPhones, iPads and Macs in September. The feature prevents Apple users from being tracked around the internet through careful management of “cookies”, small pieces of code that allow an advertising technology company to continually identify users as they browse.\nQ&A What is a cookie? Show A cookie is a small text file a website can drop on to a visitor's computer when it wants to remember something about them. The contents of a shopping trolley, perhaps, or whether or not they are logged in to the site at all. But cookies can also be used in less user-friendly ways. An advertising network can drop a cookie on a visitor's computer, and then read that same cookie at every new website the visitor arrives at that displays that network's adverts. This process lets the network track users around the web, building up a profile of their browsing habits to better target them for adverts. Was this helpful? Thank you for your feedback.\nIts launch sparked complaints from the advertising industry, which called ITP “sabotage”. An open letter signed by six advertising trade bodies called on Apple “to rethink its plan … [that risks] disrupting the valuable digital advertising ecosystem that funds much of today’s digital content and services.”\nIt also accused the company of ignoring internet standards, which say that a cookie should remain on a computer until it expires naturally or is manually removed by a user. Instead, the industry said, Apple is replacing those standards “with an amorphous set of shifting rules that will hurt the user experience and sabotage the economic model for the internet”.\nIn response, Apple noted that: “Ad tracking technology has become so pervasive that it is possible for ad tracking companies to recreate the majority of a person’s web browsing history. This information is collected without permission and is used for ad re-targeting, which is how ads follow people around the internet.”\nInitially, many advertisers believed they had found a technological way around some of the restrictions put in place by ITP. Criteo, which took advantage of that loophole, had initially expected revenue to drop by only 9-13%, the company said. But in December, Apple closed that work-around on its mobile devices as part of the iOS 11.2 update, causing the ad-tech firm to update its projected impact to its current estimate of 22% “relative to our pre-ITP base case projections”.\nThe company has not given up hope, however. “We are focused on developing an alternative sustainable solution for the long term, built on our best-in-class user privacy standards, aligning the interests of Apple users, publishers and advertisers,” Criteo said in a press release. “This solution is still under development and its effectiveness cannot be assessed at this early stage.”\nThere is more pain to come for the advertising industry. Google has announced a built-in adblocker for its Chrome, which holds over 55% of the global browser market according to data from Statcounter. Google has been testing the feature since June 2017 and will roll it out to all users in February.\nUnlike Safari’s ITP, however, Chrome’s adblocker has been created in partnership with the ad industry. The feature only blocks what the company calls “intrusive ads”, such as autoplaying video and audio, popovers which block content, or interstitial ads that take up the entire screen.",
        "sentiment": -0.15065013061144522
    },
    "article_1": {
        "title": "Report: Apple to Delay Some New Features in iOS Until Next Year to Focus on Performance and Quality Issues",
        "body": "Apple has changed its iOS software plans, and will now delay some new features until next year to focus on addressing performance and quality issues, according to Ina Fried, chief technology correspondent at Axios.\nThe report claims Apple's software engineering chief Craig Federighi announced the revised plans to employees at a meeting earlier this month.\nFried says a number of features have been delayed until 2019, including a planned refresh of the iPhone home screen and CarPlay interface, improvements to core apps like Mail, and updates to capturing, editing, and sharing photos.\nThe delay should allow Apple to focus on stability and bug fixes in iOS 12, which will likely still include improvements in a number of areas, including the Health app, ARKit, and parental controls, according to the report.\nIn addition, Apple is said to be prioritizing work to make iPhones \"more responsive\" and \"less prone to cause customer support issues.\"",
        "sentiment": 0.3292398139834404
    },
    "article_2": {
        "title": "Apple: We would never degrade the iPhone experience to get users to buy new phones",
        "body": "Apple on Wednesday responded to reports that the Justice Department and Securities and Exchange Commission are probing its decision to throttle older iPhones, confirming that the U.S government has asked questions.\nApple said it would never intentionally \"degrade the user experience to drive customer upgrades.\"\nApple acknowledged in December that it was secretly slowing the speeds of iPhones in an effort to help preserve aging batteries. In response to consumer backlash, the company dropped the price of battery replacements for the iPhone 6, iPhone 6s and iPhone 6s Plus from $79 to $29.\nIn its statement Wednesday, Apple also said it will issue a software update this spring that provides consumers with a more transparent look at how their iPhones are being throttled and will provide an option to turn off automatic speed updates.\nHere's the full response from Apple:\n\"About a year ago, we delivered a software update that improves power management during peak workloads to avoid unexpected shutdowns on certain iPhones with older batteries. We know that iPhones have become an important part of the daily lives of our customers and our intention was to improve the customer experience.\" \"We sought to further improve the customer experience in December by announcing a significant discount on replacement batteries for certain iPhones. We also announced that we began developing a new iOS feature to show battery health and which would recommend when the user should consider replacing their battery. These actions were taken to further assist our customers and help extend the life of their iPhones. In addition, users will be able to see if the power management feature is being used to prevent unexpected shutdowns, and turn if off if they so choose. These features will be included in a developer release next month and a user release this Spring.\" \"As we told our customers in December, we have never — and would never — do anything to intentionally shorten the life of any Apple product, or degrade the user experience to drive customer upgrades. Our goal has always been to create products that our customers love. Making iPhones last as long as possible is an important part of that.\" \"We have received questions from some government agencies and we are responding to them.\"\n—CNBC's Josh Lipton contributed to this report.",
        "sentiment": 0.25823675769874277
    },
    "article_3": {
        "title": "macOS 10.13.2 already fixed Intel chip security flaw",
        "body": "The critical design flaw discovered in the way Intel CPUs process information has reportedly already been fixed by Apple in a recent release of macOS.\nApple’s fix came out at the beginning of December with the release of macOS 10.13.2. But according to one developer, the company has a few additional patches for Intel’s blunder in a current beta build.\nThe flaw can be found in all Intel chips made in the last 10 years. It allows desktop programs to read parts of a computer’s protected kernel memory. This potentially gives malicious apps and attackers access to passwords, login info and other personal information.\nFixing Intel’s flaw\nDeveloper Alex Ionescu posted on Twitter that Apple included a fix for the flaw in macOS 10.13.2. Another report from AppleInsider echoes Ionescu’s claim, citing other sources that say most of the damage has already been mitigated.\nIntel issued a statement today saying that the exploits aren’t limited to Intel chips — lots of other manufacturers’ silicon suffers from the same issue.\n“Recent reports that these exploits are caused by a ‘bug’ or a ‘flaw’ and are unique to Intel products are incorrect. Based on the analysis to date, many types of computing devices — with many different vendors’ processors and operating systems — are susceptible to these exploits.”\nSome early reports estimated that fixing the flaw will cause Windows and Linux machines to see performance slowdowns of up to 30 percent. Intel says the performance impact shouldn’t be major, though.",
        "sentiment": -0.44479407054873615
    },
    "article_4": {
        "title": "Toyota concedes, reveals plans to launch first cars with Apple CarPlay",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nPerhaps the longest major CarPlay holdout, Toyota on Monday announced that it will be bringing the platform to the 2019 Avalon, as well as other vehicles in the 2019 model year — including some from its luxury Lexus brand.\nThe new Avalon is shipping this spring, and will have CarPlay standard on all trims, Toyota said in a press release. The interface will display on a 9-inch touchscreen.\nUnusually, while Android Auto support hasn't been announced, the car will also support some remote control functions by way of smartwatches and Amazon Alexa, such as starting the engine, locking and unlocking doors, and gauging fuel levels.\nCarPlay will require Toyota's Enform 2.0 or Entune 3.0 multimedia systems, a spokesman told MacRumors. In theory that could allow the technology to appear on some 2018 models such as the Camry and Sienna, but so far the company has only confirmed 2019 model support. Drivers will moreover have to use a wired iPhone connection, rather than wireless.",
        "sentiment": -0.037743997178040445
    },
    "article_5": {
        "title": "Screenplay for ‘Star Wars: The Last Jedi’ written on dedicated, air-gapped MacBook Air to prevent leaks",
        "body": "Rian Johnson, writer and director of Star Wars: The Last Jedi, has revealed the steps he took to guard against the risk of the screenplay being leaked online.\nTo protect against hackers, Johnson said that he wrote the screenplay on a dedicated, air-gapped MacBook Air …\nHe revealed the approach in an interview with the WSJ.\nI typed Episode VIII out on a MacBook Air. For security it was “air-gapped”—never connected to the internet. I carried it around and used it for nothing except writing the script. I kept it in a safe at Pinewood Studios. I think my producer was constantly horrified I would leave it in a coffee shop.\nJohnson also shared two older items that never left his side during shooting: a 1960s Omega Speedmaster Pro – ‘a kind of pre-shoot present to myself’ – and a 1980s Leica M6 35mm camera.\nI bought a ton of very high-speed, black-and-white film, had the camera on my shoulder at all times and just snapped away. By the end of the shoot I had a couple thousand film stills. It kind of keeps your eye fresh on set because you’re always looking for interesting stuff to shoot.\nHe managed a quick, humorous dig at Trump at the same time, explaining that he was listening to The History of Rome podcast while he was writing the screenplay.\nYou’ve got characters like Nero who are these insane, larger-than-life, operatic madmen driving their country to ruin. It’s very timely.\nThe movie was promoted by Apple with a series of Star Wars-themed in-store events in September.\nVia Gizmodo. Photo: The Daily Beast.\nCheck out 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.036335926600976995
    },
    "article_6": {
        "title": "Apple Is Blocking an App That Detects Net Neutrality Violations From the App Store",
        "body": "Update: After this article was published, Apple told Dave Choffnes that his iPhone app, designed to detect net neutrality violations, will be allowed in the iTunes App Store. According to Choffnes, Apple contacted him and explained that the company has to deal with many apps that don't do the things they claim to do. Apple asked Choffnes to provide a technical description of how his app is able to detect if wireless telecom providers throttle certain types of data, and 18 hours after he did, the app was approved.\nAdvertisement\n\"The conversation was very pleasant, but did not provide any insight into the review process [that] led the app to be rejected in the first place,\" Choffnes told us in an email.\nThe original story follows below.\nThe most pervasive feeling about the Federal Communication Commission’s net neutrality repeal is one of hopelessness. If we all need to use the internet, big telecom companies control our access to the internet, and there’s no choice about what company to use, how are we supposed to stop these companies from messing with our connections?\nThe FCC has suggested that consumer outrage will prevent companies from violating net neutrality, but it if you’re not a network engineer, it can be hard to know if net neutrality is being violated at all. David Coffnes, a researcher at Northeastern University, set out to change that. He created an app to detect net neutrality violations, but Apple has banned it from the App Store, preventing consumers from accessing the information they need to at least know when they’re getting screwed over.\nUsing Apple’s beta testing platform called TestFlight, I tested the app, called Wehe. It’s straightforward. You open the app, agree to a consent form (he is using the data in his research), and click “run test.” The app is designed to test download speeds from seven apps: YouTube, Amazon, NBCSports, Netflix, Skype, Spotify, and Vimeo. According to the app, my Verizon LTE service streamed YouTube to my iPhone at 6 Mbps, Amazon Prime video at 8 Mbps, and Netflix at 4 Mbps. It downloaded other data at speeds of up to 25 Mbps.\nAdvertisement\nFrom my test. Image: Jason Koebler\n“Differentiation means in this case throttling by Verizon,” Choffnes told me. This would, in theory, be the sort of thing people would want to know—with this knowledge, they could choose to switch to another carrier, or could lodge a complaint against with the Federal Trade Commission.\nAjit Pai’s FCC has made the argument that “most attempts by ISPs to block or throttle content will likely be met with a fierce consumer backlash … in the event that any stakeholder [ISP] were inclined to deviate from this consensus against blocking and throttling, we fully expect that consumer expectations, market incentives, and the deterrent threat of enforcement actions will constrain such practices.”\nBut the fact is that every major wireless telecom provider is already throttling data, and we are more-or-less powerless to stop it. And the opaque nature of both the telecom industry and Apple’s App Store vetting process is preventing consumers—and researchers like Choffnes—from getting a full picture of how net neutrality is being violated.\nAn Apple App Store reviewer told Choffnes that “your app has no direct benefits to the user,” according to screenshots reviewed by Motherboard. According to Apple’s reviewer, the app contained “Objectionable Content,” a catch-all for apps that Apple doesn’t want to let into its App Store. Apple is blocking the app and no one is quite sure why, including Choffnes; neither Apple nor Verizon responded to requests for comment for this article.\nAdvertisement\nWehe is is designed to be part of Choffnes’s research work to determine geographic and carrier-related differences in video throttling. When you open the app, you are presented with a consent form that “invites you to take part in a research project.”\n“The purpose of this research study is to understand how cellular internet providers give different performance to different network traffic from your smartphone,” it says, adding that data is anonymized. “For example, we would like to know if a provider is speeding up YouTube traffic and/or slowing down Netflix.”\nWehe, according to the App Store reviewer, “may mislead users by providing inaccurate determinations … specifically, your app is marketed to users as a way to check if their carrier is violating net neutrality. However, your app has no direct benefits to the user from participating in the study.”\nPacket inspection and video throttling\nWhen I heard about Wehe, I thought that it must be impossible for an app to detect net neutrality violations. Or at least, I couldn’t think of a mechanism in which it might work. But once I spoke to Choffnes, who has spent much of the past few years reverse-engineering the ways in which telecom companies throttle data, it made sense.\nChoffnes is an expert in data “differentiation,” which means he studies how telecom companies alter the download speeds of text, photos, or emails may be prioritized over the download speeds of video content. Such “prioritization” or data discrimination violates one of the core tenets of net neutrality, but data differentiation is commonly used by cell phone providers nonetheless.\nAdvertisement\n“We didn’t have net neutrality even before the rules changed,” Choffnes said. “All the carriers are doing content-based throttling, specifically with video. And some video providers are getting better performance than others.”\nA diagram of how packets are inspected and analyzed, and how Choffnes's system works. Image: David Chofnes\nThat video is being throttled is not a secret. Many telecom providers “zero rate” certain video services and then advertise those services as “unlimited” to customers, meaning it doesn’t count against a customer’s data cap. The most famous instance of this is T-Mobile’s “BingeOn” service, which allows unlimited access to Netflix, YouTube, and a few other major video providers.\nBut that “unlimited” video means that video is throttled—in BingeOn’s case, T-Mobile video maxes out around 1.5 mb/s, whereas its standard LTE service gets speeds of up to 10 times that for non-video content. Other telecom providers have similar programs; Verizon has plans with “unlimited 4G LTE data” and “premium unlimited 4G LTE data,” the plan you have determines the resolution and amount of data you can stream before it’s throttled (and putting a cap on resolution is also a form of throttling; delivering lower-resolution video means delivering less data).\nCustomers may not generally think of this practice as a net neutrality violation, but former FCC chief Tom Wheeler wrote in a letter to Congress in 2016 that such programs are likely violations of the net neutrality rules he put into place in 2015 (that have since been repealed by Ajit Pai’s FCC.)\nAdvertisement\nZero rating programs “may harm consumers and competition in downstream industry sectors by unreasonably discriminating in favor of select downstream providers, especially their own affiliates,” Wheeler wrote.\nWe know that telecom companies throttle video, but Choffnes’s research focuses on how and when they throttle. His research finds methods of actually detecting the mechanics of data differentiation from carrier to carrier. What he’s found is that, for the most part, telecom providers aren’t throttling video; they are using a network management tactic known as deep packet inspection that throttles based on metadata associated with network traffic. What this means is that T-Mobile, for instance, might not try to detect whether something is a video or not, but it can detect whether a service calls its data a video or has the metadata hallmarks of a video. If so, it will set a download speed cap for that specific data.\n\"We realized that they’re looking for certain text in the network traffic, and if we changed that text, when we send that traffic over the network, it doesn’t get throttled\"\nFor example, when an encrypted connection is established between Netflix’s servers and T-Mobile’s servers (known as a TLS handshake), certain plaintext information is exchanged (host names and server names). In Netflix’s case, one of these servers is called “nflxvideo.net.” If T-Mobile detects this server name in the metadata, it will throttle download data for those packets.\nAdvertisement\nChoffnes learned about this system by reverse engineering it; his team downloaded videos from various video services (including the TLS data and all metadata) and then recreated it on their own servers (called “replays”). What he found is that by changing the metadata of the video’s header—but not the video itself—it could be downloaded at much higher speeds. If he changed the metadata of other types of data (photos, for instance) to have the Netflix metadata, that data would be throttled by the telecom company when it was downloaded.\n“We realized that they’re looking for certain text in the network traffic, and if we changed that text—replaced nflxvideo.net with northeasternvideo.com—when we send that traffic over the network, it doesn’t get throttled,” Choffnes said. “This means it’s keyword related and not server or even content related.”\nBecause throttling is often keyword and not content-related, that means some video services are treated different from other video services; you may be able to stream Vimeo or a video hosted on a less-popular website faster than you can stream a video on Netflix, for example. And video is generally (not always) throttled around the clock, regardless of the overall traffic being put on a network, which peak during commutes and in the evenings.\nIt’s something we’ve been working on for years, something the academic community thinks is accurate, and we’re working with a regulator to disseminate it so other people can use it\nAdvertisement\n“When faced with a problem like network management, the question is ‘Do you want to use a sledgehammer or a scalpel?’ You want to use the tool that will have the least negative impact while providing benefit to everyone,” Choffnes said. “What I think is in place today is a bit of a sledgehammer. Video traffic is a cause for congestion, but the video is throttled to a low rate, and it’s done that way all the time.”\nAn information page for Wehe explains its mission: “We need your help to test more providers, in the US and worldwide, so we can understand how [throttling] policies change over time, location, and network. We are building a website that will publicize these practices, both to inform regulators and to allow consumers to make informed choices about selecting their mobile providers.”\n‘Objectionable Content’\nTo be clear, much of our outrage should probably be directed at the telecom industry, which has never shown much intention of following the principles of net neutrality. But it's no surprise that telecom companies are going to act in the interest of their bottom lines. What's less clear is why, exactly, Apple has banned a pro-consumer app from its App Store.\nChoffnes has presented this data at scientific and telecom conferences, and his papers are peer reviewed.\nHis system is not a perfect way of determining actual network speeds, because he doesn’t have access to telecom infrastructure or video provider servers. But he says that the basic methods of data discrimination have not been disputed by telecom companies and that his work has caught the eye of ARCEP, France’s version of the FCC, which has cited his work and wants to use his methods to catch telecom companies violating net neutrality in the country.\nIn fact, Verizon is currently paying his team to “research the video performance of Verizon’s video streaming services,” and Google has funded some of his work under its Faculty Award Research program. Choffnes says that the terms of these agreements do not allow Verizon or Google to influence his work: “This contract has no restriction on our ability to publish our findings that do not rely on confidential information, and by definition the measurements we do on these operational networks are not confidential (because we could do these measurement with or without Verizon),” he said.\nI mention these partnerships because the industry seems to believe in the accuracy of his work, but Apple, it seems, does not. The company has famously blocked many apps from entering the App Store or has prevented third party apps from accessing data that Apple itself can. For instance, Apple removed a feature that allowed third-party apps to access iPhone battery cycle data, presumably because software readings of battery health are less accurate than hardware ones (Apple never publicly addressed why it made this data inaccessible.) But Apple allows many different apps that allow users to do straight speed tests of their connections, which Choffnes says uses essentially the same technology his app does.\n“I probably could have gotten away with calling it a speed test,” he said. “But I wasn’t going to lie to get it published.”\nBecause Wehe is basically just making requests to a variety of servers Chofnes rents from Amazon (and he \"plans to include servers from multiple providers to avoid any potential for bias from just one provider\") there is no reason to think that the data it returns is inaccurate, and Apple’s suggestion that people receive no benefit from knowing they’re being throttled would seem to ignore the widespread public outrage about the FCC’s recent vote to repeal net neutrality.\n“I’m under contract with a French telecom regulator to provide this app as a service. I’m not a random independent researcher who has decided to on a whim to publish something that may or may not do what it says,” he told me. “It’s something we’ve been working on for years, something the academic community thinks is accurate, and we’re working with a regulator to disseminate it so other people can use it.”",
        "sentiment": -0.4743069326288478
    },
    "article_7": {
        "title": "'iPhone SE 2' With Wireless Charging Said to Launch in May or June",
        "body": "Apple is reportedly working on a new entry-level smartphone model similar to the iPhone SE that will support wireless charging and be released in time for summer 2018.\nThe prediction comes from Digitimes Research analyst Luke Lin, who believes that Apple's iPhone SE successor will have a glass back similar to the iPhone 8 series and iPhone X, but will lack the 3D sensing capabilities of the latter model.\nFor the entry-level sector, Apple is preparing a new inexpensive smartphone similar to the iPhone SE for 2018, featuring the wireless charging functionality, but not 3D sensing. The smartphone will begin mass production in the second quarter with the official launch in May or June, Lin noted.\nTaiwan-based website DigiTimes has a mixed track record at reporting on Apple's upcoming product plans. Its sources within the upstream supply chain have proven reliable in the past, but predictions from its research analysts are harder to gauge.\nLin doesn't specifically mention the size of the new entry-level model, but the details match up with previous rumors about a forthcoming four-inch 'iPhone SE 2' with a glass back, although earlier speculation said the device would ship in the first quarter of 2018, rather than the second quarter.\nRumors about a the specifications of Apple's next small form factor smartphone appeared in August last year, when Indian tech website Tekz24 claimed Apple's next iPhone SE model would have an A10 Fusion chip, 2GB of RAM, and 32GB and 128GB storage capacities, and a slightly larger 1,700 mAh battery.\nIn November, China's Economic Daily News claimed Apple's second-generation iPhone SE was set for the first half of 2018 and would be assembled by Wistron at its factory in Bengaluru, India, where some assembly of the current iPhone SE occurs. Taiwanese market research firm TrendForce also recently predicted that Apple is planning to launch a second-generation iPhone SE in 2018 to target the mid-range smartphone market.\nApple hasn't properly refreshed the iPhone SE since it launched back in March 2016, but it did double the available storage capacities to 64GB and 128GB in March 2017. Apple has confirmed an AirPower wireless charging mat will be released sometime this year for Apple Watch and iPhone models with a wireless charging feature.",
        "sentiment": 0.14993646259730062
    },
    "article_8": {
        "title": "Apple previews iOS 11.3",
        "body": "Batteries and Performance\niOS 11.3 adds new features to show battery health and recommend if a battery needs to be serviced. These can be found in Settings -> Battery and are available for iPhone 6 and later.\nAdditionally, users can now see if the power management feature that dynamically manages maximum performance to prevent unexpected shutdowns, first introduced in iOS 10.2.1, is on and can choose to turn it off. This feature can be found in Settings -> Battery and is available for iPhone 6, iPhone 6 Plus, iPhone SE, iPhone 6s, iPhone 6s Plus, iPhone 7 and iPhone 7 Plus.\nThese features will be coming in a later iOS 11.3 beta release.",
        "sentiment": 0.10656848317012191
    },
    "article_9": {
        "title": "Apple to Release New Entry-Level 13-inch MacBook This Year, Likely Replacing MacBook Air",
        "body": "Apple plans to release a new entry-level 13-inch MacBook in the second half of 2018, according to industry sources cited by DigiTimes. The report claims General Interface Solution (GIS) is expected to win more LCD display orders from Apple for the planned new model, after it began supplying the modules for existing MacBooks in the fourth quarter of last year.\nTouch panel maker General Interface Solution (GIS) is expected to land more LCM (LCD module) orders from Apple, which reportedly plans to release an entry-level 13-inch MacBook in the second half of 2018, according to industry sources. With new orders for MacBooks and other models, GIS is expected to ramp up its LCM shipments to 600,000 units a month by the end of 2018 compared to 300,000 units currently, said the sources.\nExtrapolating from today's report, which is light on detail, Apple's next entry-level MacBook will likely replace the 13-inch MacBook Air, Apple's lowest-cost notebook starting at $999. Apple's long-term aim was for the 12-inch MacBook to replace the MacBook Air, which was introduced in 2008, but sales of the Air have remained strong mainly thanks to its affordability. In 2016, Apple tried to position the 13-inch MacBook Pro with no Touch Bar as a viable MacBook Air alternative, but the Pro starts at $1,299, which is $300 more than the entry-level Air model.\nWith its signature tapered design, the MacBook Air is the only notebook the company still sells that does not have a Retina display. To keep it viable for a while longer, Apple bumped the base model's processor from 1.6 GHz to 1.8 in June 2017, but it has only seen similar minor updates since its last major revision in March 2015. The 11-inch MacBook Air has been discontinued entirely, and we do not expect to see further substantial updates to the line.\nIt's unclear what form a new entry-level 13-inch MacBook would take, although Apple would likely make efforts to clearly distinguish it from any existing 13-inch MacBook Pro models. Apple is known to be exploring the possibility of using fullscreen OLED displays in future MacBook series, which could see the company retain LCD display technology in a new entry-level machine while eventually adopting OLED for its Pro line-up, similar to the OLED/LCD differentiation strategy it will take for this year's upcoming iPhone line-up.\nApple is also reportedly looking into using ARM-based core processor chips for future MacBooks, which would reduce the company's dependence on Intel, especially given the recent Spectre and Meltdown troubles. Apple's interest in building its own core processors for notebooks could also enable it to control next-generation display technology and some related key components, according to sources, which would further differentiate the company's computers from others on the market.",
        "sentiment": 0.2402956989992942
    },
    "article_10": {
        "title": "2019 iPhones Could Have Smaller Notch as Apple 'Looking Into' Combining Face ID and Front Camera",
        "body": "A new report from South Korea's ETNews insinuates that iPhones may have a smaller notch in 2019 or beyond.\nThe report, citing industry sources, claims Apple is \"looking into\" combining the front-facing camera and Face ID on next year's iPhones, a move that could certainly reduce the size of the TrueDepth sensor housing.\nAccording to industries, it is heard that Apple is planning to strengthen face sensing function starting from 2019 models. That is why it is planning to increase number of parts that will be used for iPhones and is looking into combination of a face recognition module with a camera module.\nThe confusing bit is that the report mentions a singular face recognition module, whereas Face ID is powered by an infrared camera, dot projector, and flood illuminator. The report doesn't specify how Apple would manage to combine these components, so like many very-early-on rumors, this one isn't entirely clear yet.\nThe notch is easily the most controversial attribute of the iPhone X's design. While many early adopters don't mind the small cutout at the top of the display, others have heavily criticized it, including The Outline's Joshua Topolsky.\nThe \"notch\" on the new iPhone X is not just strange, interesting, or even odd — it is bad. It is bad design, and as a result, bad for the user experience. The justification for the notch (the new Face ID tech, which lets you unlock the device just by looking at it) could have easily been accomplished with no visual break in the display. Yet here is this awkward blind spot cradled by two blobs of actual screen space.\nUnfortunately for those critics, it doesn't look like the smaller notch will arrive in 2018, as new iPhones and iPads set to launch later this year are expected to have the same TrueDepth sensor housing as the iPhone X.\nBack in November, KGI Securities analyst Ming-Chi Kuo said Face ID will be featured on a second-generation 5.8-inch iPhone X, a larger 6.5-inch iPhone X Plus, and a new mid-range 6.1-inch iPhone. Apple will also release at least one iPad Pro model with Face ID this year, according to Bloomberg News.\nLG Innotek will reportedly supply all or the majority of 3D sensing modules for the next-generation iPhone and iPad models, based on an $821 million investment, which may have been funded at least partially by Apple.",
        "sentiment": -0.26944046343366307
    },
    "article_11": {
        "title": "Apple Delays iPhone 6 Plus Battery Replacements Until March-April Due to Limited Supply",
        "body": "iPhone 6 Plus users hoping to take advantage of Apple's discounted $29 battery replacements may have to wait a few months.\nApple says iPhone 6 Plus replacement batteries are in short supply and won't be available until late March to early April in the United States and other regions, according to an internal document distributed to Apple Stores and Apple Authorized Service Providers this week and later obtained by MacRumors.\nApple's internal document quotes a shorter wait of \"approximately two weeks\" for iPhone 6 and iPhone 6s Plus battery replacements, and adds that batteries for all other models like the iPhone 6s, iPhone 7, iPhone 7 Plus, and iPhone SE are expected to be available \"without extended delays\" in most countries.\nApple noted that lead times may vary in some regions, including the Middle East, Africa, Latin America, Russia, and Turkey.\nMacRumors has already received a few emails from readers with an iPhone 6 Plus who were quoted a late March to early April timeframe for the replacement service to be completed at Apple Stores in New York and North Carolina, in line with the information outlined in Apple's document.\nA reliable source at an Apple Authorized Service Provider indicated that they recently received a package with dozens of replacement batteries, the majority of which were for iPhone 7 and iPhone 7 Plus models.\nApple lowered its battery replacement fee to $29 last month for any customer with an iPhone 6 or newer as part of an apology over its lack of transparency about slowing down some older iPhone models to prevent unexpected shutdowns. Apple noted that initial supplies of some batteries may be limited.\nAs with any supply-demand situation, availability of replacement batteries will likely vary by location. Keep in mind that many Apple Authorized Service Providers like MacMedics and ComputerCare are able to replace iPhone batteries, so this may be an option worth considering beyond an Apple Store.\nA source adds that Apple Authorized Service Providers are permitted to set their own prices for out-of-warranty parts and repairs, so some third-party repair shops are charging more than $29 for battery replacements, even if Apple might not prefer it, to ensure they are being fairly compensated.\nAlso keep in mind that Apple's discounted rate is available until December 31, 2018, so unless you absolutely need a battery replacement now, you may wish to consider waiting until later in the year to initiate the process.\nIf you are replacing your iPhone's battery for the first time, the $29 price is available regardless of whether the device passes or fails Apple's battery diagnostic test. To be eligible for any additional replacements at the discounted rate, however, the device must explicitly fail the test or the standard $79 applies.\nTo get started, read our guide on how to get your iPhone's battery replaced with an appointment at an Apple Store or Apple Authorized Service Provider. There's also a mail-in option, but we've heard that Apple's repair center may only be replacing batteries that fail a diagnostic test, and sending back devices that pass.",
        "sentiment": -0.23251327220350504
    },
    "article_12": {
        "title": "FBI security expert: Apple are “jerks” about unlocking encrypted phones",
        "body": "Federal Bureau of Investigation officials are continuing to voice their displeasure with Apple's approach to iPhone security, with one FBI official reportedly calling the company \"jerks\" and an \"evil genius\" this week.\nApple has repeatedly made it more difficult to access data on encrypted iPhones, making Apple customers safer from hackers but also preventing the FBI from breaking into phones used by suspected criminals.\n\"At what point is it just trying to one-up things and at what point is it to thwart law enforcement?\" FBI forensic expert Stephen Flatley said yesterday while speaking at the International Conference on Cyber Security in Manhattan, according to a report by Motherboard. \"Apple is pretty good at evil genius stuff.\"\nFlatley also used the word \"jerks\" to describe Apple and its approach to iPhone security, according to Motherboard. The story also says:\nFor example, Flatley complained that Apple recently made password guesses slower, changing the hash iterations from 10,000 to 10,000,000. That means, he explained, that \"password attempts speed went from 45 passwords a second to one every 18 seconds,\" referring to the difficulty of cracking a password using a \"brute force\" method in which every possible permutation is tried. There are tools that can input thousands of passwords in a very short period of time—if the attempts per minute are limited, it becomes much harder and slower to crack.\nBy contrast, the Motherboard report says that Flatley praised another company, Cellebrite, which sells technology the FBI uses to break into iPhones.\nFlatley is a senior forensic examiner in the FBI's New York division. He appeared at the security conference to discuss the challenges of running a large forensic lab, according to the conference website.\nWe emailed Flatley this morning to ask if he'd like to provide further details or explanation of his views on Apple's approach to encryption. We'll update this story if we get a response.\nAdvertisement\nApple: Encryption is vital for customer safety\nWhile Apple has assisted the FBI in some cases, the company has held firm in its stance that strong encryption is vital for keeping its customers safe.\n\"For many years, we have used encryption to protect our customers' personal data because we believe it's the only way to keep their information safe,\" Apple says in a \"message to customers\" posted on its website since 2016. \"We have even put that data out of our own reach, because we believe the contents of your iPhone are none of our business.\"\nApple CEO Tim Cook previously argued that intentionally including vulnerabilities in consumer products to help law enforcement would also help criminals hack everyday people who rely on encryption to ensure their digital safety.\nFBI says encryption “urgent public safety issue”\nFlatley's comments came one day after FBI Director Christopher Wray called phone encryption \"an urgent public safety issue.\"\n\"In fiscal year 2017, we were unable to access the content of 7,775 devices—using appropriate and available technical tools—even though we had the legal authority to do so,\" Wray said in a speech at the security conference. \"Each one of those nearly 7,800 devices is tied to a specific subject, a specific defendant, a specific victim, a specific threat.\"\nThe problem makes it harder for the FBI in investigations related to \"human trafficking, counterterrorism, counterintelligence, gangs, organized crime, child exploitation, and cyber,\" he said.\nWray said the FBI \"supports information security measures, including strong encryption,\" but he said technology companies should give more help to law enforcement agencies that want to access encrypted data.\n\"We need them to respond to lawfully issued court orders, in a way that is consistent with both the rule of law and strong cybersecurity. We need to have both, and can have both,\" he said.\nWray's comments were just the latest example of federal officials calling for greater access to encrypted devices. Instead of encryption that can't be broken, tech companies should implement \"responsible encryption\" that allows law enforcement to access data, Deputy Attorney General Rod Rosenstein said in a speech in October.\nUnbreakable encryption \"is a huge, huge problem,\" Wray said at another conference in October.",
        "sentiment": -0.34238783817272633
    },
    "article_13": {
        "title": "Apple releases iOS 11.2.2 security update for iPhone and iPad",
        "body": "Apple has released iOS 11.2.2 for iPhone and iPad. The software update highlights security improvements and Apple “recommends for all users.”\nApple hasn’t disclosed exactly what security issues are addressed by iOS 11.2.2, but we can expect to see details on Apple’s security page shortly. We’ll update when we learn more about the new version. For now, non-beta users can find iOS 11.2.2 for iPhone and iPad as a software update over-the-air through the Software Update section of the Settings app.\nThe update could relate to the recently disclosed Spectre and Meltdown flaws discovered in most computer processors including ones used in iPhones and iPads. Apple acknowledged both issues last week and said it already addressed issues that could affect iOS and macOS while risks to Safari would be addressed soon.\nUpdate: Apple says the update is for Safari to address the Spectre vulnerability.\nAvailable for: iPhone 5s and later, iPad Air and later, and iPod touch 6th generation Description: iOS 11.2.2 includes security improvements to Safari and WebKit to mitigate the effects of Spectre (CVE-2017-5753 and CVE-2017-5715). We would like to acknowledge Jann Horn of Google Project Zero; and Paul Kocher in collaboration with Daniel Genkin of University of Pennsylvania and University of Maryland, Daniel Gruss of Graz University of Technology, Werner Haas of Cyberus Technology, Mike Hamburg of Rambus (Cryptography Research Division), Moritz Lipp of Graz University of Technology, Stefan Mangard of Graz University of Technology, Thomas Prescher of Cyberus Technology, Michael Schwarz of Graz University of Technology, and Yuval Yarom of University of Adelaide and Data61 for their assistance.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.2221678954665549
    },
    "article_14": {
        "title": "iPhone X’s perfect roundings",
        "body": "No Cutting Corners on the iPhone X\nWhen the iPhone X launched, a lot of designers were put off about the screen shape. Those complaints have mostly died down, but I haven’t seen much design-nerd talk about cool corner treatment details. Fortunately, deep nerd shit is my specialty.\niPhone X screen shape\nWhat’s Your Angle?\nWhen you’re starting a design like this, the obvious, and comically cheaper option is to make all corners square. Machines exist and/or are calibrated to make those screens, so keeping edges squared requires fewer manufacturing changes and less talent along the pathway to production.\nEveryone knows how to make a right angle — designers don’t have to do math, engineers need fewer calculations, the people making the machine are clear on what to do.\nAnd yet, let’s examine how crappy all-square corners would look:\nI’m a pixelated bear cub. Rawr.\nOnce Apple knew they wanted to take advantage of new full-screen technology, that gave them the opportunity to alter screen shape because they would need to address the manufacturing process anyway. Presumably, the expense was mostly built in.\nStill, there were lots of ugly ways to do this:\nMeh.\nThis is where they landed:\nThat’s better.\nScreen Corners\nHere’s where the nerd part comes in, iPhone X rounded screen corners don’t use the classic rounding method where you move in a straight line and then arc using a single quadrant of a circle. Instead, the math is a bit more complicated. Commonly called a squircle, the slope starts sooner, but is more gentle.\nThe difference is real subtle, even in gif-form, but here we go:\nDifference between common rounded rectangle maths and Apple maths.\nApple has been doing this to the corners of laptops and iMacs for years, but this type of rounding didn’t penetrate iOS until version 7. This shape has classically been difficult to achieve, because it wasn’t available in 2D design editors, though that’s starting to change. Read about it in more detail here.\nThe Notch\nNow let’s talk about the notch itself. The left and right sides have two rounded corners. Because of the curve falloff, one curve doesn’t complete before the next one starts — they blend seamlessly into each other. As a result, no tangent line on this edge actually hits a perfect vertical.\nOoo. Fancy.\nCome Correct\niPhone X templates I’ve seen out there don’t 100 percent duplicate the official shape, probably because it was either too hard to make or they haven’t noticed. This is why it’s good practice to use official assets from Apple, found in the design resources section of the developer site for creating icons and mockups.\nFuture iterations of this design will surely alter these sizes, so it will be interesting to compare how hardware sensor evolution impacts design shifts.\nOverall, these decisions seem minor, but from a design viewpoint they’re fairly opinionated. Even when designers are willing to spend social capital to push these ideas, most organizations won’t put resources behind them.\nRounding the Bend\nOne of the things I love about indie apps is their ability to be opinionated. It’s nearly impossible to ship strong viewpoints from larger companies where there are fifty people in a room examining angles. So it’s cool to see Apple still has the ability to take a strong stance in this way.\nSweating thousands of minor details is what separates Apple from other companies. Their ability to do that is hard-won, but damn it’s pretty to watch.",
        "sentiment": -0.07644251578797896
    },
    "article_15": {
        "title": "iOS 11.3 Firmware Subtly Hints at iPad With Face ID",
        "body": "Apple is planning to release a next-generation iPad Pro this year with slim bezels and Face ID, like the iPhone X, according to Mark Gurman at Bloomberg News, and evidence of the tablet may have been uncovered in iOS 11.3.\niPad Pro with Face ID mockup by Carlos Guerra\niHelpBR editor Filipe Espósito has discovered strings in the first iOS 11.3 beta that refer to a \"modern iPad,\" which is notable since Apple's software engineers referred to the iPhone X as the \"modern iPhone\" in older firmware, according to both Espósito and developer Guilherme Rambo.\nYep, there’s definitely some references to a “Modern iPad” inside iOS 11.3. pic.twitter.com/JHHone2R1D — Filipe Espósito  (@filipekids) January 25, 2018\nWhile the \"modern iPad\" strings could be placeholders, as commonly found in Apple's code, the discovery lends credence to rumors of an iPad Pro with Face ID, which would certainly be a logical next step in Apple's product roadmap.\n\"Modern iPhone\" meant iPhone X. \"Modern iPad\" is probably an iPad with Face ID https://t.co/pbMAMj3QCe — Guilherme Rambo (@_inside) January 25, 2018\nKGI Securities analyst Ming-Chi Kuo also expects Apple to release a new iPad Pro with Face ID this year, so there is a good chance the rumor is true. Like the iPhone X, the tablet reportedly lacks a Home button, although it will likely still have an LCD instead of OLED display due to supply, cost, and technological constraints.\nIt's unclear if the iPad Pro will have a notch for the TrueDepth system, as illustrated in the first mockup above, or if the device will have uniformly slim bezels on all four sides with enough room for the Face ID sensors.\niPad Pro with slim bezels rendered by Benjamin Geskin\nFace ID is also expected to be featured on a second-generation 5.8-inch iPhone X, a larger 6.5-inch version dubbed iPhone X Plus , and a new, cheaper 6.1-inch model with an LCD, aluminum frame, and no 3D Touch",
        "sentiment": -0.32355136879616314
    },
    "article_16": {
        "title": "First HomePod shipments on the way to Apple ahead of launch",
        "body": "Apple suppliers have begun shipping the first HomePod units ahead of the smart speaker’s much-anticipated launch. Just 1 million devices are on the way initially. However, Apple is expected to receive as many as 12 million by the end of this year.\nUnveiled in June of last year, HomePod was supposed to launch ahead of the holidays but Apple delayed it because it wasn’t ready. When it finally goes on sale this year, HomePod will give Apple fans an alternative to Amazon Echo and Google Home.\nHomePod launch date still a mystery\nCompeting smart assistants from Amazon and Google made quite a splash at this year’s massive CES electronics trade show in Las Vegas. Those companies’ smart speakers already have gained a foothold in consumers’ homes. But at CES, third-party manufacturers rolled out Alexa and Google Assistant implementations in a wide variety of products.\nThe steady advances make Apple’s delayed entry into the smart speaker market even more painful. In fact, Apple still hasn’t provided us with a proper HomePod release date yet. The company promised HomePod would arrive in “early 2018.” Now one supplier, Inventec, has finally started shipping the first 1 million units, according to a source for Taipei Times.\nApple also tasked Foxconn with assembling HomePod units. However, it remains unclear when Foxconn will start shipping the smart speakers. Inventec and Foxconn will share production of the 10 million to 12 million HomePods that Apple reportedly will order throughout 2018, the source added.\nAnalysts claimed in early January that HomePod would go on sale in four to six weeks. If that’s accurate, you’ll probably want to have your credit card ready in late January or early February.\nHomePod focuses on music first\nSiri powers HomePod’s smart features. That means Apple’s high-end speaker should offer many of the capabilities that make devices like the Amazon Echo incredibly popular. However, Apple focused the speaker on a stellar music experience first and foremost.\nThat could be Apple’s way of warning us that HomePod won’t be quite as smart as its rivals.",
        "sentiment": 0.0528026633408098
    },
    "article_17": {
        "title": "LG to supply OLED panels for this year’s “iPhone X Plus”",
        "body": "LG Display saw its shares surge to a one-month high on Wednesday following a report that the company will begin supplying OLED panels to Apple's new range of iPhones this year (via Financial Times).\nLG's stock rallied on an Electronic Times report that the South Korean firm would make over 15 million OLED panels for Apple's 2018 range of iPhones. LG is already a supplier of LCD panels, currently used in the iPhone 8 and iPhone 8 Plus, but Samsung dominates supply of OLED displays for Apple's flagship iPhone X. Indeed, last week LG Display revealed in a regulatory filing that it didn't supply any of the OLED panels currently used in the iPhone X.\nHowever, that could change this year, since Apple is expected to launch two new 5.8-inch and 6.5-inch iPhone models with OLED displays in 2018. According to today's report, LG Display will supply Apple with the 6.5-inch OLED panels, while Samsung will supply the 5.8-inch or 6-inch OLED panels.\nReports have been trickling out since July 2017 that Apple has invested billions of dollars in LG's OLED production capability for smartphones, but the fruits of its investment were thought to be some ways off. LG was initially reported to have secured 45,000 panels per month for future iPhones from 2019, while as recently as September it was suggested that Apple would have to wait until at least next year before it could move beyond Samsung for significant supplies of OLED panels. However, Wednesday's report suggests LG could secure its position as the number two supplier of OLED screens for Apple's iPhones as early as the second half of 2018. LG is said to be planning to mass-produce the panels for Apple at its Gen 6 flexible OLED production line located in Paju, South Korea.\nLG came in for scrutiny recently after it emerged that the firm supplied Google with the Pixel 2 XL's OLED displays, some of which were reportedly prone to screen burn-in or image retention issues. It remains unclear whether the problems stemmed from LG or other factors were involved, although the smaller Pixel 2 and original Pixel phones – both with Samsung-supplied OLED displays – have experienced far fewer issues. It's also worth noting that Apple says OLED displays can show \"slight visual changes\" after extended long-term use and minor screen burn-in is considered normal.\nThe new iPhone X and iPhone X Plus will likely launch around the usual timeframe of September to October, potentially alongside a new 6.1-inch mid-range model with an LCD display.",
        "sentiment": -0.12029639817774296
    },
    "article_18": {
        "title": "Tim Cook says that users will be able to turn off iPhone battery throttling future iOS update",
        "body": "Apple had already said that a future iOS update will give users more insight into the state of their battery. In an interview with ABC News, Tim Cook was asked for his take on Apple slowing down iPhones with degraded batteries. He revealed that the developer beta including these features will be released next month, with a public release to follow after.\nMoreover, he says that this forthcoming update will give users the option to disable the throttling to maintain normal CPU performance, but will be at risk of unexpected shutdowns.\nIn its public apology letter on Apple.com regarding the iPhone slowdown debacle, Apple described the update in the following way:\nEarly in 2018, we will issue an iOS software update with new features that give users more visibility into the health of their iPhone’s battery, so they can see for themselves if its condition is affecting performance.\nThis implied an enhancement of the Battery screen in iOS Settings to include more information about the iPhone’s battery health and whether users were being subjected to Apple’s advanced power management throttling.\nIt did not say anything about Apple giving users the choice to disable battery throttling, so either Tim Cook misspoke (in an interview focused on Apple’s investment into the US following tax reform) or he is sharing new details.\nThe new feature will make a lot of users happy who have openly asked for the ability to use their iPhone at full speed knowing that it increases the likelihood of their device randomly turning itself off if the battery cannot provide enough instantaneous voltage.\nYou can listen to Cook talk about this in the interview embedded below. Skip to around 4:30 to hear him talk about the iPhone slowdown debacle. His wording is not ambiguous, he states plainly that Apple will release the developer beta (presumably iOS 11.3) next month and that it will include the ability for users to disable performance throttling if they want to.\nApple will not recommend users disable the throttling as it may mean that they will not be able to use their device in emergency situations.\nA developer beta in February probably means a public release of this update will be available in March.\nApple’s battery throttling technique was activated on iPhone 6, iPhone 6 Plus, iPhone 6s, iPhone 6s Plus, iPhone 7, iPhone 7 Plus and iPhone SE as of iOS 11.2. It can reduce performance by up to 50% in benchmarks, but only kicks in if the system determines that the battery is degraded.\nSo far, Apple’s solution has been to cut the price of battery replacements to $29 through 2018 and tell customers to service their phones with a new battery if they do not want to experience slowdowns. It seems this forthcoming iOS release will offer users another alternative, where they can continue to use their iPhone at full speed even if the battery is degraded (albeit with a chance that the phone turns off occasionally).\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.1941040860194909
    },
    "article_19": {
        "title": "Apple Confirms 'Meltdown' and 'Spectre' Vulnerabilities Impact All Macs and iOS Devices, Some Fixes Already Released",
        "body": "Apple today confirmed that it has addressed the recent \"Meltdown\" vulnerability in previously released iOS 11.2, macOS 10.13.2, and tvOS 11.2 updates, with additional fixes coming to Safari in the near future to defend against the \"Spectre\" vulnerability.\nApple has also confirmed that the two vulnerabilities affect all Mac and iOS devices. The company's full statement, available through a new support document covering Meltdown and Spectre, is below:\nSecurity researchers have recently uncovered security issues known by two names, Meltdown and Spectre. These issues apply to all modern processors and affect nearly all computing devices and operating systems. All Mac systems and iOS devices are affected, but there are no known exploits impacting customers at this time. Since exploiting many of these issues requires a malicious app to be loaded on your Mac or iOS device, we recommend downloading software only from trusted sources such as the App Store. Apple has already released mitigations in iOS 11.2, macOS 10.13.2, and tvOS 11.2 to help defend against Meltdown. Apple Watch is not affected by Meltdown. In the coming days we plan to release mitigations in Safari to help defend against Spectre. We continue to develop and test further mitigations for these issues and will release them in upcoming updates of iOS, macOS, tvOS, and watchOS.\nApple's statement does not make it clear if these vulnerabilities have been addressed in older versions of iOS and Mac, but for Macs, there were security updates for older versions of macOS released alongside macOS 10.13.2, so it's possible fixes are already available for Sierra and El Capitan.\nNews of the Spectre and Meltdown vulnerabilities first came to light this week, but Intel and major operating system vendors like Apple, Linux, and Microsoft have known about the issue for several months and worked to prepare a fix before the security flaws were publicly shared.\nSpectre and Meltdown are serious vulnerabilities that take advantage of the speculative execution mechanism of a CPU. As these use hardware-based flaws, operating system manufacturers are required to implement software workarounds. These software workarounds can impact processor performance, but Intel has insisted most users will not see serious slowdowns. Apple also says that no measurable impact has been detected in macOS and iOS.\nApple released mitigations for Meltdown in iOS 11.2, macOS 10.13.2, and tvOS 11.2. watchOS did not require mitigation. Our testing with public benchmarks has shown that the changes in the December 2017 updates resulted in no measurable reduction in the performance of macOS and iOS as measured by the GeekBench 4 benchmark, or in common Web browsing benchmarks such as Speedometer, JetStream, and ARES-6.\nThe Meltdown vulnerability allows a malicious program to read kernel memory, accessing data like passwords, emails, documents, photos, and more. Meltdown can be exploited to read the entire physical memory of a target machine. The vulnerability is particularly problematic for cloud-based services.\nSpectre, which covers two exploitation techniques, breaks the isolation between different applications. Apple says that while the Spectre vulnerability is difficult to exploit, it can be done using JavaScript in a web browser. Apple plans to release Safari updates for macOS and iOS to prevent Spectre-based exploits.\nAs with the Meltdown vulnerability, Apple says the upcoming Safari mitigations will have \"no measurable impact\" on Speedometer and ARES-6 tests, and an impact of less than 2.5% on the JetStream benchmark.\nApple says it will continue to test further mitigations for Spectre and will release them in future versions of iOS, macOS, tvOS, and watchOS.\nUpdate: Apple has updated its Meltdown and Spectre support document to clarify that the Apple Watch is not affected by either vulnerability. Previously, Apple had only confirmed that the Apple Watch was unaffected by Meltdown.\nUpdate 2: Apple has confirmed that fixes have also been released for macOS Sierra and OS X El Capitan in an updated security support document.\nUpdate 3: The support document that confirmed the fixes for Sierra and El Capitan has been updated again to remove references to these two operating systems, so it remains unclear whether or not Meltdown fixes have been released for these two older operating systems.",
        "sentiment": -0.2140593896770189
    },
    "article_20": {
        "title": "Apple refunds the difference if you recently replaced the iPhone battery at full price",
        "body": "Si vous utilisez un iPhone 6 ou plus récent et si vous le trouvez trop lent, c’est peut-être parce que sa batterie commence à faiblir. Apple a mis en place un programme spécial pour la remplacer pour 29 €, soixante de moins qu’en temps normal. Cette nouvelle politique assouplit aussi les conditions du remplacement : désormais, les Apple Store remplaceront les batteries de tous les clients qui le demandent sur les modèles concernés.\nLa polémique a commencé avant ce programme spécial toutefois et Apple a déjà remplacé des batteries pour cette raison à l’ancien tarif. C’est mon cas, notamment, pour un iPhone 6s Plus qui a trouvé une seconde jeunesse après avoir payé 89 € en Apple Store, peu avant Noël.\nDans une note diffusée en interne que nous avons pu consulter, Apple indique à ses employés que les clients qui n’ont pas bénéficié de la réduction peuvent contacter l’assistance s’ils veulent obtenir un remboursement. C’est ce que j’ai fait dans la matinée et même si la procédure a été assez longue (quasiment une heure au total), j’ai effectivement obtenu gain de cause et ce, très simplement.\nLe constructeur me remboursera 60 € dans les prochaines semaines, directement sur le compte bancaire utilisé en Apple Store lors de la réparation. Je n’ai pas eu besoin d’argumenter ou de discuter, mes deux interlocuteurs successifs (au chat puis au téléphone) ont été parfaitement compréhensifs et ils ont immédiatement accepté. Ce qui est long, c’est la procédure pour créer un dossier et initier le remboursement. Peut-être qu’Apple simplifiera ses procédures pour les batteries d’iPhone ?\nQuoi qu’il en soit, si vous avez payé 89 € récemment pour remplacer la batterie d’un iPhone 6 ou plus récent, vous pouvez essayer d’obtenir un remboursement. Apple ne garantit pas que vous serez satisfait, mais mon expérience montre que c’est possible et même assez facile.\n[MàJ 02/01/2018 13h25] : un lecteur nous indique qu’on lui a refusé le remboursement de la différence. En cause, la date de la réparation. D’après ses interlocuteurs, seuls les remplacements effectués à partir du 14 décembre 2017 sont éligibles au remboursement, pas ceux effectués avant.\nInterrogés, ces mêmes interlocuteurs n’ont pas su justifier la date et ont même recommandé à ce lecteur de rédiger un feedback pour se plaindre de cette politique. Il ajoute qu’il a essayé de négocier, sa réparation étant proche (11 décembre), mais que les conseillers se sont montrés inflexibles.\nSi vous êtes concerné, avez-vous essayé de vous faire rembourser la différence ? N’hésitez pas à apporter votre témoignage en commentaire !",
        "sentiment": 0.07527649905532599
    },
    "article_21": {
        "title": "HomePod expected to launch in 4-6 weeks according to tech analyst GBH",
        "body": "Tech analysts GBH insights say that it expects Apple’s delayed HomePod smart speaker to be launched ‘in the next 4-6 weeks’ – but that it will face an ‘uphill climb’ as it seeks to compete with entrenched competitors.\nIt thinks that two factors will make the launch significantly tougher than it would have been had it been released on time …\nIn an investor’s note seen by us, GHB echoes a recent report that aggressive holiday shopping pricing by Amazon has further increased the dominance of its Echo speakers.\nThe “star of CES” in our opinion will be Amazon/Echo and its white hot Alexa smart home ecosystem as we believe this represents a $20 billion market opportunity for Bezos & Co. over the next three years […] Echo [is] becoming further entrenched as the home smart speaker leader (we currently estimate ~75% market share post holidays).\nSecond, it says that Google is investing a lot of CES marketing effort in its rival Google Home speakers.\nWe expect a big push for Google’s smart speaker Home product at CES this week with the underlying goal to drive more partners and products through its voice driven Assistant product portfolio […] Google is using CES as its Trojan Horse event to aggressively drive its Home product and spread the smart speaker gospel to new and existing partners as well as the all-important developer community.\nAlthough Apple focuses its attention on the premium end of the market, and won’t be trying to compete with the $50 Echo Dot, GBH argues that the HomePod likely paves the way for other products down the road, making it a critical test for the company.\nWe will be closely watching this competitive dynamic against the likes of Amazon and Google, Apple’s aggressive marketing push, and the installed base uptake of HomePod in 1H18 as this represents a pivotal window of opportunity for Cook & Co. to establish their presence in this green field smart speaker market which could be a “gate opener” to other consumer products/functionality further down the road.\nEven Apple fans might consider existing alternatives, argued Zac Hall in a recent opinion piece.\nCheck out 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.1749061591923237
    },
    "article_22": {
        "title": "iOS 11.2.5 is now available for iPhone and iPad",
        "body": "Apple has officially release iOS 11.2.5 for iPhone, iPad, and iPod touch. The release build version is 15D60. The update primarily adds support for HomePod ahead of its release next month, but includes a few other goodies as well.\nThe new version is available on Apple’s developer center and is rolling out to all users now.\nHomePod support\n– Setup and automatically transfer your Apple ID, Apple Music, Siri and Wi-Fi settings to HomePod.\nSiri News\n– Siri can now read the news, just ask, “Hey Siri, play the news”. You can also ask for specific news categories including Sports, Business or Music.\nOther improvements and fixes\n– Addresses an issue that could cause the Phone app to display incomplete information in the call list – Fixes an issue that caused Mail notifications from some Exchange accounts to disappear from the Lock screen when unlocking iPhone X with Face ID – Addresses an issue that could cause Messages conversations to temporarily be listed out of order – Fixes an issue in CarPlay where Now Playing controls become unresponsive after multiple track changes – Adds ability for VoiceOver to announce playback destinations and AirPod battery level\nThe new version should also fix the chaiOS message bug discovered this month.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.1961035897785967
    },
    "article_23": {
        "title": "Visa Dropping Signature Requirement for Chip Cards and Apple Pay Starting in April",
        "body": "Visa today announced it will eliminate its signature requirement for EMV payments beginning April 2018 in the United States and Canada.\nThe change will apply to both chip-and-signature credit and debit cards, and contactless payment solutions like Apple Pay when linked to a Visa credit or debit card. The change is designed to allow for a more consistent, streamlined, and quicker checkout experience for both merchants and cardholders.\nFor years, customers have been required to sign the receipt when making a purchase to verify they own the debit or credit card they are attempting to use. A cashier is supposed to match the signature on the receipt against the one on the back of the card, but in reality, this process is often skipped nowadays.\nCurrently, even when using Apple Pay, a signature can be required on occasion for purchases over $25 made with a Visa card in the United States. But with EMV technology and other modern safeguards, Visa is now moving to fully eliminate this requirement, in line with Mastercard, American Express, and Discover.\nThe signature requirement is already much less common in Canada, where customers insert their chip card into a payment terminal and verify ownership by entering a four-digit PIN. You also can't use contactless payments for transactions over $100 in Canada (update: excluding American Express — thanks Gary Ng!)\nVisa says its partners have deployed EMV-chip enabled readers at more than 2.5 million locations around the world. Less than two years since the technology launched in the United States, counterfeit fraud declined 66 percent at EMV-chip enabled merchants, according to the company.\nMerchants will remain able to collect signatures if required to do so by an applicable law in a particular jurisdiction.",
        "sentiment": -0.10170988117655118
    },
    "article_24": {
        "title": "macOS High Sierra's App Store System Preferences Can Be Unlocked With Any Password",
        "body": "A bug report submitted on Open Radar this week has revealed a security flaw in the current version of macOS High Sierra that allows the App Store menu in System Preferences to be unlocked with any password.\nMacRumors is able to reproduce the issue on macOS High Sierra version 10.13.2, the latest public release of the operating system, on an administrator-level account by following these steps:\n• Click on System Preferences.\n• Click on App Store.\n• Click on the padlock icon to lock it if necessary.\n• Click on the padlock icon again.\n• Enter your username and any password.\n• Click Unlock.\nAs mentioned in the radar, we can confirm that the App Store preferences login prompt does not accept an incorrect password with a non-administrator account, meaning there is no behaviour change for standard user accounts.\nWe also weren't able to bypass any other System Preferences login prompts with an incorrect password, with any type of account, so more sensitive settings such as Users & Groups and Security & Privacy are not exposed by this bug.\nApple has fixed the bug in the latest beta of macOS 10.13.3, which currently remains in testing and will likely be released at some point this month. The bug doesn't exist in macOS Sierra version 10.12.6 or earlier.\nOn the current macOS 10.13.2, the bug gives anyone with physical, administrator-level access to a Mac the ability to disable settings related to automatically installing macOS software, security, and app updates.\nThis is the second password-related bug to affect macOS High Sierra in as many months, following a major security vulnerability that enabled access to the root superuser account with a blank password on macOS High Sierra version 10.13.1 that Apple fixed with a supplemental security update.\nFollowing the root password vulnerability, Apple apologized in a statement and added that it was \"auditing its development processes to help prevent this from happening again,\" so this is a rather embarrassing mishap.\nWe greatly regret this error and we apologize to all Mac users, both for releasing with this vulnerability and for the concern it has caused. Our customers deserve better. We are auditing our development processes to help prevent this from happening again.\nIt's worth noting that the App Store preferences are unlocked by default on administrator accounts, and given the settings in this menu aren't overly sensitive, this bug is not nearly as serious as the earlier root vulnerability.\nApple will likely want to fix this bug sooner rather than later, so it's possible we'll see a similar supplemental update released at some point, or perhaps it will fast track the release of macOS High Sierra version 10.13.3. Apple did not immediately respond to our request for comment on this matter.\nIn the meantime, if you keep your App Store preferences behind lock, you'll want to be more diligent in ensuring that you log out of your administrator account when you are away from your Mac. Alternatively, until macOS 10.13.3 is released, users can use a standard account rather than an administrator one.\nWhile this bug isn't as dangerous as the root password vulnerability, being able to bypass a login prompt with any password is something that obviously shouldn't be possible and is an embarrassing oversight for Apple.",
        "sentiment": -0.2801449076960916
    }
}