{
    "article_0": {
        "title": "Apple faces class action lawsuit over failing MacBook butterfly keyboards",
        "body": "Apple’s polarizing butterfly keyboard design is now causing the company some legal issues. A new class action lawsuit has been filed against Apple, alleging that the company knew about the reliability issues of the design before launch, yet released it anyway…\nAs outlined by AppleInsider, the lawsuit was filed in the Northern District Court of California and includes both the 12-inch MacBook and the MacBook Pro.\nThe lawsuit alleges that “thousands” of users have suffered from problems with the butterfly keyboard device that render it ultimately useless. The lawsuit says that even “minimal amounts of dust or debris” causes the keyboard to fail, thus rendering one of the “core functions” of the MacBook broken. This makes the device “inoperable and unsuitable for its ordinary and intended use.”\nApple’s butterfly keyboard and MacBook are produced and assembled in such a way that when minimal amounts of dust or debris accumulate under or around a key, keystrokes fail to register. The keyboard defect compromises the MacBook’s core functionality. As a result of the defect, consumers who purchased a MacBook face a constant threat of non-responsive keys and accompanying keyboard failure. When one or more of the keys on the keyboard fail, the MacBook can no longer serve its core function: typing. Thus, when this defect manifests in the MacBook, the computer becomes inoperable and unsuitable for its ordinary and intended use.\nThe lawsuit goes on to allege Apple “knew that the MacBook is defective at or before” the release. Furthermore, it knew of the issues uses of the 12-inch MacBook were having, yet still brought the butterfly keyboard to the MacBook Pro and sold it at “premium prices.”\nAdditionally, the suit takes issues with Apple’s marketing – which touts that the butterfly keyboard offers “four times more key stability than a traditional scissor mechanism.”\nThe 1-year warranty Apple offers to users is acknowledged in the lawsuit, but it argues that “Apple routinely refuses to honor its warranty obligations,” instead instructing MacBook users to “try self-help remedies that it knows will not result in permanent repair.\nUltimately, the lawsuit seeks damages, legal fees, and calls for Apple to disclose the keyboard flaws and replace defective units, including reimbursement for the initial laptop purchase.\nThis certainly isn’t the first time Apple has come under fire for its butterfly keyboard mechanism. Earlier this month, a petition called for Apple to recall and replace defective MacBook keyboards – that petition has since accumulated over 17,000 signatures.\nYou can join the class action lawsuit here.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.4380676480708644
    },
    "article_1": {
        "title": "Apple made more profit in three months than Amazon has generated during its lifetime",
        "body": "\"I think it's fair to say, we've never looked at a [analyst] projection in connection with either a security we've bought or a business we've bought,\" Buffett said during a Berkshire Hathaway annual shareholder meeting in 1995, according to remarks found using CNBC's Warren Buffett Archive .\nThe Oracle of Omaha's moves may be explained by his philosophy of emphasizing a company's historical financial track record versus putting credence in aggressive future forecasts from analysts.\nApple \"is an unbelievable company,\" Buffett told CNBC on May 3. \"If you look at Apple, I think it earns almost twice as much as the second most profitable company in the United States.\"\nThe smartphone maker generated a $48.35 billion in profit during its fiscal 2017 and made $13.8 billion in net income during the March 2018 quarter.\nIn comparison, Amazon's total net income since inception is about $9.6 billion. The number was calculated by adding up all of Amazon's annual net income figures since its inception to the company's $1.6 billion profit in the March 2018 quarter.\nOne Wall Street analyst believes Amazon is still in the \"early stages\" in many of its key markets.\n\"We are in the sweet spot between Amazon investment cycles where new fulfillment/data centers are driving accelerating revenue growth while incremental capacity utilization is driving margin expansion,\" Goldman Sachs analyst Heath Terry wrote in a note to clients last month. \"We still remain in the early stages of the shift of compute to the cloud and the transition of traditional retail online and, in our opinion, the market is underestimating the long-term financial benefit of both to Amazon.\"\nAs Buffett puts less credence on aggressive future forecasts, that is why he is probably attracted to Apple's current high level of profits versus Amazon's potential.",
        "sentiment": 0.011891275305639614
    },
    "article_2": {
        "title": "iOS 12 will reportedly include new NFC features, enable iPhones to become secure hotel room keys",
        "body": "The Information reports that Apple will be taking a big leap in iOS 12, giving some third-party developers full access to the NFC chip inside iPhones, first introduced with iPhone 6.\nThe report says Apple wants the iPhone to be used in many more contactless interactions beyond Apple Pay payments, like acting as a hotel door key or as a virtual transit card for easier transportation.\nApple started down this road with iOS 11, by adding the CoreNFC framework. This framework allows apps to use the NFC chip as an arbitrary scanner of RFID tags. However, it is very limited.\nAs well as not supporting write access, the main drawback of the current NFC APIs is that the app must be in the foreground and the app must present a specific system modal sheet to start scanning.\nThis obviously limits the use cases and convenience of the feature. What The Information describes is something more sophisticated, where an iPhone owner would simply tap their phone on a door lock to get into their hotel room.\nThis is how Apple Pay has always worked. No special app necessary, the iPhone wakes up automatically when held near the contactless terminal. The Information says Apple is already dogfooding these features at Apple Park, in a partnership with HID Global that developed the campus’ security system. Apple employees are already using their iPhones to gain access to Apple Park buildings.\nSome hotels already support simple ‘contactless’ activation of iPhone as a door key, by using low energy Bluetooth protocols. This tends to be less secure than NFC due to issues like unintended range. The new arrangement may also allow third-parties to coordinate with the secure enclave embedded inside the iPhone to store sensitive info. Adoption of such features would increase substantially if the NFC chip in iPhones was made more widely available.\nIn addition to physical room access, The Information says Apple is keen on replacing transit cards with iPhone NFC technology. It says it has discussed plans with Cubic. In the UK, iPhone customers can already travel on the Underground just by tapping their phone on the contactless terminals. iPhone 7 devices sold in Japan, and all iPhone 8 and iPhone X models, include a FeliCa chip to achieve a similar result for the transit infrastructure in Japan. Both of these existing integrations rely on thin layers above the usual Apple Pay protocols to function.\nExpect to see announcements in this field at WWDC next month, where Apple will announce iOS 12 and its other major software platforms. It is not clear whether Apple will simply add new APIs to the SDK for anyone to take advantage of, or if the new NFC features will be locked down to select partners only.\nRead the full report over at The Information.\nCheck out 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.08202256140514062
    },
    "article_3": {
        "title": "Apple: \"Starting July 2018, all iOS app updates submitted to the App Store must be built with the iOS 11 SDK and must support the Super Retina display of iPhone X\"",
        "body": "iOS 11 delivers innovative features and the redesigned App Store to hundreds of millions of customers around the world. Your apps can deliver more intelligent, unified, and immersive experiences with Core ML, ARKit, new camera APIs, new SiriKit domains, Apple Music integration, drag and drop for iPad, and more. Starting July 2018, all iOS app updates submitted to the App Store must be built with the iOS 11 SDK and must support the Super Retina display of iPhone X.\nLearn more about submitting iOS apps to the App Store",
        "sentiment": 0.7613654090091586
    },
    "article_4": {
        "title": "Apple: My request for all the data it had on me was eye-opening",
        "body": "Apple took 8 days to give me the data it had collected on me. It was eye opening.\nShow Caption Hide Caption Update your Apple privacy settings in just 5 taps Unlike Facebook and Google, Apple says it's stricter about what data it keeps and allows advertisers to see. Jefferson Graham reports on Talking Tech. USA TODAY\nHow much does Apple know about me? The answer surprised me.\nFollowing Facebook's acknowledgement that it had let a political ad targeting firm scrape the personal data of 87 million users, I rushed to see what kind of personal data the social network and Google had gathered on me. Both had more information, reaching back longer, than I had envisioned.\nSo Apple was next. I use an iPhone, iPad and two Mac computers, and Apple also offers data downloads in the privacy section of its website. It's hard to find, and once you do make the connection, you can expect a hefty wait to get the results.\nBut don't expect to stay up all night reading what Apple has on you.\nThe zip file I eventually received from Apple was tiny, only 9 megabytes, compared to 243 MB from Google and 881 MB from Facebook. And there's not much there, because Apple says the information is primarily kept on your device, not its servers. The one sentence highlight: a list of my downloads, purchases and repairs, but not my search histories through the Siri personal assistant or the Safari browser.\nFirst, the wait\nIt took eight days for my data to arrive from Apple, from a European office that is handling the privacy requests. After making the request, the iPhone maker first asked for my street address, phone number, the serial number of the iPhone, and other personal information before releasing it. This compares to Google and Facebook's data dump. They asked no questions, and the results arrived swiftly—Facebook within minutes, and Google within hours.\nWhat I got\nApple's file on me took longer but was lightweight — a testimony, according to the company, of how little it collects and stores on its individual users.\nAccording to the file, it had made time stamps of when I backed up my iPhone, when I uploaded photos to iCloud and really boring things like that. It had stored my e-mail and physical address, but not the phone number, which is odd, since the information came from the iPhone.\nIt kept a copy of every app and song I'd downloaded, every tune I'd added to my iTunes music library, and every time I needed repair on a multitude of Apple devices going back a decade.\nWhat it didn't include\nWhat Apple didn’t share with me is all the questions I've asked the Siri personal digital assistant, queries it gathers to make the artificial intelligence smarter.\nThe company says the data wouldn't tell an individual user anything, since it's not associated with him or her. Your Siri requests —\"Show me how to get to PF Chang's,\" or \"What year was Steve Jobs born?\" go back to Apple — but it uses a random identifier to mask your identity. So a Siri search for the closest Chipotle restaurant will only tell Apple that a user requested the data, but not associate it with me.\nThe company says flatly that it doesn’t want your personal information and doesn’t store it.\nOn the Safari browser on my Macs, my browsing history goes back to July 2017, but Apple says it doesn't track that information.\nAs a result, the personal download is very different from what I got from competitors Facebook and Google, which both track our moves, likes and queries in order to sell targeted advertising to sponsors.\nApple says it’s in a different business, one based on selling you products, not selling advertisers access to your attention — for the most part.\nOn a far more limited basis than Facebook or Google, Apple does sell targeted ads based on our interests in the News and App Store apps.\nTo find what Apple has on you here, you need to go to the device. Click Settings, Privacy, Advertising. Then select \"View Ad Information.\"\nOn my iPhone, Apple told me that the Washington Post and Politico are \"targeting\" me, which I guess should make me feel good as I actually read them.\nMore: You should pay attention to those privacy notices flooding your email\nMore: Facebook to let you delete data it tracks on you from apps and on the Web\nMore: 3 ways to clean up your online history on Facebook, Google and Apple's Safari\nMore: Apple co-founder Steve Wozniak says he's left Facebook over data collection\nHow to download everything Apple knows about you\nYou make the request at https://www.apple.com/privacy/contact and then choose from \"Privacy Issues,\" in the contact form. Write a sentence explaining that you want your personal data and download histories.\nThe company says it is moving to one-click requests — which would put it on par with Facebook and Google — in May, but only for European countries at first, to comply with new privacy regulations going into effect May 25th. It says it will have the easier and less confusing privacy requests here later in the year.\nMore: You should pay attention to those privacy notices flooding your email\nApple makes a big deal about its different approach to privacy on the company website, and it paints quite an effective selling proposition for buying an iPhone vs. a Samsung Galaxy or Google Pixel phone.\nPaul-Olivier Dehaye, who runs the PersonalData.IO website from Switzerland, gives Apple generally good marks for its approach to privacy. \"By keeping everything on the device, their incentives are better,\" Dehaye says.\nOverall, Apple keeps less data on me than Facebook or Google. Once you read it, it's more of a shrug.\nBut what Apple really needs to do now is not wait to take care of its customers in the United States, home to its biggest customer base, with easier tools to get our data back. Since there's so little to report that Apple keeps on us, why make it so hard?\nFollow USA TODAY's Jefferson Graham on Twitter, @jeffersongraham, YouTube and Instagram, and listen to the daily Talking Tech podcast on Apple Podcasts, Stitcher or wherever you listen to online audio.",
        "sentiment": -0.1645455161611048
    },
    "article_5": {
        "title": "Apple wins $533.3 million from Samsung in latest iPhone patent retrial",
        "body": "Nearly six years after a federal jury awarded Apple over $1 billion for Samsung infringements of iPhone intellectual properties, a jury retrying the damages portion of the case has reached a unanimous verdict, modifying the figure to $538,641,656 across five design and utility patents. The verdict comes after years of damages-only retrials and appeals, including a visit to the United States Supreme Court.\nApple Inc. v. Samsung Electronics Co. began in April 2011 with Apple’s allegation that certain Samsung smartphones infringed on iPhone inventions including patents and trademarks. Apple won the trial in August 2012, receiving an initial award of $1.049 billion, but was forced back into court for subsequent disputes over legal questions and damages. Following the first verdict, Samsung paid Apple $548 million in damages, roughly $399 million of which was at stake here.\nDuring the latest retrial, the key issue has been the appropriate definition of the phrase “article of manufacture” — specifically, whether to calculate the damages Apple suffered based solely on the specific value of five iPhone patents Samsung infringed, or upon the total value of a phone containing those innovations. If a $600 phone contained $300 of infringed Apple parts, Samsung might argue that it owed Apple damages only for the $300 portion, while Apple might say that its $300 of innovations enabled sales of $600 phones.\nThe retrial has been looming since December 2016, when the U.S. Supreme Court returned the case to a lower federal court for a jury to determine whether the entire phone or its components were the correct “article of manufacture.” Last October, the federal court ordered a jury retrial on that issue, using a new test focused on four factors:\n“[T]he scope of the design claimed in the plaintiff’s patent, including the drawing and written description,”\n“[T]he relative prominence of the design within the product as a whole,”\n“[W]hether the design is conceptually distinct from the product as a whole,” and\n“[T]he physical relationship between the patented design and the rest of the product … [whether] the design pertains to a component that a user or seller can physically separate from the product as a whole” and “the design is embodied in a component that is manufactured separately from the rest of the product, or if the component can be sold separately.”\nNot surprisingly, each side polarized its measure of damages to persuade the jury to fall somewhere in the middle. Samsung suggested damages of $28 million, while Apple asked for $1 billion, telling the jury to “put it in context: Samsung infringed millions and millions and millions of times.” The jury’s verdict included $533,316,606 for infringement of Apple’s design patents, and $5,325,050 for infringement of its utility patents, totaling just over $538.6 million. That figure sits roughly in the middle of the companies’ extremes, but is higher than the $399 million that was originally at stake in the retrial, a victory for Apple.\nFollowing the verdict, Apple said in a statement that “it is a fact that Samsung blatantly copied our design” and that it is “grateful to the jury for their service and pleased they agree that Samsung should pay for copying our products.” Samsung responded, saying that “[t]oday’s decision flies in the face of a unanimous Supreme Court ruling in favor of Samsung on the scope of design patent damages. We will consider all options to obtain an outcome that does not hinder creativity.”",
        "sentiment": -0.48995490855304524
    },
    "article_6": {
        "title": "[Engadget] Apple is reportedly pulling apps that share location data",
        "body": "It's also telling developers to update their applications before they can be relisted.\nApple is reportedly pulling apps that share location data It's also telling developers to update their applications before they can be relisted.\nApple has reportedly started enforcing an App Store rule regarding location data more stringently. According 9to5mac, the tech giant has already removed a number of apps from the Store that share users' location to third parties without their explicit consent. In the letter it sent to the affected developers, Apple told them their applications didn't comply with Legal sections 5.1.1 and 5.1.2 of the App Store Review Guidelines. Those sections state that apps must not transmit \"user location data to third parties without explicit consent from the user and for unapproved purposes.\"\nApple also told them they need to remove any code, framework or SDK used for location data collection and third-party sharing before their apps can be listed on the Store again. As 9to5mac noted, Cupertino has started cracking down on apps that violate its location data rules just before the EU's General Data Protection Regulation law takes effect on May 25th.\nOther tech titans are also preparing for its implementation. Facebook, for instance, recently made its privacy policy easier to understand following the Cambridge Analytica scandal and will also ask users to review information on the way the website uses their data. Apple might have also started enforcing those specific sections in its guidelines after high-profile fiascos that involve user location, such as what happened to MoviePass. The subscription-based movie service's chief once proclaimed the company watches \"how you drive from home to the movies.\" MoviePass quickly backtracked and ultimately removed the app's \"unused\" location features.\nWhether Apple is truly doing this to comply with GDPR is unclear -- we've reached out to the company and will update this post when we hear back.\nTurn on browser notifications to receive breaking news alerts from Engadget You can disable notifications at any time in your settings menu. Not now Turned on Turn on\nYou can see Apple's whole letter below:",
        "sentiment": -0.033244741806650865
    },
    "article_7": {
        "title": "The analysts were wrong: The iPhone X is still the most popular iPhone",
        "body": "Several companies, including Consumer Intelligence Research Partners and Mirabaud Securities, said recently — in different terms — that demand for Apple's iPhone X had been weakening in the March quarter.\nSeveral analysts and banks have suggested in recent weeks that demand for Apple's most high-end iPhone, the iPhone X, has been waning.\nBut Apple has an enormous supply chain, and the reports from a few of Apple's suppliers may have led analysts to get the wrong impression about iPhone sales for the March quarter, particularly sales of the iPhone X.\nIn fact, in Apple's earnings report for the quarter ended March 31, the company said Tuesday that the iPhone X is still outselling its other iPhones. It's unlikely that's dramatically changed in the first couple of weeks of Apple's fiscal quarter that started April 1 as some analysts have suggested. (Still, many analysts fear Apple's sales will fall off during the current quarter.)\n\"The iPhone X was the most popular iPhone each and every week of the quarter,\" continuing a trend that began when it hit store shelves in November, CEO Tim Cook told CNBC's Jim Cramer on \"Mad Money.\"\n\"The iPhone X has been a huge success and it's the first time since we split the lineup back at iPhone 6 and iPhone 6 Plus that the top model has been the top-selling model,\" Cook said.\nApple still missed estimates on iPhone unit sales. It sold 52.2 million iPhones during the quarter versus 52.54 million units expected by a StreetAccount estimate and fewer than Goldman Sachs expected. The average selling price of an iPhone during the quarter was $728 while Wall Street expected an average selling price of $742.\nChina also helped drive the iPhone X's success. Cook said the model was \"the most popular smartphone in all of China last quarter.\" (Jun Zhang of Rosenblatt Securities said in April that sales of Apple's new iPhones were cooling down in Asia.)\n\"As I predicted, Apple's iPhone X was its best-selling phone in a time that other financial analysts were saying the phone was going to be killed,\" Patrick Moorhead, president and founder of Moor Insights & Strategy, told CNBC. \"Every product line improved, led by services (31 percent) and other (38 percent) but Macs were flat. This says a few things. IPhone X has staying power and stickiness, Watch and AirPods are very successful, and services are huge, a $12 billion run-rate business. The iPhone staying power gives the company time to get its HomePod business humming while the industry awaits AR and VR to kick in the next three to five years to provide growth.\"\nMoorhead said in April that suppliers may see a decrease in orders as Apple seeks other providers for parts. KGI Securities Ming-Chi Kuo has suggested Apple may launch three new iPhones in September, including an upgraded model of the iPhone X.\nSome banks believe that decreased iPhone sales — not just the iPhone X — will be reflected in Apple's next earnings report, however. Bank of America Merrill Lynch and J.P. Morgan specifically blamed Taiwan Semiconductor's weak guidance for the March quarter. Goldman Sachs also slashed iPhone estimates for the June quarter.\n— CNBC's Anita Balakrishnan and Sara Salinas contributed to this report.",
        "sentiment": 0.0802699571232433
    },
    "article_8": {
        "title": "Today in Apple history, Steve Jobs premiers the iMac G3. A design classic.",
        "body": "May 6, 1998: Steve Jobs unveils the iMac G3, a brightly colored, translucent computer that will help save Apple.\nTen months after Jobs’ new management team takes over, the iMac loudly announces that the days of Apple quietly fading into the background are over.\nOriginal iMac launch: A computer from a good planet\nIt’s difficult to overstate just how different the iMac looked when compared to other computers at the time. Next to the gray or beige boxes built by rivals, it really stood out.\n“It looks like it’s from another planet,” Jobs said at the time. “A good planet. A planet with better designers.”\nThe designer responsible for the iMac G3 was Jony Ive, then just 31 years old. Ive had been at Apple for several years before Jobs’ return, but he was on the verge of quitting. Instead, he found so much in common with Jobs that his planned resignation turned into the pair developing a breakthrough new machine.\nThe iMac G3 was very much an update of the philosophy that drove the original Macintosh in 1984. At the time, Apple’s most affordable computer cost $2,000, almost twice what a typical Windows PC ran. Jobs initially wanted something stripped-down and affordable, through which users could access the internet.\nHowever, just as happened with the original Mac, the project became more ambitious and morphed into a statement computer. With its translucent sea-blue design (named Bondi Blue after the water at an Australian beach), the iMac G3 looked accessible and easy to use.\nNot everyone liked it, though. Some people thought it looked too toylike, especially with its terrible “hockey puck” mouse. But everyone acknowledged its distinctiveness.\niMac G3 specs: A smash hit for Apple\nIn terms of specs, the iMac G3 boasted a 233 MHz PowerPC 750 (G3) processor, 32MB of RAM, a 4GB EIDE hard drive, and a choice of either ATI Rage IIc graphics with 2MB of VRAM or ATI Rage Pro Turbo graphics with 6MB of VRAM.\nTwo other pieces of iMac G3 hardware also merit a mention.\nThe machine came with a built-in telephone modem at a time when most computers included these only as optional extras.\nIt also, notably, didn’t come with a floppy disk drive at a time when this was standard. Like Apple’s elimination of the 3.5mm headphone jack years later, this caused an uproar — until everyone realized Cupertino made the right call.\nThe iMac went on sale in August 1998 a few months after Jobs’ unveiling. By this time, the all-in-one computer racked up 150,000 preorders. The high level of interest drove Apple’s stock price to more than $40. This marked its highest point in three years.\nThe iMac G3 kicked off a new Apple era\nThe iMac’s colorful design later made its way to the iBook laptop, which also proved immensely popular. In addition, Apple released a series of iMac G3 models in alternative colors, including oddball patterns like Flower Power and Blue Dalmatian.\nApple moved away from the ultra-colorful look a couple of years later, beginning with the distinctive white iPod. For years, the look most associated with the modern iMac was a single thin slab of aluminum.\nIn 2021, Apple launched the first iMac powered by the company’s speedy (and proprietary) M1 chip. Aside from a giant performance boost from the Apple silicon, the first M1 iMacs also ushered in a top-to-bottom redesign. And they came in seven different colors — a throwback to when the Bondi Blue iMac G3 was the coolest computer around.\nDid you own the iMac G3? What did you think of it when you first saw it? Let us know in the comments below.",
        "sentiment": 0.3297502661778315
    },
    "article_9": {
        "title": "Microsoft says it would love to work with Apple to bring iMessage support to Windows",
        "body": "At its Build developer conference this year, Microsoft revealed a new “Your Phone” application that it hopes will make iOS and Android devices work better with Windows 10 PCs. The app bring things such as photos, texts, and more directly from your smartphone to your Windows PC.\nOne key missing feature, however, is iMessage support – but Microsoft says it would love to work with Apple to change that…\nIn a thorough interview with The Verge, Microsoft’s Joe Belfiore and Shilpa Ranganathan explain that some things are harder to bring to the new Your Phone application than others. Messages is one of those.\nWhile the Your Phone application will work with photos and notifications, Ranganathan says Apple makes it challenging to add support for Messages. Essentially, the vision that she offers is full support for iMessage on Windows via the Your Phone application.\nRanganathan explains that she wants to bring iMessage support to Windows 10 in a way that is respectful to the ecosystem, but also one that makes for an enjoyable experience for users:\n“Apple does make it a tad harder for messages, but we’re very willing to work with Apple,” Ranganathan says. “I want to do this in a supported way with a respect for the ecosystem we’re building on and at the same time make it a delightful experience. Messages is one where we’re not currently where we need to be compared to Android, but we need to work with Apple.”\nAt this point, however, Microsoft has not approached Apple about such a partnership – and whether or not Apple would even agree to it is anyone’s guess. On one hand, adding iMessage to Microsoft’s Your Phone application would keep people tied to their iPhone. Of course, on the other hand, Apple would much rather have people purchase a Mac with built-in support for iMessage.\nNevertheless, as The Verge notes, it certainly seems that the new Your Phone platform will launch with better support for Android than iPhone – but something tells me Apple doesn’t care. Do you think Microsoft could convince Apple to expand iMessage to Windows 10? Let us know down in the comments!\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.23018561632317655
    },
    "article_10": {
        "title": "Apple Hit with a Five Count Class Action for the MacBook Pro's 'Defective' Keyboard, the Second lawsuit on this Issue this month",
        "body": "Earlier this month a petition came to light from Charge.org that demanded Apple take action to fix their MacBook Pro's faulty keyboard. Days later the first class action was filed against Apple regarding this keyboard issue. Late yesterday Apple was hit with a second class action filed by Remy Turner (of Washington), Christopher Martin (of Florida) and Joey baruch (of California) claiming the action was taken due to Apple's \"defective\" MacBook Pro keyboard which uses a newly invented butterfly key mechanism.\nCauses for Action\nCount 1: BREACH OF EXPRESS WARRANTY\nCount 2: VIOLATION OF THE MAGNUSON-MOSS WARRANTY ACT\nCount 3: VIOLATION OF CALIFORNIA SONG-BEVERLY CONSUMER WARRANTY ACT\nCount 4: VIOLATION OF THE CALIFORNIA UNFAIR COMPETITION LAW\nCount 5: VIOLATION OF CALIFORNIA'S CONSUMER LEGAL REMEDIES ACT\nSummary of the Action\nThe class action complaint before the court begins with the Summary of Action as presented in full below:\n\"This action is brought on behalf of all persons in the United States who purchased, other than for resale, a model year 2015 or later Apple MacBook or a model year 2016 or later MacBook Pro laptop (the \"Laptops\"), which are equipped with \"butterfly switch\" keyboards (the \"Class\").\nPrior to the introduction of the butterfly switch keyboard in 2015, Apple used a \"scissor switch\" mechanism for the keyboard keys on its low-profile laptops. The keys are attached to the keyboard via two plastic pieces that interlock in a \"scissor\"-like fashion, and snap to the keyboard and the key. The scissors mechanism links the key to a plunger that depresses a rubber dome. These keyboards are generally quiet and the keys require little force to press. Because the \"scissor switch\" is a more closed design than the traditional \"rubber-dome\" keyboard design, debris is less likely to get under the keys and, by extension, into the rest of the computer. The tradeoff is that scissor-switch keys are more difficult to separate from their base than rubber-domed keys, but they can be removed and replaced.\nButterfly switch keyboards, which Apple began to use in 2015 on MacBooks and in 2016 on MacBook Pros, are even lower profile than scissor switch keyboards. They still propup the keys with two intersecting pieces of plastic, but their profile is so low that the key barely \"travels\" at all when it is depressed. True to the name, butterfly switches are also extremely delicate, held in place by four tiny threads of brittle plastic.\nBecause of their very low profile, butterfly switch keyboards are resistant to the accumulation of debris underneath the keys. However, when dust or other tiny particles do get beneath the keys, they are capable of rendering the butterfly switches nonfunctional. Further, the keys cannot be removed without risk of damage to the keyboard, which may void Apple's warranty. Most commonly, problems arise with the keyboards' spacebar keys, which cannot be removed, even by Apple's \"Geniuses\" at its stores. without risking damage to the keyboards.\nThe Laptops' defect is substantially certain to manifest. Thousands of consumers have reported sticking or non-responsive keys on their Laptops. Complaints about the butterfly keyboard are prevalent, and include blog posts, tweets, support-forum comments, a Change.org petition1, and even a satirical song and video.\nDespite its awareness of the defect, Defendant has advertised and continues to advertise the Laptops as having a superior and highly responsive keyboard, with \"four times more key stability than a traditional scissor mechanism.\" These representations were false and misleading.\nDefendant has at all times failed to disclose that the keyboard is defective, because it is prone to malfunction necessitating costly repair and replacement.\nFurther, although the Laptops come with a one-year written warranty from Defendant, Defendant refuses to honor its warranty obligations, attributing the keyboard defect to owner negligence, or advising Laptop owners to attempt home remedies, such as using compressed air on the keyboard, which it knows will not permanently repair the defect.\nResponding to hundreds of complaints on its own website, as well as on social and traditional media sites, Apple has posted a \"solution\" to the problem on its website, which is also advocated as a remedy by its \"Genius\" bar employees. The \"solution\" – which Business Insider has characterized as \"absurd\" -- requires holding the Laptop at a 75 degree angle with one hand while blowing a spray can of air at the affected keys multiple times. For many Laptop owners, the solution does not work at all; for others, it only works temporarily. When the \"solution\" does not work, or stops working, the entire lower panel of the Laptop must be replaced. And unfortunately, even replacement does not preclude recurrence of the problem.\nAll Laptops are sold with a one-year warranty from Apple. However, Apple does not fulfill its warranty obligations, instead directing many customers to self-help solutions when their defective keyboards are rendered inoperable. When Apple does provide warranty service, the keyboard replacement does not ensure a permanent fix. And for consumers outside of the warranty period, Apple denies warranty service, instead directing them to pay for the replacement at a cost of between $400 and $700.\nBy shipping and selling defective Laptops, Defendant sold and continues to sell goods that are substantially below the quality generally available in the market, are not fit for the use for which they were intended, and are not adequately packaged and labeled. Defendant also concealed and continues to conceal the problems through its marketing, advertising, and packaging of the Laptops.\"\nFor full details on this case, review the full Class Action lawsuit filing below provided to you courtesy of Patently Apple\nSecond Class Action Against Apple for Faulty MacBook Pro Using Butterfly Key Mechanism by Jack Purcher on Scribd\nToday's report covers a class action filed in Northern California, San Jose office. No Judge has been assigned to the case thus far.\nAbout Comments: Patently Apple reserves the right to post, dismiss or edit comments. Those using abusive language or negative behavior will result in being blacklisted on Disqus.",
        "sentiment": -0.4086699693463743
    },
    "article_11": {
        "title": "iOS 11.4 to Disable USB Port After 7 Days: What It Means for Mobile Forensics",
        "body": "iOS 11.4 to Disable USB Port After 7 Days: What It Means for Mobile Forensics\nUPDATE June 2, 2018: USB Restricted Mode did not make it into iOS 11.4. However, in iOS 11.4.1 Beta USB Restricted Mode Has Arrived\nA new iOS update is about to roll out in the next few weeks or even days. Reading Apple documentation and researching developer betas, we discovered a major new security feature that is about to be released with iOS 11.4. The update will disable the Lightning port after 7 days since the device has been last unlocked. What is the meaning of this security measure, what reasons are behind, and what can be done about it? Let’s have a closer look.\nUSB Restricted Mode in iOS 11.4\nIn the iOS 11.4 Beta, Apple introduced a new called USB Restricted Mode. In fact, the feature made its first appearance in the iOS 11.3 Beta, but was later removed from the final release. This is how it works:\n“To improve security, for a locked iOS device to communicate with USB accessories you must connect an accessory via lightning connector to the device while unlocked – or enter your device passcode while connected – at least once a week.”\nThe functionality of USB Restricted Mode is actually very simple. Once the iPhone or iPad is updated to the latest version of iOS supporting the feature, the device will disable the USB data connection over the Lightning port one week after the device has been last unlocked.\nAt this point, it is still unclear whether the USB port is blocked if the device has not been unlocked with a passcode for 7 consecutive days; if the device has not been unlocked at all (password or biometrics); or if the device has not been unlocked or connected to a trusted USB device or computer. In our test, we were able to confirm the USB lock after the device has been left idle for 7 days. During this period, we have not tried to unlock the device with Touch ID or connect it to a paired USB device. What we do know, however, is that after the 7 days the Lightning port is only good for charging.\nForensic Consequences of USB Restricted Mode\nRestricted USB Mode requires an iPhone running 11.3 to be unlocked at least once every 7 days. Otherwise, the Lightning port will lock down to charge only mode. The iPhone or iPad will still charge, but it will no longer attempt to establish a data connection. Even the “Trust this computer?” prompt will not be displayed once the device is connected to the computer, and any existing lockdown records (iTunes pairing records) will not be honoured until the user unlocks the device with a passcode.\nIn other words, law enforcement will have at most 7 days from the time the device was last unlocked to perform the extraction using any known forensic techniques, be it logical acquisition or passcode recovery via GreyKey or other services . Even the 7 days are not a given, since the exact date and time the device was last unlocked may not be known.\nUSB Restricted Mode and Lockdown Records\nBefore iOS 11, one could use an existing lockdown record to access the iPhone or iPad device for the purpose of creating a new local backup (logical acquisition). Essentially, this is exactly how experts perform logical acquisition in the vast majority of cases of iPhone and iPad devices that are locked with an unknown passcode. The lockdown record (a small file extracted from the suspect’s computer) allows accessing essential information about the device and initiating the backup sequence without the passcode.\nIn addition to iTunes-style backups, the lockdown record could be used for pulling media files (pictures and videos), list installed apps, and access general information about the device. Once created, the lockdown records would not expire; however, if you power-cycle or reboot the iPhone, even a valid lockdown record will be of little use until you unlock the device with a passcode because of full-disk encryption.\niOS 11 brought limitations to the use of lockdown records. In iOS 11.0 through 11.2.1, lockdown records would expire after a certain unspecified time. Once a lockdown record expired, it could no longer be used to establish communication with the iOS device; the user would need to enter their passcode on the device to establish a new pairing relationship.\niOS 11.3 further limited the lifespan of iTunes pairing records, making the records expire after 7 days.\nWhat Happens After 7 Days?\nApparently, iOS stores information about the date and time the device was last unlocked or had a data connection to a USB port. After the seven days elapse, the Lightning port will be disabled. Once this happens, you will no longer be able to pair the device to a computer or USB accessory, or use an existing lockdown record, without unlocking the device with a passcode. The only thing you’ll be able to do is charging.\nWhether or not iPhone unlocking solutions developed by GreyShift and Cellerbrite will work is still an open question.\nMitigation\nUSB Restricted Mode is aimed squarely at law enforcement, preventing device acquisition after the device has been stored for 7 consecutive days without being unlocked or connected to a (paired) computer or USB accessory. At this time, we suggest two possible mitigations.\nExtract the device during the first 7 days using a lockdown record (if available). Attempt to unlock the device during the first 7 days. Unlocking solutions (e.g. by GreyShift) will disable USB Restricted Mode if the initial connection is made while the Lightning port is still active. If a lockdown record is available, connecting the device to a paired accessory or computer may extend the time the USB port remains active. However, bear in mind that lockdown records now carry a 7-day expiry date of their own.\nIn addition, managed devices may disable USB Restricted Mode for good.\nThe success rate will receive on the condition in which the phone is delivered to the lab. If the phone was seized while it was still powered on, and kept powered on in the meanwhile, than the chance of successfully connecting the phone to a computer for the purpose of making a local backup will depend on whether or not the expert has access to a non-expired lockdown file (pairing record). If, however, the phone is delivered in a powered-off state, and the passcode is not known, the chance of successful extraction is slim at best.\nWhy Apple Needed USB Restricted Mode\nActually, it was only a matter of time. Companies such as Cellerbrite and the recent newcomer GreyShift make their business by unlocking protected iPhones. While Cellerbrite offers this exclusively as an in-house service, and the service is only available to select law enforcement agencies with proper court orders, GreyKey supplies the actual unlocking hardware to North American law enforcement. Both companies keep their lips shut as to the details of their techniques, so the exact method they use to gain access to the devices is not known to Apple. However, their ability to unlock even the latest hardware running the latest version of iOS is worrisome, so Apple is taking action with the USB Restricted Mode.\nConclusion\nIn responce to the latest developments, Apple made an attempt to prevent device exploitation. USB Restricted Mode effectively disables the iPhone or iPad Lightning ports after 7 days without an unlock. While this undoubtedly strengthens overall security of iOS devices, effectively disabling logical acquisition through lockdown records after 7 days the device has been in storage, its effect on passcode unlocking techniques developed by Cellerbrite and GreyShift is yet to be seen.\nWhat else is Apple baking in iOS 11.4? Without going through the lengthy list of bug fixes and improvements, there is the possibility of iMessage sync with iCloud being finally released in iOS 11.4. iMessage sync showed up in early betas of iOS 11.0, but didn’t make it into the final release. The feature appeared again in iOS 11.3 betas, but was stripped from the final release at the last minute. There are signs the feature might be ready for prime time in iOS 11.4. How will iMessage sync work? How will it be different from Continuity, and what challenges and benefits will it present to the mobile forensic crowd? Stay tuned to find out!",
        "sentiment": -0.2525349164268736
    },
    "article_12": {
        "title": "Developers Union urges Apple to allow free app trials, make it easier to earn a living",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nOn Friday a fledgling group calling itself the Developers Union published an open letter to Apple, calling on the company to both expand free app trials and provide developers a livable revenue cut from the App Store.\nThe group is being led by four people: Jake Schumacher, the director of \"App: The Human Story,\" developers Roger Odgen and Loren Morris, and most notably Brent Simmons, responsible for popular apps like NetNewsWire and MarsEdit. Though the Union doesn't yet have a strategy for voting, collective bargaining, or any dues, it's hoping to recruit 1,000 people this week and reach 20,000 by early June, when Apple's Worldwide Developers Conference kicks off.\nApple already permits free app trials, but only for subscription services like HBO Now. Enabling trials for all apps could help entice shoppers without making them pay for an unknown quantity.\n\"Apple owns the App Store. Apple shapes its economics,\" Simmons told AppleInsider. \"Those economics could give indies a better chance at making great apps that last — and free trials would be a big step forward. Not the only step, but an important one.\"\nOn the revenue front, the Union said it wants to \"advocate for a more reasonable revenue cut.\" Apple currently takes a 30 percent cut from most App Store transactions, the exception being subscriptions, in which case the cut can drop to 15 percent if a customer stays active long enough.\nApp Store economics are said to primarily favor games with repeatable in-app purchases. Apps with a one-time fee can fall by the wayside, especially since their creators may not have a dedicated team.",
        "sentiment": -0.011270267090627126
    },
    "article_13": {
        "title": "Apple now has over 50 self-driving cars on the road in California, expanding autonomous testing",
        "body": "Apple’s autonomous vehicle program is one of the biggest known secrets in the tech industry. While the company has yet to confirm anything, information about the project has been leaking out sporadically over the past several years.\nToday, the California Department of Motor Vehicles (DMV) has confirmed (via macReports) that Apple now has 55 vehicles and 83 drivers permitted to test autonomous vehicles.\nOne important thing to note here is that Apple has yet to apply for a separate driverless testing permit, which would allow the company to test autonomous vehicles without a person in the car. The California DMV has began issuing driverless permits in April of this year.\nTo put this into perspective, Apple had roughly 45 self driving vehicles back in January of this year. Apple’s self-driving efforts have been somewhat confusing over the past year or so, with most rumors suggesting that Apple will build its autonomous software/hardware suite but will license it to other manufacturers to use it rather than building its own Apple-branded car.\nWould you be interested in an autonomous system for your own car? Or maybe you’re in the market for a new car and are hoping Apple builds a car of its own? Let us know in the comments below!\nTop image artist rendering\nCheck out 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.045145404525101185
    },
    "article_14": {
        "title": "Apple will buy back up to $100 billion worth of shares",
        "body": "Apple said it would be increasing dividends 16 percent to 73 cents per share.\nThe iPhone maker reported earnings on Tuesday for the fiscal second quarter , which has traditionally been the quarter when Apple announces capital return programs such as share buybacks and dividends.\nApple on Tuesday announced a plan to return $100 billion to shareholders in a massive stock buyback, confirming recent optimism around tax reform.\nApple's gargantuan net income has piled up over the years, resulting in a cash reserve of $267.2 billion as of the March quarter. But until recently, the overseas portion of that money was subject to relatively high tax rates.\nNonetheless, Apple has steadily increased its dividends since its 2014 stock split. Apple said Tuesday it has returned $275 billion in total capital to shareholders since 2012.\nIt did not give a timeline for the latest buyback program.\n\"We are not giving an end date to the program this time because the amount is very, very large,\" Chief Financial Officer Luca Maestri said on the earnings call. \"We will do it at a very fast pace but we also want to do it efficiently.\"\nMaestri said that since Apple has now completed $275 billion of its $300 billion capital return program, including $200 billion in share repurchases, Apple will complete its original plan three quarters early, in June.\nThe company will also provide an update to the full repurchase program in 12 months, Maestri said.",
        "sentiment": 0.058731684461236
    },
    "article_15": {
        "title": "Apple Proved Wall Street Wrong—iPhone X Is the Best-Selling Phone in China",
        "body": "Apple sold 52.2 million iPhones during the first quarter of 2018 and posted estimate-beating revenue and earnings per share on Tuesday, dismissing Wall Street’s worry over the impact of weakening iPhone X sales on Apple’s bottom line.\nFor the quarter which ended March 31, Apple recorded $61.1 billion in revenue, up by 16 percent from last year, and $2.73 in earnings per share, up by 30 percent. Quarterly profit rose by 25 percent to $13.82 billion.\nTotal iPhone sales during the quarter, which account for more than 60 percent of Apple’s total revenue, rose by 14 percent from last year. The units of iPhones sold grew by only three percent, however, suggesting that the pricier iPhone models have been selling strong.\nAn average iPhone was sold for $728 during the quarter, up from $655 a year ago, said CFO Luca Maestri during the investor call. However, it was nearly 10 percent down from $796 in the first quarter, a sign that the iPhone X (starting at $999) wasn’t driving the majority of sales. (iPhone 8, which starts at $699, seems to have had a bigger influence on total sales.)\nApple doesn’t disclose sales breakdown for specific iPhone models, but CEO Tim Cook said he couldn’t be happier with the current state of the iPhone X.\n“Customers chose iPhone X over any other model every week during the March quarter, just as they did in the December quarter,” Cook told investors. “iPhone X is a beloved product. It’s like when a team wins a Super Bowl, maybe you expected it to win a few more points, but it’s [still] a Super Bowl winner. That’s how I see iPhone X.”\nBefore the earnings release, evidence were mounting that Apple could be slowing down iPhone X production in light of weakening sales in China, its largest overseas market. One ominous sign in particular was that Cognex, which sells technologies to factories that assemble iPhone X and generates 20 percent of its revenue from Apple, reported disappointing first-quarter earnings on Monday.\n“Cognex results provide further evidence that the smartphone cycle has turned south, the OLED overcapacity bites and Apple’s iPhone X is over,” Neil Campling, an analyst of Mirabaud Securities, told CNBC.\nHowever, Cook said iPhone X is the best-selling smartphone in China right now. Apple’s quarterly sales in the Greater China market rose by 21 percent to $13 billion, the third quarter of growth after six quarters of double-digit declines.\nOn the trade tension with China, Cook said he is optimistic about the two countries ultimately reaching a win-win situation.\n“China and the U.S. have this unavoidable mutuality where China only wins when the U.S. wins, and the U.S. wins only when China wins. And the world wins only when both countries win,” he said.",
        "sentiment": -0.07614761012557306
    },
    "article_16": {
        "title": "Razer announces entry-level eGPU enclosure with support for macOS",
        "body": "Razer has announced the Core X, a new entry-level eGPU enclosure which is compatible with Macs with a Thunderbolt 3/USB-C port.\nGive your thin and light laptop the power of a full gaming rig. Whether you’re hunting down enemies in an apocalypse or designing your own 3D world, the Razer Core X delivers desktop-class graphics to your laptop instantly. Compatible with Thunderbolt 3 Windows 10 or Mac laptops …\nRazer says that the $300 eGPU is plug-and-play, with no need for a reboot after connecting.\nIt can be used with compatible Macs running macOS High Sierra 10.13.4 or later, and its 650W power supply can also power MacBook Pro models through the USB-C connection, delivering up to 100W.\nRazer says the Core X is compatible with PCI-Express graphics cards, and lists seven Mac-compatible GPU cards.\nAMD Radeon RX 570\nAMD Radeon RX580\nAMD Radeon Pro WX 7100\nAMD Radeon RX Vega 56\nAMD Radeon RX Vega 64\nAMD Vega Frontier Edition Air\nAMD Radeon Pro WX 9100\nThe housing measures around 15 x 9 x 7 inches.\nThe Razer Core X is available today from the company’s website, and we’ll be checking it out.\nIf your preferences run more to Nvidia than AMD, there is now unofficial macOS support for the company’s eGPUs.\nCheck out 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.3825880881737579
    },
    "article_17": {
        "title": "Apple's second-largest shareholder is Berkshire Hathaway",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nBerkshire Hathaway is now Apple's third-largest shareholder, financial mogul Warren Buffett has confirmed.\nRevealed in a regulatory filing disclosing Berkshire Hathaway's U.S. stock holdings as of March 31, Reuters reports the Warren Buffett-controlled company owned 239.6 million shares in Apple. The total value of the shares possessed by Berkshire Hathaway is more than $40 billion, and represents a stake in Apple of around 5 percent.\nDuring the quarter, Berkshire Hathaway used part of the $14.8 billion investment in equities for Apple stock. Earlier this month, Buffett revealed the company had acquired close to 75 million Apple shares in the first quarter, significantly bolstering its ownership position.\nIt is unclear who in Berkshire Hathaway performed the Apple stock purchase, as the filing does not reveal that information. It is believed Buffett himself makes the firm's larger stock purchases, while investment managers Todd Combs and Ted Weschler perform smaller deals.\nThe large share purchase is a continuation of previous activities by the investment firm to own more of Apple, a company that Buffett claims produces \"sticky\" products. Before the 75 million share purchase, a regulatory filing for the fourth quarter 2017 revealed Berkshire had increased its Apple stake by 23.3 percent, becoming its largest holding at the time.\nBuffett has heaped praise on Apple in the past, calling it \"an unbelievable company\" that he believes earns \"almost twice as much as the second most profitable company in the United States.\"\nThe \"Oracle of Omaha\" has also admitted to wanting to own even more of Apple, claiming \"It was a company I liked, a business I liked, very much.\" Buffett also suggested Berkshire could easily invest in Apple more in the future, proclaiming \"I'd like to own 100 percent of it.\"\nAt a shareholder meeting, Buffett praised Apple's recent share buyback plans, loving the idea \"of having our 5 percent, or whatever it is, maybe grow to 6 or 7 percent without our laying out a dime.\" At the time, Buffett suggested more shares could be bought, if the price is right.",
        "sentiment": 0.1932659080872933
    },
    "article_18": {
        "title": "Apple invites press to WWDC 2018 keynote, iOS 12 and macOS 10.13 unveil expected",
        "body": "Apple has confirmed with press that its next media event — the opening keynote of WWDC — will take place on June 4th at 10 a.m. PT/1 p.m. ET. The keynote will be held in San Jose, California, at the McEnery Convention Center where Apple’s Worldwide Developer Conference is held.\nWWDC 2018 runs June 4th through 8th with developer sessions on Apple’s latest platform technology scheduled throughout the week, and the opening keynote is where Apple first debuts its latest platform changes.\niOS 12, macOS 10.14, tvOS 12, watchOS 5, and possibly improvements to Siri and HomePod are expected. Apple typically releases developer betas of its new iPhone, iPad, Mac, Apple Watch, and Apple TV software the same day, followed by public beta versions a few weeks later and final releases later in September.\nLast year Apple’s WWDC opening keynote also included the launch of new MacBook Pros and iMacs as well as a preview of the iMac Pro and HomePod. Hardware expectations this year are slim with a Retina 13-inch MacBook rumored for later in the year, but we’ll find out more in a few short weeks.\n9to5Mac will be attending WWDC so keep it locked here for the most detailed coverage and analysis from WWDC 2018.\nRelated Stories:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.1566308460198343
    },
    "article_19": {
        "title": "Samsung ad compares brand new S9 with iPhone 6 to mock performance throttling [Video]",
        "body": "Samsung has a history of ads that mock Apple products or customers, and its latest ad for the company’s Galaxy S9 is no exception …\nIn a clear dig at the performance throttling issue, Samsung presents the S9 as a super-fast device while portraying the iPhone 6 as visibly slow.\nIt’s a pretty ridiculous ad, as CNET notes. It not only compares a 2018 Samsung phone with a 2014 iPhone, but the performance throttling is stupidly exaggerated. Certainly for the type of activities shown, there would be no discernible lag – and you definitely wouldn’t be waiting for something like a boarding pass to load in the Wallet app.\nEarlier Samsung ads have mocked the iPhone X notch and headphone dongle, Apple’s belated decision to embrace larger screens, battery life, lack of waterproofing, and line-sitting customers.\nSamsung is unapologetic about its Apple-hating campaigns, describing them two years ago as ‘relevant, bold and right.’ It is also not above copying Apple’s own ad campaigns.\nCheck out the latest ad below.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2750030871480703
    },
    "article_20": {
        "title": "Apple Adopting OLED Displays for All Three 2019 iPhones",
        "body": "As Apple continues its shift from LCD to OLED technology for its iPhones, reports have indicated that two out of the three iPhone models planned for launch around the usual September timeframe this year will offer OLED displays – a second-generation iPhone X and a larger \"iPhone X Plus.\" The lowest-cost option is said to be a new 6.1-inch model with a similar full-face display as seen on the iPhone X, but it will reportedly be an LCD rather than OLED display.\nApple's iPhone X promotional video highlighting flexible OLED display\n\"Apple recently started planning the iPhone model in 2019 and decided to adopt OLED in all three types,\" said an official from Apple who said, \"The OLED used in the iPhone X (TEN) is a low temperature polysilicon (LTPS) LCD Quality, performance, and so on. \" Another official said, \"Apple has decided to put all the OLED on the new iPhone model in 2019.\" If the new model is more than three kinds, the LCD model may be maintained. However.\nPrevious rumors have suggested Apple will complete its transition to OLED in 2019, with all models adopting the technology. A new report from South Korea's ET News is now adding its voice to the claim Google Translate ] based on information from its sources.\nWhile this isn't the first time we've heard this rumor and it does make sense based on Apple's trajectory, it appears the financial markets are taking this specific rumor fairly seriously. Reuters notes that shares of Japan Display fell as much as 20 percent today on the news (though they have recovered somewhat and are now down 10 percent), while Bloomberg points out that Sharp's shares fell 4 percent.\nJapan Display is currently an LCD display supplier for the iPhone, and while it is moving to develop OLED technology, it will only just be starting up in 2019. That timing and lack of experience will make it difficult for Japan Display to compete against Samsung and other OLED vendors that are further along with the technology.\nSamsung is currently the sole OLED display supplier for the iPhone X, but Apple has reportedly invested billions of dollars to help LG get up and running with the technology, and LG has been rumored to be the supplier for this year's \"iPhone X Plus.\"",
        "sentiment": -0.016898698674944732
    },
    "article_21": {
        "title": "Here's all the data Apple collects on you",
        "body": "(Image: ZDNet)\nLast week, I asked Apple to give me all the data it's collected on me since I first became a customer in 2010 with the purchase of my first iPhone. That was nearly a decade ago. As most tech companies have grown in size, they began collecting more and more data on users and customers -- even on non-users and non-customers.\nThe recent Cambridge Analytica scandal revealed just how much tech companies have on us -- enough to figure out who we might vote for at the ballot box, for example.\nApple? Not so much.\nRead also: This is why Apple needs a cheaper iPhone\nApple took a little over a week to send me all the data it's collected on me, amounting to almost two dozen Excel spreadsheets at just 5MB in total -- roughly the equivalent of a high-quality photo snapped on my iPhone.\nFacebook, Google, and Twitter all took a few minutes to an hour to send me all the data they store on me -- ranging from a few hundred megabytes to a couple of gigabytes in size.\nHere's what came back.\nClose to two-dozen spreadsheets in a zip file. (Image: ZDNet)\nWhat's interesting about the data is what Apple has -- and what it doesn't.\nThe zip file contained mostly Excel spreadsheets, packed with information that Apple stores about me. None of the files contained content information -- like text messages and photos -- but they do contain metadata, like when and who I messaged or called on FaceTime.\nApple says that any data information it collects on you is yours to have if you want it, but as of yet, it doesn't turn over your content which is largely stored on your slew of Apple devices. That's set to change later this year when the tech giant will allow customers to download their data archives, largely to comply with new European data protection and privacy rules. And, of the data it collects to power Siri, Maps, and News, it does so anonymously -- Apple can't attribute that data to the device owner.\nMy entire set of data can be perused in less than an hour -- at most.\nOne spreadsheet -- handily -- contained explanations for all the data fields, which we've uploaded here. Not all the spreadsheets contained information referencing these fields, but it shows you what kind of data Apple can collect on you.\nIn the first folder, several spreadsheets contained information relating to my interactions with my devices and my content.\nRead also: iPhone of our dreams: The fixes and features Apple must deliver\nAccountDetails.xlsx contains basic information about the account holder, including name, address, phone number, and Apple ID information. It also includes when an account was created and IP address of the Apple server used to open the account.\niCloudLogs.xlsx keeps a note on every time one of your devices downloads data from iCloud, including your photo library, contacts, and Safari browsing history -- but doesn't contain the actual data.\nMailLogs.xlsx also keeps a record of each time something from your Apple device interacts with your iCloud email account, but no email content is stored here.\nTwo more files relate to Apple's flagship end-to-end encrypted messaging apps, FaceTime and iMessage. Because even Apple can't access the content of encrypted video calls and text messages, Apple can't turn over the data, but it can provide information on all the calls and messages that are routed through its servers.\nIn both the FaceTime and IDS (iMessage) logs, notes read that the logs only indicate if there was an attempt to place a FaceTime call or to send an iMessage, because both requests are sent through Apple's servers. But neither log whether the call was made or message was sent, let alone if it was successful.\nHere's an example:\n(Image: ZDNet)\nIn a separate folder, another batch of Excel documents contained information mostly pertaining to with my interactions with Apple, like downloads and support requests.\nAOS Orders contains an entire history of devices and accessories I've bought from Apple dating back to my first purchase. It also includes the five separate occasions I bought new earphones roughly once per year because my cat had chewed through them.\nCRM Installed Product is a list of every Apple device ever bought, including highly detailed information -- like serial numbers, a note on if a device is unlocked, unique networking MAC addresses for Bluetooth, Ethernet and Wi-Fi connections, and any other identifying information on a device.\nRead also: What would Steve Jobs think of today's Apple?\nCRM AppleCare Case Contact contains basic contact information on the account holder, such as name, address, and phone number -- and if the user opts into marketing emails and phone calls.\nCRM AppleCare Case Header included every interaction I've had with customer support. Every time you call, a company representatives make notes about the customer's problem, and also describes the next steps or the outcome of the call.\nYou can see how that looks here.\n(Image: ZDNet)\nCRM Warranty includes all the information on a device owner's warranty, what AppleCare coverage they have -- if any, and when warranties expire.\nDS Signons is a long list of every time you logged in to iTunes and from which specific device, and contains peripheral information like if the login failed.\nGame Center predictably contains information on all the gaming sessions a user has played or interacted with -- which in my case, as you'd expect, is limited to almost zero.\niForgot keeps a log of every time you visited your Apple ID page on the web, or reset your password.\niTunes Match Uploads retains a record of every song you've ever uploaded to iTunes Match service, which matches your music with higher quality and downloads that copy instead. The list also includes your user agent information, which can identify your device.\niTunes Match Downloads similarly keeps a list of all matched music that's later downloaded from iTunes Match.\niTunes Downloads contains a user's entire download history since the account's creation -- from apps, songs, albums, videos, and movies -- from the iTunes Store. It also includes information on which device the item was downloaded and its IP address.\nRepair Transaction Details recounts every time you put in a repair request with Apple, and includes information on what the issue is, any notes made by Apple staff, and any information that identifies the device, such as a phone's IMEI number.\nMarketing Contact includes the information that Apple uses to contact you for marketing reasons, and the reason why -- such as if the user has a developer account.\nAnd that's it -- there's really not much to it.\nRead also: iOS 11.4 looks set to be Apple's most boring iOS release to date\nAs insightful as it was, Apple's treasure trove of my personal data is a drop in the ocean to what social networks or search giants have on me, because Apple is primarily a hardware maker and not ad-driven, like Facebook and Google, which use your data to pitch you ads.\nIt takes just a few seconds to request your data. Our sister-site CNET has a quick explainer on how to get yours.",
        "sentiment": -0.32065393406559123
    },
    "article_22": {
        "title": "Apple Won 45 Granted Patents today covering an Apple Store Design, Glassimetal Nickel Alloys, AirPods Case &amp; more",
        "body": "The U.S. Patent and Trademark Office officially published a series of 45 newly granted patents for Apple Inc. today. Apple was granted an iPod patent dating back to 2009; another Glassimetal Technology patent covering nickel-iron, nickel-cobalt and nickel-copper glass forming alloys; and two more granted patents covering specific features of the AirPods case here and here. Apple's streak continues as they were granted five patents for the AirPods case in January, another in March and one in April. We wrap up this week's granted patent report with our traditional listing of the remaining granted patents that were issued to Apple today.\nDesign Patent for Apple Store\nApple's newly granted design patent covers a \"Building.\" While this particular design was used for their Zhongjie Joy City Apple Store in China, the design is of course not restricted to a single store in a single location.\nApple's granted patent D816,866 was originally filed in Q4 2015 and published today by the US Patent and Trademark Office.\nThe store was granted a design patent in China in 2015. From design to finish, the Apple store actually ended up only having two support beams as noted in the photo below of the Apple Store Zhongjie. Whether a four beam store design was implemented is unknown at this time.\nOther design patents granted to Apple today cover the MacBook Pro (D816,661); the backside of the Apple Watch for heart rate monitoring and inductive charging as noted below (D816,524); and the iPad Air Smart Case (D816,677).\nThe Remaining Patents granted to Apple Today\nPatently Apple presents only a brief summary of granted patents with associated graphics for journalistic news purposes as each Granted Patent is revealed by the U.S. Patent & Trademark Office. Readers are cautioned that the full text of any Granted Patent should be read in its entirety for full details. About Making Comments on our Site: Patently Apple reserves the right to post, dismiss or edit any comments. Those using abusive language or negative behavior will result in being blacklisted on Disqus.",
        "sentiment": -0.30983498953282834
    },
    "article_23": {
        "title": "Plaintext Apple ID passwords included in teen phone monitoring app’s data breach",
        "body": "According to a new report from ZDNet, a popular app used by parents to monitor their teens has suffered a data breach. The app, TeenSafe, touts that it’s a “secure” monitor app for iOS that allows parents to monitor text messages, location, calling history, web history, and more.\nIncluded in the data breach, the report says, was a list of plaintext Apple ID passwords…\nAccording to the report, TeenSafe left its servers – which are hosted on Amazon’s Web Services platform, unprotected. Thus, anyone could access the information without a password. After ZDNet notified the company of the glaring security lapse, it pulled the servers offline.\n“We have taken action to close one of our servers to the public and begun alerting customers that could potentially be impacted,” said a TeenSafe spokesperson told ZDNet on Sunday.\nIncluded in the TeenSafe servers was a list of the parent’s email addresses, as well as their child’s Apple ID email address. Furthermore, it included their device’s unique device identifier, and most importantly, plaintext passwords for the child’s Apple ID.\nMaking matters even more shocking, TeenSafe requires that the child’s Apple ID account have two-factor authentication turned off. This is so the parent can monitor their child’s activity without having to gain direct consent.\nNone of the accessible records included location data, photos, or messages. The company claims to have over 1 million parents using the service, though the servers housed “at least 10,200 records from the past three months.”\nShortly before the server went offline, there were at least 10,200 records from the past three months containing customers data — but some are duplicates. One of the servers appeared to store test data, but it’s not known if there are other exposed servers with additional data.\nQuestions have been raised about TeenSafe’s legitimacy in the past, primarily due to the sheer amount of data the app collects. Furthermore, teen monitoring apps such as TeenSafe have been labeled as intrusive and an invasion of the child’s privacy.\nAt this point, TeenSafe hasn’t expanded too much on the breadth of the breach, though says it has started informing affected users.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.4643327592823066
    },
    "article_24": {
        "title": "2019 iPhone may bring stereoscopic vision &amp; 3X optical zoom via 12MP triple-lens rear camera",
        "body": "Apple’s rumored triple-lens iPhone, allegedly coming in 2019, may bring 3x optical zoom and advanced 3D sensing via stereoscopic vision, one analyst speculated Tuesday.\nThat’s according to a research note from Deutsche Securities analyst Jialin Lu, mentioned in a Tuesday report from Taiwanese publication Economic Daily News (Google Translate).\nAt least one of the phones scheduled for release in 2019 is, according to the machine-translated article, “expected to have twelve million pixels 6P anti-shock specifications.” Among other perks, a 6P lens provides true optical zoom and light field camera applications.\nThe news outlet first mentioned a triple-lens iPhone last month. Having three lenses out the back would result in crisper long-exposure shots, better images in low-light conditions, as well as improved depth detection, portraiture photography and depth of field effects.\nBloomberg was first to report last November that Apple would release a triple-lens iPhone model in 2019 with enhanced augmented reality features, such as accurate depth mapping and more reliable tracking, thanks to vastly improved 3D sensing.\nAs the Cupertino technology giant is expected to keep iPhone X’s TrueDepth camera system, future iPhone models will likely sport both front and rear-facing 3D sensing capabilities.\nHaving three 12-megapixel lenses will power new photography and camera features, Lu speculated, like stereoscopic vision and 3x optical zoom capabilities on an iPhone for the first time thanks to a longer focal length without a reduction in quality like digital zoom.\nFor the comparison’s sake, Apple’s existing dual-lens smartphone models—iPhone 7 Plus, iPhone 8 Plus and iPhone X—feature 2x optical zoom.\niPhone won’t be the first smartphone with three lenses on the back, though.\nThat honor belongs to Huawei’s recently released P20 Pro device which comes outfitted with a triple-lens rear camera system comprised of a 40-megapixel lens, a 20-megapixel monochrome lens and an eight-megapixel telephoto lens with 3x optical zoom.",
        "sentiment": 0.3337050094269216
    }
}