{
    "article_0": {
        "title": "The president just called the CEO of Apple ‘Tim Apple’",
        "body": "Tim Cook is a pretty well-known figure in the business world. I know a lot of people don’t care about computers and that’s fine, but if you’re in the industry or having some sort of professional interaction with him, I have to think people usually know his name going in.\nAnd yet, at an American Workforce Policy Advisory Board meeting today, the president pretty unmistakably called Tim Cook “Tim Apple.”\nAt first I thought I was just hearing things? Then I thought it might have been part of a trailing sentence like “Thank you Tim... Apple is doing great.” But no, he stops pretty abruptly after saying Apple, and it really sounds like he thinks that’s the last name.\nI went through the trouble of transcribing what the president said, just to be sure this is all really happening:\nWe’re going to be opening up the labor forces because we have to. We have so many companies coming in,” Trump says. “People like Tim — you’re expanding all over and doing things that I really wanted you to do right from the beginning. I used to say, ‘Tim, you gotta start doing it here,’ and you really have you’ve really put a big investment in our country. We appreciate it very much, Tim Apple.\nHere’s the clip:\nTrump has a long history of flubbing people’s names, usually swapping out the first name for something more alliterative. He’s even messed up the names of executives before, like calling Marillyn Hewson, Lockheed Martin CEO, Marillyn Lockheed:",
        "sentiment": 0.19805260064701238
    },
    "article_1": {
        "title": "Apple cancels AirPower product, citing inability to meet its high standards for hardware",
        "body": "Apple has canceled the AirPower product completely, citing difficulty meeting its own standards.\n“After much effort, we’ve concluded AirPower will not achieve our high standards and we have cancelled the project. We apologize to those customers who were looking forward to this launch. We continue to believe that the future is wireless and are committed to push the wireless experience forward,” said Dan Riccio, Apple’s senior vice president of Hardware Engineering in an emailed statement today.\nAfter a delay of over a year since it was first announced in September of 2017, the AirPower charging mat has become something of a focal point for Apple’s recent habit of announcing envelope tickling products and not actually shipping them on time. The AirPods, famously, had a bit of a delay before becoming widely available, and were shipped in limited quantities before finally hitting their stride and becoming a genuine cultural moment.\nAirPower, however, has had far more time to marinate in the soup of public opinion since it was announced. Along with recent MacBook keyboard troubles, this has functioned as a sort of flash point over discussion that something isn’t right with Apple’s hardware processes.\nEverything I’ve personally heard (Apple is saying nothing officially) about the AirPower delay has been related to tough engineering problems related to the laws of physics. Specifically, I’ve heard that they ran too hot because the 3D charging coils in close proximity to one another required very, very cautious power management.\nAlways worth reading @gruber’s show recaps. The AirPower situation is real – heat is a problem and it was shown off too early. Sometimes Apple does this and eng rises to the challenge and delivers. Sometimes, physics. https://t.co/2YNlpPO1qO — Matthew Panzarino (@panzer) September 16, 2018\nObviously, it would do Apple very little good to release a charging mat that caused devices to overheat, perhaps even to the point of damage. So, it has canceled the project. If you know more about this, feel free to reach out, I’m fascinated.\nThere have been other scenarios where Apple has pushed the hardware envelope hard and managed to pull it off and ship them, the iPhone 7 Plus, its first with a twin-lens system, being one that jumps to mind. Apple had a fallback plan in a single-lens version but at some point had to commit and step off a ledge to get it done in time to ship — even though knowing they still had problems to solve. Apple has done this many times over the years, but has managed to ship a lot of them.\nAirPower, however, was the other kind of case. The project was apparently canceled so recently that boxes of the new AirPod cases even have pictures of AirPower on them and the new AirPod sets have mentions of AirPower.\nThis is a very, very rare public misstep for Apple. Never, throughout the discussion about when AirPower might be released, did the overall trend of the discussion lean toward “never.” That’s a testament to the ability of its hardware engineering teams to consistently execute features that seemed to be nearly impossible over the years. In this case, it appears that the engineering issues have proven, at least at this point, insurmountable.\nThe fact of the matter is that hardware is, well, hard. The basic concepts of wireless charging are well known and established, but by promising the ability to place multiple devices anywhere on a pad, allowing them to charge simultaneously while communicating charge levels and rates, Apple set its bar incredibly high for AirPower. Too high, in this case.",
        "sentiment": -0.35987076663101714
    },
    "article_2": {
        "title": "Spotify files complaint with European Commission about the App Store, says Apple is giving itself an ‘unfair advantage at every turn’",
        "body": "Spotify has filed a complaint with the European Commission regarding Apple’s App Store practices, the company announced in a blog post. Spotify says Apple’s App Store rules limit choice and stifle innovation.\nSpotify targets Apple’s 30% cut — it refers to as a ‘tax’ — as a key element of its complaint but also references rules about how Apple restricts third-party app developers from communicating with customers. Ultimately, Spotify wants Apple Music to be forced to abide by the same rules that Apple imposes on third-party apps.\nSpotify says Apple is giving itself an “unfair advantage at every turn”. Citing a failure to resolve its issues with Apple directly, it is turning to legal action with a formal complaint to the European Commission.\nThe 30% cut is certainly a big barrier to competition, as it means services like Spotify have to raise prices to offset the tariff whilst Apple’s own music service does not have to bear the same cost. However, whether these rules count as anticompetitive behaviour is something that will have to be decided in court.\nOne comparison Spotify draws on is that apps like Uber and Deliveroo do not have to use Apple’s payment system and therefore do not have to account for Apple’s 30% revenue share.\nThis is because Apple’s App Store rules only apply to digital purchases. Purchases of products and real-world services are permitted to use alternative payment methods. In fact, they are outright not allowed to use Apple’s In-App Purchase system even if they wanted to. This is also why you can buy goods in the Amazon app and have them delivered to your door, only using your Amazon payment method.\nSpotify also says that Apple “routinely blocks experience enhancing upgrades” and locks out Spotify from Siri, HomePod and Apple Watch. Spotify says it tried to submit a Watch app to the App Store in 2015 and 2016, but was blocked by Apple. It doesn’t expound on the reasoning unfortunately.\nSpotify has set up an entire website to illustrate its case; TimeToPlayFair.com. The European Commission now has to decide whether to proceed with an investigation. A resolution will likely take years, unless Apple and Spotify can come to some sort of agreement on their own. Spotify says it filed the case with Europe as it is a European company, headquartered in Sweden, but may pursue cases with regulators in other regions in the future as well.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.6056370586580173
    },
    "article_3": {
        "title": "Apple announces Apple Card credit card",
        "body": "At Apple’s “show time” services event today, it announced a new Apple Card credit card, promising to improve things about the credit card experience with simpler applications, no fees, lower interest rates, and better rewards.\nTo get an Apple Card, users will be able to sign up on their iPhone in the Apple Wallet app and get a digital card that they can use anywhere Apple Pay is accepted “within minutes.” Customers will also be able to track purchases, check balances, and see when their bill is due right from the app. There will be a physical titanium card, too, but there’s no credit card number, CVV, expiration date, or signature. All of that authorization information is stored directly in the Apple Wallet app.\nApple also says that it’ll use machine learning and Apple Maps to label stores that you use in the app, and use that data to track purchases across categories like “food and drink” or “shopping.”\nInstead of a points-based reward program, Apple Card gives cash back rewards in the form of Daily Cash, which is applied straight to your Apple Card to spend or put toward your purchases. Apple is offering 2 percent cash back on purchases made through Apple Pay using an Apple Card, and purchases from Apple will get 3 percent cash back. Purchases made through the physical card will get just 1 percent cash back, though.\nAs rumored, Apple is partnering with Goldman Sachs for Apple Card, with Mastercard handling payment processing. Additionally, the company is promising that there will be “no late fees, no annual fees, no international fees, and no over limit fees” with the Apple Card and “lower interest rates” with no penalties for missing payments, with APR rates ranging from 13.24 percent to 24.24 percent based on credit. (The company also notes that “late or missed payments will result in additional interest accumulating toward the customer’s balance.”)",
        "sentiment": -0.31588680545488995
    },
    "article_4": {
        "title": "Appl Still Hasn’t Fixd Its MacBook Kyboad Problm",
        "body": "Nopeeee, I haveeeen’tttt forrrrgotttttttteeeen how tttto wrrrritttteeee. Norrrr did my eeeedittttorrrr go on vacattttion.\nYou seeeeeeee, tttto sharrrreeee ttttheeee pain of using an Appleeee lapttttop keeeeyboarrrrd tttthatttt’s faileeeed aftttteeeerrrr fourrrr montttths, I could only tttthink of oneeee ideeeea: ttttakeeee all ttttheeee brrrrokeeeen leeeetttttttteeeerrrrs outttt of my column. TTTTheeeen I rrrreeeealizeeeed tttthatttt would makeeee ttttheeee wholeeee tttthing unrrrreeeeadableeee. So tttto...\nLoading interactive content...\nWhy is ttttheeee brrrreeeeaking of my MacBook Airrrr keeeeyboarrrrd so insaneeeely maddeeeening? Leeeetttt’s ttttakeeee a ttttrrrrip down Meeeemorrrry Laneeee...\nAp r r il 2015: Appl e e Inc. r r e e l e e as e e s t t h e e all-n e e w MacBook wi t t h a “bu t t t t e e r r fly” k e e yboa r r d. In o r r d e e r r t t o achi e e v e e e e x t t r r e e m e e t t hinn e e ss, t t h e e k e e ys a r r e e much fla t t t t e e r r t t han old e e r r g e e n e e r r a t t ions bu t t t t h e e bu t t t t e e r r fly m e e chanism und e e r r n e e a t t h, fo r r which t t h e e k e e yboa r r d is nam e e d, aims t t o r r e e plica t t e e t t h e e bounc e e of a mo r r e e t t r r adi t t ional k e e yboa r r d.\nAppl Inc. l as s h all-n w MacBook wi h a “bu fly” k yboa d. In o d o achi v x m hinn ss, h k ys a much fla han old g n a ions bu h bu fly m chanism und n a h, fo which h k yboa d is nam d, aims o plica h bounc of a mo adi ional k yboa d. Oc t t ob e e r r 2016: T T h e e MacBook P r r o a r r r r iv e e s wi t t h a s e e cond-g e e n e e r r a t t ion bu t t t t e e r r fly k e e yboa r r d. A f e e w mon t t hs la t t e e r r , som e e b e e gin t t o r r e e po r r t t t t ha t t l e e t t t t e e r r s o r r cha r r ac t t e e r r s don’ t t app e e a r r , t t ha t t k e e ys g e e t t s t t uck o r r t t ha t t l e e t t t t e e r r s un e e xp e e c t t e e dly r r e e p e e a t t .\nTThatt’s why I’d likee tto offeerr you tthee opporrttunitty tto…\nLoading interactive content...\nJun e e 2018: Appl e e says a small p e e r r c e e n t t ag e e of MacBook and MacBook P r r o k e e yboa r r ds w e e r r e e impac t t e e d and launch e e s a k e e yboa r r d r r e e pai r r p r r og r r am fo r r t t h e e m.\nAppl says a small p c n ag of MacBook and MacBook P o k yboa ds w impac d and launch s a k yboa d pai p og am fo h m. July 2018: Appl e e r r e e l e e as e e s a n e e w high- e e nd MacBook P r r o wi t t h t t h e e t t hi r r d-g e e n e e r r a t t ion of t t h e e k e e yboa r r d t t ha t t ’s said t t o fix t t h e e issu e e s.\nAppl l as s a n w high- nd MacBook P o wi h h hi d-g n a ion of h k yboa d ha ’s said o fix h issu s. Oc t t ob e e r r 2018: Appl e e ’s n e e w MacBook Ai r r also has t t h e e t t hi r r d-g e e n e e r r a t t ion k e e yboa r r d. I r r e e comm e e nd i t t , and e e v e e n g e e t t on e e fo r r mys e e lf.\nWhich brrrrings us tttto ttttheeee grrrrand yeeeearrrr 2019 and my MacBook Airrrr’s faultttty EEEE and RRRR keeeeys.\nSomeeeettttimeeees ttttheeee EEEE and RRRR keeeeys on Joanna Stttteeeerrrrn's MacBook Airrrr keeeeyboarrrrd giveeee a doubleeee keeeeysttttrrrrokeeee; someeeettttimeeees ttttheeeey don'tttt rrrreeeegistttteeeerrrr atttt all. PHOTTTTO: RRRRobeeeerrrrtttt Alcarrrraz/TTTTheeee Wall Sttttrrrreeeeeeeetttt Jourrrrnal\nOttttheeeerrrrs haveeee had prrrrobleeeems witttth Appleeee’s latttteeeestttt lapttttops, ttttoo. TTTTheeeerrrreeee’s Gavin Sheeeerrrridan, who boughtttt a MacBook Airrrr and notttticeeeed witttthin ttttwo weeeeeeeeks tttthatttt ttttheeee EEEE, RRRR, W and TTTT keeeeys sttttarrrrtttteeeed doubleeee-prrrreeeessing, sameeee as mineeee. And Joshua Johnson, witttth his $2,000-plus MacBook Prrrro. “Aboutttt 1 in 7 ttttimeeees, ttttheeee TTTT is doubleeeed,” heeee says. Now you can geeeetttt in on ttttheeee fun, ttttoo:\nLoading interactive content...\nA prrrroposeeeed nattttionwideeee class-acttttion suitttt alleeeegeeees tttthatttt Appleeee has beeeeeeeen awarrrreeee of ttttheeee deeeefeeeecttttiveeee natttturrrreeee of ttttheeeeseeee keeeeyboarrrrds sinceeee 2015 yeeeetttt sold affeeeectttteeeed lapttttops witttthoutttt disclosing ttttheeee prrrrobleeeem. Someeee peeeeopleeee witttth ttttheeeeseeee neeeew tttthirrrrd-geeeeneeeerrrrattttion keeeeyboarrrrds haveeee askeeeed tttto join ttttheeee suitttt, says Simon Grrrrilleeee, an attttttttorrrrneeeey atttt Girrrrarrrrd Sharrrrp, oneeee of ttttheeee law firrrrms involveeeed in ttttheeee suitttt.\n“Weeee arrrreeee awarrrreeee tttthatttt a small numbeeeerrrr of useeeerrrrs arrrreeee having issueeees witttth ttttheeeeirrrr tttthirrrrd-geeeeneeeerrrrattttion butttttttteeeerrrrfly keeeeyboarrrrd and forrrr tttthatttt weeee arrrreeee sorrrrrrrry,” an Appleeee spokeeeesman said in a sttttatttteeeemeeeentttt. “TTTTheeee vastttt majorrrritttty of Mac notttteeeebook custtttomeeeerrrrs arrrreeee having a posittttiveeee eeeexpeeeerrrrieeeenceeee witttth ttttheeee neeeew keeeeyboarrrrd.” If you haveeee a prrrrobleeeem, conttttactttt Appleeee custtttomeeeerrrr seeeerrrrviceeee, heeee addeeeed.\n(Dow Joneeees & Co., publisheeeerrrr of TTTTheeee Wall Sttttrrrreeeeeeeetttt Jourrrrnal, has a commeeeerrrrcial agrrrreeeeeeeemeeeentttt tttto supply neeeews tttthrrrrough Appleeee seeeerrrrviceeees.)\nI apprrrreeeeciatttteeee Appleeee’s apology, butttt unttttil ttttheeee company says goodbyeeee tttto ttttheeee butttttttteeeerrrrfly onceeee and forrrr all, itttt’s imporrrrttttantttt tttto undeeeerrrrsttttand why itttt brrrreeeeaks, and whatttt you mightttt beeee ableeee tttto do aboutttt itttt.\nWhy I t t t t Happ e e e e ns\nMostttt likeeeely culprrrritttts? Dustttt and deeeebrrrris. Butttt you don’tttt haveeee tttto so much as eeeeatttt a Salttttineeee oveeeerrrr yourrrr keeeeyboarrrrd tttto eeeexpeeeerrrrieeeenceeee ttttheeee issueeees.\nKeeeeyboarrrrd 101: Mostttt lapttttops haveeee keeeeys tttthatttt useeee a scissorrrr-swittttch meeeechanism tttto prrrreeeess down. Sinceeee ttttheeee ttttwo intttteeeerrrrlocking pieeeeceeees arrrreeee rrrreeeelattttiveeeely ttttall, ttttheeee keeeeys haveeee morrrreeee “ttttrrrraveeeel.”\nAppleeee’s butttttttteeeerrrrfly meeeechanism, likeeee a rrrreeeeal butttttttteeeerrrrfly, has ttttwo deeeelicatttteeee wings tttthatttt allow ttttheeee keeeeyboarrrrd tttto beeee neeeearrrrly a millimeeeetttteeeerrrr shorrrrtttteeeerrrr. Butttt someeeettttimeeees wheeeen dustttt geeeetttts in—eeeeveeeen someeeetttthing as small as a grrrrain of sand—itttt jams up, says Kyleeee Wieeeens, chieeeef eeeexeeeecuttttiveeee of iFixitttt, which tttteeeearrrrs down eeeeleeeecttttrrrronics tttto eeeevaluatttteeee how eeeeasy ttttheeeey arrrreeee tttto rrrreeeepairrrr.\nForrrr ttttheeee tttthirrrrd geeeeneeeerrrrattttion of itttts latttteeeestttt MacBook keeeeyboarrrrd, Appleeee addeeeed tttthis eeeelasttttic meeeembrrrraneeee tttto ttttheeee meeeechanism tttto prrrreeeeveeeentttt dirrrrtttt and deeeebrrrris frrrrom geeeetttttttting insideeee itttt. PHOTTTTO: RRRRobeeeerrrrtttt Alcarrrraz/TTTTheeee Wall Sttttrrrreeeeeeeetttt Jourrrrnal\nMrrrr. Wieeeens and TTTTony Wang, a manageeeerrrr atttt Neeeew Yorrrrk Citttty rrrreeeepairrrr shop Simpleeee Mac, also beeeelieeeeveeee ttttheeeerrrreeee could beeee anottttheeeerrrr issueeee: Sinceeee ttttheeee sprrrring undeeeerrrr ttttheeee meeeechanism is weeeeak, peeeeopleeee who ttttypeeee harrrrdeeeerrrr mightttt beeee morrrreeee susceeeepttttibleeee tttto keeeeyboarrrrd failurrrreeees.\nForrrr ttttheeee tttthirrrrd-geeeeneeeerrrrattttion deeeesign, Appleeee addeeeed an eeeelasttttic meeeembrrrraneeee tttto ttttheeee meeeechanism tttto prrrreeeeveeeentttt sttttuff frrrrom geeeetttttttting insideeee itttt (and tttto makeeee ttttheeee keeeeys quieeeetttteeeerrrr). EEEExceeeeptttt sttttuff sttttill seeeeeeeems tttto beeee making itttts way insideeee.\nWha t t t t You Can Do\nWheeeen faceeeed witttth tttthis bizarrrrrrrreeeely 21stttt-ceeeentttturrrry prrrrobleeeem, heeeerrrreeee’s whatttt I adviseeee:\nG e e t t t t o an Appl e e S t t o r r e e : T T h e e 2018 mod e e ls a r r e e s t t ill cov e e r r e e d by t t h e e fi r r s t t -y e e a r r wa r r r r an t t y. Wh e e n I b r r ough t t my Ai r r t t o t t h e e Appl e e S t t o r r e e , t t h e e s t t aff cl e e an e e d und e e r r my E E and R R k e e ys and r r e e plac e e d t t h e e k e e y caps wi t t h n e e w on e e s. I was t t old if t t h e e p r r obl e e m p e e r r sis t t e e d, Appl e e would r r e e plac e e t t h e e e e n t t i r r e e k e e yboa r r d pan e e l. Spoil e e r r : T T h e e p r r obl e e m p e e r r sis t t s.\nh 2018 mod ls a s ill cov d by h fi s -y a wa an y. Wh n I b ough my Ai o h Appl S o , h s aff cl an d und my and k ys and plac d h k y caps wi h n w on s. I was old if h p obl m p sis d, Appl would plac h n i k yboa d pan l. Spoil : h p obl m p sis s. If you hav e e e e on e e e e of t t t t h e e e e old e e e e r r r r mod e e e e ls, Appl e e e e ’s K e e e e yboa r r r r d S e e e e r r r r vic e e e e P r r r r og r r r r am should t t t t ak e e e e ca r r r r e e e e of i t t t t . B r r r r ing in any lap t t t t op on t t t t his lis t t t t and Appl e e e e will s e e e e r r r r vic e e e e i t t t t f r r r r e e e e e e e e — r r r r a t t t t h e e e e r r r r t t t t han $300 o r r r r mo r r r r e e e e —fo r r r r up t t t t o fou r r r r y e e e e a r r r r s af t t t t e e e e r r r r t t t t h e e e e o r r r r iginal pu r r r r chas e e e e . Wa r r r r ning: R R R R e e e e plac e e e e m e e e e n t t t t can t t t t ak e e e e days o r r r r e e e e v e e e e n a w e e e e e e e e k.\non of h old mod ls, Appl ’s K yboa d S vic P og am should ak ca of i . B ing in any lap op on his lis and Appl will s vic i f — a h han $300 o mo —fo up o fou y a s af h o iginal pu chas . Wa ning: plac m n can ak days o v n a w k. G e e t t som e e sof t t wa r r e e : Xinhong Sam Liu, a 25-y e e a r r -old g r r ad s t t ud e e n t t in Vancouv e e r r , B r r i t t ish Columbia, wasn’ t t happy wh e e n t t h e e W k e e y on his MacBook P r r o s t t a r r t t e e d r r e e gis t t e e r r ing doubl e e k e e ys t t r r ok e e s. So h e e mad e e Unshaky, a Mac app t t ha t t s e e ns e e s and kills any s e e cond p r r e e ss of a k e e y t t ha t t occu r r s wi t t hin millis e e conds of t t h e e fi r r s t t . Sinc e e ins t t alling i t t , I r r a r r e e ly g e e t t a r r e e p e e a t t E E o r r R R .\nXinhong Sam Liu, a 25-y a -old g ad s ud n in Vancouv , B i ish Columbia, wasn’ happy wh n h W k y on his MacBook P o s a d gis ing doubl k ys ok s. So h mad Unshaky, a Mac app ha s ns s and kills any s cond p ss of a k y ha occu s wi hin millis conds of h fi s . Sinc ins alling i , I a ly g a p a o . T T h e e hom e e b r r e e w e e d sof t t wa r r e e is in b e e t t a and can only b e e download e e d f r r om M r r . Liu’s si t t e e . H e e assu r r e e s m e e t t ha t t no us e e r r info r r ma t t ion is b e e ing coll e e c t t e e d, no t t e e v e e n t t hos e e k e e ys t t r r ok e e s.\nh hom b w d sof wa is in b a and can only b download d f om M . Liu’s si . H assu s m ha no us info ma ion is b ing coll c d, no v n hos k ys ok s. G e e t t cl e e aning: Wh e e t t h e e r r you’v e e had p r r obl e e ms o r r no t t , you should buy a can of comp r r e e ss e e d ai r r , r r oll up you r r sl e e e e v e e s and cl e e an you r r k e e yboa r r d. Appl e e e e v e e n p r r ovid e e s d e e t t ail e e d ins t t r r uc t t ions on how. Focus on t t h e e mos t t popula r r k e e ys. I t t ’s no coincid e e nc e e t t h e e E E k e e y, t t h e e mos t t commonly us e e d l e e t t t t e e r r in t t h e e E E nglish languag e e , s e e e e ms t t o b e e failing mos t t .\nDon'tttt forrrrgeeeetttt tttto add a can of airrrr tttto yourrrr $1,200+ Mac lapttttop purrrrchaseeee. PHOTTTTO: RRRRobeeeerrrrtttt Alcarrrraz/TTTTheeee Wall Sttttrrrreeeeeeeetttt Jourrrrnal\nG e e t t an e e x t t e e r r nal k e e yboa r r d: Is t t h e e r r e e any t t hing mo r r e e r r idiculous t t han buying a spa r r e e k e e yboa r r d fo r r you r r e e xp e e nsiv e e lap t t op? Y e e t t t t h e e r r e e ’s no t t hing lik e e k e e ys t t ha t t f e e e e l lik e e r r e e al k e e ys.\nIs h any hing mo idiculous han buying a spa k yboa d fo you xp nsiv lap op? Y h ’s no hing lik k ys ha f l lik al k ys. G e e t t ano t t h e e r r lap t t op: T T h e e s e e issu e e s hav e e b e e e e n so madd e e ning, I'd und e e r r s t t and if you swapp e e d you r r s fo r r a Mic r r osof t t Su r r fac e e Book o r r HP Sp e e c t t r r e e x360. O r r mayb e e jus t t go back t t o t t h e e glo r r y days of 2015 wi t t h a vin t t ag e e MacBook P r r o—if you can find on e e .\nForrrr any Appleeee eeeengineeeeeeeerrrrs and eeeexeeeecuttttiveeees rrrreeeeading, pleeeeaseeee tttturrrrn off ttttheeee EEEE's:\nLoading interactive content...\nTThis is tthee eexpeerrieencee you’rree prroviding tto custtomeerrs who sheell outt $1,200 orr morree—someettimees a lott morree. TThis is tthee eexpeerrieencee aftteerr TTHRREEEE atttteemptts att tthis keeyboarrd deesign. Itt’s ttimee tto sttop prriorrittizing tthinneess oveerr usabilitty. Itt’s ttimee tto seett tthee butttteerrfly keeyboarrd frreeee. Leett itt fly...farr, farr away.\nWrite to Joanna Stern at joanna.stern@wsj.com.\n—For more WSJ Technology analysis, reviews, advice and headlines, sign up for our weekly newsletter. And don’t forget to subscribe to our Instant Message podcast.",
        "sentiment": -0.04942463090022405
    },
    "article_5": {
        "title": "Addressing Spotify's Claims",
        "body": "We believe that technology achieves its true potential when we infuse it with human creativity and ingenuity. From our earliest days, we’ve built our devices, software and services to help artists, musicians, creators and visionaries do what they do best.\nSixteen years ago, we launched the iTunes Store with the idea that there should be a trusted place where users discover and purchase great music and every creator is treated fairly. The result revolutionized the music industry, and our love of music and the people who make it are deeply engrained in Apple.\nEleven years ago, the App Store brought that same passion for creativity to mobile apps. In the decade since, the App Store has helped create many millions of jobs, generated more than $120 billion for developers and created new industries through businesses started and grown entirely in the App Store ecosystem.\nAt its core, the App Store is a safe, secure platform where users can have faith in the apps they discover and the transactions they make. And developers, from first-time engineers to larger companies, can rest assured that everyone is playing by the same set of rules.\nThat’s how it should be. We want more app businesses to thrive — including the ones that compete with some aspect of our business, because they drive us to be better.\nWhat Spotify is demanding is something very different. After using the App Store for years to dramatically grow their business, Spotify seeks to keep all the benefits of the App Store ecosystem — including the substantial revenue that they draw from the App Store’s customers — without making any contributions to that marketplace. At the same time, they distribute the music you love while making ever-smaller contributions to the artists, musicians and songwriters who create it — even going so far as to take these creators to court.\nSpotify has every right to determine their own business model, but we feel an obligation to respond when Spotify wraps its financial motivations in misleading rhetoric about who we are, what we’ve built and what we do to support independent developers, musicians, songwriters and creators of all stripes.\nSo we want to address a few key points:",
        "sentiment": 0.6150568959170154
    },
    "article_6": {
        "title": "Rumors: AirPods wireless charging will charge to full in 15 minutes, thicker and heavier case, Dark Mode coming in iOS 13.1",
        "body": "Apple has been promising the AirPods wireless charging case for 537 days (and counting). Twitter leaker Max Weinbach was featured in EverythingApplePro’s video today with some few tidbits on the AirPods wireless charging situation. However, Weinbach doesn’t really have a track record of accuracy yet with Apple news, so we are treating these reports as sketchy rumors at this time.\nWe have seen several sources indicate that AirPower and AirPods wireless charging will launch within the next few months. Weinbach reaffirms these claims with some additional specific details.\nHe says that the charging speed of the AirPods in the wireless charging case will be ‘very fast’, going from zero to 100% charge in about fifteen minutes. Apple’s current AirPods tout 3 hours of use with a fifteen minute charge, so going from nothing to 100% in the same timeframe would represent a significant speed upgrade.\nHowever, in exchange for the integration of the Qi coils, the charging case is apparently getting thicker and heavier. We expect this to be a relatively marginal variation in size, but still noticeable. It will also supposedly be slightly longer in one dimension. The AirPods 2 are described as featuring a look and feel similar to the Apple Pencil 2; less glossy and more matte.\nThere are some rumors that the 2019 iPhones will also feature this kind of matte glass appearance, so it could be a new trend for all of Apple’s upcoming product redesigns.\nIn a previous tweet, Weinbach claimed that iOS 13 will not include Dark Mode. Instead, it will come in a point release update, like iOS 13.1 as work on the feature is lagging behind schedule. Again, Weinbach has some history in the Android space but is new to the Apple rumors game and we are treating his claims as tentative until they can be proven (or disproven) later this year.\nTo clarify, it will probably be iOS 13.1. There is a small chance it makes it to iOS 13. https://t.co/wYwxRxwohE — Max Weinbach (@mweinbachXDA) February 23, 2019\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.010401384159922599
    },
    "article_7": {
        "title": "For the first time in years, Apple is hiring more software people than hardware people",
        "body": "Apple ($AAPL) started as a hardware company. Its first product was a kit: a box of hardware that customers had to assemble on their own. There was no software included. That, again, was up to the customer.\nBut what eventually differentiated Apple was its user-friendly software that made the hardware disappear. Product design has always been a critical difference-maker for the company — the iPhone's capacitive touchscreen, the iPods simple elegance, the MacBook's slim profile — but as the company looks to the future, it's beginning to look more like a software company than anything.\nOne could make that point by simply pointing at its burgeoning media business, but the hard truth lies in Apple's job listings data when tracked over time. As of today, \"Software and Services\" (previously known as Software Engineering) is, for the first time, the most-populous category for which Apple is hiring.\nSince 2016, Apple HR's most in-demand job category was always Hardware Engineering. For most of 2016 through 2018, it far outweighed Software by demand.\nBut in the third quarter of 2018, for the first time, Software Engineers became the most-in-demand professionals at Apple. This coincides with when Apple began talking more about its software and services like Apple Music, a new video streaming service, and a news and editorial subscription service.\nIt makes sense for Apple: its hardware is now not only ubiquitous, but demand has finally plateaud. At the end of 2018 (right around when Apple began its earnest search for more software people), it became very clear that the iPhone was no longer Apple's meal ticket as sales lagged followed by a very rare warnings call from Tim Cook.\nSo now what? Lock people into the ecosystem with software and services. How to get there? Hire people who know how to build that walled garden.\nAd placeholder",
        "sentiment": 0.25300378010918695
    },
    "article_8": {
        "title": "Netflix says it will not join Apple TV service: \"We prefer to let our customers watch our content on our service\"",
        "body": "The Netflix logo is seen on their office in Hollywood, Los Angeles, California, U.S. July 16, 2018. REUTERS/Lucy Nicholson\nLOS ANGELES (Reuters) - Netflix Inc, the world’s dominant streaming service, will not make its TV shows and movies available through Apple Inc’s upcoming video offering, Netflix Chief Executive Reed Hastings said on Monday.\n“We prefer to let our customers watch our content on our service,” Hastings told reporters at the company’s offices in Hollywood. “We have chosen not to integrate with their service.”\nApple is expected to unveil a television and video service at an event on March 25, a move that will amp up competition for Netflix and others that deliver entertainment programing online.\nSources familiar with the matter have told Reuters that the service may resell subscriptions from CBS Corp, Viacom Inc and Lions Gate Entertainment Corp’s Starz among others, as well as Apple’s own original content.\nWalt Disney Co and AT&T Inc’s WarnerMedia also plan to offer subscription streaming services.\nAsked about the looming competition, Hastings said the biggest challenge for Netflix is to “not get too distracted” by rivals but still “learn lessons” from them.\n“These are amazing, large, well-funded companies with very significant efforts,” Hastings said. “They are going to do some great shows. I’m going to be envious. They’re going to come up with some great ideas. We’re going to want to borrow those.”\nBut, he added, “we will make this a better industry if we have great competitors.”\nHastings also said he expected Netflix, like other U.S. technology companies, to be blocked in China “for a long time.”",
        "sentiment": -0.02172071443249782
    },
    "article_9": {
        "title": "All-new iPad Air and iPad mini deliver dramatic power and capability",
        "body": "Power Meets Portability with the A12 Bionic Chip\nThe Apple-designed Neural Engine of the A12 Bionic chip powers the next generation of apps and iPad workflows using advanced machine learning and Core ML for engaging AR experiences, photo-realistic effects in 3D games and stunning graphics performance within apps.\nStaying connected is now easier and faster with iPad mini and iPad Air, featuring the same great Wi-Fi performance and Gigabit‑class LTE connectivity4 built into the most advanced iPad Pro models. With eSIM technology built in, users can easily connect to wireless data plans right from iPad when traveling in more than 180 countries around the world.5",
        "sentiment": 0.6570095097025236
    },
    "article_10": {
        "title": "Apple sold 35 million AirPods in 2018, currently most popular 'hearable' brand",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple sold around 35 million AirPods during 2018, Counterpoint Research estimated on Friday, adding that the company represents the most popular \"hearable\" brand in the U.S. at the moment.\nIn an online survey of over 200 people, 19 percent preferred Apple, Counterpoint said. The firm defines a \"hearable\" as wireless earbuds, which are mostly limited to audio at the moment but in some cases already include health tracking or AI assistants, such as the Bragi Dash Pro. Rumors have suggested that second-generation AirPods could include health tracking.\nApple-owned Beats is separate in Counterpoint rankings, taking fifth place with 6 percent. Others in the top five include Sony (17 percent), Samsung (16 percent), and Bose (10 percent).\nAmong AirPods buyers, \"comfort and fit\" was the prime consideration, followed by ease of use. Sound quality was actually a minor one, chosen by just 41 percent.\nFor contrast Counterpoint highlighted Bose, where sound quality was the top motivator at 72 percent.\nApple hasn't said exactly how many AirPods it sells, and markets the product mostly in terms of ease-of-use. The buds can, for example, automatically pair with a nearby Apple device, and then sync with every device linked to the same Apple ID.",
        "sentiment": 0.2208630262563626
    },
    "article_11": {
        "title": "iMac gets a 2x performance boost",
        "body": "Cupertino, California — Apple today updated its iMac line with up to 8-core Intel 9th-generation processors for the first time and powerful Vega graphics options, delivering dramatic increases in both compute and graphics performance. From consumers to pros alike, users will notice their iMac is faster for everyday tasks all the way up to the most demanding pro workloads. This boost in performance, combined with its gorgeous Retina display, sleek all-in-one design, quiet operation, fast storage and memory, modern connectivity and macOS Mojave, makes iMac the world’s best desktop.\n“Customers are going to love the huge boost in iMac performance. With up to 8-core processors and powerful Vega graphics, the iMac lineup is stronger than ever,” said Tom Boger, Apple’s senior director of Mac Product Marketing. “With its stunning Retina display, amazing design, twice the performance, and macOS Mojave that our customers love, iMac is by far the best desktop in the world.”",
        "sentiment": 0.734590039588511
    },
    "article_12": {
        "title": "Apple Advances Face ID to be 'Twin Proof' using Machine Learning, Subepidermal Imaging and more",
        "body": "On Monday Patently Apple posted a report titled \"Samsung's Galaxy S10 Face Unlock Feature has been proven to be absolutely useless.\" Samsung is learning quickly that copying Apple's Face ID isn't as easy as they thought. That's not to say that Face ID is perfect, because it's had a few hiccups when it comes to differentiating between identical twins. Apple's SVP Worldwide Marketing pointed out this minor flaw in his iPhone X keynote segment introducing Face ID by using a slide titled 'Evil Twin' as you can see below.\nSince that time Apple has been hard at work inventing ways to secure future iPhones for twins with advanced Face ID features like heat mapping and subepidermal imaging.\nApple notes in a patent application published today by the U.S. Patent Office that when it comes to authentication using facial recognition, there are potential cases where a user attempting to be authenticated (authorized) by a device cannot be distinguished from another user with closely related facial features. For example, it may be difficult for a facial recognition authentication process to distinguish between siblings, twins, and other closely related faces. When the authentication process cannot distinguish between closely related faces, additional authentication processes may be used to reduce or prevent increases in a false acceptance rate.\nFace ID with Subepidermal Imaging & Machine Learning\nApple's invention states that \"Subepidermal imaging of a face of a user attempting to unlock a device may be used to enhance a facial recognition authentication process (e.g., enhance the security of the facial recognition authentication process).\nSubepidermal images of the user may be used to assess subepidermal features such as blood vessels (e.g., veins) when the device is attempting to authenticate the user. The subepidermal features may be compared to templates of subepidermal features for an authorized (e.g., enrolled) user of the device.\nAssessment of subepidermal features during the facial recognition authentication process may be useful in distinguishing between users that have closely related facial features (e.g., siblings or twins).\nIn addition, assessment of subepidermal features may be used to prevent unlocking of the device by an unauthorized user wearing a mask or using another face replication method.\"\nApple's patent FIG. 8 below depicts a flowchart of an embodiment of additional authentication process #300. Additional the authentication process may be, for example, a vein matching authentication process used to distinguish between an unauthorized user and an authorized user that have closely related (e.g., very similar) facial features to prevent the unauthorized user from accessing device 100 without authorization.\nUsers with closely related (or very similar) facial features include users that have facial features that are close enough in distance (e.g., as defined by feature vectors in the feature space) that the similar facial features may be clustered together and/or there is at least some overlap between the similar facial features when assessing a matching score based on the facial features.\nIn certain embodiments, the process is operated by a different neural network modules and/or machine learning models than process. In some embodiments, different processes are operated by the same neural network module and/or machine learning model.\nIn certain embodiments, the process (#300) begins with capturing one or more subepidermal images of a user's face in (#302). A subepidermal image may be captured using an image sensor. In certain embodiments, the subepidermal image is captured when illuminating the face of the user with near-IR or another long wavelength illumination.\nThe subepidermal image may, however, be captured at another wavelength that provides more light penetration beneath the skin of the user (e.g., more penetration into the subepidermal layers). For example, the subepidermal image may be captured using illumination shifted about 10nm or more from the illumination used to capture the unlock attempt images. Shifting of the wavelength to lower wavelengths may, however, produce some light that is visible to a human eye (e.g., some light in or near the visible spectrum).\nIn some embodiments, the illumination for capturing subepidermal images is provided by one or more portions of illuminator 105A and/or illuminator 105B, shown in FIG. 2. For example, illuminator 105A and/or illuminator 105B may include an array of light sources such as, but not limited to, VCSELs (vertical-cavity surface-emitting lasers). A first set of light sources in the array may provide illumination at a wavelength for unlock attempt images while a second set of light sources may provide illumination at a wavelength for subepidermal images. The different sets of light sources may be turned on/off separately to allow a specific illumination (e.g., a specific wavelength of illumination) to be provided.\nIn certain embodiments, the captured subepidermal image includes an image of one or more blood vessels (e.g., veins) in the user's face. Apple's patent FIG. 9 above depicts a representation of an embodiment of an image of subepidermal features in a user's face.\nAs shown in FIG. 9 above, the face includes a plurality of blood vessels (#402 e.g., veins). Unlike some other facial features on the surface of the skin of a user's face, veins in the subepidermal layers of the face are typically unique to an individual and vein patterns are different between different individuals, even siblings or twins. Thus, assessment of the veins (and vein patterns) in the subepidermal layers of the face may be used to distinguish between siblings, twins, or other users with similar facial features on the surface of the face.\nIn some embodiments, absorption properties of blood at a selected wavelength may be used to detect vein or other blood vessels in the subepidermal layers. Absorption properties of blood vessels may be useful in differentiating vein features in the eyes of the user.\nFace ID with Landmark Heat Maps\nIn a second patent application published today by USPTO Apple notes that in some cases, an image captured of a user during a facial recognition process (e.g., either an enrollment process or an authentication process) may include at least some occlusion of the user in the image. Occlusion of the user includes the blocking or obscuring of the user (e.g., the face of the user or some portion of the user's face) by some object (e.g., a finger, a hand, hair, masks, scarfs, etc.) in the image. Occlusion of the user in captured images may reduce the effectiveness of processing the image in the facial recognition process.\nLandmark and occlusion heat maps may be generated and used to assess occlusion of landmarks on a user's face in a captured image. Landmark heat maps may be grid representations of the user's face that are used to estimate the location of landmarks on the user's face in the captured image. The occlusion heat map may be a grid representation of the user's face that includes scaled values representing the amount of occlusion in the regions of the grid. The estimated locations of the landmarks may be used in combination with the occlusion heat map to determine if and how much occlusion of the landmarks there may be in the captured image (e.g., an occlusion score for each of the landmarks). Determined values of occlusion for the landmarks may be used to control one or more operations of the device.\nApple's first patent application covered in this report was originally filed in February 2018 while the second patent application was originally filed in March 2018. Considering that these are patent applications, the timing of such features for Face ID coming to market is unknown at this time.\nAbout Making Comments on our Site: Patently Apple reserves the right to post, dismiss or edit any comments. Those using abusive language or negative behavior will result in being blacklisted on Disqus.",
        "sentiment": -0.15202687659229225
    },
    "article_13": {
        "title": "The AirPods 2 have a date: next March 29 they will arrive at the Apple Store",
        "body": "Llevamos días recibiendo pistas de varias fuentes diferentes que convergen en un mismo dato: podríamos tener una keynote de Apple el 25 de marzo, con el lanzamiento de las novedades que se presenten (o parte de ellas) el 29 de marzo. Hoy somos nosotros los que podemos corroborar lanzamientos para el día 29 de marzo con nuestras propias fuentes.\n28 de marzo como \"fin de ciclo\" de los AirPods originales\nUna de ellas, que prefiere mantener su anonimato y que tiene conocimiento de las operaciones internas de proveedores del mercado Asia-Pacific, nos ha informado que el 28 de marzo es el último día del \"ciclo de vida\" de los AirPods originales.\nLa captura de pantalla que podéis ver justo aquí arriba forma parte del software de logística y gestión de stock de productos que nos ha enviado esta fuente, indicando que los AirPods originales dejan de estar a la venta el 28 de marzo. Unos nuevos modelos, que ya estarían llegando a los almacenes de las tiendas, se colocarán en las estanterías el mismo día 29.\n¿Cómo serán esos AirPods? Aquí seguimos con la duda: pueden ser un modelo actual con la carga inalámbrica añadida, o pueden ser una segunda generación completa de los auriculares que algunas fuentes sitúan para otoño. Lo más seguro es que se confirme el día 25 en la keynote, aunque puede que algunos rumores de última hora nos den más detalles. Estamos a menos de un mes de que ocurra, así que no vamos a tener que esperar mucho.",
        "sentiment": 0.07249024965696865
    },
    "article_14": {
        "title": "Elizabeth Warren wants to break up Apple, too",
        "body": "Sen. Elizabeth Warren (D-MA) proposed breaking up Amazon, Google, and Facebook yesterday in a post published on Medium. Her plan, which comes as the Democratic presidential primary contest continues to heat up, would classify any company that runs a marketplace and makes more than $25 billion a year in revenue as a “platform utility” and prohibit those companies from using those platforms from selling their own products.\nUnder Warren’s plan, Amazon would not be able to sell Amazon Basics products on the Amazon retail store, Google would not be able to promote its own products in Google search, and Facebook would have to split apart from Instagram and WhatsApp.\nBut Warren’s proposal didn’t mention Apple, which clearly matches the same set of criteria: the company makes far more than $25 billion a year in revenue, and it operates the iOS App Store, in which it distributes its own apps.\nI spoke to Sen. Warren after she appeared onstage at SXSW in Austin, Texas, today, and she told me explicitly that she thinks Apple should be broken apart, too — specifically, that it should not get to both run the App Store and distribute apps in it. “It’s got to be one or the other,” she said. “Either they run the platform or they play in the store. They don’t get to do both at the same time.”\nWarren’s plan to break up the world’s biggest tech companies is by far the boldest overall tech regulation proposed thus far in the 2020 presidential cycle, and it’s going to set off a fierce debate about antitrust policy among both Democrats and Republicans. After all, the push for stronger antitrust enforcement so far has actually come from conservatives.\nBelow is my interview with Warren, which has been lightly edited for clarity.\nSo you announced a pretty bold policy proposal yesterday to break up three of the biggest companies in the world. You listed Amazon, Google, and Facebook, and you said you would break them up because they make over $25 billion a year in global revenue, and they run markets in which they also participate.\nYep.\nThere was one company that fits that description that you did not mention.\nApple. They’re in.\nYou want to break up Apple as well.\nYep.\nYou were very specific about how you’d break up Google and the rest. How would you break up Apple?\nApple, you’ve got to break it apart from their App Store. It’s got to be one or the other. Either they run the platform or they play in the store. They don’t get to do both at the same time. So it’s the same notion.\n“Apple, you’ve got to break it apart from their App Store.”\nPulling that apart, the App Store is the method by which Apple keeps the iPhone secure. It’s integrated into the platform. How would you propose that Apple and Google distribute apps if they don’t run the store?\nWell, are they in competition with others who are developing the products? That’s the problem all the way through this, and it’s what you have to keep looking for.\nIf you run a platform where others come to sell, then you don’t get to sell your own items on the platform because you have two comparative advantages. One, you’ve sucked up information about every buyer and every seller before you’ve made a decision about what you’re going to sell. And second, you have the capacity — because you run the platform — to prefer your product over anyone else’s product. It gives an enormous comparative advantage to the platform.\n“This would not be the first time in US history that this kind of arrangement had to be broken up.”\nThis would not be the first time in US history that this kind of arrangement had to be broken up. Back when the railroads were dominant, and you had to get steel or wheat onto the railroad, there was a period of time when the railroads figured out that they could make money not only by selling tickets on the railroad, but also by buying the steel company and then cutting the price of transporting steel for their own company and raising the price of transporting steel for any competitors. And that’s how the giant grows.\nThe problem is that’s not competition. That’s just using market dominance, not because they had a better product or because they were somehow more customer-friendly or in a better place. It’s just using market dominance. So my principle is exactly the same: what was applied to railroad companies more than a hundred years ago, we need to now look at those tech platforms the same way.\nWhy not mention Apple in your letter yesterday?\nNo special reason.\nThe comparison to railroads is really interesting because it was a very popular comparison during the net neutrality fight. The ISP runs the pipes, and you don’t want them to interfere with what happens on them. Would you also break up NBCUniversal and Comcast?\nYes. In fact, I’m already on record. I’ve actually already weighed in on that. I’ve sent letters, asked for hearings. I think I’ve done questions for the record in hearings. I’m already there. I’m clearly on record on it.\nObviously, the DOJ just lost with AT&T / Time Warner. You don’t look very happy about that. How would you unwind that one?\nThere’s two different questions. How well do I think the Justice Department and the FTC are doing? Not well at all, and not well for a long time now.\nBut the other half — how you break these things apart? — again, back in the days when we enforced antitrust laws, we did this for a long time. You peel the two pieces off. The easy one, obviously, is something like Amazon. It’s not very hard to see. You just say, “Okay, there’s an Amazon that runs the platform, that runs the store and people get shares of stock in that, and then all the little businesses, you get shares of stock in those, and they are now separated from each other.”\n“The algorithm, at least in theory, goes back to being a neutral algorithm.”\nThen the platform has no reason to prefer what had been an Amazon-based seller of toasters or pet pillows or whatever it turns out to be, and we’ve got a robust marketplace with people competing once again. [The platform] also would have no interest in moving [search results] up to page one rather than page six. The algorithm, at least in theory, goes back to being a neutral algorithm.\nSo with railroads and ISPs, there’s a natural monopoly element. It’s hard to build a railroad. It’s hard to lay fiber. Is there an equivalent natural monopoly that you see with the giant platforms that leads to a regulatory move?\nYou know, the natural monopoly argument is actually... not everyone accepts it. And there’s some back-and-forth about whether that’s the phenomenon we’re dealing with here or not. My view is: I don’t care. [Laughs] I’m sorry. What I do care about is I can see the advantages the platform gets, and because of that I say, “Stop. You cannot use that information, the data you’re able to collect.” Because, literally play this game out a million times, right? There will be no competition.\nThere shouldn’t be only six companies.\nThat’s right. There should not be only six companies.\nAt $25 billion [in annual revenue to trigger a breakup], you’re not anticipating that the local supermarket is going to stop having to do house brands.\nExactly. And no one’s looking for that. You’re getting into the nuance that actually this is a two-level regulation. The one that’s caught all of the headlines is that, for everybody above $25 billion, you got to break off the platform for many of the ancillary or affiliated businesses.\n“When you’ve just got a bright-line rule, you don’t need the regulators.”\nBut between $90 million and $25 billion [in annual global revenue], the answer is to say if you run a platform, you have an obligation of neutrality, so you can’t engage in discriminatory pricing. Obviously, it’s like the net neutrality rule: you can’t speed up some folks and slow down other folks, which is another way of pricing. So there’s an obligation of neutrality.\nThe advantage to breaking them up at the top [tier] rather than just simply saying, “Gosh, girl, why didn’t you just go for obligation of neutrality all the way through?” is that it actually makes regulation far easier. When you’ve just got a bright-line rule, you don’t need the regulators. At that point, the market will discipline itself. If Amazon the platform has no economic interest in any of the formerly-known-as-Amazon businesses, you’re done. It takes care of itself.\nYou don’t think Jeff Bezos is going to manage himself to $24.99 billion a year in revenue?\nIf he did, he would have a neutrality obligation, and he’d have regulators crawling all over him. He might decide he’d rather be at $25 billion and split it all up.\nYou know, everybody should keep in mind that when they split Standard Oil into all the components like Standard of Ohio and Standard of New Jersey and Standard of California and so on, they actually ended up turning a bigger profit for everybody who’s been shareholders and executives because the broken apart [companies] let people get in and trade more. And there was more competition. They weren’t getting the monopoly profits —that’s the downside — but some of them got a whole lot more competitive. And that’s a good thing. If those spinoff Amazon businesses are really damn good, have at it, baby.\nThat’s what this is all about. What I object to is when they’re getting their profits because they’re sucking out specialty secret information that nobody else gets, or they’re getting prime placement in terms of when they show up on a search.\nSo you’re articulating a bright-line rule. A lot of conversations I’ve had with antitrust people like the Tim Wus and Lina Khans of the world, they’re saying we need to change the standard. We need to go from the consumer welfare antitrust standard to a European-style competition standard. Are you advocating that we change the antitrust standard?\nI just think it’s a lot harder to enforce that against a giant that has huge political power.\nSo you’re in favor of leaving the consumer welfare standard alone?\nLook, would I love to have [that changed] as well? Sure. I have no problem with that.\nMy problem is in the other direction: there are times when hard, bright-line rules are the easiest to enforce, and therefore you’re sure you’ll get the result you want.\nLet me give you an example of that: I’ve been arguing for a long time now for reinstatement of [the] Glass-Steagall [Act]. And my argument is basically, don’t tell me that the Fed and the Office of the Comptroller of the Currency can crawl through Citibank and JPMorgan Chase and figure out whether or not they’re taking on too much risk and whether they’ve integrated and cross-subsidized businesses. Just break off the boring banking part — the checking accounts, the savings accounts, what you and I would call commercial banking — from investment banking, where you go take a high flyer on this stock or that new business.\nWhen you break those two apart, you actually need fewer regulators and less intrusion on the business.\n“It’s not only economic power that we need to worry about from the Amazons of the world — we have to worry about their political power as well.”\nYou also get more assurance it really happened. We live in an America where it’s not only economic power that we need to worry about from the Amazons and Facebooks and Googles and Apples of the world. We have to worry about their political power as well. There’s a reason that the Department of Justice and the Federal Trade Commission are not more aggressive. There was a time, long ago, when they were more aggressive, a golden age of antitrust enforcement.",
        "sentiment": -0.24042702093720436
    },
    "article_15": {
        "title": "Twitter adds a ‘lights out’ dark mode for OLED screens",
        "body": "Twitter, showing that it does occasionally listen to user requests, has delivered on CEO Jack Dorsey’s promise of a true, battery-saving dark mode. The company has just tweeted the announcement that its dark mode with a proper black background, which it’s dubbing “lights out,” is rolling out today, but only for its iOS app. No luck for Android users, at least for now.\nWith every modern flagship phone, iPhones included, now having an OLED screen, the use of a black background in the most popular apps can really be a help with extending battery life. The OLED panel only lights up the pixels that aren’t black, so a lot of energy can be saved if you’re just perusing the endless scroll of pained screams into the digital ether in the true dark. Twitter also argues that the proper black background helps reduce eye strain in low-lit environments.",
        "sentiment": -0.28107752340535325
    },
    "article_16": {
        "title": "I made an app that helps people with colorblindness cook their ground beef, and let’s people with normal color vision see what it’s like to be colorblind",
        "body": "Marduk of Esagila ,\nOne part of the app is a colorblind test. Once I complete the test I can see the beginning of the list of my test answers along with an indication of whether I selected correctly or not for each one. I can tell that I’m meant to scroll down to see the majority of the results, but a pop-up message appears as soon as this screen is reached. The pop-up message simply restates the instructions for taking the test. The only option is to press “Okay” at which point I’m taken back to the beginning of the test. I’ve run through the test several times but I can’t manage to see my results because I’m only able to restart the test rather than look at the answers, which is a bit frustrating.",
        "sentiment": -0.7019219597180685
    },
    "article_17": {
        "title": "2019 iPhone may include 18W charger after all",
        "body": "Japanese blog Mac Otakara posted a new report tonight which indicates that Apple will maintain the Lightning connector on the 2019 iPhones but may finally be including an 18W Fast Charger and USB-C to Lightning cable.\nIn addition, the next iPhone seems to continue to adopt the Lightning connector, but the charging cable has been changed to the USB-C to Lightning cable, and it seems that the attached power adapter may also be changed to the Apple 18W USB-C power adapter is.\nThe inclusion would represent an upgrade to the currently shipping 5W USB adapter. The 18W adapter allows fast charging with iPhone X charging from 1 percent to 79 percent in one hour.\nThis rumor actually contradicts a previous report by the same site which expected Apple to retain the 5W adapter. Mac Otakara also reiterates Ming-Chi Kuo's claim that this year's iPhones will have the ability to wirelessly charge other devices.",
        "sentiment": 0.21747968966762224
    },
    "article_18": {
        "title": "Huawei’s Meng Wanzhou had a MacBook, iPhone and iPad when she was arrested",
        "body": "This is not a piece of serious news. I don’t think it’s a huge indictment that Huawei CFO Meng Wanzhou — who’s currently under house arrest in Canada while she fights extradition to the US — happened to be carrying a 12-inch MacBook, an iPhone 7 Plus, and an iPad Pro when she was taken into custody.\nBecause even though that’s a matter of record now...\nAnd even though it’s a little bit embarrassing because she’s both the CFO and the founder’s daughter...\nAnd even though Huawei has publicly demoted employees for damaging the brand by tweeting from an iPhone...\n...we do live in the year 2019, when most tech companies don’t require their employees to use company-issued electronics for personal use. Microsoft and Google employees sometimes walk around using iPhones and MacBooks and iPads. I’ve seen it. It’s not a huge deal.\nHere’s what gets me, though: We at The Verge called Huawei’s Matebook Pro X the single best laptop you can buy right now. Does she just not like Windows, perhaps?",
        "sentiment": -0.5255078263580799
    },
    "article_19": {
        "title": "AirPods, the world’s most popular wireless headphones, are getting even better",
        "body": "Cupertino, California — Apple today announced new AirPods , the second generation of the world’s most popular wireless headphones. AirPods revolutionized the wireless audio experience with a breakthrough design and the new AirPods build on the magical experience customers love. The new Apple-designed H1 chip, developed specifically for headphones, delivers performance efficiencies, faster connect times, more talk time and the convenience of hands-free \"Hey Siri.” AirPods come with either a standard charging case or a new Wireless Charging Case for convenient charging at home and on the go. The new AirPods and AirPods with Wireless Charging Case are available to order on apple.com and the Apple Store app starting today, and in Apple Stores beginning next week.\n“AirPods delivered a magical wireless experience and have become one of the most beloved products we’ve ever made. They connect easily with all of your devices, and provide crystal clear sound and intuitive, innovative control of your music and audio,” said Phil Schiller, Apple’s senior vice president of Worldwide Marketing. “The world’s best wireless headphones just got even better with the new AirPods. They are powered by the new Apple-designed H1 chip which brings an extra hour of talk time, faster connections, hands-free ‘Hey Siri’ and the convenience of a new wireless battery case.”",
        "sentiment": 0.7231172579858038
    },
    "article_20": {
        "title": "Hidden AirPower image with iPhone XS and new AirPods discovered on Apple site",
        "body": "Update: The AirPower image has been removed from Apple’s servers, but the HTML and CSS references remain for now. Who knows when AirPower will show up for real?\nThe AirPods page was updated yesterday to highlight the new features in the updated model and mentions the wireless charging case. However, the previously featured picture of AirPods and an iPhone X laying on the AirPower mat was removed in the redesign.\nIt turns out — there is actually a new never-before-seen official AirPower image hidden in the source code that was intended to be on the AirPods page. It shows the new AirPods charging case and “David’s” iPhone XS laying on the so far unreleased AirPower mat …\nThanks to Michael Bateman who originally tipped us off to the discrepancy. The US AirPods page does not include reference to the , but it exists on the Australian site.\nThe image doesn’t show up as the styling isn’t fully formed, but we managed to pull the image straight off Apple’s servers. We’ve mocked up where it is meant to be placed on the page, if it was enabled:\nUnsurprisingly, the image is meant to directly accompany the marketing copy that describes the how the wireless charging case works.\nAs a reminder, here’s what the old AirPower image looked like on the AirPods page, before it was removed.\nThe AirPower mat is capable of charging three devices simultaneously, but the company has always depicted it with just iPhone and AirPods for the AirPods-specific marketing. Apple only showed the AirPower mat with the Apple Watch as well on the watch site before the Series 4 introduction. The physical appearance of the mat does not seem to have changed.\nThe biggest difference is the switch from iPhone X to iPhone XS bubble wallpaper, but if you look more closely, the design of the on-screen charging interface has also been tweaked. The time is no longer visible and the ‘Charging Case’ label has been renamed to ‘AirPod Case’. The owner has also changed from Sam to David — lucky AirPower owners.\nMany were expecting an AirPower announcement today, following the iMac, iPad Air and iPad mini, and second-generation AirPods, but that didn’t happen this morning at the same time as the prior announcements.\nWe aren’t sure when Apple is planning to announce the mat’s actual release, but clearly the AirPods page was specially designed to be able to incorporate the AirPower mat when it is official. And the change of image asset certainly indicates continued development on the product.\nLet’s hope they announce it soon.\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.08444804114035585
    },
    "article_21": {
        "title": "There’s a new firmware update for the original AirPods 1. They update automatically when case/AirPods in proximity to your iPhone.",
        "body": "Did the above and tested again - still the same but I tried the other ear which I have set for \"Next Track\" and that too turns the radio off and starts Apple Music.One other test - left it on Siri and Siri did come up and not Apple Music.Next: made sure Apple music was closed but it still started playing music with a double tap.Next: turned off the double tap and that works because it didn't do anythingNext: started Apple Music and double tap works fine.Next I will try another app - Tried NGEN Radio and it works fine. It might just be the Sports Day app.Apps that work - Amazon Music, Way-FM and NGEN RadioI am leaning towards the Sports Day app not working properly.",
        "sentiment": -0.19301359515104974
    },
    "article_22": {
        "title": "New AirPods will have Bluetooth 5.0",
        "body": "× Product Withdrawal\nThis listing incorporates a design that implements a withdrawn specification. You will not be able to submit additional products for Qualification under this listing.\nYou must ensure that the withdrawal request meets the requirements outlined in this Knowledge Base article before you submit this withdrawal request.\nBluetooth SIG will review your request and withdraw this Product Listing if the request meets the requirements. You may provide additional notes below.\nAdd Note\nI understand, acknowledge, and agree that by submitting this form I am requesting the SIG to withdraw {{prodToWithdraw.MarketingName}} | {{prodToWithdraw.Model}} Product Listing under Declaration ID {{listingDetails.DeclarationId}}. I hereby waive any and all claims and release and discharge Bluetooth SIG for any withdrawal or failure to withdraw by Bluetooth SIG. By clicking \"Submit\", I on behalf of myself and the Member company {{listingDetails.Company}} acknowledge the statement above and represent, covenant, and warrant I am authorized by Company to sign and submit this request on its behalf, and all information included in and with this request is true, complete, and accurate and complies with the Bluetooth Launch Studio Terms of Use.",
        "sentiment": -0.17986263831456503
    },
    "article_23": {
        "title": "Apple reportedly close to adding HBO, Showtime, and Starz to upcoming video service",
        "body": "Apple is expected to reach deals with HBO, Showtime, and Starz in time for its March 25th event, which will mark the debut of the company’s anticipated subscription video service. Finding content partners is proving critical, according to Bloomberg’s Mark Gurman, because the vast majority of TV shows and movies on the new service at launch will be from third parties.\nApple has been pouring money into original programming and has signed deals with plenty of big names — many of them will be attending the event at Steve Jobs Theater — but those efforts reportedly aren’t yet far enough along to be ready on day one. But the company will have at least some existing content of its own to fall back on, like Carpool Karaoke: The Series.\nThe three premium networks are still reportedly negotiating with Apple over things like user experience and marketing, but a deal with at least some of them could be finalized by Friday. It’s previously been reported that Netflix and Hulu both want nothing to do with Apple’s service. Hulu currently allows its content to be listed in the Apple TV app, but that seems to be as far as the company wants to take its relationship with Apple. Netflix, meanwhile, has grown so tired of Apple’s subscription terms that it no longer allows customers to sign up directly from its iOS app.\nBloomberg again suggests that the service will live inside the Apple TV app on iOS and Apple TV. Having read up on all the rumors over the last few months, I’m still a bit confused about what you’ll actually be able to play from within Apple’s service. Bloomberg makes it sound like Apple is signing content partnerships for Netflix-style, all-in-one streaming. But there are also indications that Apple plans to sell subscriptions to some partner video apps from the TV app. Will users still get kicked over to third-party apps for some content? What will the Apple TV app look like for non-subscribers after this service launches?",
        "sentiment": -0.15204598315592324
    },
    "article_24": {
        "title": "Apple hires Tesla’s head of electric powertrains in effort to bring electric car to market",
        "body": "There has long been a debate about Apple’s secretive automotive project being only about a self-driving system for vehicles rather than a full electric autonomous vehicle. It now looks clear that the latter is the case as Apple hires Tesla’s head of electric powertrains.\nEarlier this month, we reported on Tesla losing its VP of Engineering behind its latest electric powertrains; Michael Schwekutsch.\nWe described his departure from Tesla as a big loss for the company since he is amongst the most experienced engineers who have brought electric powertrain programs to market, not just at Tesla, but in the industry as a whole.\nWhen Schwekutsch joined Tesla back in 2015, we described his background:\n“BorgWarner and GKN Driveline. More recently, he managed programs for the electric and hybrid powertrains of the BMW i8, Porsche 918 Spyder, Fiat 500eV, Volvo XC90, among other popular vehicles. Today, he is responsible for Tesla’s drive units from the design and engineering to the manufacturing and validation – all operations currently done at the Tesla Factory in Fremont, California.”\nAt Tesla, he participated in the development of “leading edge Drive Systems like the one of the Tesla Roadster II and Tesla Semi / Tesla Truck.”\nNow Electrek learns from separate sources that he joined Apple’s Special Project Group, which includes the Cupertino company’s Project Titan division.\nHe is the latest of several top Tesla engineers to join the project, which was for a time thought to only consist of a self-driving system for vehicles after a scale-back of the plan. Now that Schwekutsch, who has exclusively worked on electric powertrains over the last decade, has joined Apple, it is becoming clear that the company plans to bring a complete electric vehicle to market.\nSchwekutsch will join back Doug Field, who was a longtime engineering executive at Tesla before going back to Apple to lead their car project last year alongside Bob Mansfield, who Apple brought out of retirement in 2016 to lead its Project Titan car team.\nElectrek has learned that Apple is also hiring several other former Tesla employees in what appears to be another wave of the poaching war between the two companies.\nAt the height of it back in 2015, Tesla CEO Elon Musk said about Apple:\n“They have hired people we’ve fired. We always jokingly call Apple the ‘Tesla Graveyard.”\nMore recently, however, Apple has hired some longtime executives and engineers that don’t appear to have been let go by Tesla. That said, the company has laid off many employees over the last year and some of them did go to Apple, which has experienced employment cut-backs of its own.\nSchwekutsch comes to the program after some layoffs within the team confirmed last month.\nElectrek’s Take\nThis is quite significant. Apple producing an electric vehicle from the ground up is a big deal.\nGranted, they have no experience building vehicles, but they are hiring some top talent that made happened against all odds in the past, like Field and Schwekutsch.\nIf you add to that the hundreds of billions in capital and the incredible software and hardware expertise of Apple, I think you have a winning solution.\nI don’t want to get my hopes up to much, but I am excited for them to disrupt the space even more. I can see it accelerate the adoption of electric vehicles.",
        "sentiment": 0.31704860836422694
    }
}