{
    "article_0": {
        "title": "In 2020, Apple needs to change iPhone’s call UI because robocalls are killing us",
        "body": "A year ago I published this and it struck a chord on the internet, hitting #4 on Reddit and #1 on HN (it actually triggered the “flamewar” detector there). So I thought I’d republish the post since the default UI for incoming calls remains the same. Otherwise, what’s publicly changed on Apple’s side of things (other than this alleged email response from an exec) includes some tools for filtering unknown callers, which look helpful but aside from the original gripe. Some very incremental progress has been made on the carrier side, but the original post was specifically aimed at iOS’ outdated UI so it still seems relevant.\nRight now, any robocall hacker in the world can instantly take over your phone’s screen, knocking you out of your mobile gaming experience, disrupting you as you check out at the store, or breaking your concentration as you try and type out an email. (For that matter, calls from your contacts will also perhaps be more disruptive than you’d like them to be.)\nAnd disrupt they do, at a massive scale. Several billion fake calls are received each month in the US. Reports show this is a global problem, with Brazilians averaging 37 spam calls per month. Actually, I’m getting a robocall as I type this very sentence, my second today.\nAt the telelphony-infrastructure level, it’s a supremely difficult problem that lacks a short-term fix because the underlying protocol is hopelessly insecure.\nBut from a user-experience perspective, there’s a simple way to make things more manageable. Apple should let incoming calls show up as a banner notification, not a full screen alert.\nWhat was magical in 2007 has become a major annoyance\nIt’s absolutely bonkers that millions of smartphone users get their full screen taken over by robocallers on a daily basis. Tapping Decline is not a great option because it actually tells the robocaller that you’re with your phone and are annoyed by the call, information I’d rather not give.\nThe jailbreak community for iOS saw this need years ago, and an app called CallReply tweaked the phone UI to let incoming calls appear as banner notifications.\nWhen will Apple follow suit?\nOne commenter on Hacker News pointed out: “This annoyance is three-fold when a call from your iPhone also takes over your iPad screen and rings on your MacBook.”[1] Fair point!\nAnother exclaims there’s lack of call filtering options available in iOS, I completely agree – as blocking individual numbers is totally ineffective in blocking robocall spam. “I would love to be able to block all numbers coming from my area code and the first 3 digits of my number.. all my robo calls come from a number that looks just like mine.” [2]\nAnother points out, the carriers could taking some steps to limit robocalls, but may be dragging their feet because it’s (arguably) in their commercial interests to let it flourish. While I agree there’s a lot more the carriers could be doing to flag “inauthentic” behavior of network participants, the root cause of SS7’s lack of authentication and encryption will remain. But yes, carriers are definitely on the hook for making things better too. [3]\nYet another commenter remarks about how Google has dealt with this issue: “Fwiw, Android actually does do this. When the phone is unlocked, calls show up as a banner. In addition, they added that new call screening option, I’ve been using it and so far it has worked fairly well. Also, there is some built-in call filtering and third party apps as well, though I have mostly been able to rely on the built-in filtering. Does iOS really not have any options for filtering? I swear last time I had an iPhone (running iOS9) there was Something… but then again, I was jailbroken. It’s a bit funny that we got full web browsers on phones before proper call filtering. (Disclaimer: I work for Google but not on phones.)” [4]",
        "sentiment": -0.4181806405129678
    },
    "article_1": {
        "title": "iFixit Mac Pro 2019 Teardown: “beautiful, amazingly well put together, and a masterclass in repairability”",
        "body": "The Mac is back and more Pro than ever, throwing away the cylindrical “trash can” design in favor of something that resembles a computer. Its appearance may harken to the original Mac Pro from 2006, but can it compare in the repairability department? We dropped six thousand dollars and one block of hard cheddar to find out. Let’s tear it down.\nYearning for more teardowns? Follow us on Instagram, Twitter, and Facebook for all the latest teardown and repair news. For news delivered, sign up for our newsletter.",
        "sentiment": -0.09982798248529434
    },
    "article_2": {
        "title": "BMW No Longer Charging Monthly Fee for CarPlay in Cars With Newest Software",
        "body": "BMW in early 2018 decided to begin offering BMW customers CarPlay access for a subscription fee rather than a one-time fee, requiring BMW owners to pay $80 per year to use ‌CarPlay‌ after the first year of owning a BMW vehicle.\nNo other car manufacturer that offers ‌CarPlay‌ charges a monthly fee, so this change was understandably unpopular with BMW customers. Prior to the subscription fee, BMW charged a one-time $300 upgrade fee.\nGiven the negative sentiment over the subscription charges, BMW is now changing its plans. According to a BMW spokesperson that spoke with British site AutoCar, BMW will now offer ‌CarPlay‌ for free for the lifetime of the car on all models that have the latest ConnectedDrive infotainment system installed.\nModels that do not use the latest system, such as the i3 and the i8, will now require a one-time fee instead of the subscription access. Going forward, in vehicles with the new system, ‌CarPlay‌ will be available at no cost.\nU.S. site Autoblog has confirmed that BMW is also making this change in the United States. \"BMW is always looking to satisfy our customers' needs and this policy change is intended to provide BMW owners with a better ownership experience,\" a BMW spokesperson told Autoblog after being asked why the change was made.\nIt's not yet clear when BMW customers who already pay for a subscription will be able to stop paying for ‌CarPlay‌ access, nor is there word on whether BMW will be reimbursing customers who already paid for a longterm ‌CarPlay‌ subscription.",
        "sentiment": -0.5589983761310577
    },
    "article_3": {
        "title": "AirPods to hit quarterly sales of $4B, surpassing peak iPod sales",
        "body": "AirPods are set up to have an amazing holiday quarter and a new research note predicts that they will soon overtake the $4 billion quarterly revenue that Apple saw at the peak of iPod in 2007.\nAsymco published a research note today looking into the potential quarterly revenue from Apple’s Wearables, Home, and Other category. While last year was when Apple Watch surpassed $4B in revenue for a quarter back in Q4 2018, now it looks like it may be AirPods‘ turn.\nAsymco notes that it’s tricky to tell exactly what the revenue of any individual product in the Wearables and Home category is since Apple doesn’t break out the numbers. But by estimating Watch revenue and subtracting it from the total category figure, you can arrive at an estimate for AirPods.\nThe problem lately has been that AirPods have become huge unto themselves. There is literally no information about AirPods sales as a product category. The only option is to guess Watch and subtract it from Wearables and then guess again the portion of “non-Watch Wearables & Home” that is AirPods.\nBased on those numbers, AirPods could overtake the peak iPod revenue of $4 billion next quarter. Asymco also believes Apple will see over 50% growth year over year for Wearables.\nLooking forward to the next quarter, I am expecting a 51% increase y/y for Wearables and 24% growth in Watch. This results in a Watch revenues about $5.2 billion and non-Watch $5.7 billion. Now if we assume $1.7 billion for non-Watch-non-AirPods (i.e. Apple TV, HomePod, Beats, iPod, other) then this quarter AirPods will have overtaken peak iPod.\nLast month Bloomberg reported that Apple was doubling its AirPods Pro production and we previously detailed why AirPods are positioned to dominate the holidays more than ever before.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.009497150545939803
    },
    "article_4": {
        "title": "iPhone XR has been the best-selling smartphone every quarter this year",
        "body": "The iPhone XR was the best-selling smartphone in Q3 2019, meaning it has been the best-selling model every quarter so far this year, according to Counterpoint Research.\nIts launch midway through Q4 2018 meant it didn’t top the lists that quarter, but it has done so ever since, comfortably beating out the base model iPhone 11…\nThe company said that the iPhone 11 managed fifth place in its own launch quarter.\nAccording to Counterpoint Research’s Market Pulse, the iPhone XR was the top-selling model globally in Q3 2019, capturing 3% market share. In fact, except for the launch quarter in September 2018, iPhone XR has been the top-selling model globally in every quarter since Q4 2018. The XR alone contributed to over one-quarter of the total Apple sales during the quarter, making it the best-selling model for Apple across all regions. Apple also adjusted the price of the iPhone XR in China and several other markets, which helped keep demand strong during the quarter. The iPhone 11 also made its debut in the top 10 within the launch quarter.\nThe top 10 best-selling smartphones in Q3 comprised two iPhones, three low-end Samsung models, and a mix of Chinese brands:\niPhone XR\nSamsung Galaxy A10\nSamsung Galaxy A50\nOppo A9\niPhone 11\nOppo A5s\nSamsung Galaxy A20\nOppo A5\nXiaomi Redmi A7\nHuawei P30\nWhile Samsung appeared to have pushed buyers up through its range, the reality was that it simply dropped the prices of its former “mid-range” A-series models to become the new low-end phones.\nSamsung had three models in the top 10, all from the A series. Samsung discontinued its J series and brought the A series to lower price tiers. A series had a more premium perception than the J series. The new devices came with competing specs and design features, affordable price and Samsung’s strong brand perception (especially in the mid-segment) which provided an excellent value proposition to consumers. This was also strategically aligned with global trade-up trend. The A-series also gained some share from HONOR. However, there were no flagships from Samsung in the top 10 list.\nXiaomi’s single showing in the top 10, was thanks to India.\nXiaomi had Redmi 7A in the top 10. This was driven by India, which contributed to over half of the total sales of the model during the quarter.\nIf you’re wondering which iPhone to buy, check out our video comparison of the current line-up, as well as a direct comparison between the iPhone XR and iPhone 11.\nTop image: Shutterstock\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.3300702722654456
    },
    "article_5": {
        "title": "Apple earned 66% of the entire smartphone market's profits in 2019",
        "body": "Apple's iPhone 11\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nResearch claims that while the entire market's smartphone profits declined by around a tenth in 2019, Apple continued to dominate with 66% of all profits and the nearest competitor being Samsung on just 17%.\nThe global profits from cell phone sales fell by 11% in the third quarter of 2019, earning companies an estimated total of $12 billion. Apple has again dominated those profits, though, earning a reported 66% or almost $8 billion. When compared to revenue instead of profits, Apple remains in the lead with 32%.\nAccording to Counterpoint Research, the remaining 34% of profits was chiefly divided between Samsung, Huawei, Oppo, Vivo and Xiami. Of all of these, Samsung was the closest to Apple, but it only earned 17% of the profits.\nThese figures are broadly similar to 2018's, and like that year's, doesn't include companies that didn't turn a profit. But, 2019 marks growth for Samsung, which Counterpoint ascribes chiefly to the launch of the Galaxy Note 10 Series.\nThe research firm believes the overall decline in smartphone profits in the last quarter is because premium smartphones are facing greater competition from mid-tier devices.\nCounterpoint also reports that Chinese brands are expanding outside China, and that they are providing flagship phones at more affordable prices. These firms are also said to be looking at providing an ecosystem that includes financial services.\nThe most profitable smartphone handset companies. (Source: Counterpoint)\nThe ability of Chinese firms to increase their profits has been hampered, however, by users holding on their devices for longer — and Apple introducing price cuts and trade-ins.",
        "sentiment": -0.17232998806451047
    },
    "article_6": {
        "title": "Apple Pulls Emirati Chat App 'ToTok' From App Store for Allegedly Spying on Users",
        "body": "Apple has removed messaging app \"ToTok\" from the App Store after an investigation by the New York Times concluded that the app was actually a spying tool being used by the United Arab Emirates government to mass surveil its citizens.\nAccording to the report, which cites U.S. officials familiar with a classified intelligence assessment, the app was being used to mine data from users' contact lists and track locations by offering a localized weather forecast.\nToTok's privacy policy notes that it \"may share your personal data with group companies,\" but it turns out that the app is linked to Abu Dhabi-based cybersecurity firm DarkMatter, which is under investigation by the FBI for possible cybercrimes. A U.S. intelligence assessment also linked ToTok to Pax AI, an Abu Dhabi-based data mining firm.\nIn the time that it was available on the ‌App Store‌ and the Google Play store, the app was downloaded by millions of users in the Middle East, North America, Europe, Asia and Africa. The app was particularly popular in the UAE, where other messaging apps like WhatsApp and Skype are partially blocked. Users who installed the app on their devices are being advised to remove it, as any surveillance capacity could still potentially operate unhindered.\nThe UAE has reportedly been using surveillance technology to crack down on internal dissent in the country, including hacking Western journalists and holding human rights activists in solitary confinement over Facebook posts.\nIt's not the first time we've heard reports that apparently legitimate apps are being used as fronts for governments to spy on their citizens. An October report from the Open Technology Fund (OTF), an initiative funded by the U.S. government, revealed that an \"educational\" app teaching the Chinese Communist Party's policies includes code that amounts to a backdoor into users' Android devices.\nA separate report elaborating on the findings said that the app, known as \"Study Xi, Strong Nation,\" essentially gives the Chinese government the capacity to determine \"the location of every citizen at any single point in time.\"",
        "sentiment": -0.43599481220272457
    },
    "article_7": {
        "title": "Florida man who had ‘no idea what AFib was’ saved by Apple Watch during holiday travel",
        "body": "Today brings yet another story of the Apple Watch helping save someone’s life. ABC News tells the story of Roy Robinson, a 74-year-old man from Lake Worth, Florida whose Apple Watch alerted him to potential atrial fibrillation.\nRobinson was visiting his family in Baltimore for the holidays last week. He and his wife Dale went to visit their granddaughter at school, which involved climbing several flights of stairs. When they reached the third floor, Roy was feeling especially out of breath, something that’s unusual for him:\nRobinson’s wife, Dale Robinson, knew something was off when they visited their granddaughter at school. “She wanted to show us her classroom, so he went up to the third floor, and he was out of breath when he got there which is very unlike him.\nAround that same time, Roy got an alert from his Apple Watch that said it had detected potential atrial fibrillation. Roy had “no idea” what AFib was, but his son pushed him to go to the emergency room after the Apple Watch sent multiple alerts.\n“So I rested and didn’t think anything of it, and later that afternoon, the watch started beeping probably about once an hour, saying, ‘You’re in A-fib,’ and I had no idea what A-fib was.” So he did what many of us do: He Googled it. “The first thing we did was finish our Thanksgiving dinner. We’ve gotta get our priorities right. And after dinner, my son said, ‘You’re going to the hospital.’\nWhen they showed up at the hospital, Roy told the nurses that he was there simply because “my watch told me I was in AFib.” He was then hooked up to an EKG and later admitted to the hospital.\n“I had a parade of doctors and interns and residents and nurses. Half of them came in and said, ‘I want to see the guy who was saved by the Apple Watch.’ I think I was a mini-celebrity in the hospital.”\nUltimately, Roy doesn’t know if the Apple Watch saved his life, “but it sure as hell helped.” And the best part of the situation, according to Roy? Apple CEO Tim Cook even reached out to wish him well after the health scare.\nRead more stories about the Apple Watch’s health features here. Watch Roy Robinson talk about his story here.\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.18997144281864167
    },
    "article_8": {
        "title": "Apple Watch Siri awkwardly interrupts on-air meteorologist and contradicts his forecast",
        "body": "Earlier this month, Apple Watch fall detection made a humorous appearance on James Corden’s The Late Late Show when it was unexpectedly triggered by a guest in the audience.\nFollowing that, Siri on Apple Watch recently made an unplanned appearance on a BBC broadcast this week after a meteorologist accidentally activated the assistant.\nAs noted by Mashable, meteorologist Tomasz Schafernaker was delivering his forecast on BBC Thursday when Siri chimed in to help. Schafernaker was describing the cold and snowy conditions around many parts of the United States, but Siri had other ideas.\nAs Schafernaker was talking about the snow throughout the United States, and outlining the possibility of snow in Europe, Siri chimed in to say that there was “no snow in the forecast.” While Schafernaker tried to quickly move on, the BBC anchor didn’t let the blunder slide.\n“There is snow in your forecast, I thought,” the anchor pointed out. “Yeah, but it probably doesn’t know what place I’m talking about,” Schafernaker said.\nYou can watch the awkward interaction below:\nWhen you're a weather presenter and your watch contradicts your forecast….😆\n🔊Sound on👇 pic.twitter.com/YXojblKcIQ — BBC Weather (@bbcweather) November 28, 2019\nSchafernaker responded to the incident on Twitter, pointing out that he did not purposefully trigger Siri, blaming it on Apple instead.\nSo how did this happen exactly? There are a few possibilities. First off, the Apple Watch might have thought it heard the “Hey Siri” trigger phrase. Second, the meteorologist could have accidentally pressed the Digital Crown and activated Siri. And third, if “Raise to speak” was enabled, it’s possible Siri was activated when Schafernaker raised his arm to point at the green screen.\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.3654361975689729
    },
    "article_9": {
        "title": "3D mask or photo fools airport face-recognition, but not Face ID - 9to5Mac",
        "body": "A 3D mask – or even a photograph of a face – was able to fool supposedly secure face recognition systems used for payments and boarding aircraft, but was unable to fool Face ID…\nFortune reports on the tests carried out by an AI company.\nThe test, by artificial intelligence company Kneron, involved visiting public locations and tricking facial recognition terminals into allowing payment or access. For example, in stores in Asia—where facial recognition technology is deployed widely—the Kneron team used high quality 3-D masks to deceive AliPay and WeChat payment systems in order to make purchases. Those systems, which resemble the ones seen in airports, use a person’s face rather than a PIN or a fingerprint to validate user’s identity. Such masks, in theory, could allow fraudsters to use another person’s face—and bank account—to go shopping. More alarming were the tests deployed at transportation hubs. At the self-boarding terminal in Schiphol Airport, the Netherlands’ largest airport, the Kneron team tricked the sensor with just a photo on a phone screen. The team also says it was able to gain access in this way to rail stations in China where commuters use facial recognition to pay their fare and board trains.\nThe masks are expensive and time-consuming to create, so unlikely to be an issue for the average person, but could certainly render some wealthy individuals or public figures liable to fraud or misrepresentation.\nThe ability of a simple smartphone photo to fool an airport system is much more worrying.\nSchiphol Airport, We Chat, and AliPay did not respond to requests for comment about the effectiveness of their facial recognition technology.\nThere was, however, good news for iPhone owners: not even the 3D mask was able to fool Face ID, even on the oldest phone to use it, the iPhone X. There has, however, been one example of a mask being used to gain access using Face ID. An Apple patent seems designed to counter this type of attack, requiring facial muscle movement to be seen.\nVia Engadget\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.4928484787543615
    },
    "article_10": {
        "title": "AirPlay 2 cracked, will allow multiroom play to non-supported speakers",
        "body": "Audio enthusiasts who prefer to listen to music on their existing speakers have been waiting for some time to see AirPlay 2 cracked, and that day has now arrived.\nThree developers who have been working on the problem for some time say they have now done it…\nThe original announcement was made in a Slack group, and then posted to GitHub.\nGuys… ready? I can finally confirm I got airplay2 working, including multi-room! Audio streaming data correctly recovered, decrypted and decoded!\nApple uses a proprietary streaming protocol which means only speakers that have licensed the tech from Apple can receive and decode the audio. But that protocol has now been reverse-engineered.\nWhat this means is that multi-room playback from iOS devices will be possible to any speaker system when connected to something like a Raspberry Pi running an app designed to receive and decode AirPlay 2 audio streams.\nThe developer who made the announcement was quick to point out that cracking the protocol is only the first step: the team still needs to build an app around it before it can be used.\nThe code I have is rather a python prototype for debugging/reversing not meant for running in “production”. You might have read in this channel that @iostat is working on a cool Rust implementation of AirPlay 2. A bit of patience and I’m sure it will happen.\nAirPlay 1 had long been cracked, so there are already apps like shairport-sync which allows iTunes to send music to non-supported speakers via a small computer. There’s a tutorial here on how to do this on a Raspberry Pi.\nApple’s AirPlay is an incredibly useful feature – assuming, of course, that you have enough Apple products to make it work. As you probably know, AirPlay allows you to sling from an Apple device to another device. But while Apple has been a little nicer than usual about licensing the tech out to third-party companies, there’s still a good chance that your particular stereo isn’t AirPlay-capable. That’s too bad, but its’ a problem you can solve with – you guessed it – a Raspberry Pi. You can actually make a Raspberry Pi AirPlay receiver with nothing more than a few commands in Terminal.\nHowever, although multi-room playback using AirPlay 1 is supported by iTunes, streaming from an iOS device requires AirPlay 2. Now that we’ve seen AirPlay 2 cracked, it shouldn’t be long before you can do the same thing from an iOS device.\nIf all this sounds like too much trouble, there is an increasing number of AirPlay 2 speakers and receivers available. However, you do need to check the specs carefully to ensure that AirPlay 2 is specifically listed, as a lot of companies include the term in their SEO keywords when the product only supports AirPlay 1.\nYou can find some recommended AirPlay 2 speakers in our audio gift guide.\nFTC: We use income earning auto affiliate links. More.\nPhoto: Shutterstock\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.178916834294796
    },
    "article_11": {
        "title": "$73K in Apple products stolen from Target, iPad thief chased by 71-year-old on the Apple Crime Blotter",
        "body": "$73K in Apple products stolen from Target, iPad thief chased by 71-year-old on the Apple Crime Blotter\nArticle Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nInvestigation opened into Apple Store employee accused of sending nudes to himself, a bagel buffet iPhone theft, and more from the Apple crime blotter.\nThe Marlborough, Mass., Apple Store\nThe latest in an occasional AppleInsider series, looking at the world of Apple-related crime.\n71-year-old florist tracks down iPad thief\nA septuagenarian British woman who owns a flower shop arrived one morning to find her store ransacked, and later that day decided to track down her stolen iPad, using the Find My iPhone app.\nAccording to The Lancashire Post, the expedition led her to the door of the suspect's apartment, at which point he brandished a knife, however, police soon arrived and arrested the man.\niPad stolen at swordpoint\nA 40-year-old man in Florida has been charged with using a sword to rob a salesman of his iPad. Bradenton.com reports a home-alarm salesman was going door-to-door when the accused perpetrator grabbed the salesman's iPad. Shortly afterwards, the perpetrator produced a sword, which he brandished in \"a threatening manner.\"\nThe man was soon arrested, and charged with armed robbery.\nPolice investigating ex-Apple Store employee who emailed customer's intimate photos to himself\nWe told you last time about an incident in Bakersfield, Calif., in which a young woman who brought her iPhone to an Apple Store discovered that an employee of the store had emailed an intimate photo of the customer to himself from the phone. Now, per KRON, police have opened a criminal investigation into the matter.\nThe employee in question was fired following the initial discovery.\nSeattle man tracked stolen iPad, leading to arrests\nA man in Seattle whose iPad and laptop were stolen got his items back by tracking them to a fast-food restaurant parking lot in the city's Capitol Hill section, leading to three arrests. Reported by Key News Network, police tracked the signal to a car — which had also been reported stolen — and found the trio of accused perpetrators.\nMen charged with stealing $73,000 of Apple products from Target\nPolice in Delaware arrested three New York men, stating that they had stolen more than $70,000 worth of Apple products from a secured case at a Dover-area Target. According to WBOC, police say the men also attempted a similar theft at a Target elsewhere in Delaware.\niPhones and iPad seized from indicted Giuliani associate\nIt was a frequent occurrence during Robert Mueller's investigation into Russian interference for large numbers of iPhones, iPods and other devices to be seized from such targets of the probe as Paul Manafort and Roger Stone. Now, that's happened in the Ukraine investigation as well.\nThe Washington Post writes Lev Parnas, the associate of presidential attorney Rudy Giuliani who was charged with campaign finance violations, had numerous devices, including \"two iPhones, a Samsung device, an iPad and another cellphone,\" seized when he was arrested in October at Dulles International Airport in Virginia.\nParnas' attorney asked the judge to turn over the devices, which are in federal custody, in order to comply with a Congressional subpoena.\nApple Watch ping leads to arrests\nTwo California men were arrested, police say, after they were found with a stolen Apple Watch that was pinged by its owner. According to Fox 40, police were searching the motorhome with he two suspects inside it when the Watch made a sound, indicating that it was on the premises.\nBoth men were arrested and charged with possession of stolen property and possession of a controlled substance.\nCongressman accused of improper Apple Store purchases pleads guilty\nRep. Duncan Hunter of California, who was indicted last year on charges that he directed more than $250,00 in campaign funds towards his personal use, changed his plea to guilty, NBC News reported.\nThe indictment against Hunter, which had also named his wife, alleged that the Congressman's improper spending including two visits to the Apple Store, which included the purchase of a $1,199 Mac computer in 2010.\niPhone stolen at Bagel Buffet\nAn iPhone 10 was stolen last week at a Bagel Buffet location in Secaucus, N.J. The owner of the phone had arranged to meet at the location in order to sell the device to a buyer they had met on Craigslist. However, a co-conspirator of the \"buyer\" showed up, grabbed the phone, and ran, per Patch. The man who took the phone was apprehended and charged with theft and conspiracy to commit theft, and was also held on an outstanding warrant.\nNationwide locker theft ring spent big on Apple products\nPolice in the Chicago area say a nationwide ring that steals credit cards from gym lockers has recently been active in the area. According to NBC Chicago, the ring has hit five different gyms in the Chicago suburbs, and has gone on to spend \"approximately $30,000 on Apple products and high-end jewelry\" at a local high-end mall.\nThe crew is said to consist of more than 20 people, who are described as \"Eastern Europeans.\"\n\"Thousands\" in Apple Watches taken from Apple Store in Boston area\nPolice are looking for three men who they say stole 15 Apple Watches from an Apple Store in Marlborough, Mass. WCVB reports two of the men acted as lookouts while the third took the items, which are valued at a total of about $8,000.",
        "sentiment": -0.517463450320065
    },
    "article_12": {
        "title": "Apple accused of monitoring employee text messages in lawsuit against ex-chip exec - ex-Apple employee Gerard Williams argued Apple illegally collected his private messages to build its case against him",
        "body": "Apple CEO Tim Cook participates in an American Workforce Policy Advisory Board meeting with U.S. President Donald Trump and others in the White House in Washington, March 6, 2019.\nA former Apple executive alleges the company illegally gathered private text messages from his iPhone before firing him for breach of contract.\nGerard Williams, who led design of all the chips powering Apple's mobile devices, left the company in February after nine years to head up Nuvia, a new server chip start-up. Nuvia, which is building silicon chips for data centers, announced in November that it secured $53 million in funding.\nApple filed a lawsuit against Williams in August for breach of contract, claiming an intellectual property agreement prevented him from planning or engaging in any business activities that would compete with the company. In the lawsuit, filed in Santa Clara Superior Court in California, Apple argues Williams' work around Nuvia was competitive to Apple because he recruited \"numerous Apple engineers\" away from the company.\nIn his response, Williams argues Apple illegally collected text messages between him and other Apple employees, two of which went on to be Nuvia's co-founders, to build its case.\n\"Apple, an early beneficiary of the creative forces that formed and continue to drive Silicon Valley, has filed this lawsuit in a desperate effort to shut down lawful employment by a former employee,\" the lawsuit states. \"To further intimidate any current Apple employee who might dare consider leaving Apple, Apple's complaint shows that it is monitoring and examining its employees' phone records and text messages, in a stunning and disquieting invasion of privacy.\"\nApple contends that Williams used his experience at the company to \"start a competing company leveraging the very technology the director was working on.\" The company is seeking injunctions and punitive damages against Williams for breach of contract and breach of duty of loyalty.\nWilliams' allegation that Apple searched his text messages contradicts the company's repeated commitments to privacy. In recent months, Apple has dialed up its pro-privacy messaging, in an effort to differentiate itself from other tech companies that have mismanaged users' data. In one example, Apple ran an advertisement pledging \"what happens on your iPhone, stays on your iPhone.\"\nApple was not immediately available to comment.",
        "sentiment": -0.30671383435837923
    },
    "article_13": {
        "title": "Black Friday is the time Android fans need to swallow their pride and buy a $229 iPad",
        "body": "When you think of tablets these days, what comes to mind? For the vast majority of people, it's the iPad. Some companies continue to make Android tablets and release them here and there, but nothing has managed to overthrow the iPad in all the years we've had tablets.\nThe biggest disadvantage to the iPad is that it doesn't go on sale all that often, but Cyber Monday is one of the few exceptions to that rule. Right now, the latest version of the iPad Mini can be yours at a $100 discount. That brings the final price down to just $300, and even if you're a die-hard Android user, you still owe it to yourself to check this one out.\nBetter than Android Apple iPad Mini (2019) | $100 off at Best Buy $300 at Best Buy (opens in new tab) Cyber Monday is a perfect time to buy a tablet, whether it be for yourself or a loved one. If you plan on doing that, make sure you pick up the iPad Mini. It's $100 off its retail price right now, and as far as small tablets go, it's the best you can get. The iPad Mini is fast, supports a ton of excellent applications, and works with the Apple Pencil.\nAs you'd expect given the \"Mini\" name, this is the smallest iPad that Apple currently sells. Measuring in with a 7.9-inch display, the iPad Mini is the perfect device for watching movies, playing games, and running your favorite apps without having something that's unwieldy to hold. It's larger than your phone, smaller than a lot of other tablets, and is just a joy in day-to-day use.\nDespite its small size, the iPad Mini still manages to be plenty powerful. It has the Apple A12 Bionic processor for blazing-fast performance, lasts for up to 10 hours on a single charge, and features a Touch ID fingerprint sensor for keeping your most sensitive apps as secure as can be. Powering everything is the iPadOS operating system, which is like iOS cranked up to 11. Between tweaks to the core interface and a slew of tablet-optimized applications, the user experience you get with iPadOS is far and away better than anything we've ever seen from Android.\nIn addition to the iPad itself, it can be used with a couple of key accessories if you want to take your experience to the next level. Want to do a lot of creative work? The Apple Pencil (opens in new tab) is fully supported and allows for one of the best stylus experiences on the market. You can also get the iPad Mini Smart Cover (opens in new tab), which keeps the tablet protected and easily props it up for hands-free use.\nIt's pretty rare that we see Apple gadgets go on sale, especially with a discount as good as this one. If you're at all interested in what the iPad Mini has to offer, $300 is a fantastic price to pay (opens in new tab) — and it's one of the few tablets we're happy to recommend you buy in 2020.",
        "sentiment": 0.391323225815659
    },
    "article_14": {
        "title": "Apple brings contactless student IDs on iPhone and Apple Watch to more universities",
        "body": "In the coming school year, more than 100,000 college students will enjoy the ease and convenience of carrying their student IDs on iPhone and Apple Watch. Students at Clemson University, Georgetown University, University of Tennessee, University of Kentucky, University of San Francisco, University of Vermont, Arkansas State University, South Dakota State University, Norfolk State University, Louisburg College, University of North Alabama and Chowan University will soon be able to use their student ID in Apple Wallet to get into dorms, buy lunch and more.\n“We’re happy to add to the growing number of schools that are making getting around campus easier than ever with iPhone and Apple Watch,” said Jennifer Bailey, Apple’s vice president of Internet Services, in a statement. “We know students love this feature. Our university partners tell us that since launch, students across the country have purchased 1.25 million meals and opened more than 4 million doors across campuses by just tapping their iPhone and Apple Watch.”\nDuke University, University of Oklahoma, University of Alabama, Temple University, Johns Hopkins University, Marshall University and Mercer University already offer their students, faculty and staff the ease, convenience and security of contactless student IDs in Wallet.\nAs a part of these launches, Apple is adding support for CBORD, Allegion, and HID, industry leaders for campus credentials and mobile access, to enable more students to add their student IDs to Apple Wallet.\nOnce students add their student ID to Apple Wallet, they simply hold their iPhone or Apple Watch near a reader anywhere physical student ID cards are accepted on and off campus. With contactless student IDs in Apple Wallet, students can leave their physical wallets at home and no longer have to worry about misplacing their physical cards. School credentials on iPhone and Apple Watch are also protected by two-factor authentication.\nMacDailyNews Take: Congrats to all of the schools using Apple Wallet for contactless student IDs. We expect there’ll be many, many more to come!",
        "sentiment": 0.5024224476267894
    },
    "article_15": {
        "title": "AirPods were a $6 billion business for Apple this year and will be even bigger next year - Toni Sacconaghi",
        "body": "A man shows AirPods Pro at an Apple store on East Nanjing Road on October 30, 2019 in Shanghai, China. Apple's new AirPods Pro with active noise cancellation are on sale on October 30 in China.\nSales of Apple 's AirPods nearly doubled to $6 billion this year and should take another leap forward next year, according to Toni Sacconaghi of Bernstein.\nThe analyst said in a note Friday that Apple could sell 85 million AirPods in 2020, generating about $15 billion in revenue. If sales of the wireless headphones grew at the same rate again in 2021, the product would become Apple's third largest business, Sacconaghi said.\nSacconaghi, who has a market perform rating on Apple's stock, is consistently rated as the top investor for IT hardware and electronics manufacturing services by Institutional Investor magazine.\nAirPods Pro are already sold out in Apple Stores and at many online retailers for the holiday season, with some selling AirPods on eBay for large premiums. The Pro is sold for $249 on Apple's website, while the regular AirPods start at $159.\nHowever, the AirPod's run may be short-lived, said Sacconaghi, who compared the product's trajectory to the iPad's rapidly slowing growth four years after it launched. As more iPhone users buy AirPods, there are fewer potential customers, according to Sacconaghi.\n\"Given AirPods' extraordinarily steep adoption curve and rapid saturation of the iPhone installed base, we see a dramatic deceleration in AirPods revenue growth by 2021 or 22, to single digit growth rates or possibly lower,\" Sacconaghi wrote.",
        "sentiment": 0.13970252990045331
    },
    "article_16": {
        "title": "I made an app that informs you when someone is staring at your screen",
        "body": "Rearview - handy mirror camera\nPerfect camera for gamers, presentation makers & remote workers\nHow can gamers and presentation makers use Rearview?\nRearview camera is always on top even when other apps are on full-screen mode. This feature makes Rearview a perfect camera when recording a Keynote presentations or game tutorials with your face visible.\nHow can I use rearview when working remotely?\nRearview is easily accessible from menubar which make it perfect tool for checking if everything is OK before joining video-call on Slack, Zoom or Hangouts. You can check how you look, light angle and what is behind you.\nIs camera view always visible?\nYes! Rearview shows mirrored image from camera. It is always on top, even when other apps are on full-screen mode (and even during Apple Keynote presentation). What is more, camera view can follow active space (cmd + ⬅️/➡️).\nWhat is \"emoji alarm\"?😎😱\nNobody likes when someone behind is staring at your screen. Doesn't matter if it is your boss or nosy person in the cafe. Rearview solves this problem by using face detection technology.\nWhen emoji alarm mode is started, app captures image from camera and analyses how many faces are detected. If everything is fine, there is 😎 emoji visible. When unexpected face is detected Rearview shows 😱 emoji. You can set number of faces to play alarm or hide 😎 emoji if you find it disturbing.\nDo you support dark mode?\nYea, app is adjusted for light and dark mode since MacOS Mojave🌞🌚. It works automatically when you change your appearance in system preferences.\nWhy it isn't free?\nMaintaining and developing the app costs time.💸⏱ For the price of cheap lunch you get a nice application - it's a really good deal.\nWhat about privacy policy?\nRearview does not record anything, makes no network requests and doesn't store any of your personal data, period.\nCamera view in Rearview application shows only the image captured by your device's camera at the moment.\nWhen emoji alarm mode is started, app captures image from camera and analyses how many faces are detected to play emoji alarm.\nFeatured:",
        "sentiment": -0.07890555365332241
    },
    "article_17": {
        "title": "No, Apple's new Mac Pro isn't overpriced",
        "body": "Mac Pro and Pro Display XDR\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nThat $53,000 for the Mac Pro on the high-end is a lot of money for a computer, but there will be buyers. There doesn't seem to be a lot of discussion about the lower, more practical, workstation price points — which are common to Windows workstations too.\nWhen considering the Mac Pro price, context is key. Context is what's lacking in nearly all of these conversations. If the Mac Pro is compared to build-your-own hardware or an iMac, it is indeed more expensive.\nBut, compared to Windows workstation pricing, the jokes and arguments fall flat.\nThe Mac Pro isn't a consumer-level machine that is actively competing with Apple's other Macs for the target market. The Mac Pro is a true professional workstation designed for the likes of Pixar, Adobe, and other organizations.\nTitles like \"Apple's priciest Mac Pro costs $52,599 — 56% higher than typical U.S. income\" from CBS News is comparing the maxed-out configuration against the median family income, as if that was the target audience Apple was trying to sell the Mac Pro to. The headline isn't factually incorrect, but it is a ridiculous compare point.\nWhy the Mac Pro is expensive\nMost of that $53,000 price point is in 8TB of flash memory and 1.5TB of RAM. Apple's RAM price alone is $25,000. Another $10K can go to two Radeon Pro Vega II Duo cards, sold for $5,600 individually. Tack on a massive 8TB SSD, a 28-core processor, and an Afterburner card, and it is easy to see how, when maxed out, this machine surpasses the $50k mark.\nThe machine has user-accessible RAM. Using non-Apple Storage or third-party AMD video cards aren't a major crisis, as the unit has eight PCI-E slots. There are already options for internally mounting drives in an MPX bay or connected to one of the two SATA-3 ports internal to the machine.\nUsers have balked, and cracked jokes at the $400 Apple chooses to charge for wheels, yet don't think twice — or even consider — the $309 Microsoft charges for the operating system on a Windows workstation. And, when they pick components from Newegg or other PC vendors to compare, that Windows price isn't included.\nThe back of the 2019 Mac Pro\nIf you don't want to pay Apple's prices for RAM, storage, and video cards, then don't — this is a pretty straightforward concept. Big business and others not interested in spending labor and money will pay Apple's prices, though, and they'll pair the machine with an expensive service contract, well above and beyond just the $299 for AppleCare.\nApple's Mac Pro versus Windows workstation prices\nWorkstations have always been expensive. The Mac Pro is no exception to that rule, and Windows workstations are priced similarly to the Mac Pro.\nComparing a similarly configured HP workstation to the entry-level Mac Pro\nLooking at HP, we built a comparable tower with an Intel Xeon 6234 3.3GHz 8-core processor, 32GB (4x8GB) RAM, 256GB SATA SSD, and AMD Radeon Pro WX 7100 graphics with 8GB of memory. That is up against the Mac Pro base config with an 8-core 2.5GHz Xeon W processor, 32GB RAM, Radeon Pro 580X with 8GB of video RAM. The processors have similar real-world performance, and the WX 7100 and 580X video cards have similar performance with 4,150 gflops for the former and more than 5530 gflops for the latter.\nThe Mac Pro is effectively $6000. The HP, on the other hand, is a hefty $8,506.40 — and that is on sale from the full price of $10,633. The HP still lacks features such as Thunderbolt, explicit support for 6K displays like Apple's Pro Display XDR, and more nebulously, Apple's design elements, like a near-silent case.\nComparing a similarly configured Lenovo workstation to the entry-level Mac Pro\nLenovo fared a bit better. A Lenovo workstation with Intel Xeon Silver 4110 8-core processor, 32GB of RAM, NVIDIA Quadra P4000 8GB graphics, and one Thunderbolt 3 port will cost $4,964 — though it too is on sale for the holidays at $3,444. The Lenovo model lacks many features of the Mac Pro, such as more Thunderbolt 3, USB-C, dual 10Gb Ethernet, and, again, Apple's design elements.\nComparing a similarly configured Dell workstation to the entry-level Mac Pro\nA Dell workstation with an Intel Xeon Gold 6234 3.3GHz 8-core processor, 48GB RAM, NVIDIA Quadro P4000 with 8GB of memory, and two Thunderbolt 3 ports racked up the cost to $5,851 — after $2,522 in holiday savings. Nearly the same price, but without many of the Mac Pro's benefits.\nMost of that $53,000 in the Mac Pro is RAM and SSD upgrades at Apple's pricing. If we take out Apple-provided SSD and RAM — which can be picked up aftermarket for less — but max out the graphics and processor, we wind up with a $23,799 machine, with the 2.5GHz 28-core Intel Xeon W. We configured another HP workstation with similar specs, and it reached $22,150, on sale from its full $27,688 price point.\nComparing a similarly configured HP workstation to the high-end Mac Pro\nThat HP configuration also lacks Thunderbolt 3, and only packs a single AMD Radeon Pro WX 9100 with 16GB of memory. The Mac Pro, which costs far less at full price, is configured with two Radeon Pro Vega II Duo cards with 2x32GB of HBM2 memory each. You can add a second graphics card to the HP workstation, but it can only handle two WX 7100 cards rather than two WX 9100 cards.\nApple's Mac Pro isn't just priced competitively in the workstation market but comes in under the cost of many competing Windows-based offerings.\nApples to oranges\nThe Mac Pro isn't just a $400 i9 processor jammed in a machine with a plain-as-day Northbridge, a few PCI-E slots, and a couple of I/O options. Instead, the Mac Pro is a machine where processors by themselves can cost thousands of dollars, coupled with other components running into the thousands of dollars each, all aimed at a very specific, very demanding, market.\nThe Mac Pro is absolutely a \"Pro\" machine. It is also absolutely not for everybody, and absolutely not aimed at the same markets that the lower-end of the G4 towers or lower-end Mac Pro towers were. Comparing prosumer hardware like the low-end G4 or lower-end Mac Pro with a workstation is a strange comparison to make, but it's being made anyway.\nAnd, for some reason, the jokes and Twitter hot-takes aren't talking about Windows workstation pricing, which, as we've demonstrated, are in the same range. The comparisons to Apple's pricing are derived using part-pickers, component by component. Assembly labor and support of a Frankenstein configuration aren't free, and the value of both varies person to person.\nApple's Mac Pro is well priced\nThe comparisons across the web today are omitting features, most commonly Thunderbolt 3. Comparisons are skipping the quiet enclosure and discounting the desire for macOS on workstation hardware. Just because you don't need something doesn't mean that it should be stricken from the compare.\nWe've said it before, Apple didn't set out to make that xMac of lore with Core i3, i5, i7, and i9 options, and just overshoot that target with the Mac Pro. The new Mac Pro is a workstation. While we won't argue that the xMac concept would be nice for us, and probably most of the AppleInsider audience, Apple set out to put the most processing power in the chassis they could, and they hit that target.",
        "sentiment": -0.20235340400514276
    },
    "article_18": {
        "title": "Apple is offering free genetic tests to all its Silicon Valley employees",
        "body": "Apple employees in Silicon Valley can now get free genetic screenings for diseases from their on-site health clinics, thanks to a pilot partnership with Color Genomics.\nApple, which recently set up dedicated health clinics known as \"AC Wellness\" for employees and their dependents near its headquarters, has been working with Color for several months, according to several people with direct knowledge of the discussions. The people requested anonymity because they were not authorized to publicize the deal on their companies' behalf.\nThe idea is to move health care at Apple's clinics from reactive to proactive, as genetic tests can offer a window into health risks down the line. In some cases, patients can take preventative steps to reduce their likelihood of getting a disease.\nBy offering cutting-edge medical treatments like genetic testing, AC Wellness can help Apple recruit and retain talented employees. In addition, although AC Wellness is technically a separate company from Apple, medical experts have speculated that it could help Apple quietly test new products or ideas without risking leaks. So the group's partnership with Color could indicate Apple's broader interest in the space.\nApple has publicly acknowledged its interest in health and is moving forward with a range of efforts, including its health and fitness-tracking Apple Watch, its clinical research apps in partnership with academic medical centers and its partnership with the health insurer Aetna. Thus far, it has taken only tentative steps into genetics through a move to bring genetic data into ResearchKit, its software that makes it easier for academic researchers to use the iPhone for medical studies.\nAC Wellness, which got its start in early 2018, has already opened several medical centers on the Apple Park campus, and in Santa Clara, a few miles north of Apple's Cupertino, Calif. headquarters. The goal is to bring the \"world's best health care experience\" to employees, according to its website. Its clinicians and health coaches are not employed by Apple, but they treat only Apple employees and their dependents. The administrative part of the business, which orders supplies and manages the clinical software, is run through a separate legal subsidiary of Apple to comply with regulations that ensure that employers don't have direct access to employees' most sensitive health information.",
        "sentiment": 0.6591761695221067
    },
    "article_19": {
        "title": "Supply Chain Reports Back Rumors of MacBook Pro and iPad Pro With Mini-LED Displays in 2020",
        "body": "Yesterday, in a research note shared with MacRumors, analyst Ming-Chi Kuo said that Apple is planning four to six products with mini-LED displays over the next two to three years, including a 12.9-inch iPad Pro with an A14X chip in the third quarter of 2020 and a refreshed 16-inch MacBook Pro in the fourth quarter of 2020.\nKuo said LG Display and Taiwanese manufacturer GIS will be the most significant benefactors of these mini-LED products starting next year.\nNow, those mini-LED plans have been backed by two Taiwanese publications in DigiTimes and the Economic Daily News, with both outlets also reporting that GIS will be a key supplier of mini-LED-related components.\n\"Apple will introduce a 12.9-inch iPad Pro series featuring mini-LED backlit displays in 2020, with related suppliers set to kick off shipments in the third quarter, according to industry sources,\" reports DigiTimes, which in a separate report added that Apple also plans to release a new MacBook with a mini-LED display next year.\nLikewise, the Economic Daily News reported that Apple will tap GIS for mini-LED display module assembly for an upcoming iPad.\nKuo has previously said that Mini-LED displays will allow for thinner and lighter product designs, while offering many of the same benefits of OLED displays used on the latest iPhones, including good wide color gamut performance, high contrast and dynamic range, and local dimming for truer blacks.\niPads and MacBooks currently use LCDs.",
        "sentiment": 0.17943025486809866
    },
    "article_20": {
        "title": "‘Apple Card Monthly Installments’ offer 0% iPhone financing - 9to5Mac",
        "body": "During Apple’s most recent earnings call in October, Tim Cook teased that Apple Card would soon be adding 0% financing for iPhone purchases. Ahead of that feature rolling out, Apple has updated the Wallet app on iOS to reference this new monthly installment option.\nOn the earnings call in October, Cook explained that Apple Card users will be able to finance iPhone purchases over 24 months with 0% interest. You’ll also still get 3% Daily Cash on your total iPhone purchase.\nIf you tap the “Learn More” link in the Wallet app when paying your Apple Card balance, you see a clear explanation of how Apple Card payments work. This explainer has been there since Apple Card launched, but Apple has recently added a new “Apple Card Monthly Installments” section with new details on iPhone financing.\nApple explains that when you use Apple Card Monthly Installments to finance your iPhone, the monthly payment for that iPhone will simply be included in your minimum payment amount every month. The installments are not subject to interest like the rest of your balance, Apple points out.\nHere is the full explanation:\nApple Card Monthly Installments If you are paying for your iPhone with Apple Card Monthly Installments, each month your installment is included in the minimum payment amount. Installments aren’t subject to interest like other purchases made with Apple Card. If you pay more toward your installment balance, you may reduce the overall number of payments, but are still scheduled to pay your installment payment the following month. Paying the total balance will include the total amount you’ve spent with Apple Card, including your remaining iPhone balance.\nTim Cook had said that Apple Card would add 0% financing for iPhone purchases “later this year,” but the option does not yet appear to be live. Given this new addition to the Wallet app, and the fact that there are only three weeks left in the year, it’s safe to assume the financing option will roll out sometime soon.\nAt this point, there’s no word on whether Apple plans to offer Apple Card Monthly Installments for purchases of other Apple products. You can still finance Apple Store purchases with Barclaycard for now, but presumably Apple will expand Apple Card Monthly Installments 0% financing to the Mac, iPad, and other products at some point in the future.\nThanks, David!\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.14238005327550987
    },
    "article_21": {
        "title": "Apple ink supplier in Japan makes mark with iPhone 11 Pro colors",
        "body": "TOKYO -- Apple may be the world's most recognizable brand. Few consumers have ever heard of Seiko Advance. But when Apple CEO Tim Cook spent three days in Japan in early December, he made sure to visit the unsung company -- and tweet about it.\nIn an interview, Cook told Nikkei that Seiko Advance is the \"reason\" Apple was able to release its top-of-the-line iPhone 11 Pro in a new color called Midnight Green.\nSeiko Advance is an ink producer. Incorporated in 1950 as a paint supplier, it is an example of a long-established company that managed to adapt to a new age. It also shows how Japan's technological backbone has endured even as some of its brightest business stars have faded. And its story tells us something about Cook, whose knack for managing procurement was one of the reasons Apple hired him in the first place.\n\"This was only made by high-quality control and craftsmanship,\" Cook said early on a chilly December morning. He was standing in front of a metal tank full of green ink inside Seiko Advance's factory in the countryside of Saitama Prefecture, near Tokyo.\nUsually, producing green ink involves pollutants like halogens. The company, however, developed a cleaner way that offers high color accuracy and durability, said Yukinori Kabe, a sales manager. This appealed to the environmentally conscious Cook, who also praised Seiko Advance's plans to switch to renewable solar and wind power in 2020.\nMidnight Green is not the only color Seiko Advance provides for the iPhone 11 Pro -- it is also behind the Gold, Space Gray and Silver models. \"We are the sole supplier of colors for the iPhone 11 Pro and iPhone 11 Pro Max,\" said Kabe. For the lower-priced iPhone 11 range, the representative said there are multiple suppliers.\nCook told Nikkei that Seiko Advance is \"the best in the world\" at what it does. He also tweeted this:\nWhile Cook was impressed with Seiko Advance, Seiko Advance officials sounded impressed with Cook.\n\"Cook showed us his attitude to deal with any company with high technology,\" said Kabe. \"However small you are, Apple will be your customer if you have outstanding technology.\"\nSeiko Advance is a minnow compared with Apple. It has 160 employees and annual sales of several billion yen, or tens of millions of dollars. Apple reported $260.2 billion in sales for its latest fiscal year.\nTheir collaboration began in 2011 -- a watershed year for Apple. Legendary co-founder Steve Jobs retired due to his battle with cancer, and died that October. Cook, who had joined Apple in 1998 after his supply chain management at computer maker Compaq caught Jobs' eye, became permanent CEO.\nThat same year, a Seiko Advance sales representative received an email from the tech giant. Apple wanted the company and other ink makers to send representatives to the U.S. to explain their products.\nToshio Hiraguri, now Seiko Advance's president, sent Kabe to make a pitch to Apple officials in charge of development. He was not aware of Cook back then; the two men met for the first time this December.\nSeiko Advance President Toshio Hiraguri displays the company's color swatches. (Photo by Ken Kobayashi)\nOne could say Seiko Advance had been preparing for decades. It had already produced inks for industrial products, including appliances and vehicles. The business expanded as Japan's economy grew in the years after World War II.\nIn 1972, the company formed a technical alliance with a U.S. ink producer that boasted advanced screen printing technology, which allows for printing on a wide variety of materials. The partnership helped Seiko Advance enhance its own screen printing techniques -- still the core of its expertise.\nEven so, Kabe recalled that the visit to Apple revealed a \"very different world.\" Suppliers were expected to meet hundreds of criteria. \"At that time,\" he said, \"we found that we couldn't meet Apple's high standards.\"\nAfter four years of trial and error, the company finally began supplying black ink for iPhones. Now Apple accounts for nearly 40% of its sales, while it also supplies major global smartphone competitors like Samsung Electronics and Huawei. Its inks are mainly used for high-end phones.\nInks for appliances, sign boards and vending machines account for the rest. Although the company declined to provide numbers, it said sales are growing, and that becoming an Apple supplier was a major boost.\nCook told Nikkei that Apple and Seiko Advance have worked together for years and \"grown together.\"\n\"Both parties enjoy working together, we push each other to innovate more,\" he said.\nSeiko Advance officials said that since Cook's visit, they have been fielding calls from other potential customers. The challenge is to carry this momentum forward. \"We maintain strict quality control,\" said President Hiraguri, who succeeded his father in November.\nSeiko Advance has a cleanroom in its factory. Hiraguri says it is the only ink company in the world that has one. This gives it a competitive edge, as controlling temperature and humidity keeps the ink under stable conditions and helps ensure consistent quality.\nApple's Cook noted the cleanliness of the facility and the carefully controlled environment.\nSeiko Advance has a cleanroom in its factory. (Photo by Ken Kobayashi)\nSkilled workers are equally important. Seiko Advance has 30 experts who specialize in color compounds. They produce 150 colors per day and check them one by one, manually.\nAs the company nears its 70th anniversary, Hiraguri vowed to \"keep providing good products as always.\" But he also recognized the need to break new ground. \"If we cannot produce better products, the value of a company will fade away,\" he said.\nHiraguri stressed that Seiko Advance has never fallen into the red and that the company's equity ratio is over 80%, which shows it does not rely on debt. But he sees a looming threat from emerging rivals in China, where he worked for a few years.\n\"Chinese companies are rapidly catching up,\" Hiraguri said. \"If we fall into price competition, we will be in a very tough position. We need to maintain quality to win.\"",
        "sentiment": 0.3785304651953853
    },
    "article_22": {
        "title": "Apple iPad Pro 2020 might have the same back camera setup as the iPhone 11 Pro",
        "body": "It’s been a while since Apple released a Pro variant to its tablet line up. That’s why fans were thrilled when supposed renders of the upcoming iPad Pro 2020 were leaked.\nThe leaks came from Steve H.McFly, also known as @OnLeaks, and iGeeksBlog who shared numerous renders on the supposed 2020 iPad Pro 12.9-inch and the 2020 iPad Pro 11-inch. McFly is known for his high-accuracy advanced information on popular gadgets.\nBased on the renders’ front views, it appears that the upcoming iPad Pro models will have roughly the same sizes as their predecessors, according to PhoneArena. In addition, they also share the same look when viewed from the front so there might be no massive redesign happening.\nHowever, the renders’ back views show that there is a noticeable difference between the older and the upcoming models. While the 2018 iPad Pro only has a single rear camera, the leaked renders show that the 2020 iPad Pro version will both feature a three-camera assembly.\nThe images even seem to suggest that the 2020 iPad Pro might share the same camera specs as the iPhone 11 Pro and iPhone 11 Pro Max. The phone’s triple rear camera is composed of a regular camera, an ultra-wide camera and a telephoto sensor with a 2X optical zoom capability. These might be the rear cameras of the upcoming tablets as well should Apple follow the same three-camera specs as that found in the iPhone models.\nHowever, MacRumors suggested another possible lens combination for the 2020 iPad Pro triple rear camera. According to the publication, one of the cameras could feature a time-of-flight (ToF) capability.\nA ToF camera is able to gauge distances between objects by using a laser for the measurement. This makes this kind of camera perfect for 3D effect. With its ability to perceive depth, it can even be used in augmented reality applications.\nAt the moment, it is not yet sure if the new tablets will have glass or aluminum backing. To be on the safe side, OnLeaks actually made renderings that show both materials as backings.\nThe 2020 iPads will likely feature the A13X chip. The gadgets are expected to have at least 4 GB of RAM as well. According to iGeeks, the two tablets could be released by March 2020.",
        "sentiment": -0.07896933349825087
    },
    "article_23": {
        "title": "Apple Investigating 16-Inch MacBook Pro Popping Sound Issue, Fix Planned in Future Software Updates",
        "body": "Apple is investigating a popping sound issue with the new 16-inch MacBook Pro and plans to make a fix available in future software updates, the company has indicated in an internal document obtained by MacRumors.\nThe memo shared with Apple Authorized Service Providers reads as follows:\nIf a customer hears a popping sound when playback is stopped on their MacBook Pro (16-inch, 2019) When using Final Cut Pro X, Logic Pro X, QuickTime Player, Music, Movies, or other applications to play audio, users may hear a pop come from the speakers after playback has ended. Apple is investigating the issue. A fix is planned in future software updates. Do not set up service, or replace the user's computer, as this is a software-related issue.\nShortly following the launch of the 16-inch MacBook Pro last month, some customers began to voice concerns about the popping sound issue across the MacRumors forums, Apple Support Communities, Reddit, and elsewhere. The exact cause is unclear, but Apple confirms it is a software issue, not a hardware issue.\nApple seeded the fourth beta of macOS Catalina 10.15.2 to developers for testing today. It is unclear when the fix will be implemented.",
        "sentiment": -0.31474530991787714
    },
    "article_24": {
        "title": "Apple defends iPhone encryption against Senate Judiciary Committee threats",
        "body": "Apple has defended its policy of using strong iPhone encryption such that not even the company can gain access to the personal data stored on devices.\nThe company struck to its privacy guns despite the Senate Judiciary Committee chairman issuing a threat against Apple and other tech giants…\nArsTechnica reports on the Encryption and Lawful Access: Evaluating Benefits and Risks to Public Safety and Privacy hearing.\nIn a hearing of the Senate Judiciary Committee yesterday, while their counterparts in the House were busy with articles of impeachment, senators questioned New York District Attorney Cyrus Vance, University of Texas Professor Matt Tait, and experts from Apple and Facebook over the issue of gaining legal access to data in encrypted devices and messages. And committee chairman Sen. Lindsey Graham (R-S.C.) warned the representatives of the tech companies, “You’re gonna find a way to do this or we’re going to do it for you.”\nGraham didn’t appear to understand the contradictory stance he was taking, saying on the one hand that he appreciated that “people cannot hack into my phone” while at the same time asking Apple to create a vulnerability that would inevitably be discovered by others and used to do just that.\n“When they get a warrant or court order, I want the government to be able to look and find all relevant information,” Graham declared. “In American law there is no place that’s immune from inquiry if criminality is involved… I’m not about to create a safe haven for criminals where they can plan their misdeeds and store information in a place that law enforcement can never access it.”\nManhattan district attorney Cyrus Vance – a longstanding opponent of iPhone encryption – also gave evidence.\nExplaining that his office’s lab gets about 1,600 devices a year as part of case evidence, Vance said, “About 82 percent are locked—it was 60 percent four years ago,” he said. “About half of those are Apple devices. Using technology, we’re able to unlock about half of the devices—so there are about 300 to 400 phones [a year] that we can’t access with the technology we have. There are many, many serious cases where we can’t access the device in the time period where it is most important.”\nApple said that it worked extensively with law enforcement.\nApple Manager of User Privacy Erik Neuenschwander responded that Apple will continue to work with law enforcement, citing the 127,000 requests from law enforcement for assistance Apple’s team—which includes former law enforcement officials—has responded to over the past seven years, in addition to thousands of emergency requests that Apple has responded to usually within 20 minutes. “We’re going to continue to work with law enforcement as we have to find ways through this,” Neuenschwander said. “We have a team of dedicated professionals that is working on a daily basis with law enforcement.”\nAlthough he didn’t go into specifics, this likely refers to Apple granting access to iCloud backups. While Apple has no ability to access the data stored on iPhones, it does hold the keys to encrypted iCloud backups, so is able to decrypt these.\nPressed on removing strong encryption from iPhones, Neuenschwander said there was no safe way to do this.\nUltimately we believe strong encryption makes us all safer, and we haven’t found a way to provide access to users’ devices that wouldn’t weaken security for everyone.\nGraham, however, persisted in his threat.\nBy this time next year, if you haven’t come up with a solution that we can all live with, we will impose our will on you.\nApple will be discussing the issue during a roundtable event at CES, the first time the company has appeared there since 1992.\nFTC: We use income earning auto affiliate links. More.\nPhoto: Shutterstock\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.033083928283303976
    }
}