{
    "article_0": {
        "title": "Apple Music Overtakes Spotify in U.S. Subscribers",
        "body": "Apple Music has surpassed Spotify Technology SA in paid U.S. subscriptions, according to people familiar with the matter, in a shift that escalates the music rivals’ contest for listeners world-wide.\nApple Inc.’s streaming-music service has been adding subscribers in the world’s biggest music market more rapidly than its Swedish rival—a monthly growth rate of about 2.6% to 3%, compared with 1.5% to 2% for Spotify—the people said.",
        "sentiment": 0.3601834066212177
    },
    "article_1": {
        "title": "Spotify has 100M subscribers, double that of Apple Music's last reporting",
        "body": "Spotify paid subscribers have now reached 100M, double the last number Apple Music reported back in January.\nSpotify announced the number in its latest earnings report, for the first quarter of the year …\nAlmost half of the company’s users are now paid subscribers.\nMonthly Active Users grew 26% Y/Y to 217 million, slightly lower than the midpoint of our 215-220 million MAU guidance range […] Premium Subscribers grew to 100 million, up 32% Y/Y, reaching the high end of our guidance range of 97-100 million, and marking an important milestone in Company history.\nHowever, as the company itself acknowledges, much of its recent growth was driven by generous promotions.\nOutperformance was driven by a better than plan promotion in the US and Canada and continued strong growth in Family Plan. We also saw strong growth from the expansion of our Google Home Mini promotion, as well as the price reduction to our Spotify Premium + Hulu offering in the US. In March, we extended our partnership with Google by expanding our Google Home Mini promotion to two new markets, the UK and France. The new promotional offer is substantially similar to the deal offered in the US in Q4. In the UK and France, new and existing Family Plan master account holders can claim a free Google Home Mini voice speaker […] Additionally, we expanded our partnership with Hulu during Q1 by offering their limited commercial plan to our Standard $9.99 subscribers at no additional charge. This promotion replaces our existing $12.99 Spotify + Hulu bundle and builds upon the success and popularity of our Spotify Student + Hulu plan available in the US.\nWhile Apple Music offers a six-month free trial, as well as discounts for students and families, Spotify has always gone further, with a range of promotions that saw Premium subscribers paying as little as $1/month for several months after a free trial. Spotify paid subscribers therefore don’t offer a direct like-for-like comparison with those for Apple Music in terms of financials.\nThe most recent Apple Music subscriber number reported by Apple was 50M paid users back in January, representing growth of around 10M users in the second half of 2018. It’s possible – though not certain – that we’ll get an updated number when Apple reports its Q2 (calendar Q1) earnings tomorrow.\nSpotify and Apple are not exactly on the best of terms at present. Spotify has made an official complaint against the Cupertino company, accusing it of anti-competitive behavior and giving its own streaming music service an ‘unfair advantage at every turn.’ Apple responded aggressively, claiming that Spotify wants all the benefits of a free app without being free, but industry commenters have said that Apple could potentially take a triple-hit from the dispute:\nFines from antitrust investigations\nLoss of App Store commissions if it is forced to change its policies\nReputational damage if the matter becomes a big public battle\nBoth incumbents face increased competition from Amazon as it reportedly readies a hi-res streaming music service.\nFTC: We use income earning auto affiliate links. More.\nPhoto: Shutterstock\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.2998023192937437
    },
    "article_2": {
        "title": "Apple has persuaded 15 more of its suppliers, including Foxconn and TSMC, to manufacture Apple products using 100 percent clean energy",
        "body": "Apple has persuaded 15 more of its suppliers, including Foxconn and TSMC, to manufacture Apple products using 100 percent clean energy. The additions bring the total number of suppliers in the program up to 44. Apple says it now expects to exceed its goal of using four gigawatts of renewable energy in its supply chain by 2020 by an additional gigawatt.\nIn April last year Apple announced that its facilities now run entirely on renewable energy, and in October the company added that it had achieved the same goal for its retail locations. But, as CNBC notes, Apple’s own facilities only account for just over a quarter of its carbon footprint. The other 74 percent comes from its factory partners.\n“Obviously if they fall down on the job, we’ll be right there on their chase”\nToday’s announcement says that these suppliers have committed to the renewable goal, not that they have already achieved it. Speaking to Reuters, Apple’s vice president of Environment, Policy and Social Initiatives Lisa Jackson, refused to comment on whether Apple would drop suppliers such as Foxconn and TSMC if they failed to honor these commitments.\n“It took a while for them to come on board, and so we believe that now that they have, they’re fully committed to doing it… and obviously if they fall down on the job, we’ll be right there on their chase. I can’t tell you what will happen, but I hope it never does.”\nApple’s environmental goals have proven to be points of contention with some Apple investors. In 2014, for example, one Apple shareholder raised concerns about the company’s environmental initiatives, objecting to “affiliations that may primarily advance social or environmental causes rather than promoting shareholder value.” The concerns were rejected by the company’s shareholders as a whole, and Tim Cook said “you should get out of this stock” if they expected him to be motivated solely by money.",
        "sentiment": 0.2632760257961658
    },
    "article_3": {
        "title": "Nearly half of the third-gen Apple butterfly keyboards at Basecamp have failed",
        "body": "Apple continues to downplay the extent of issues of the widely criticized butterfly keyboard, though some \"anecdata\" finds a more widespread problem.\nApple’s ultra-low travel “butterfly keyboard” is facing a reckoning following renewed criticism from the Wall Street Journal, prompting Apple to issue an official apology in late March. “We are aware that a small number of users are having issues with their third-generation butterfly keyboard and for that we are sorry,” Apple said in a statement, adding that “The vast majority of Mac notebook customers are having a positive experience with the new keyboard.”\nThat conceit is receiving pushback from Ruby on Rails creator David Heinemeier Hansson, a developer at project management application firm Basecamp, who claims that “many people simply do not contact Apple when their MacBook keyboards fail. They just live with an S key that stutters or a spacebar that intermittently gives double,” concluding that “Apple never sees these cases, so it never counts in their statistics.”\nSEE: How to get the most from Apple’s free productivity apps: 9 tips (free PDF) (TechRepublic)\nIn an internal survey of Basecamp employees, six of 13 third-generation keyboard owners–users of 2018-revision MacBook Pro systems–indicated their keyboards have failed, with 30% dealing with keyboard issues now, though Hansson notes that “If you include all the people who used to have issues, but went through a repair or replacement process, the number would be even higher.”\nHansson backed up that “anecdata,” as he called it, with a Twitter poll finding that half of users are simply living with it, and just 11% have taken the system in for repairs, a result that “has remained remarkably stable all the way from 200 responses up to 3,400,” Hansson noted on Twitter.\nThe problem with repairing butterfly keyboards\nThough users typically report problems with either the space bar or just an individual key, repairing individual keys on these keyboards is a practical impossibility, due to the fragility of the butterfly switch mechanism holding the key in place. Replacing just the keyboard itself is similarly a non-starter, as the entire keyboard is bonded with the top case, requiring full replacement.\nApple attempted to mitigate this problem in the third-generation butterfly keyboards. iFixit found a thin silicone overlay placed around the butterfly switches for each key in their teardown of the 2018 MacBook Pro. Apple’s official explanation for this, in a press release, was that these systems have “an improved third-generation keyboard for quieter typing,” though some users contend that the butterfly keyboards are louder than previous MacBook Pro keyboards.\nA longstanding problem\nApple has faced a consistent stream of criticism for the keyboards, which were first introduced with the Retina MacBook in 2015. The keyboards either fail to register keystrokes, or register the same keystrokes twice, due to dust or other particles becoming trapped in the butterfly switch mechanism engineered to reduce the thickness of MacBooks. A group of aggrieved customers filed a class action lawsuit against Apple in May over the keyboards.\nIn June 2018, Apple introduced a keyboard repair program, which covers repairs for MacBooks with malfunctioning keyboards up to four years from the purchase date. Prior to this, for users out of warranty, replacement of the top case was $350 for the MacBook, and $700 for the MacBook Pro.\nDevelopers, creative professionals, and the tech press have been unanimous in their criticism of the keyboard, with Daring Fireball’s John Gruber–a noteworthy longtime Apple user–calling them “the worst products in Apple history… doing lasting harm to the reputation of the MacBook brand,” in response to the story in the Wall Street Journal. In October 2017, Casey Johnson of The Outline declared “the new MacBook keyboard is ruining my life,” in the first high-profile op-ed arguing against the keyboards.\nFor more on Apple, check out the Apple Developer Program: what professionals need to know, and Apple’s biggest flops of all time, from AirPower to Bendgate to the Newton.",
        "sentiment": -0.3760133643634617
    },
    "article_4": {
        "title": "Spotify losing artists due to rate hike appeal with Apple Music reaping the rewards",
        "body": "Over the next five years, the Copyright Royalty Board is looking to raise the rates that music services pay to artists by 44%. While Spotify, Amazon, Google, and more are appealing the decision, Apple is not. Here’s why Apple will come out on top no matter the outcome.\nAs reported by Variety, most of the major music streaming services except for Apple have objected to the proposed rate increases over the coming years. Spotify is seeing backlash from the artist community, with some using social media to share they are cancelling their accounts using #cancelspotify.\nAs a sign of how badly the PR war is going, many songwriters are canceling Spotify subscriptions and doing so publicly on social media, where they make sure to note their subscription fees will now be going to Apple Music.\nOfficially canceled my @Spotify subscription because Of their abhorrent treatment of songwriters and added @AppleMusic #cancelspotify pic.twitter.com/hdHIAEHgBr — Manny Medina (@MannyDMedina) March 9, 2019\nAlong with the recent acquisitions of several podcast companies, some in the industry feel Spotify is shifting its focus away from music.\nDawn Ostroff, Spotify’s chief content officer, said as much at South by Southwest last month when she declared that the company’s mandate is to become “the world’s No. 1 audio platform.” It was hard not to notice the absence of the word “music.”\nAs for Apple, no matter the outcome of the appeal, it wins. If the rate hikes do go through (which is expected), Apple Music benefits with increased songwriter loyalty as the company has taken a pro-artist stance. If Spotify, Google, and Amazon do successfully defeat or change the rate prices, Apple will also see the lower costs.\nJust last week, we heard from the WSJ that Apple Music surpassed Spotify with paid subscriptions in the US. This latest development could help Apple increase its lead in the US and close the gap with Spotify internationally.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.05717285443097353
    },
    "article_5": {
        "title": "iOS 13: Dark Mode, detachable panels, Safari and Mail, more",
        "body": "Apple is expected to unveil iOS 13, the next major version of the iPhone and iPad operating system, at its annual Worldwide Developers Conference, which kicks off on June 3rd. Now, people familiar with the development of the operating system have shared exclusive details with 9to5Mac. Read on for new details about what to expect.\nDark Mode and Multitasking\nFirst, the long-awaited Dark Mode is finally coming to the iPhone and iPad with iOS 13. There will be a system-wide Dark Mode that can be enabled in Settings, including a high contrast version, similar to what’s already available on macOS. Speaking of macOS, iPad apps that run on the Mac using Marzipan will finally take advantage of the Dark Mode support on both systems.\nThere are many changes coming to iPad with iOS 13, including the ability for apps to have multiple windows. Each window will also be able to contain sheets that are initially attached to a portion of the screen, but can be detached with a drag gesture, becoming a card that can be moved around freely, similar to what an open-source project called “PanelKit” could do.\nThese cards can also be stacked on top of each other, and use a depth effect to indicate which cards are on top and which are on the bottom. Cards can be flung away to dismiss them.\nUndo gesture, Safari improvements, and font management\nAnother thing many iOS users complain about is the lack of a standard undo system, which on the iPhone and iPad currently requires physically shaking the device.\nWith iOS 13, Apple is introducing a new standard undo gesture for text input on the iPad. The gesture starts as a three-finger tap on the keyboard area, sliding left and right allows the user to undo and redo actions interactively.\nThere will be a tutorial the first time the keyboard is opened to teach users how to use the new feature. It’s possible that developers will be able to adopt this interaction in custom controls through a public API.\nSafari on iOS 13 for the iPad will automatically ask for a desktop version of websites when necessary, preventing a common issue where websites will render their iPhone version even when running on an iPad with a big screen. YouTube is notorious for this behavior, forcing users to rely on a ‘Request Desktop Site’ button.\nFont management is getting a major upgrade on iOS 13. It will not be necessary to install a profile to get new fonts into the system anymore. Instead there will be a new font management panel in Settings. A new standard font picker component will be available for developers and the system will notify the user when they open a document that has missing fonts.\nSmarter Mail, improved multiple item selection, more\nThe Mail app is getting smarter for the first time in a while: the upgraded app will be able to organize messages into categories such as marketing, purchases, travel, “not important” and more, with the categories being searchable. Users will also be able to add messages to a “read later” queue similar to third-party email apps.\nEngineers are also working on bringing easy collaboration to third-party document-based apps, similar to what’s already available in Apple’s own productivity apps including Pages, Numbers and Keynote.\nThe focus on productivity on iOS continues with the inclusion of new gestures to allow for the selection of multiple items in table views and collection views, which make up for most of the user interfaces found in apps that list large amounts of data. Users will be able to drag with multiple fingers on a list or collection of items to draw a selection, similar to clicking and dragging in Finder on the Mac.\nThere will also be the ability for developers to use a different status bar style (light or dark) for each side of an in-app splitview, which should prevent issues that currently happen in some apps where the status bar will lack contrast with the background in one side of the splitview. Split Views on Marzipan apps based on iPad designs that run on the Mac will get the ability to be resized by dragging the divider and have their position reset when double-clicking the divider, like existing Split View apps on the Mac.\nNew Volume HUD and other changes\nOther features to come with iOS 13 include a redesigned Reminders app, which is also coming to the Mac, a new volume HUD (the current obtrusive one has been a UI joke for a while now), better “Hey Siri” rejection for common mistaken noises such as laughter and crying babies, better multilingual support for keyboards and dictation, and expanded in-app printing controls.\nThanks to Steve Troughton-Smith for his help with this report.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.02879042545100674
    },
    "article_6": {
        "title": "On this day in 1976, Ronald Wayne sold his 10% share of Apple for $800.",
        "body": "You don’t hear all that much about Apple’s third founder, Ronald Wayne, and for good reason: he sold his stake in Apple just twelve days after the company was founded. It’d be worth $35 billion today. You might wonder what is going on in the head of a guy who made a blunder like that. Well, Wayne would like to tell you in his new autobiography, and… surprise… he doesn’t think he made a mistake at all!\nThis post contains affiliate links. Cult of Mac may earn a commission when you use our links to buy items.\nWayne, now 77, worked with Jobs and Wozniak at Atari before the trio left to work on the first Apple computer. He is credited with drawing up the first Apple logo, but he wasn’t part of the group for long before he left his partners to it.\nWhy? Well, unlike Jobs and Wozniak, Wayne had personal assets that could have been seized by potential creditors, and so after just a 12 days – yes, days! — Wayne left Apple. He sold his 10% stake in the company for just $800. Today, that 10% stake would be worth a whopping $35 billion.\nJobs tried to tempt Wayne back, according to Macworld, but Wayne decided to pursue a career in scientific research and building gambling machine instead. The description for Adventures of an Apple Founder reads:\n“In the spring of 1976 while working as chief draftsman and product development engineer at the video game maker Atari, Ron assisted a co-worker with the subtle intricacies of forming a small business. It was with Ron’s natural sensibilities, experiences, and skills honed over a lifelong career in many disciplines that he offered himself openly as a resource to two much-younger entrepreneurs: Steve Jobs and Steve Wozniak. These same traits would drive Ron’s decision to leave a short time later.”\nIf you missed it, be sure to check out Wayne’s interview, along with Wozniak, for Bloomberg, in which the pair recollect the early days at Apple.\nYou can download the book now from the iTunes Store for $9.99, or from the Kindle Store for $11.65.\n[via Macworld]",
        "sentiment": -0.07625906934079371
    },
    "article_7": {
        "title": "Record 83% of Surveyed U.S. Teens Own an iPhone",
        "body": "iPhone continues to be the most popular smartphone among American teenagers based on a recent survey.\nShutterstock\nA record 83 percent of U.S. teens own an ‌iPhone‌ as of spring 2019, according to investment bank Piper Jaffray's semiannual \"Taking Stock With Teens\" survey of around 8,000 high school students. Respondents were roughly 54 percent male and 46 percent female with an average age of 16.3 years.\nMeanwhile, 86 percent of U.S. teens expect their next smartphone to be an ‌iPhone‌, matching an all-time high set in fall 2018. This metric has steadily grown in Apple's favor over the years, rising from 75 percent in spring 2016.\n‌iPhone‌ popularity among teens is a good sign for Apple, as many of them could stick with the ‌iPhone‌ as an adult. Teens also become locked into the Apple ecosystem at an early age, becoming accustomed to services like iMessage, Apple Music, and iCloud as well as accessories like the AirPods and Apple Watch.\nThe survey found that 27 percent of U.S. teens own a smartwatch, while 22 percent of respondents plan to purchase an Apple Watch within the next six months. By comparison, 20 percent of teens said they plan to purchase an Apple Watch in the next six months in the year-ago survey.\nPiper Jaffray divided its survey into two distinct income groups: \"upper-income\" with household incomes approximating $100,000 and \"average-income\" with household incomes approximating $55,000 based on zip code and census data.",
        "sentiment": 0.11538526266813279
    },
    "article_8": {
        "title": "Apple beats all PC makers on laptop tech support, scores 91 out of 100 on undercover tests",
        "body": "(Image credit: Laptop Mag)\nApple's been strutting around — Connor McGregor-style — as the reigning king of laptop tech support for the past couple of years. Does the tech giant still have its customer service charm? I had to channel my inner detective and find out myself. Whipping out my best Oscar-worthy acting performance, I masqueraded as a damsel in distress in need of Apple's assistance with the following queries: disabling automatic updates, downloading Microsoft Edge, and turning on Dark Mode.\nApple's phone-support experience, with its shared-screen remote assistance and helpful agents, was painless and pleasant. As a cherry on top, Apple's online live chat offered a dash of humor that left a positive lasting impression. Apple's Twitter support, on the other hand, paled in comparison to the tech giant's phone and live-chat service. Despite this, I'd recommend Apple's customer service — just don't tweet Apple for help.\nApple tech support\nSwipe to scroll horizontally Overall Web Score Phone Score Avg. Call Time Phone Number Web Support 85/100 51/60 34/40 10:02 800-275-2273 Link\nLive chat, Twitter and Apple Support app\nMy co-workers’ jaws dropped when I told them that the ubiquitous Apple brand did not have a tech support platform for Facebook. But the Cupertino-based tech giant makes up for it by providing three other avenues for help seekers: live chat, Twitter and an Apple support app\nPretending to be fed up with Safari, I asked a live-chat agent — Florida-based Geovani — to help me install the new Microsoft Edge browser on my MacBook Air. I was expecting Geovani to protest, but instead, he kindly typed, \"I understand your concern and would be happy to team up with you to find the best solution.\" This might have been a canned response, but I appreciated it nonetheless.\n(Image credit: Laptop Mag)\nIn 10 minutes, Geovani patiently guided me through downloading the Microsoft Edge browser, and he even had a sense of humor. After installing Microsoft Edge, Geovani asked me if I saw the icon appear on the bottom dock. When I said yes, he replied, \"Good, now let's laugh at it!\"\nMy experience with Apple's Twitter support wasn't nearly as eventful. At 12:24 p.m. EST, through Twitter's direct message system, I asked Apple to help me turn on dark mode. Two minutes later, I received a reply that said, \"Sure thing, we're happy to help. You can learn about the requirements, and how to use Dark Mode here.\" A link to an article titled \" How to Use Dark Mode on Your Mac\" (opens in new tab) followed. That's it? Are you not going to walk me through this, Apple?\nThe third platform I used is the Apple Support App that I downloaded on my iPhone. This time, I wanted to know how to disable automatic system updates. After navigating through Apple's archive of help articles on the app, I couldn't find anything that specifically outlined how to switch off unauthorized updates. But to be fair, Apple's excellent live chat and phone support — brimming with helpful, human agents — eliminates the time-wasting burden of writing an article for every single possible question that could pop up in a customer's mind.\nPhone support\nBrandon, a top-notch tech-support agent from St. Louis, provided me with smooth-sailing guidance when I asked for help with disabling automatic system updates. At 8:20 a.m. EST, using a remote screen-sharing service, the friendly agent articulately guided me through ticking off the automatic updates box. On top of that, Brandon spotted that my time zone was incorrect, so he volunteered an extra 2 minutes of help to provide instructions on how to rectify this issue. Bravo, Brandon! My chat lasted no more than 10 minutes.\nMy experience with Amir, on the other hand, was mediocre. He was friendly, but a little disoriented. When he asked me for my name, he forgot it a few seconds later and called me \"Ashley.\" He apologized and said, \"It's been a long day.\"\n(Image credit: Laptop Mag)\nAt 1:34 p.m. EST, I asked Amir to help me install the new Microsoft Edge browser. He seemed to be in disbelief that I would need help with such a simple task. He asked, \"Did you have issues downloading it from the App Store?\" What Amir didn't know, though, is that one cannot download Microsoft Edge from the App Store.\nAmir, still radiating a warm and friendly aura, inaccurately guided me to the App Store to download Microsoft Edge through the remote screen-sharing service. Realizing the flub, he then instructed me to click on Safari to search for Microsoft Edge. From there, he helped me install the new Microsoft Edge browser. My call with Amir lasted 10 minutes and 12 seconds.\nTiffany — a Virginia-based tech agent — may deter Apple from climbing to the top of the list in our 2020 Tech Support Showdown. She was my quickest phone call as 4 minutes just whizzed by, but this isn't praiseworthy; Tiffany was rushing me off the phone.\nWhen Tiffany first picked up my call at 5:17 p.m. EST, she was having some witty banter with a nearby co-worker. When I said \"Hello?\" there was some silence for a few seconds, and then Talkative Tiffany suddenly transformed into Tactful Tiffany. She code-switched into her professional voice and began her customer service script. Tiffany wasn't as friendly and warm as Amir and Brandon, but she wasn't impolite, either. I'd describe her as \"brusque.\"\nI asked her how to turn on Dark Mode, and she hastily blitzed through the process. She was right on the money with her guidance, but I wish she didn't have such a \"hurry up, you're wasting my time\" tone. Tiffany's impatience with an undercover spy (who happens to be one of this year's judges on Laptop Mag's Tech Support Showdown panel) may knock Apple off its undefeated pedestal.\nWarranty\nApple will swoop in and save the day with free telephone technical support, but only within the first 90 days of product ownership. If you need an Apple agent to be your helpful hero beyond that time frame, you'll have to pay up. Through AppleCare+ (formerly known as AppleCare Protection), you can lock down three years of telephone support coverage and hardware service. For $99, you can secure coverage for screen and external closure damages, and for $299, you can snag coverage for other blows to your laptop.\nOnce you've snagged AppleCare+ coverage for your device, you can find out how much time is left on your plan with our Apple Warranty Check guide.\nBottom line\nThis year, the calls I made to Apple started off with a bang with a fantastic Missouri-based tech support agent, but my satisfaction plummeted into disappointment due to the lack of professionalism that emanated from my rushed chitchat with Tiffany.\nThis year, the average call time increased by 3 minutes and 22 seconds, but my experience with Tiffany proves that a speedier phone call does not lead to better customer service. For example, although Amir struggled slightly in the beginning providing accurate instructions, his friendly personality and willingness to help made his service charming — I even forgot that he misremembered my name.\nIf Apple wishes to shoot for a higher score in 2021, I'd make an out-of-the-ordinary suggestion to the tech giant: increase employee morale to re-energize tech support agents, especially those in call centers. Though Brandon had a lively energetic tone, Amir commented that he had a \"long day\" and Tiffany seemed disengaged and aloof.\nDespite a few hiccups, Apple's tech support is solid. At first, I was hesitant about allowing a tech agent to remotely access my MacBook Air, but this shared-screen service ended up being my favorite part of the process. With a few tweaks, Apple could reach the pinnacle of tech-support perfection.",
        "sentiment": -0.0013689324259757996
    },
    "article_9": {
        "title": "Rumor: Apple to Launch iPhone XE with 4.8-inch Edge-To-Edge OLED Display with Face ID in Q3 2019",
        "body": "Apple is preparing an entry-level “iPhone XE” that will be introduced this fall, according to a sketchy new report.\nThe device is claimed to be an iPhone SE successor with huge improvements, including an edge-to-edge display and Face ID. It could also pack Apple’s latest A12 Bionic processor.\nIf you’re still a fan of compact smartphones, your options are extremely limited in 2019. You either have to opt for a handset that’s significantly larger than you normally prefer, or one that’s a lot older.\nApple’s last compact smartphone, the iPhone SE, is now three years old. But just like the MacBook Air and the iPad mini, it could make a comeback in 2019 with big improvements.\niPhone SE will be reborn in 2019\nThe new iPhone SE will be called the iPhone XE, according to a report from PC-Tablet. It will supposedly offer a 4.8-inch edge-to-edge OLED display and Face ID. That means it will have a notch but no Home button.\n“iPhone XE will still come in iconic rectangular slab design with an aluminum back, so no wireless charging this time,” the report adds. “The internals of the iPhone XE is still unknown but if it will be coming with Face ID, it’s automatically understood that it will feature Apple’s latest A12 Bionic chip.”\nThe device is also expected to feature a 12-megapixel an f/1.8 aperture — like the rear-facing camera in the iPhone XR.\nMade in India\nThe report says the iPhone XE will be manufactured by Foxconn in India, which suggests it could be aimed primarily at locals and other emerging markets. It cites a source “closely associated” with the facility.\n“Our source got no information about the battery specs or internal storage details yet,” it adds. “The retail pricing of iPhone XE could go as high as $600.”\nWe would advise you to take these claims with a bucket full of salt for now. This is the first time we’ve seen a report predicting Apple’s plans from PC-Tablet, so we can’t vouch for its accuracy. And there is no way to verify its claims.\nSome aspects of the report also seem implausible.\nIt’s unlikely Apple would put a pricey OLED display inside a budget device. Not even the $750 iPhone XR has one. It also seems crazy that it would charge $600 for what seems to be a phone designed for emerging markets.\nBut you never know.",
        "sentiment": -0.349273741543293
    },
    "article_10": {
        "title": "The iPhone’s camera used to be a selling point",
        "body": "There are many good reasons to own an iPhone: your social life might revolve around iMessage, you might value Apple’s emphasis on privacy, or perhaps you appreciate the quality of Apple’s displays and software experience. But the one thing that once exemplified Apple’s lead over the Android chasing pack, the iPhone’s camera, is no longer top of the list of reasons to want an iPhone. The iPhone camera has fallen behind, and it’s now something users tend to accept rather than anticipate.\nFour years ago, I wrote that to beat the iPhone, you have to beat the iPhone’s camera. At the time, Apple owned the uncontested title for best mobile camera, on the strength of the iPhone’s unique combination of high-quality photos and ease of use. Few, if any, other cameras were as quick and easy to use, and none produced great photos as effortlessly as the iPhone did. With Facebook, Instagram, Snapchat, and even Twitter all relying on the camera to let people engage and share with the digital world, it was obvious that a great camera was paramount to the appeal of a great smartphone.\nMobile cameras are improving at an incredible rate, but you wouldn’t know it from looking at Apple and Samsung\nI wasn’t alone in my estimation of the camera’s importance, and in the past couple of years every phone company has worked overtime to secure a lead in this all-important area. Well, every company except for Apple and Samsung, it seems. The two companies selling the most smartphones have contented themselves with only incremental imaging improvements year after year, and if you’re in a limited market like the US where they’re the only options you see, you could start to believe that mobile cameras have stagnated.\nThat couldn’t be further from the truth.\nGoogle came out with the Pixel camera in 2016 and raised the bar of expectation for mobile photography a couple of notches above the iPhone. HTC responded with the brilliant cameras in the U11 and U11 Plus. Then Huawei introduced a terrific night mode on the P20 Pro last year, besting the Pixel, only for Google to respond with Night Sight, which was a revolution for nighttime imaging. And now, Huawei has returned with an even better P30 Pro that steps ahead of Night Sight. Come the autumn, the Pixel 4 is likely to push us even further into the age of unbelievable computational photography.\nWhere is the iPhone?\nThat’s not just my question, it’s a repeated query I’ve heard from readers in reaction to my sample photos from the P30 Pro’s excellent camera. It wasn’t that long ago that we looked to Apple to be the leader in popularizing — if not necessarily inventing — new creative technologies. Apple’s MacBooks are still the most commonly used laptops for DJs and video producers, while iPads are the only tablets making any real progress toward fulfilling the promise of being a whole new creative outlet. But the iPhone, even while maintaining an edge in video quality and improving its stills photography in small ways every year, has been surpassed by faster-moving competitors.\nHuawei didn’t settle for merely raising the bar for low-light photography. It has put a 5x optical zoom lens in the P30 Pro, the periscope design for which has also been demonstrated in prototype form by Oppo. Assuming OnePlus, which shares most of its technological base with Oppo, also does a periscope-zoom phone, by the end of the year we could have a choice from as many as four or five different phones with 5x optical zoom. And the results I’m getting while zooming in to 10x and even 24x with the Huawei P30 Pro are very good, too. 2019 is the year when real, high-quality zoom is coming to smartphones.\nThe conventional wisdom in tech is that Chinese companies, like Huawei, can aggressively pursue zany and risky ideas that more established brands like Apple can’t afford to take chances on. That’s correct. But what’s different about it now is that the chances Huawei is taking are paying off: I’ve seen this company go from a no-name also-ran in smartphones to the purveyor of truly premium devices, as exemplified by last year’s P20 Pro and Mate 20 Pro. This year’s Mate X is the consensus pick for best foldable design we’ve yet seen. And what’s more, Huawei is keeping its aggression up even while shipping as many, sometimes more, phones as Apple is.\nPhoto by James Bareham / The Verge\nThe iPhone can’t be the best phone if it has the third-best camera\nThis could always be the quiet before the storm of new groundbreaking designs and innovations from Apple. I’ve been covering this company long enough to not be surprised by its ability to outdo everyone else when it really wants to. The AirPods, for instance, haven’t changed in large part because they were so far ahead of their time when they were first released. There are also rumors of new 16-inch MacBooks and 32-inch iMacs on the horizon, though I’d be more comforted if I were hearing similar rumors about the iPhone’s cameras taking major steps forward.\nThe iPhone, for most of its existence, has been the standard-setting phone for mobile photography. Yes, the Nokia Lumia 1020 and 808 PureView happened, but they never put the pieces of usability and quality together quite like Apple’s phone did. Now we have a new wave of Android devices that are doing almost everything right on the camera front. With the P30 Pro’s arrival, there’s no room for the iPhone in the top two camera spots (for stills photography, at least), and Apple is in the unusual position of having to run just to catch up.",
        "sentiment": 0.35867531664478475
    },
    "article_11": {
        "title": "Apple adds new ‘Confirm Subscription’ step for in-app subscription signups on iOS",
        "body": "Seemingly in an effort to combat the ongoing problem of accidental App Store subscriptions, Apple has added an extra step to the subscription process in the App Store. Apple will now present users with a “Confirm Subscription” popup before finalizing the details.\nThis change was first noted by developer David Barnard on Twitter this afternoon. Starting sometime in the last week, Apple has added an additional step to the subscription process. After you authenticate via Touch ID or Face ID, you’ll see a pop-up asking you to confirm your subscription:\nConfirm Subscription The subscription will continue unless canceled in Settings at least one day before a subscription period ends.\nAccidental subscription signups have been a major problem, especially for users with Touch ID iPhones. Essentially, users would see a subscription popup and immediately press the Home button to try and exit the app. When they placed their finger on the Home button, Touch ID would instead authenticate – signing users up for a subscription.\nApple has taken several steps to counteract problems with hidden and devious subscriptions in iOS apps. Earlier this year, the company revamped documentation for app subscriptions, explaining that developers must clearly present the subscription price and other details.\nThe new confirm subscription step rolled out sometime in the last week, making it an unusual change that wasn’t included in a standard update to iOS. Nonetheless, it’s great to see Apple making things clearer for iOS users. What do you think about this change? Let us know down in the comments.\nRead more:\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.09878129349090159
    },
    "article_12": {
        "title": "With iOS 13, mouse and trackpad support is apparently coming to iPad.",
        "body": "On last week’s episode of the Connected podcast, MacStories editor Federico Viticci revealed a pretty interesting scoop he’d been sitting on: mouse support is apparently coming to iPad with iOS 13, which will be previewed at WWDC 2019 on June 3 ahead of launch this fall.\nViticci said:\nI want to go on the record with this because it’s the season of rumors. Something that I heard from a couple of people a few months ago sort of mentioned to me just casually, “Wouldn’t it be funny if you could have a mouse cursors on iPad as an accessibility feature?” I thought that was a fascinating idea. My understanding of these conversations was that enabling mouse support on iPad as part of the AssistiveTouch accessibility feature would make sense—you plug in a mouse and you get a cursor. But then I started doing some research and I learned that actually it’s already possible, if you have right accessibility hardware like special joysticks and motors, to have some kind of cursor on iOS. This is already possible and has been possible for years. But what I heard from sources is that without any adapter you will be able to use a USB-C mouse, on your iPad, as an accessibility device.\nHis claim was corroborated by prolific Irish developer Steven Troughton-Smith who confirmed on Twitter that “as far as I’m aware, that is indeed in the works.”\nIf you missed last week's @_connectedfm, @viticci had a pretty interesting scoop that he'd been sitting on re mouse support coming to iPad as an accessibility feature. As far as I'm aware, that *is* indeed in the works. I feel like every pro user will turn that on, day one 😂 — Steve Troughton-Smith (@stroughtonsmith) April 22, 2019\nMouse and trackpad support seems to be an iPad-only feature and it’s something that’ll be buried in accessibility settings.\n“I feel like every pro user will turn that on, day one,” Steve added. This has a lot to do with Project Marzipan, Apple’s upcoming framework for building cross-platform iOS/macOS apps.\nAdding fuel to the fire, Belgian developer Louis D’hauwe who has created a proof-of-concept PointerKit framework to use a pointing device on iOS is now with Apple, and has been since at least October 2018.\nHere’s a video showing PointerKit in action.\nOf course, adding mouse support implies making changes to iOS to make the operating system cursor-friendly. There will need to be a pointer of some kind, perhaps a circle or an arrow.\nPreviewed last year, an improved Marzipan will be released to developers at WWDC 2019. “With UIKit adopting all kinds of API for mouse support for the Mac, it makes a ton of sense to let that be leveraged on iPad, too, if somebody has a mouse connected,” Steve opined.\nI can confirm that mouse support is coming to iOS 13 as an accessibility feature. You should trust @stroughtonsmith 😉 — Guilherme Rambo (@_inside) April 25, 2019\nIn simpler terms, Apple won’t be de-emphasizing the primary touch paradigm in iOS 13. Touch is still going to be the main input method for a vast majority of users. But for power users, mouse and trackpad functionality will be there should they need it.\nEarlier reporting indicated that iOS 13 will bring app windows with detachable menus to iPad and that apps will be able to open multiple windows. Managing windows on a tablet using just one’s finger doesn’t make for a very good user experience—hence, mouse support. I believe Apple will at some point release a Smart Keyboard Folio for iPad with a built-in trackpad.\n“Mouse support on iPad is a band-aid that needs to be ripped off so that we can move on, just like for the stylus—which is now one of the most important iPad accessories,” he added. “New input devices beget whole new categories of apps, and that’s a good thing for iPad.”\nAre you looking forward to mouse support on iPad? And if so, will this feature make iPad Pro so much more pro, do you think?\nDo share your thoughts with fellow readers in the comments down below.",
        "sentiment": 0.2891801461810246
    },
    "article_13": {
        "title": "Apple Paid an Estimated $5-$6 Billion to Settle Qualcomm Dispute, Plus $8-$9 Per iPhone in Royalty Fees",
        "body": "Apple likely paid somewhere around $5 to $6 billion to settle its ongoing legal battle with Qualcomm, according to estimates shared today by UBS analyst Timothy Arcuri (via CNBC).\nThe $5 to $6 billion payment would have been for royalty fees that Apple had stopped paying over the course of its two year legal fight with Qualcomm.\nQualcomm may also be receiving between $8 and $9 per iPhone from Apple in ongoing patent royalties, a figure calculated based on guidance numbers that Qualcomm provided following the settlement. Qualcomm said that it expects its earnings per share to increase by $2.\nApple previously paid $7.50 in royalties, so at $8 to $9 per ‌iPhone‌, Apple would be shelling out more cash than it did before.\nApple appears to have had no alternative but to settle with Qualcomm, as it had no other way to source 5G chips for its 2020 ‌iPhone‌ lineup. Apple initially planned to use Intel chips, but rumors suggested Intel wasn't meeting development goals, leading to tension between Apple and Intel.\nJust hours after Apple and Qualcomm announced a settlement deal, Intel said that it was exiting the 5G smartphone modem business and would not be making 5G smartphone chips at all.\nIt's not entirely clear if Apple settled with Qualcomm because it knew of Intel's plan to abandon 5G chip development or if Intel made the decision after learning of Apple's settlement plans, but either way, it leaves Apple with no choice but to re-adopt Qualcomm chips for future iPhones.\nSmartphone makers like Samsung will have 5G smartphones available starting this year, so Apple could not afford to delay the rollout of its 5G iPhones. Launching in 2020 already puts Apple somewhat behind, but 5G networks from U.S. carriers are still very much in development.\nFollowing news of the settlement, Qualcomm's stock has gone up over 38 percent, marking a big win for the San Diego company. The agreement includes a six-year licensing deal along with a \"multiyear chipset supply agreement.\"\nIt sounds like Apple will need to rely on Qualcomm for the foreseeable future, but Apple is working on its own modem chip technology, which may eventually allow it to drop Qualcomm as a modem chip supplier.",
        "sentiment": -0.22523029853722878
    },
    "article_14": {
        "title": "The MacBook keyboard fiasco is surely worse than Apple thinks",
        "body": "Apple keep insisting that only a “small number of customers have problems” with the MacBook keyboards. That’s bollocks. This is a huge issue, it’s getting worse not better, and Apple is missing the forest for the trees.\nThe fact is that many people simply do not contact Apple when their MacBook keyboards fail. They just live with an S key that stutters or a spacebar that intermittently gives double. Or they just start using an external keyboard. Apple never sees these cases, so it never counts in their statistics.\nSo here’s some anecdata for Apple. I sampled the people at Basecamp. Out of the 47 people using MacBooks at the company, a staggering 30% are dealing with keyboard issues right now!! And that’s just the people dealing with current keyboard issues. If you include all the people who used to have issues, but went through a repair or replacement process, the number would be even higher.\nWorth noting here is that the 3rd generation membrane keyboard did nothing to fix the issues. Six out of thirteen – nearly half!! – of the 2018+ MacBooks we have at the company have a failed keyboard.\nI backed up those figures with a Twitter poll that has over 7,000 respondents already. That’s a 63% failure rate!! But Apple is only seeing 11% of those, as the vast majority of customers are simply just living with their broken computer:\nThis is a disaster. A complete unmitigated disaster.\nBut as always, in a time of crisis, the event itself is less indicative of the health of a company than the response. Is Apple going to accept that they’re currently alienating and undermining decades of goodwill by shipping broken computers in mass quantities?",
        "sentiment": -0.5251771946204826
    },
    "article_15": {
        "title": "One of Google’s top A.I. people just joined Apple",
        "body": "Ian Goodfellow, one of the top minds in artificial intelligence at Google , has joined Apple in a director role.\nThe hire comes as Apple increasingly strives to tap AI to boost its software and hardware. Last year Apple hired John Giannandrea, head of AI and search at Google, to supervise AI strategy.\nGoodfellow updated his LinkedIn profile on Thursday to acknowledge that he moved from Google to Apple in March. He said he's a director of machine learning in the Special Projects Group. In addition to developing AI for features like FaceID and Siri, Apple also has been working on autonomous driving technology. Recently the autonomous group had a round of layoffs.\nA Google spokesperson confirmed his departure. Apple declined to comment. Goodfellow didn't respond to a request for comment.",
        "sentiment": -0.06762529350817204
    },
    "article_16": {
        "title": "Next major macOS version will include standalone Music, Podcasts, and TV apps, Books app gets major redesign",
        "body": "During the “It’s show time” event in late March, Apple announced that the TV app would be coming to the Mac soon. This naturally sparked discussions about whether Apple would be bringing its other media apps to the Mac, finally splitting up iTunes into distinct applications.\nFellow developer Steve Troughton-Smith recently expressed confidence about some evidence found indicating that Apple is working on new Music, Podcasts, and perhaps Books apps for macOS, to join the new TV app.\nI’ve been able to independently confirm that this is true. On top of that, I’ve been able to confirm with sources familiar with the development of the next major version of macOS – likely 10.15 – that the system will include standalone Music, Podcasts, and TV apps, but it will also include a major redesign of the Books app. We also got an exclusive look at the icons for the new Podcasts and TV apps on macOS.\nThe new Books app will have a sidebar similar to the News app on the Mac, it will also feature a narrower title bar with different tabs for the Library, Book Store, and Audiobook Store. On the library tab, the sidebar will list the user’s Books, Audiobooks, PDFs and other collections, including custom ones.\nThe new Music, Podcasts, and TV apps will be made using Marzipan, Apple’s new technology designed to facilitate the porting of iPad apps to the Mac without too many code changes. It’s not clear whether the redesigned Apple Books app will also be made using the technology, but given that the redesign came to iOS first and its usage for the other apps, it’s likely that this new Books app will also be using UIKit.\nUpdate 5/9: We’ve now learned that the code for the new Music app for macOS will be based on iTunes, not iOS.\nWith the standalone versions of Apple’s media apps coming to the Mac, it’s natural to ask: what about iTunes in macOS 10.15? According to sources, the next major version of macOS will still include the iTunes app. Since Apple doesn’t have a new solution for manually syncing devices such as old iPods and iPhones with the Mac, it’s natural to keep iTunes around a little longer.\nAgain, here’s an exclusive look at the icons for the new Podcasts and TV apps on macOS:\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.21793010592227802
    },
    "article_17": {
        "title": "Runaway Saudi sisters urge Google and Apple to pull woman-monitoring apps",
        "body": "T wo Saudi sisters have urged Apple and Google to pull the government app Absher, which allows men to monitor and control female relatives' travel.\nMaha and Wafa al-Subaie, who are seeking asylum in Georgia, said the app helped trap girls in abusive families, controlled by Saudi's strict male guardian system.\n\"It gives men control over women,\" said Wafa, 25. \"They have to remove it,\" she added, referring to Google and Apple.\nMaha, 28 and Wafa, 25 fled Saudi Arabia to for Tbilisi, Georgia via Tuckey earlier this month.\nThe pair had to steal their father’s phone and log onto his Absher account and give themselves permission to go to Istanbul.\nThe free e-service which is provided by the country’s Ministry of the Interior and is available in the Saudi version of Google and Apple online stores, allows men to update or withdraw permission for female relatives to travel abroad.\nUsers receive SMS updates if the women’s passports are used, according to researchers.\nApple's chief executive Tim Cook said in February that he had not heard of Absher but pledged to \"take a look at it\".\nAbsher allows Saudis to access a wide range of government services, such as renewing passports, making appointments and viewing traffic violations.\nSaudi women must have permission from a male relative to work, marry and travel under the ultra-conservative Islamic kingdom's guardianship system, which has faced scrutiny following recent cases of Saudi women seeking refuge overseas.\nThe al-Subaie sisters said they knew of dozens of other young women who were looking to escape abusive families.\nTech giants could help bring about change in Saudi Arabia if they pulled Absher or insisted that it allows women to organise travel independently - which would significantly hamper the guardianship system - they said.\n\"If (they) remove this application, maybe the government will do something,\" Wafa told the Thomson Reuters Foundation in an interview.\nThe sisters' plea added to growing calls from rights groups, diplomats and US and European politicians for the app to be removed from online stores.\nUnited Nations human rights chief Michelle Bachelet said on Wednesday that she had asked tech companies in Silicon Valley \"tough questions\" this month about the \"threats\" posed by apps like Absher which allow Saudi men to restrict women's movement.\nAFP/Getty Images\n\"Technology can, and should, be all about progress. But the hugely invasive powers that are being unleashed may do incalculable damage if there are not sufficient checks in place to respect human rights,\" she said in a statement.\nSaudi Crown Prince Mohammed bin Salman has introduced reforms, such as lifting the driving ban for women, and indicated last year that he favoured ending the guardianship system.\nBut he has stopped short of backing its annulment.\nWestern criticism of the kingdom has sharpened with the trial of 11 women activists who said last month that they had been tortured while in detention on charges related to human rights work and contacts with foreign journalists and diplomats.\nThe public prosecutor has denied the torture allegations and said the women had been arrested on suspicion of harming Saudi interests and offering support to hostile elements abroad.\nA Saudi teen won global attention and asylum in Canada when she holed up in a Thai airport hotel in January to escape her family.\nTwo other Saudi sisters who hid in Hong Kong for six months were granted visas in March to travel to a third country.\n\"Increasing cases of women fleeing the country are indicative of the situation of women in Saudi Arabia,\" said Lynn Maalouf, Middle East research director for rights group Amnesty International.\n\"Despite some limited reforms, (they) are inadequately protected against domestic violence and abuse and, more generally, are discriminated against.\"\nAdditional reporting by AP/Reuters",
        "sentiment": -0.4297976859916861
    },
    "article_18": {
        "title": "@Gruber: \"These keyboards are the biggest mistake in Apple’s history.\"",
        "body": "Casey Johnston, writing at The Outline:\nFueled by equal parts irrational hope I knew I shouldn’t trust and deep skepticism to which I should have listened, I bought the 2018 MacBook Air. Sure enough, a couple months into owning this computer, the keys started to act up. As before, problems would come and go; the E or B key would be unresponsive for a day or so before whatever was jamming them up mysteriously went away. The spacebar was the worst offender. For a long while it doubled spaces from a single keypress, but only sometimes. Finally, it seemed to get something lodged under it big or annoying enough that it couldn’t shake itself loose, and I had to pound it to get a space out of it; for two days, my sentencescame outlikethis. I made a Genius Bar appointment.\nThese keyboards are the biggest mistake in Apple’s history.*\nEven if they ship a truly new, reliable keyboard this summer (which I think they will, because if they don’t, it means they’re in deep denial of a huge problem), how long will it take for that new keyboard to roll out across the entire MacBook line? Even if Apple is on the case, hard at work on a new keyboard, there are likely to be brand-new MacBooks in the lineup with the unreliable butterfly keyboards for at least another year.\nThe real harm is to the long-term reputation of the entire MacBook brand.\n* Or at least modern Apple history — post-NeXT-reunification. There’s no point comparing it to the Apple III or Lisa.\n★ Friday, 26 April 2019",
        "sentiment": -0.37399756679168117
    },
    "article_19": {
        "title": "HomePod pricing cut to $299 in the U.S",
        "body": "Apple Music is a streaming service that allows you to listen to over 100 million songs. Its features include the ability to download your favorite tracks and play them offline, lyrics in real time, listening across all your favorite devices, new music personalized just for you, curated playlists from our editors, and much more. All this in addition to exclusive and original content.\nYour iTunes library is still yours. You can access your entire collection from Apple Music or from iTunes for macOS or Windows.",
        "sentiment": 0.41218322664499285
    },
    "article_20": {
        "title": "Apple revamping Find My Friends &amp; Find My iPhone in unified app, developing Tile-like personal item tracking",
        "body": "Apple is working on a new app that’s going to replace the Find My Friends and Find My iPhone apps. With codename “GreenTorch”, the app is currently being tested by engineers at the company.\nPeople familiar with its development shared exclusive details about the project with 9to5Mac, but asked to remain anonymous discussing the company’s plans. The new app will have the same features of the two existing apps, but combined into a single app, which will be available on both iOS and on macOS, as a Marzipan app.\nThe new unified app includes an improved ability to find a user’s devices. Called “Find Network”, the feature allows devices to be tracked even when not connected to Wi-Fi or to a cellular network.\nBesides sharing their location with members of their family, users are also able to share their location with any friend. Friends can also send location sharing requests to other people. When a friend is sharing their location with a user, they’re be able to create notifications for when this friend arrives or leaves a specific location.\nAll devices from a user – and their family – can be located using the unified app, including AirPods. Devices can be put in “lost mode” or made to play a sound using the same app, just like Find My iPhone.\nApple also wants users to be able to track any item – not just their Apple devices – using this new unified app. The company is working on a new hardware product, known only as “B389” by the people involved in its development.\nThis new product will be a tag that can be attached to any item – similar to other products like Tile. The tag will be paired to a user’s iCloud account by proximity to an iPhone, like AirPods. Users will be able to receive notifications when their device gets too far away from the tag, preventing them from forgetting the item the tag is attached to. Certain locations can be added to a list of ignored locations, so that the item can be left at those locations without the user being notified. The location of a tag can also be shared with friends or family.\nUsers will be able to store their contact information in the tag, which can be read by any Apple device when the tag is put into “lost mode” – the owner of the tag will receive a notification when it is found. It seems that Apple wants to leverage the vast amount of active Apple devices to create a crowdsourced network that helps its users find any lost item, by using this new hardware product.\n9to5Mac was unable to get any information about when this product is supposed to ship to customers, but it could be announced as early as this September, when the company is expected to release new iPhones.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.18268010838200216
    },
    "article_21": {
        "title": "JCPenny: Apple Pay support dropped from both stores and app",
        "body": "Update: JCPenney told TechCrunch that it was unable to update its payment terminals to meet the latest requirements, so has switched off contactless functionality altogether. Read: it’s using old kit and can’t afford to replace it.\nDepartment store giant JCPenney has dropped support for Apple Pay from both its retail stores, and its app.\nThe company’s Twitter support account confirmed the change over the weekend …\nThe company made the statement in response to a customer asking why the company would do this.\nJCPenney made the decision to remove Apple Pay for our stores, we apologize for any inconvenience this may have caused. We will definitely forward your feedback regarding this for review.\nNotably, the company didn’t answer the actual question.\nMy wife went to your store today to buy stuff. She had her phone ready to pay and was told you guys removed #Applepay. Why would you remove a very secure form of payment? Do you not care about your customers security?\nCustomers in the Twitter thread are unimpressed.\nWell, you just lost my business. As other said, data breaches are a big problem and you took away an important tool. I no longer can trust you with my data. That’s very unfortunate you would retreat from the Securest form of payment. I just removed the JCP app from my phone. You know who else removed Contactless but had the hardware? Sears. Well guess you lost customers! Guess we’ll be shopping at your competition. What a customer-unfriendly move…the other two anchor stores at my local mall take it…this signals that either you’re inept with technology (data breach waiting to happen) or think some proprietary payment system will win out (it won’t). Please pass the word along to reconsider. Why? Is your aim to serve customers from 1990, or 2019?\nThe chain has so far not provided any explanation for the decision.\nJCPenney first started trialling Apple Pay in 2015, with a full rollout in 2016. The company, founded in 1902, has more than 800 stores across 49 US states. Former Apple retail head Ron Johnson left Apple back in 2011 to become CEO of JCP, a role he held for just two years, the chain disappointed in the results of his reshaping of the retail stores.\nFTC: We use income earning auto affiliate links. More.\nPhoto: Shutterstock\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.5234305188059807
    },
    "article_22": {
        "title": "Netflix explains the 'technical limitations' responsible for it removing AirPlay support on iOS",
        "body": "Netflix is offering more details on its decision to remove AirPlay functionality from its iOS app. The change was announced in an update to a support document on Netflix’s website last week, with the company attributing it to unnamed “technical limitations.”\nIn a statement to The Verge, however, Netflix elaborated on that limitation. Essentially, Netflix says that because Apple is opening AirPlay up to third-party TVs, it can no longer distinguish between devices. This means it can’t tell whether a user is sending content to an Apple TV or another device.\nUltimately, Netflix says that it is no longer able to “certify the experiences” through AirPlay on iOS. Here’s the full statement from Netflix:\nWe want to make sure our members have a great Netflix experience on any device they use. With AirPlay support rolling out to third-party devices, there isn’t a way for us to distinguish between devices (what is an Apple TV vs. what isn’t) or certify these experiences. Therefore, we have decided to discontinue Netflix AirPlay support to ensure our standard of quality for viewing is being met. Members can continue to access Netflix on the built-in app across Apple TV and other devices.\nWhether or not Netflix could eventually add AirPlay support back to its iOS app is unclear. It seems like the decision to remove the functionality is partly attributable to a “technical limitation” like Netflix originally said. Although, that limitation doesn’t appear to be a functionality problem, but rather Netflix not being able to ensure the user experience with the expansion of AirPlay to additional screens.\nWhat do you think about Netflix’s decision to remove AirPlay from its iOS app? Let us know down in the comments.\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2215198887926009
    },
    "article_23": {
        "title": "Apple Watch has another record quarter as Wearables business hits $5.1 billion",
        "body": "Apr. 30th 2019 2:43 pm\nApple Watch continues to be a strong source of growth for Apple. During Apple’s Q2 2019 earnings call, both Apple CEO Tim Cook and CFO Luca Maestri touted the success of Apple Watch during the quarter, revealing that three-quarters of Apple Watch sales are to first-time buyers.\nApple says that the second quarter of 2019 marks the best non-holiday quarter ever for Apple Watch. In total, Apple’s wearables, home, and accessories category set a new March quarter record with $5.1 billion in revenue. That’s up from $3.94 billion in the year-ago quarter.\nTim Cook said during the call that this makes Apple’s wearables business the size of a Fortune 200 company on its own. Meanwhile, Luca Maestri touted that wearables sales were up 50 percent year-over-year.\nIt’s rather remarkable to see that three-quarters of Apple Watch sales are to new customers. While Apple doesn’t break out individual sales numbers for Apple Watch, it would be interesting to see what portion of customers are buying the Apple Watch Series 4 versus last-generation models such as the Series 3 at lower prices.\nRead Apple’s full earnings release here. You can listen live to the Apple Q2 2019 earnings call audio streaming here, or listen back shortly after the call with Apple Podcasts.\nRead more:\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.11108234538031476
    },
    "article_24": {
        "title": "2 Oregon students returned thousands of fake iPhones, costing Apple $900,000, feds say",
        "body": "The iPhone’s First 10 Years: A look at its game-changing impact Duke marketing professor Debu Purohit reflects on the impact the smartphone has made. Professor Purohit looks back at predictions he made ten years ago about the iPhone.\n×\nDuke marketing professor Debu Purohit reflects on the impact the smartphone has made. Professor Purohit looks back at predictions he made ten years ago about the iPhone.\nTwo Oregon college students are accused of scamming Apple out of hundreds of thousands of dollars by returning fake Chinese iPhones — claiming they were real but broken — to get new, working iPhones in return, according to federal investigators. If you’d like to research this issue in an academic paper, feel free to get college homework help.\nAssociates paid the pair of students — Chinese nationals Yangyang Zhou and Quan Jiang — to send the working iPhones back to China, a criminal complaint filed last year against Jiang said.\nJiang faces federal charges of wire fraud and trafficking in counterfeit goods, and Zhou is charged with submitting false or misleading information on an export declaration, according to court records. Zhou appeared in U.S. District Court in Portland on Friday, the Oregonian reports, while Jiang is out of custody with a GPS monitor since he was accused of the crime last year.\nIn a statement, defense lawyer Jamie S. Kilberg said “Mr. Zhou was not aware of any alleged counterfeiting, and we believe Mr. Zhou will be vindicated,” KOIN reports. Jiang told federal investigators he didn’t know the phones were counterfeit, according to court records. Jiang’s defense lawyer declined to comment, the Oregonian reports.\nDuring the alleged scheme, Zhou and Jiang were living in Corvallis, Oregon, on student visas to study engineering — Zhou at Oregon Sciences University, Jiang at Linn Benton Community College, court documents said.\nAlso, Most international gambling portals have many third-party game suppliers onboard. This makes for a better gaming experience as the selection of slot machines will be much greater. So, Student should only play at the best non gamstop casinos.\nFederal authorities started investigating the scam in April 2017 after U.S. Customs and Border Protection intercepted shipments of phones that featured Apple logos and features, “but which appeared to be counterfeit based on shipping methods and packaging,” court records said.\nInvestigators said CBP officials in Portland tied more than five shipments from China to Jiang.\nDuring an interview at a Portland CBP office in December 2017, Jiang said a Chinese associate routinely shipped him packages of up to 30 iPhones that wouldn’t power on, and Jiang would then send them to Apple — one by one — to be fixed under the warranty, court records said.\nJiang told authorities he had the Chinese phones sent to him at varying addresses “to avoid the packages being detained by CBP,” court records said. Jiang said he sent in roughly 2,000 phones to Apple in 2017, claiming they needed to be fixed. After Apple sent Jiang working phones he shipped them to China, where an associate paid his mother and his mother put the money in a bank account Jiang could access, according to court records.\nInvestigators said they found this photo on one of the suspect’s phones, showing “approximately seven cardboard shipping boxes with the labels and markings used by Apple to return phones that have been submitted for warranty claims but rejected for being counterfeit or otherwise out of warranty.” U.S. District Court for the District of Oregon\nMonths before the CBP interview, Apple sent Jiang a cease-and-desist letter, but he denied having received notice from Apple that what he was doing was illegal, according to court records. CBP had also sent him letters in April and October telling him authorities had seized counterfeit phones destined for him.\nApple did not immediately respond to a request for comment on the case Tuesday night.\nApple records showed Jiang was associated (by name, email, address or computer) to 3,069 iPhone warranty claims — and 100 percent of those alleged the phone being returned wouldn’t power on, according to court records.\nAn Apple representative explained that “submission of an iPhone that will not power on is critical to perpetuating iPhone warranty fraud, as the phone will not be able to be immediately examined or repaired by Apple technicians, triggering the Apple phone replacement process as part of its product warranty policy,” court records said\nThe tech company’s records showed that 1,493 of Jiang’s more than 3,000 warranty claims ended with Apple sending him a replacement phone. If each of those phones were worth $600, that resulted in a $895,800 loss for the company, court records said.\nInvestigators discovered more than “300 counterfeit iPhones, shipping records, and warranty submission records” when they searched Jiang’s home in March 2018, the criminal complaint filed last month against Zhou said.\nApple records tied Zhou to more than 200 iPhone warranty claims, and CBP seized three shipments of a total of 95 phones headed for Zhou, according to the complaint.",
        "sentiment": -0.5639024603240672
    }
}