{
    "article_0": {
        "title": "Apple announces iPhone 11 Pro: triple camera, A13 chip, more",
        "body": "Apple officially announced the siblings to the iPhone 11 — the iPhone 11 Pro and the iPhone 11 Pro Max — as successors to iPhone XS and iPhone XS Max. The prices are the same as last year, $999 and $1,099. Preorders start Friday at 5 a.m. Pacific Time.\nThere’s a new midnight green color, a refreshed space gray and silver, and a new gold finish. Apple is also touting a wider dynamic range display called Super Retina XDR. And yes, it has a new triple camera system — a triangular array of lenses in a rectangular camera bump.\nApple has added an ultra-wide lens on both the iPhone 11 Pro and the iPhone 11, which is shown in the Camera app as a 0.5x button. Just zoom out to see more and take wider shots, from 0.5x to 2x. The ultra-wide has an f/2.4 aperture with a 120-degree field of view.\nThere are also upgrades to the telephoto and wide-angle lenses, including 100% Focus Pixels.\nThere is a new Night mode to take illuminated low-light photos similar to the Google Pixel Night Sight feature.\nApple is using computational photography to fuse photo data from all three lenses in order to improve image detail. A technology called ‘Deep Fusion’ combines nine images using a neural network analysis on every single pixel. Senior Vice President of Worldwide Marketing Phil Schiller described it as “computational photography mad science.”\nThey have also upgraded the front camera with a 12-megapixel sensor. The camera is also wider so you can now rotate to landscape on the selfie cam to fit more people into the frame. There is also slow-mo on the front camera for the first time.\nApple is also touting the iPhone 11 Pro’s video capabilities. Apple pairs the three cameras at the factory to improve color and exposure. You can now record 4K with extended dynamic range at 60 frames per second.\nApple demoed a new version of Filmic Pro that will let you shoot 4K from multiple cameras, and coordinate it on the phone.\niPhone 11 Pro includes Apple’s new A13 Bionic chip with faster CPU and GPU performance than iPhone XS and iPhone XR, making it the fastest smartphone on the market. The A13 chip includes new matrix multiplication features, ideal for machine learning tasks. Apple said it can perform over 1 trillion operations per second, and this makes the iPhone 11 Pro “the best machine-learning platform in any smartphone.”\nApple also boasted how it made the A13 Bionic chip the most efficient SoC to date, built on a new mm transistor fabrication process. This results in higher performance with lower power usage. Apple says you can now get up to four to five hours of longer battery life compared to iPhone XS. Apple is also including the 18W fast-charge adapter in the box.\nApple also touted increased durability and upgraded Face ID that works faster and from more angles.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.40275794411859206
    },
    "article_1": {
        "title": "Amazon executive promotes the company’s new Echo Buds ... while wearing AirPods - 9to5Mac",
        "body": "Amazon today took the wraps off of a monster list of new Alexa-enabled products, including its rumored AirPods competitor. Dubbed the Echo Buds, the truly wireless earbuds are available for pre-order now at $129 – but Amazon executive Dave Limp apparently doesn’t even have his pair just yet.\nFollowing Amazon’s special event today – which the folks over at 9to5Toys covered in detail – Dave Limp went on Bloomberg to talk about the new products. Limp serves as Amazon’s senior vice president of devices and service.\nIn the interview with Bloomberg, Limp can clearly be seen wearing a single AirPod. You’d think that Limp would want to be seen in Amazon’s new Echo Buds, but that’s seemingly not the case. The slip up was first spotted by John Paczkowski on Twitter, and you can see the video for yourself here.\nWe regularly see Apple competitors using Apple products, namely through companies and celebrities tweeting promotions for Android devices using iPhones. Of course, one possibility in Limp’s situation is that Bloomberg provided him with the AirPod to help streamline the live interview.\nThe Echo Buds offer “really great sound” according to Amazon, with five hours of battery life, touch controls, and noise cancellation developed in partnership with Bose. You can pre-order the Echo Buds form Amazon for $129.99, with the first orders arriving by Wednesday, October 30th.\nDo you plan on ordering the Echo Buds – or any of Amazon’s new Alexa-enabled products? Get all of the details over at 9to5Toys and let us know what you think down in the comments.\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.16865046843886375
    },
    "article_2": {
        "title": "Spotify is getting Siri Integration",
        "body": "Spotify’s latest beta versions now include support for Siri and will allow iPhone users to play their music simply by asking Apple’s voice assistant\nSiri allows users to do a lot of things on their iPhones. They can ask her about the weather, get her to give them driving instructions going to their location, and tell her to reply to text messages. If there’s one thing Siri couldn’t or wouldn’t do, however, it’s to play songs on Spotify.\nApple Insider noted that previously, Siri normally played songs via Apple Music “with no option to change the music provider.” This is about to change as Spotify is gaining support for Siri on iOS 13, allowing users to play their songs, albums and playlists with a simple “Hey Siri” request.\nThe Verge reported that the feature comes with Spotify’s latest beta versions. The feature works on iPhones running iOS 13, but doesn’t work with the Apple Watch as the wearable doesn’t have a full dedicated Spotify app. Those who try tell Siri to play Spotify songs on the Apple Watch will be met with a a response saying “I’m sorry, I can’t do that on your Apple Watch.”\nThe new feature, interestingly, works with the AirPods. All users need to do is to tell Siri while wearing their AirPods, and the voice assistant will play the songs, albums and playlists they have on Spotify. The Verge noted, however, that Siri is unable to play podcasts because it searches for music instead of podcasts.\nThe Spotify-Siri integration is currently under testing, but can be expected to launch in the coming weeks in the Spotify app on iOS 13. The Verge said Spotify refused to comment about the new feature at this time, but a spokeman for the music streaming platform said “we routinely conduct a number of tests in an effort to improve our user experience.”\n“Some of those tests,” the spokesman continued, “end up paving the path for our broader user experience and others serve only as an important learning.”\nThis new functionality means that Spotify is now on the same level as Apple’s own apps, at least in terms of Siri integration. It comes after Apple “handicapped” its own apps on the App Store, following complaints from third-party app developers.",
        "sentiment": -0.3386808105133241
    },
    "article_3": {
        "title": "Kuo: 2020 iPhones to Boast Redesigned Metal Frame Similar to iPhone 4",
        "body": "Apple will unveil redesigned iPhones next year that boast a new metal frame structure reminiscent of the iPhone 4, according to a research note by Apple analyst Ming-Chi Kuo and seen by MacRumors.\nIn his research note with TF International Securities, Kuo says Apple will change its flagship ‌iPhone‌ design \"significantly\" next year. Specifically, the new devices will feature a new metal frame with \"a more complex segmentation design, new trenching and injection molding procedures, and sapphire or glass cover assembly to protect the trench injection molding structure.\"\nWe predict that the new 2H20 iPhone design will change significantly [...] The metal frame and the front and rear 2/2.5D glass are still used, but the metal frame surface will be changed to a similar design to the iPhone 4, replacing the current surface design.\nJony Ive's design for the ‌iPhone‌ 4 was the first smartphone to introduce the concept of an exposed squared-edged aluminum frame sandwiched between two panes of strengthened glass – a design that has been variously copied in the smartphone industry.\nApple's ‌iPhone‌ has undergone several changes since, with the latest ‌iPhone‌ 11 using an aluminum frame that wraps around the rounded corners of a display housed in an all-glass enclosure, and the ‌iPhone‌ 11 Pro devices sharing a matte glass material encased in a durable stainless steel frame. Notably, Apple has adopted a different design for the iPad Pro, which features a more industrial band around the sides that's also reminiscent of the ‌iPhone‌ 4.\nKuo believes the grooving and injecting of the metal in next year's ‌iPhone‌ frame will reduce the negative impact of metal shielding on the high-frequency transmission efficiency of the internal antenna, while the use of sapphire or tempered glass on the groove will serve to protect the injection molded structure.\nThe ‌iPhone‌ 4, released in 2010\nAs a result of the design change coming in next year's iPhones, Kuo believes the cost of the metal frame and glass case will rise significantly, with a maximum increase of 50-60 percent and 40 to 50 percent, respectively. If the grooved cover is made of tempered glass, Kuo sees the cost of the metal middle frame and chassis increasing by about 25–35 percent and 20–30 percent, respectively.\nThe report predicts that the new design will be a major selling point that will contribute to supplier revenue and profitability, and combined with 5G support, will increase Apple's smartphone shipments to 85 million units in 2020, compared to 75 million new ‌iPhone‌ shipments in 2019.\nIn a previous note, Kuo said the 2020 iPhones will be available in new sizes. He believes Apple is going to release 5.4 and 6.7-inch high-end iPhones with OLED displays, along with a 6.1-inch model with an OLED display. Two of the phones will also feature a rear-facing time-of-flight 3D camera that will support augmented reality and improve the camera experience.\nKuo also said all three of next year's iPhones will support 5G networks, for which Apple will use Qualcomm's 5G modem. Despite its acquisition of Intel's smartphone modem chip business, Apple will not use its own baseband until the launch of 2022 ‌iPhone‌. Instead, Kuo believes Apple will first test its own baseband products in a new Apple Watch and other future devices.",
        "sentiment": 0.11173254678792813
    },
    "article_4": {
        "title": "Best battery life: iPhone 11 Pro Max beats leading Android phones",
        "body": "Apple focused on two big things for the iPhone 11 lineup: cameras and battery life. In typical battery life tests up to now, the flagship iPhones have performed well but have been outpaced by leading Android phones which ship much larger capacitiy batteries.\nHowever, Apple increased the battery capacity in the iPhone 11, iPhone 11 Pro, and iPhone 11 Pro Max this year. And the results speak for themselves; in Arun Maini’s battery life test video, the iPhone 11 Pro Max easily beat the leading Android competition.\nApple made big claims about the new iPhone flagship battery life, with all models reportedly beating the iPhone XR’s performance, and general real-world use has been backing up those estimates. But how does the iPhone 11 lineup compare to the leading Android smartphones when it comes to battery life?\nThe iPhone 11 battery capacity is rated at 3046 mAh, and the iPhone 11 Pro is roughly comparable with 3190 mAh. The larger iPhone 11 Pro Max has a whopping 3969 mAh battery. In this test, Maini compared the three iPhone 11 models to the Note 10+ and the Huawei Mate 30 Pro, which features an incredible 4500 mAh battery.\nThe battery life test is relatively strenuous, cycling through tasks like Instagram, Camera, 3D games, music streaming, and Shazam. How well does Apple’s combination of hardware and software do?\nYou can obviously watch the video yourself for the full breakdown of what happened, but what’s interesting is that whilst the iPhone 11 Pro Max stormed ahead, the $699 iPhone 11 trailed its 5.8-inch iPhone 11 Pro cousin by quite a margin — even though on paper the batteries are seemingly equivalent.\nThe iPhone 11 achieved a final time of 5 hours and 2 minutes. This longevity is fine for everyday use and mirrors the performance of the iPhone XR, which everyone generally agrees is more than enough to get you through a normal day.\nHowever, the iPhone 11 Pro managed 6 hours and 42 minutes, lasting an additional hour and a half than the iPhone 11. This much of a discrepancy was surprising. Perhaps the OLED display in the 11 Pro is just more efficient than the 11’s LCD panel, or maybe there are buggy software explanations behind this.\nThe Note 10+ achieved 6 hours and 31 minutes, almost rivalling the iPhone 11 Pro.\nBut there’s a big gap between those and the remaining two contenders. The Huawei Mate 30 Pro came in at 8 hours and 13 minutes… but the iPhone 11 Pro Max took the number one spot with an incredible 8 hours and 32 minutes of battery life.\nIt’s going to be seriously difficult to run out of juice on an iPhone 11 Pro Max with typical day-to-day workloads.\nWatch the full test here:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.14751345599475113
    },
    "article_5": {
        "title": "Apple’s new Mac Pro to be made in Texas",
        "body": "As part of its commitment to US economic growth, Apple today confirmed that its newly redesigned Mac Pro will be manufactured in Austin, Texas. This latest generation Mac Pro, which was unveiled at Apple’s annual Worldwide Developer Conference in June, will begin production soon at the same Austin facility where Mac Pro has been made since 2013.\nThe new Mac Pro will include components designed, developed and manufactured by more than a dozen American companies for distribution to US customers. Manufacturers and suppliers across Arizona, Maine, New Mexico, New York, Oregon, Pennsylvania, Texas and Vermont, including Intersil and ON Semiconductor, are providing advanced technology. The US manufacturing of Mac Pro is made possible following a federal product exclusion Apple is receiving for certain necessary components. The value of American-made components in the new Mac Pro is 2.5 times greater than in Apple’s previous generation Mac Pro.",
        "sentiment": 0.34550129109993577
    },
    "article_6": {
        "title": "Apple cofounder Steve Wozniak says the Apple Watch is his 'favorite piece of technology in the world' because he doesn't want to be addicted to his phone.",
        "body": "Steve wozniak\nNordic Business Forum\nApple cofounder Steve Wozniak called the Apple Watch his \"favorite piece of technology in the world right now\" when speaking to Bloomberg Television.\nHe said the watch gives him less of a reason to use his phone, and therefore prevents him from being addicted to it.\nTechnology addiction has been an increasingly important focus area for Apple and other tech companies in recent years. Apple built screen-time management controls into the iPhone last year.\nVisit Business Insider's homepage for more stories.\nWhile Apple has certainly improved the Apple Watch's health functionality in recent years, company cofounder Steve Wozniak says he loves his smartwatch for a very different reason: it prevents him from being addicted to his phone.\n\"It's about my favorite piece of technology in the world right now,\" Wozniak recently said when speaking to Bloomberg Television.\nWozniak says he typically uses his computer when he's checking email or keeping up with the news and uses the watch when he's on the go. \"And then I move to the watch and pretty much skip the phone,\" he said. \"I'm not one of these people that wants to be like an addict.\"\nThe Apple Watch has slowly become an increasingly important product for Apple in recent years. Sales of products in Apple's wearables, home, and accessories division, which includes the Apple Watch, have surpassed that of the iPad and are closing in on the Mac, according to the company's most recent earnings report.\nRead more: Fitbit's new smartwatch can do 3 important things the Apple Watch can't\nTechnology addiction has become a prominent subject of interest for companies like Apple and Google, which in recent years have added tools to their smartphones to help users better monitor how they're using their devices.\nApple brought a feature called Screen Time to the iPhone last year, which provides reports showing how much time users spent in specific apps. The company is adding more features to it this fall with iOS 13 that let parents control who children can communicate with and set screen-time limits across different app categories, apps, and websites. Google has a similar feature for its Android devices called Digital Wellbeing.\nStory continues\nApple is also launching a new software update for the Apple Watch this fall, which will bring the ability to track activity trends over time and a standalone App Store to the watch. Apple could also launch a new Apple Watch model this fall, according to Bloomberg.\nApple CEO Tim Cook has also spoken about the importance of managing the amount of time we spend on our smartphones in the past. \"I think they ought to put their phone down and look at who they're talking to or having dinner with,\" Cook said when ABC's Diane Sawyer asked him what he thinks when he sees people in a restaurant staring at their phones. \"But I totally recognize that it is their decision.\"\nNOW WATCH: Steve Jobs left Apple to start a new computer company. His $12-million failure saved Apple.",
        "sentiment": 0.10901269664906937
    },
    "article_7": {
        "title": "Upcoming Firefox update will decrease power usage on macOS by up to three times",
        "body": "TechRepubli 10 things you should never do in Excel Read now\nMozilla teased today an upcoming update for Firefox on macOS that they say will reduce power consumption by a factor of up to three.\nThe primary beneficiaries of this upcoming update are Macbook users, who can now expect longer battery lives while using Firefox.\nFirefox's increased battery consumption has been a problem for Mozilla, and a black stain on the Firefox Quantum release -- a revamped, performance-centric version of the older Firefox browser.\nWhile Firefox Quantum has received praises for its increased page loading speeds, Macbook users haven't been that delighted, especially when they're mobile and have to rely on the notebook's battery as long as possible.\nAs reported countless of times on Reddit [1, 2, 3, 4, 5], HackerNews and various blogs, Firefox Quantum on macOS has been quite the battery hog, making life difficult for users on the go, who, despite loving Firefox, often had to rely on other browsers to avoid draining their batteries.\nBut according to Mozilla engineer Henrik Skupin, Firefox devs have finally made a breakthrough, and believe they fixed Firefox's power consumption on macOS.\nSkupin said that a current fix for the battery drain issue has been deployed on Firefox Nightly, where it managed to reduce power usage by three times.\nThe fix is expected to land in the stable version of Firefox in late October 2019, with the release of Firefox 70.\nAccording to Firefox statistics, nearly 7% of Firefox's 100 million monthly active users are running a macOS version. Not all may be running on Macbooks, but those who are will most likely be interested in giving Firefox another go in the coming months, knowing the browser won't eat away at their battery at a much faster pace than Chrome or Safari.\nPer a Bugzilla entry, at the technical level, Mozilla engineers managed to cut down Firefox's power consumption by switching browser page rendering operations to Core Animation, the graphics rendering and animation engine that's built into both iOS and macOS. This, according to a series of tests, has put Firefox on par with Chrome, in regards to power usage.",
        "sentiment": 0.02481554914265871
    },
    "article_8": {
        "title": "7 out of 10 Apple Watch customers are first time buyers, not upgraders",
        "body": "Apple Watch is still a maturing product category for Apple, and that shows in the adoption data. According to CNBC, Apple says a whole 70% of Apple Watch customers are buying their very first model. That means that 30% of Apple Watch customers are actually upgrading from older models, but Apple hasn’t fully tapped into the upgrade pool yet.\nInstead, Apple Watch has focused on adding key features with each version — GPS and swim tracking, cellular connectivity, ECG and fall detection, and the new always-on display — but even Apple Watch Series 4’s redesign didn’t open the flood gates of upgraders.\nApple is still growing the customer base (while dominating marketshare) which makes sense for a product still in its relative infancy compared to iPhone and iPad.\nAside from the redesign that we saw last year, Apple hasn’t fundamentally evolved the Apple Watch since the first version either. If that’s something coming in the future, perhaps we could see upgrade customers reach higher numbers. But for now, buyers are enjoying their Apple Watch, and every Apple Watch model sold since Series 1 still has support for watchOS software updates.\nOf course, that data likely doesn’t include Apple Watch Series 5 yet. Apple opened orders for the brand new Apple Watch last week, but the new model won’t hit stores until Friday.\nMeanwhile, Apple has also significantly lowered the entry price for iPhone users to become Apple Watch customers. The new $199 price for the Apple Watch Series 3 bests Fitbit’s fitness tracker for the same price, adding GPS and deeper iPhone integration.\nRead our review of the now $199 Apple Watch Series 3 plus our roundup of the first Apple Watch Series 5 reviews. 9to5Mac will have a full review of the new Apple Watch Series 5 in the coming days.\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.03138353209942579
    },
    "article_9": {
        "title": "Disney CEO Bob Iger resigns from Apple board",
        "body": "watch now\nDisney CEO Bob Iger has resigned from Apple's board of directors, Apple said in an SEC filing on Friday. Apple and Disney stock were unchanged on the news. Disney is launching streaming video service Disney+ on Nov. 12, which will compete with Apple's Apple TV+ service, scheduled to become available on Nov. 1. Iger resigned on Sept. 10, the day Apple announced the price and release date for its streaming service. The two streaming services will increasingly come into conflict in the future as both compete for original content. \"It has been an extraordinary privilege to have served on the Apple board for 8 years, and I have the utmost respect for Tim Cook, his team at Apple, and for my fellow board members,\" Iger said in a statement. \"Apple is one of the world's most admired companies, known for the quality and integrity of its products and its people, and I am forever grateful to have served as a member of the company's board.\"\nBob Iger, chief executive officer of The Walt Disney Company, walks with Tim Cook, chief executive officer of Apple Inc., as they attend the annual Allen & Company Sun Valley Conference, July 6, 2016 in Sun Valley, Idaho. Getty Images\nApple said in a statement, \"Bob has been an exemplary board member for nearly eight years, and for as long as he has led Disney he has been one of Apple's most trusted business partners. He is a dedicated, visionary CEO and a role model for an entire generation of business leaders. More than anything, Bob is our friend. He leads with his heart and he has always been generous with his time and advice. While we will greatly miss his contributions as a board member, we respect his decision and we have every expectation that our relationship with both Bob and Disney will continue far into the future.\" Apple downplayed potential conflicts in a financial filing earlier this year. \"Apple enters into arms-length commercial dealings with The Walt Disney Company, including sales arrangements, digital services content licensing agreements, and similar arrangements,\" Apple said in its proxy filing. \"Apple does not believe that Mr. Iger has a material direct or indirect interest in any of such commercial dealings.\"\nwatch now\nIger was personal friends with late Apple cofounder Steve Jobs. Disney bought Jobs' other company, Pixar, in 2006, and Jobs was on Disney's board until his death in 2011. Jobs asked Iger to take his place on the Apple board when he died, according to Fortune, and Iger joined the board that year. Iger was the chair of Apple's corporate governance committee and on Apple's compensation board, according to the company's proxy filing earlier this year. Disney and Apple have had a close corporate relationship over the years. Disney was one of the first major companies to develop apps for iPhones and iPads, and shortly after Iger took over as Disney CEO in 2005, he appeared on stage with Jobs to announce ABC content for iTunes. Disney has announced that it will distribute its streaming service on Apple's platforms. More recently, Iger has been photographed chatting with current Apple CEO Tim Cook at an annual retreat in Sun Valley, Idaho. Iger has been CEO of Disney since 2005 and is its chairman. He is not on any other public company boards. This isn't the first time that a director has left Apple's board because of competition concerns. In 2009, then-Google CEO Eric Schmidt resigned from Apple's board when it became clear that Google's Android would directly compete with Apple's iPhone.",
        "sentiment": 0.22407253317895434
    },
    "article_10": {
        "title": "Report says Apple to release new 'iPhone SE' with 4.7-inch display in spring 2020 - 9to5Mac",
        "body": "Sep. 4th 2019 2:21 am\nApple is about to launch its flagship iPhone 11 lineup next week, but these high-end models only make up about half of Apple’s total phone sales volume. Its cheaper SKUs are also important to its business. Currently, it offers the iPhone 8 and iPhone 7 as cheaper models. It is possible that the iPhone 7 will no longer be sold once the iPhone 11 is released.\nA report from Nikkei says the company is planning to launch a new 4.7-inch iPhone in the spring, a spiritual iPhone SE successor — at least in terms of price point.\nThe iPhone SE was a 4-inch option in an era where Apple had moved all of its high-end iPhones to 4.7-inch and 5.5-inch screens. The SE carved out some semblance of popularity, with some customers drawn to its compact size and others taking advantage of the lower $399 price point.\nToday’s Nikkei report says that the new 4.7-inch iPhone will be similar to the iPhone 8. Economic Daily News reported very similar details earlier this year.\nThe new SE would feature an LCD display to keep the price down, but likely feature modern internals like the new A13 chip. It’s not clear if the phone will keep the Touch ID home button or adopt the more expensive Face ID system. The ‘iPhone 8’-esque description suggests it would be based around Touch ID though.\nThe iPhone XR is an appealing cheaper option, but it is still priced above the $700 level. Even if Apple price dropped the XR in the wake of the iPhone 11 / iPhone 11 Pro release, it is still going to be around $600-$650. A true iPhone SE successor would be expected to be much cheaper, around the $400 mark. However, Nikkei would not be drawn on naming or pricing of the purported upcoming new ‘budget’ iPhone.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.18623215313020505
    },
    "article_11": {
        "title": "‘Sign In With Apple’ Is Way Better Than Passwords—If You Can Find It",
        "body": "It’s time to play Pick a Door to Your Apps—a game show that, admittedly, not many people would watch.\nBehind Door No. 1: That familiar username box and a never-ending hamster wheel of reused passwords and reset emails. Door No. 2: A quick login accompanied by a lifetime supply of intrusive ads. Door No. 3? A more private way in. Just be warned—for now, Door No. 3 is hard to find.",
        "sentiment": -0.5800528168678284
    },
    "article_12": {
        "title": "Multiple camera simultaneous recording coming to iPhone XS and iPhone XR, not just iPhone 11",
        "body": "At its event last week, Apple previewed a new version of Filmic Pro running on the iPhone 11 Pro. It was a compelling demo, with the app able to record from multiple cameras simultaneously, like recording the front and back camera together, or filming using the new ultra-wide and standard wide cameras for additional coverage.\nHowever, the good news is that simultaneous multi-cam sessions are not only available on the iPhone 11. The feature is also supported by the iPhone XS, iPhone XR, and the 2018 iPad Pro…\nThe multi-cam recording relies on new API introduced in iOS 13. At the WWDC session on the subject, Apple stressed that this required significant reworking of the hardware pipeline of their devices, but that the necessary changes have been made in the iPhone XS, iPhone XR, and the new iPad Pro models.\nThe new APIs allow developers to initiate multi-cam sessions while being conscious of performance and power costs.\nThis is great news for prospective customers of iPhone 11 and existing iPhone XR/XS owners. If you own the 2018 flagships, you will be able to take advantage of the new multiple camera apps hitting the store in the coming months.\nThis app ecosystem should be strong, as Apple announced the API back in June, giving developers the entire summer to work on incorporating the feature into their camera apps, so it shouldn’t be a long wait before iPhone 11 and iPhone 11 buyers can start trying it for themselves. For its part, Filmic Pro said that their multi-cam app update will be launching later this year.\nHowever, recording from multiple cameras is strenuous, and there are some imposed limitations. For iPhone XS and iPhone XR, only certain combinations of cameras can be active simultaneously. Developers may also have to use lower-quality camera feeds, depending on how much work the rest of their own app logic wants to do.\nAs you can see from the compatibility matrix, the iPhone XS can record (or take photos) from the back wide and front camera together, or the back telephoto and the front camera, or the back wide and back telephoto. Three-camera recording is not supported. It’s not yet clear what combinations of simultaneous camera streams the iPhone 11 and iPhone 11 Pro will be capable of. In the Filmic demo, though, the preview screen appeared to show live feeds from all four of the iPhone 11 Pro’s cameras at the same time.\nThe multi-cam API is a feature of iOS 13, which launches publicly on September 19. Apple uses the multi-cam technology in the iPhone 11 and iPhone 11 Camera app, showing image data from the wider scene in the toolbar areas of the viewfinder interface. However, the Camera app does not directly support recording multiple streams. For now, iPhone users will have to rely on the third-party app ecosystem for that functionality.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.03292743703755348
    },
    "article_13": {
        "title": "Can Apple's iPhone 11 Still Surprise in an Age of Leaks?",
        "body": "There was a time when Steve Jobs could stand on stage at a Macworld Expo and blow people away with surprise product announcements. Apple CEO Tim Cook once famously said he was \" doubling down on secrecy .\" And yet for the last few years, there's been precious little at Apple media events that was a surprise.\nWith Cook and company set to take the stage again on Tuesday for Apple's Sept. 10 press event , there's no doubt that Apple can captivate the world with its product announcements — but can it still provide surprises?\nForget the supply chain\nThere's one part of Apple's product lineup that's never, ever going to be a surprise: anything that's in even the most preliminary stages of production in its Asian supply chain. These days, we're hearing features about next year's iPhone 12 before this year's models have even been announced.\nThe fact is, the supply chain leaks like a sieve. Whether it's bribes to extremely low-paid workers or quid pro quo exchanges of information for various factories, Apple's every move — whether it's a case with the exact shape and size of the iPhone's new cameras , or a deal with a parts supplier that gives away the existence of a new product — is magnified and reported throughout the world.\n(Image credit: MobileFun)\nIs there room for a hardware surprise from Apple? Sure, but it would have to come much earlier in the design process. In practical terms, this generally means it needs to be a new product that hasn't yet been put into production, meaning it has to be announced months in advance. The iPhone, iPad and Apple Watch are good examples. If Apple found itself ready to announce a new product category, like, say, augmented-reality glasses, we might hear rumblings about it in advance, but the physical details of that product could be cloaked in mystery right up until the big reveal.\nDoubling down or self-leaking?\nFor all of Cook's claims that Apple would be cranking up its secrecy efforts, the company has been its own worst enemy over the last few years. For decades, Apple has seen some of its best-laid plans revealed by human sources cultivated by enterprising journalists. Back in the '90s, it was Mac the Knife at MacWeek, and these days it's Mark Gurman of Bloomberg who has clearly gotten tight with Apple employees who are in the know.\nThose kinds of leaks are bound to happen in any organization populated by human beings, who tend to have egos that can be stroked by journalists and who feel some strange intoxication in seeing the information they leaked spread into the wider world.\nIt's the technical own-goals that are baffling, especially for a company so apparently technically competent as Apple.\n(Image credit: Apple)\nIn the last few years, Apple has leaked numerous details about its own plans by including images, text and programming-interface data about secret products in public software releases. For a long time, curious types have scrolled through OS betas and looked for accidental disclosures, but developer Steve Troughton-Smith and 9to5Mac's Guilherme Rambo have transformed this spelunking into an art. So many Apple leaks the past few years have come because the company seems incapable of locking down portions of its code and assets and preventing them from being carried out into public software builds. Every year, I think that Apple has probably learned its lesson and cracked down — and every year there are more leaks.\nEven more troubling is the leakage from Apple's public-facing websites. Last year's iPhone event was spoiled by Apple's web team using a recurring, guessable pattern for all sorts of filenames, and Rambo was able to load marketing images from the event days before it occurred. I get that websites the size of Apple.com are large, unwieldy beasts, but there's got to be a way to make sure that marketing images for unannounced products aren't pushed to public servers until the products are announced, right?\nI'm sure Apple's web team got in big trouble over the incident and plans to do better, but if the last few years have taught me anything, it's that the Apple watchers are closely anticipating an operational failure. And thus far, Apple's internal processes have rarely been up to the challenge of keeping the company's most vital secrets hidden.\nIs there no hope of a surprise?\nPeople like me are happy to get advance warning of Apple's moves, because it gives us more to discuss on podcasts and in articles (like, say, iPhone 11 rumor roundups detailing every possible feature for this week's phone unveiling). But there's no denying that there's nothing like a genuine surprise when it comes to stagecraft — and Apple's business at these media events is stagecraft. So what's a tech behemoth to do?\nAs mentioned above, the surest way to surprise people is to announce a new bit of hardware ahead of time, before every part has been leaked in the supply chain and before it's been filed with government regulatory agencies. We know that Apple has been working on augmented-reality glasses , but what form they will take is still a mystery. And that's something Apple can exploit, as it did with the Apple Watch a few years back.\nMORE: Why the iPhone 11 Will Be Apple’s Toughest Sell Ever\nSoftware, while prone to some leaks from humans in Cupertino, is another place where there can be genuine surprise. Small projects can be kept away from the larger part of the company, and that can be enough to keep those projects from leaking — or at least from leaking thoroughly. Apple's developer-conference introduction of its new SwiftUI framework, and a few years before the Swift programming language itself, are examples where we heard rumblings that Apple was working on something, but the details were a surprise.\n(Image credit: Apple)\nAnd leaving aside the products themselves, there's always the story of any given product. Apple's media events are, above all else, a space for the company to wrap its industry-leading narrative construction around everything it's selling. How the company markets products and features matters, and on Tuesday, they'll have a couple of hours to tell that story, uninterrupted by critics or journalists or anyone else who could puncture its bubble.\nSimilarly, it's harder to leak product pricing, because pricing can be determined at the last minute and distributed just before or just after the event. The price of a product is part of how its story gets told. In the case of the HomePod , most people walked away thinking less of the product because its price was perceived as too high. In the case of the original iPad, people were expecting a $1,000 product and got something for half that price — and it made the iPad seem like a fantastic deal.\nWill Apple ever surprise us again at a media event? Of course it will. But it will most likely come in the details, in small features and marketing spin. Every few years, if we're lucky, we might get surprised by an entirely new hardware product. But Apple has become too important a company to rely on obscurity to keep details of its future products hidden. And as a result, we'll have to take the small surprises where we can get them.",
        "sentiment": -0.0703357447995446
    },
    "article_14": {
        "title": "Apple’s Online Store Goes Down Ahead Of Today’s iPhone Event",
        "body": "Apple has taken its online store down ahead of its \"By Innovation Only\" event today at Steve Jobs Theater, where the company is widely expected to unveil new iPhone and Apple Watch models.\nBeyond that, wild cards include a 10.2-inch iPad, a new Apple TV, an iPad Pro refresh, a 16-inch MacBook Pro, and Apple's rumored Tile-like item tracking tags, but some of these products may be reserved for an October event, which Apple has held in two out of the last three years.\nAlongside hardware announcements, Apple should provide release dates for iOS 13, macOS Catalina, watchOS 6, and tvOS 13 by the end of tomorrow, either during its keynote or on its website. Apple may also detail pricing and availability for its upcoming Apple TV+ and Apple Arcade services.\nWhat to Expect at Apple's September 2019 Event: New iPhones, Apple Watch Models, Services Updates, and More\nApple often takes its online store down ahead of its media events as a way of generating hype ahead of new products and accessories. It should come back online moments after Apple's keynote ends.\nApple will provide a live stream of its keynote on its website, through its Apple Events app for the Apple TV, and even on YouTube for the first time. MacRumors will have up-to-the-minute coverage of all of Apple's announcements on our website and via @MacRumorsLive on Twitter.\nMac users can get MacRumors headlines delivered to their desktops instantly by enabling Safari push notifications\nMacRumors readers can follow along in our forums, which are a great place to discuss the announcements before, during, and after the event. Be sure to keep tabs on the ‌iPhone‌ and Apple Watch sections in particular.\nApple's keynote begins at 10 a.m. Pacific Time.",
        "sentiment": 0.3176736298694529
    },
    "article_15": {
        "title": "Kuo: iPhone 11 demand better than expectations, stronger interest for new color options",
        "body": "Sep. 15th 2019 3:47 pm\nRespected Apple analyst Ming-Chi Kuo released a report late on Sunday that said he believes iPhone 11 and iPhone 11 Pro order demand is ahead of expectations, following the launch of preorders on Friday.\nBasing his predictions largely off of Apple’s online shipping estimates, Kuo points out strong demand for the new colors: the midnight green iPhone 11 Pro, and the green and purple iPhone 11 models. He also warns that production problems of the glass for the midnight green phone means availability of that model is currently constrained.\nKuo indicates that the demand for the more expensive iPhone 11 Pro is higher in the United States, whereas the Chinese market is most interested in the cheaper iPhone 11 series.\nGiven the positive early signs, TF Securities is raising its estimate for new iPhone shipments in 2019 to 70-75 million units, up from its previous 65-70 million estimate.\nUnsurprisingly, Kuo says the availability of trade-in programs and zero-interest payment plans is helping to stimulate upgrades.\nIn addition to the appeal of the new colors, Apple is being aggressive with the $699 iPhone 11 base price whilst adding features like the new ultra-wide lens, improved battery life, and 4K video upgrades. The report says the iPhone 11 pricing makes it an ideal choice for the current install base of iPhone 6, iPhone 6s and iPhone 7 owners.\nThe iPhone 11 and iPhone 11 Pro bring improvements like Night mode, 4K 60 FPS extended dynamic range video recording, 20% faster performance thanks to the A13 chip, improved durability and water resistance, and a new U1 indoor location chip.\nPreorders for Apple’s new flagships opened on Friday and the iPhone 11 series will officially go on sale this coming Friday, September 20.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.27735477399367553
    },
    "article_16": {
        "title": "Apple Watch sleep tracking revealed: sleep quality, battery management, more",
        "body": "There’s been a lot of speculation about Apple Watch sleep tracking, especially after Apple acquired Beddit, manufacturer of the Beddit Sleep Monitor product and companion app.\nToday, 9to5Mac has learned from sources inside Apple that the company is working on sleep tracking for the Apple Watch, which won’t require any special hardware to work. The new feature could be announced as early as next week when the company is expected to announce the next generation iPhones and possibly a revised Apple Watch with titanium and ceramic options.\nThe new feature — codenamed “Burrito” internally and called “Time in Bed tracking” — will allow users to choose to wear Apple Watch to bed. If the user has more than one Apple Watch, they can pick one to be their designated bedtime Watch.\nWhile asleep, the Apple Watch will track the user’s quality of sleep using its multiple sensors and inputs, including the person’s movement, heart rate, and noises. Data about the user’s quality of sleep will be made available in the Health app and a new Sleep app for the Apple Watch.\nOne of the issues with wearing an Apple Watch during sleep is that many users choose to charge their Apple Watch at night. Apple thought about this and developed a feature that will remind users to charge their Watch beforehand so they can get through the night.\nWhen wearing the Watch during bedtime, if the user wakes up and starts their day before their alarm goes off, it will automatically turn off the alarm. The alarm will also play only on Apple Watch, using the iPhone as a backup. There will also be an option to use a silent alarm that only vibrates the Apple Watch. The new bedtime system will enable Do Not Disturb automatically when the user goes to bed. There will also be a new complication available for sleep tracking.\nIt’s unclear whether the new sleep tracking features will require a new model of the Apple Watch to be announced on September 10, but given the current rumors about new watches being a minor revision, it’s likely it won’t require new hardware.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.07394124282633557
    },
    "article_17": {
        "title": "Apple Drops $149 Price Tag of Milanese and Leather Loop Apple Watch Bands to $99",
        "body": "Alongside the announcement of the Apple Watch Series 5 yesterday, Apple has now updated the price on some of its high-end leather and metallic bands.\nSpecifically, the original $149 price tag of Leather Loop and Milanese Loop Apple Watch bands has now dropped to $99. This means that they're only $50 more expensive than Apple's cheapest Sport Bands and Sport Loops, which cost $49.\nLeather Loop is now available in Meyer Lemon, Black, and Saddle Brown; it only fits 44mm Apple Watch cases. Milanese Loop is available in Silver, Gold, and Space Black; it can fit both 40mm and 44mm cases.\nApple has not dropped the price of the Modern Buckle any further, although at $149 it is still $100 cheaper than it initially was at launch. Hermès bands are as much as $539, and the Silver Link Bracelet is $349, while the Space Black Link Bracelet is $449.\nMore information about the new Apple Watch Series 5 can be found in our full launch post on the new wearable.",
        "sentiment": -0.023399320663884282
    },
    "article_18": {
        "title": "TIL Apple made an exclusive auction version of the iPad Pro in 2016 with an orange Apple Pencil Case, more than a year before the Apple Pencil Case was actually released.",
        "body": "To help raise money for the relocation of the prestigious London Design Museum, Apple has submitted a very special lot to be sold at auction. Jony Ive has designed a one-of-a-kind iPad Pro and set of accessories, labelled ‘Edition 1 of 1’. The lot includes a 12.9 inch iPad Pro with a custom yellow-gold anodised finish, a blue leather Smart Cover and an Apple Pencil case cover — an accessory that Apple doesn’t sell at all today. It’s a small carry case for the Pencil, made with orange Italian calf leather. To denote the exclusivity of the products, an ‘Edition 1 of 1’ label has been engraved into the iPad Pro and underside of the Smart Cover.\nGiven its special edition nature, the auction is expected to sell for a tidy premium over Apple’s normal iPad Pro pricing …\nThe collection has an estimated auction price between £10,000 and £15,000 (about $20,000). It’s a very special collectors item of course, details about the auction can be found here. Unsurprisingly, the Design Museum is very grateful for Apple’s contribution. Via Wallpaper:\nIve’s new products are in single editions, designed exclusively for the Design Museum event. To prove it, ‘Edition 1 of 1’ has been laser etched on the back surface of the iPad and the interior surface of the ‘Smart Cover’. ‘We are extremely grateful to the friends of the museum who had donated such outstanding pieces to help us fulfill our ambition of creating one of London’s most important new cultural sites,’ says Design Museum curator (and auction co-curator) Deyan Sudjic.\nPerhaps Apple will release the Apple Pencil cover as a mass-market product in time, or it was something they considered but decided not to continue developing.\nWeird thing about the special edition iPad? Redesigned status bar. (Photoshop blunder?)https://t.co/1ayMXYWvlX pic.twitter.com/bn0rSwTpEi — Benjamin Mayo (@bzamayo) April 16, 2016\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.11279142844049554
    },
    "article_19": {
        "title": "September 10, 2019: More than iPhones- Watch 5, Airpods 3, iPads, Mac pros.",
        "body": "Apple will be hosting its annual autumn event at its Cupertino, California headquarters on Sept. 10. Much like in years past, the company is expected to unveil new iPhones, Apple Watches, and perhaps a few other gadgets. The event will take place at 10am US Pacific time (1pm US Eastern time, 6pm London time). Here’s a quick rundown of what we’re expecting to see:\nNew iPhones\nIt pretty much goes without saying at this point that Apple will release a new iPhone come September. This year, the rumors have it that we should be expecting three new phones, much like last year. According to Bloomberg, there’s going to be two large phones similar in design to last year’s iPhone Xs and Xs Max, but this year featuring a “Pro” suffix (much like the MacBook Pro and iPad Pro), as well as a successor to the lower-cost iPhone Xr.\nAdvertisement\nThe new Pro phones are expected to have a few new features that will put them on par with the top offerings from many Android phone makers, such as an additional rear-facing camera that will allow the phone to capture wider-angle photos. The new phones will apparently be able to wirelessly charge other devices stacked on top of them, much like Samsung’s newest phones. There will be other minor updates as well, including better video taking, a wider angle for the FaceID sensors, faster processors, and better waterproofing. There are also rumors swirling that the Pro phones will be able to take advantage of Apple’s Pencil stylus.\nAll three phones are expected to be roughly the same shape and design as last year’s iPhones, which were roughly the same as the year before’s. The successor to the Xr will also likely come in new colors, as suggested by the event’s invite:\nNew Apple Watches\nApple is planning to launch a fifth generation of its wearable, based primarily on the design released at last year’s event. It seems that the biggest changes will come in the software, which will apparently allow the wearer to track their sleep and manage battery usage better, and in the finishes on the watches. Rumors suggest the new watches will come in titanium and ceramic finishes.\nAdvertisement\nNew iPads\nThe redesigned iPad Pro, first announced last year, is expected to get a few internal upgrades at this year’s event, Bloomberg reported. Much like the new iPhones, the devices won’t be changing much aesthetically, instead receiving faster processors, more battery life, and better cameras. The standard iPad, which Apple now primarily pitches to schools, will also be refreshed with a slightly larger display.\nAirPods 3\nUsually when you have a successful sequel you wait a little while longer before releasing another one. Not Apple, apparently. Even though it released a second version of its AirPods wireless earbuds in March, it reportedly plans to announce a third version at the event. The new versions, which may not be available until 2020, are rumored to be water-resistant, noise-canceling, and may even come in black. They’ll likely cost more than the current versions, too.\nA bigger MacBook Pro\nApple is planning to release a 16-inch MacBook Pro, with smaller bezels and a compact design that will make it feel closer to the current 15-inch models, according to rumors. The new laptop would also feature slightly faster processors, and hopefully a reprieve from the terribly finicky keyboards Apple has been putting in laptops since 2015 which have been the impetus for a class-action lawsuit.\nWe’ll also likely hear more information on when the Mac Pro desktop and Pro Display, announced this summer at Apple’s developer conference, will be ready to ship.\nAdvertisement\nOne more thing?\nIt’s pretty unlikely that we’re going to see anything truly transformative at this year’s event (even with all the money Apple is spending on research), but it’s possible we’ll see some updates to other Apple products. The company hasn’t released a second version of its HomePod yet, which was first released in February 2018, and there’s some speculation that it could release a smaller version at this year’s event.\nApple also hasn’t updated its Apple TV streaming box in two years. Given that we’ll likely hear more info about Apple TV+, the company’s new streaming service that’s set to launch… soon…it wouldn’t be completely surprising that a new box might be on the way. Its new games service, Apple Arcade, is also expected to launch this fall, and the company recently extended support to popular games controllers from Sony and Xbox to work with iOS and Apple TV devices.\nThe company is also reportedly working on developing small tracking devices, like the ones produced by Tile, that owners could affix to their personal belongings that they tend to lose. Users will apparently be able to use their iPhone’s camera and augmented reality to walk around looking for their misplaced items.",
        "sentiment": -0.20528354973751395
    },
    "article_20": {
        "title": "iPhone XR shipments topped all other phones in the first half of 2019, report says",
        "body": "Smartphone prices have been creeping up over $1,000 in recent years, but it was Apple's less expensive iPhone XR that topped all other smartphones in shipments in the first half of 2019, says IHS Market. The iPhone XR shipped nearly 30 million units in the first half of 2019, according to a Thursday report from the market analysts.\nAt $749, the iPhone XR isn't exactly cheap, but it's the least expensive iPhone in Apple's 2018 lineup. IHS Market said 13.6 million iPhone XR units shipped in the first quarter and 13.3 million shipped in the second quarter -- bringing the total to 26.9 million for the first half of the year. That's more than double the number of Samsung Galaxy A10 phones, the No. 2 device on IHS Market's list, that shipped in the first half.\n\"Compared to the Android-based smartphone makers, Apple maintains a relatively small model lineup,\" said Jusy Hong, research and analysis director. \"This means that Apple's total sales volume is divided among fewer models. As a result, each of Apple's iPhone models tends to generate higher shipment numbers than comparable Android smartphones, such as those sold by Samsung.\"\nApple's iPhone 8, released in 2017, and iPhone XS Max were also among the top smartphones for the first half of the year. Samsung's budget A10 and A50, which both cost less than $400, took second and third place, with 13.4 million and 12 million shipments respectively. None of Samsung's flagship Galaxy S10 phones made the list.",
        "sentiment": -0.10710589649776618
    },
    "article_21": {
        "title": "iPhone 11 Pro and iPhone 11 Pro Max Include Faster 18W Charger in Box",
        "body": "Finally, after years of including the same-old, slower 5W charger in the box with iPhones, Apple has announced that the new iPhone 11 Pro and iPhone 11 Pro Max will ship with a faster 18W USB-C power adapter. The two higher-end models will also include a Lightning to USB-C cable in the box.\nThe lower-end ‌iPhone‌ 11, which replaces the ‌iPhone‌ XR, continues to ship with a 5W charger and a Lightning to USB-A cable.",
        "sentiment": 0.585104281703631
    },
    "article_22": {
        "title": "The U1 chip in the iPhone 11 is the beginning of an Ultra Wideband revolution",
        "body": "By Jason Snell\nThe U1 chip in the iPhone 11 is the beginning of an Ultra Wideband revolution\nWarning: This story has not been updated in several years and may contain out-of-date information.\nApple likes talking about the awesome chips it designs for its iPhones, but it hates even hinting at products it hasn’t yet announced. The new U1 chip—introduced with the iPhone 11 but never mentioned on stage at Tuesday’s iPhone event—strikes at the heart of this conflict. Embedded in the U1 is new technology that may dramatically change how our various intelligent devices interact with each other, but Apple is only using it to make a small addition to AirDrop.\nOf course, the story is more complicated. If you believe the reports that Apple is working on a tracking accessory that will let you locate just about any object with extreme precision, then the lack of a keynote mention starts to make sense. Apple will probably be ready to talk up Ultra Wideband (UWB), the wireless standard that powers the U1, the very moment that product is released. Until then, we’re left with a paragraph on Apple’s website:\nThe new Apple”‘designed U1 chip uses Ultra Wideband technology for spatial awareness — allowing iPhone 11 Pro to understand its precise location relative to other nearby U1”‘equipped Apple devices. It’s like adding another sense to iPhone, and it’s going to lead to amazing new capabilities.\nAmazing new capabilities, eh? The Apple marketing copy has it right—UWB’s technological trick is allowing devices to pinpoint one another’s locations in the real world with great precision. From raw data alone, UWB devices can detect locations within 10 centimeters (4 inches), but depending on implementation that accuracy can be lowered to as much as 5 millimeters, according to Mickael Viot, VP of marketing at UWB chipmaker Decawave.\nSecurity through precision\nFor now, an improved AirDrop interface in iOS 13.1 is the only sign of Apple’s adoption of Ultra Wideband.\nThe technology works by using a method that Apple’s already using in allowing Apple Watches to unlock Macs: using the total round-trip time of a radio signal (measured in nanoseconds—radio waves move at the speed of light) to calculate how far away a device is. This prevents your Apple Watch from unlocking a Mac unless it’s in close proximity.\nThis is an important security feature, because other wireless technologies such as Bluetooth tend to estimate distance by measuring the strength of a wireless signal, not the time it takes for it to be sent to a device and then returned back to the sender. Sneaky people could relay a signal and boost its power and fool a Bluetooth device into thinking you were nearby when you weren’t. That’s a security hole wide enough to break into a Mac or steal a car.\nThe speed of light and a roundtrip signal allows for a precise measuring of distance, but UWB can also determine the angle of arrival of the radio signals by measuring the phase shift that comes when receiving the signal from multiple antennas. Put the distance and angle together and you’ve got incredible precision—enough for, the rumors suggest, Apple to use an augmented-reality display to mark the precise location of another device.\nRight now, the only feature Apple has announced involving the U1 is a modified version of AirDrop that uses that precision location to determine if another iPhone 11 is close (and, believe it or not, if it’s pointing at your phone), and pops that device to the very top of your AirDrop interface. UWB can be used to transfer data at up to 27 megabits per second, which is faster than Bluetooth LE, but slower than Wi-Fi. I don’t know if Apple’s using UWB to do the data transfer or just using it for location finding and then switching to a peer-to-peer Wi-Fi connection for fast file transfers, which is what usually happens when using AirDrop between devices.\nBeyond AirDrop and tracking tags\nBut the possible applications of UWB go way beyond AirDrop and tracking tags. Decawave’s Viot says potential applications include smart home tech, augmented reality, mobile payments, the aforementioned keyless car entry, and even indoor navigation. (And it’s not a power hog, either—Viot says that Decawave’s latest UWB chip uses one-third of the power of a Bluetooth LE chip when in beacon mode, as a tracking tile would be.)\nIn terms of smart home tech, both security and functionality could be improved by devices knowing exactly where they are, and where the humans in the house are. (This is one reason why Viot thinks that Apple will add UWB support to the Apple Watch sooner rather than later: we aren’t always with our phones, but we bring our wrists with us wherever we go.) Imagine a whole-home audio system moving music playback through multiple rooms based on the location of an individual listener. Consider the peace of mind of knowing that your smart door lock won’t open unless you’re standing right in front of it—and can lock the moment it knows you’re inside.\nAugmented reality is also an enormous area of interest for Apple, and UWB can help there, too, by providing location precision for devices and accessories. And then there’s boring stuff like UWB-enabled badges that could unlock doors and even enable office buildings to provide “turn by turn” directions to their destinations.\nAnd the stolen car thing—that seems to have been enough of a security hole to help spur car manufacturers to get off of Bluetooth LE and on to something more secure. The Car Connectivity Consortium, of which both Apple and Google are members, should enable UWB-enabled devices to replace car keyfobs securely.\nApple is first out of the gate\nOf course, that’s only if most smartphones are UWB enabled. As of today, the total number of smartphones shipping with UWB onboard is zero. In fact the iPhone 11 family, when it arrives next week, will be the first consumer smartphones to support UWB. A glance at the various trade groups coalescing around this technology suggests that Google, Samsung, HTC, and other major players plan to get in the game.\n“It’s huge,” Viot says, that Apple has taken this step. He likens the move to Apple adopting Wi-Fi in the first iBook, which was the push the technology needed to start rolling out everywhere. Apple might not be talking a lot about it now, but that U1 chip may be our first step into a world where all of our devices know where they are in relation to one another at a precision measured in millimeters.\nThe implications are enormous. As Apple’s innocuous final marketing sentence about the U1 reads, “that’s just the beginning.”\nIf you appreciate articles like this one, support us by becoming a Six Colors subscriber. Subscribers get access to an exclusive podcast, members-only stories, and a special community.",
        "sentiment": 0.034581211706002556
    },
    "article_23": {
        "title": "Walgreens joins Apple Card’s rewards program to offer 3% Daily Cash on purchases",
        "body": "Apple Card’s rewards program, Daily Cash, is expanding with the addition of Walgreens. The retailer joins Uber and Uber Eats to become the latest merchant to offer 3% Daily Cash to Apple Card customers who use Apple Pay at checkout. This includes purchases made in both Walgreens and Duane Reade retail stores, as well as on the web at walgreens.com and in the Walgreens mobile app.\nDaily Cash is the Apple Card’s big incentive, as it offers a percentage back on every purchase when cardholders pay with Apple Pay, or when they pay with their titanium Apple Card when Apple Pay isn’t available.\nInitially, only purchases made directly with Apple — including at Apple Stores, apple.com, the App Store, the iTunes Store and for Apple services — would qualify for the 3% Daily Cash. Apple Pay purchases earned 2% Daily Cash and those made with the physical card earned 1%.\nThis Daily Cash is paid out with every qualifying purchase and can be used right away for other Apple Pay purchases. It also can be put toward the Apple Card balance or sent to friends and family through iMessage.\nBut when the Apple Card launched in August to all customers in the U.S., Apple surprised users by expanding its 3% Daily Cash program to more merchants. Uber and Uber Eats were only the first of “many popular merchants” who would join the program in the months ahead, the company said at the time.\nFor the merchants, participation in the rewards program means better access to Apple’s sizable customer base, and a way to increase customer loyalty with their own businesses. After all, why not shop Walgreens over CVS when there’s 3% Daily Cash to be had?\nApple hasn’t yet said what other merchants may be joining the program in the future, but an obvious place to look would be at the big list of Apple Pay merchants who accept Apple Pay in their stores already, as Walgreens does.\n“We know our customers love Apple Pay and they’re looking for convenient ways to shop and pay for their purchases at Walgreens. We’re pleased to offer a higher level of Daily Cash on Apple Card for even better value on daily essentials, medicines, and prescriptions,” said Joe Hartsig, chief merchandising officer, Walgreens, in a statement.\nThe retailer also expanded the number of stores carrying Apple accessories, including Lightning cables, EarPods and iPhone cases, to 2,600 stores chainwide, it says.\nThe Walgreens’ support for Apple Pay’s Daily Cash at the 3% rate will roll out on Friday, September 13, 2019.*\n* Update: An earlier version of this article implied the feature was live now. It actually begins tomorrow.",
        "sentiment": 0.149538234562466
    },
    "article_24": {
        "title": "A whopping collection of 150 Siri Shortcuts to use with iOS 13",
        "body": "Looking for the updated collection? Check out my Shortcuts Catalog, the announcement post, and my new membership.\nNow that Apple has officially released iOS 13 to the public, I am excited to share my personal library of 150+ custom Siri Shortcuts for everyone to add and use.\nI’ve worked countless hours this summer building up a database of my shortcuts, giving each shortcut a description and explanation of how I use it. These are saved inside each shortcut in Comment actions as well, so you can still reference the intended use after adding it to your Shortcuts app.\nYou can find my Shortcuts Library at the bottom of this post and here on my website at matthewcassinelli.com/siri-shortcuts. But first, I wanted to contextualize my collection.\nWhy I am sharing\nSince my time working at Workflow, I’ve lamented losing the ability to curate the in-app Gallery. My last collection was added in March of 2017 before we were acquired by Apple, and since then I’ve wanted to build, curate, and collect as many shortcuts as possible.\nMy original goal in joining Workflow was to help everyday users take advantage of the power of scripting on mobile devices. I could tell it was very cool, but also very complicated – the learning curve was high, but passable. After I left Apple as the acquisition completed in full, and then the next summer saw it turn into Shortcuts, I restarted my mission to fulfill the same goal.\nMy mission as an independent creator is to share my personal experiences of using Shortcuts in my daily life and to get my work done, explained in such a way that anyone can follow along and apply it to their life too.\nWhile Apple and the team that I worked with have been and will continue to take Shortcuts to new heights, I want to be there along the way showing you how a “normal person” can use this tool too.\nBefore this app, I never had engineering training and I didn’t know how to code – I am just a guy who likes taking advantage of the technology available to him.\nFor me, what was Workflow—and is now much-improved as Shortcuts—stuck out as a unique experience. The blend of drag-and-drop building blocks along with deep scripting capabilities and the access to the world of iOS apps on hardware like the iPhone and iPad was so unique – clearly Apple noticed this too – but it made me feel like I could truly take advantage of these mobile computers as real pieces of useful technology and not just the latest gadget.\nInstead of relying on someone else to build me apps, or my smart assistant to “learn” my specific needs, I could use my favorite devices to put together my own little programs.\nWhy use Siri Shortcuts now?\nThis update for Siri Shortcuts feels like the moment that the rocket ship is truly taking off.\nWith iOS 13, Shortcuts is installed by default on every device – hundreds of millions of people will inevitably use this app now. The actions in Shortcuts have also been redesigned to read in plain language, clarifying the connections between actions and showing how they work together as each one is added – what was previously somewhat obtuse is now very clear.\nWhen iOS 13.1 drops, Siri Shortcuts work on iPhone, iPad, AirPods, Apple Watch, HomePod, and CarPlay. That release also adds support for Automations, triggering notifications for your shortcuts from a variety of contexts. Now almost everything you do with your phone can be run on a schedule, in reaction to changes from your device, and even respond the real world – NFC tags can be used to fire off Siri Shortcuts automatically.\nAnd as developers adopt the new Siri Shortcuts APIs, any functionality that can be built into an app can be extended out via Shortcuts as an action. All of these app shortcuts will work entirely from Siri, they can accept and receive batches of information at once, and they can all hook into each other to created a chained workflow of operations for every need you can think of.\nI firmly believe this is the most ambitious update to iOS since perhaps the redesign of iOS 7. However, while that was an overhaul of how iPhone and iPad worked visually, iOS 13 overhauls the entire way users can interact with their devices. Just a few years ago, apps were operating in silos and couldn’t talk to each other; now, every function of every app can be abstracted out from the interface, brought it all into a brand-new programming language that involves absolutely zero actual coding, and—oh yeah—it works across almost every Apple device using only your voice.\nPlus, Siri Shortcuts gives you the ability to make your technology even more valuable. If you’ve ever felt concerned about making real use of your smartphone or felt unsettled when paying $1000+ for something that’s largely for socializing, you can intentionally put existing devices to better use, or generate enough utility from integrating your device as a core part of getting things done in daily life that it might be worth the upgrade.\nSiri Shortcuts pushes iPad forward as the next generation of computers, transfers that same power to your iPhone that you can carry with you anywhere, makes Siri actually useful on devices like AirPods, Apple Watch, CarPlay, and HomePod, and taps into the capabilities of the App Store ecosystem that has been growing for over 10 years.\nLet’s learn together\nI have no idea why Apple hasn’t talked about Siri Shortcuts on stage more, but this is supremely cool stuff and will rethink how you use all of your technology.\nI look forward to sharing what I know about Shortcuts and discovering more with everyone along the way, because there’s an endless amount of material to cover.\nMy Shortcuts Library below is just a start. Please browse through it and come back later as needed, but I will be covering all this material and much, much more. These are the first batch of Siri Shortcuts I’m sharing, and this collection will receive regular updates.\nIf you want to take advantage Siri Shortcuts, follow me on all these channels and we’ll have fun learning it together:\nYouTube : Subscribe to my channel, where I am producing videos on Siri Shortcuts as well as other technology topics. This is where I’ll be putting my primary focus this next year.\n: Subscribe to my channel, where I am producing videos on Siri Shortcuts as well as other technology topics. This is where I’ll be putting my primary focus this next year. Email : Subscribe to my newsletter Type, which is relaunching this Sunday with a weekly curation from my Shortcuts Library and related links from the web.\n: Subscribe to my newsletter Type, which is relaunching this Sunday with a weekly curation from my Shortcuts Library and related links from the web. Blog : Add my blog to your feed reader to get each post as it comes out. I have a series of “Offsite” posts that I write for all of my videos and iMore articles, so subscribing from a service like Feedly will let you keep up with all my work.\n: Add my blog to your feed reader to get each post as it comes out. I have a series of “Offsite” posts that I write for all of my videos and iMore articles, so subscribing from a service like Feedly will let you keep up with all my work. Streaming : Follow me on Twitch, where I’ll be doing long-form sessions where I build Siri Shortcuts live alongside streams for topics like product unboxings or Apple Arcade games. I’ll be streaming on YouTube too.\n: Follow me on Twitch, where I’ll be doing long-form sessions where I build Siri Shortcuts live alongside streams for topics like product unboxings or Apple Arcade games. I’ll be streaming on YouTube too. Twitter: Follow me at @mattcassinelli, where I post daily about Shortcuts and Apple topics, along with my weird sense of humor.\nMy Siri Shortcuts Library\nNow that this 1200-word introduction is done, please enjoy over one hundred Siri Shortcuts:\nFull table:\nGallery view:\nI also did a livestream covering the Siri Shortcuts update for iOS 13 on YouTube and gave a few examples from my Shortcuts Library, so tune in and learn how to use Shortcuts too:\nPlease send any questions, comments, or feedback about the database to [email protected]",
        "sentiment": 0.33252704308702136
    }
}