{
    "article_0": {
        "title": "Apple exec met with teenager who found FaceTime bug at his Arizona home, will be eligible for bug bounty program",
        "body": "Feb. 4th 2019 7:14 am\nThe FaceTime bug that made waves as result of 9to5Mac’s coverage last week was actually first reported to Apple by Grant Thompson and his mother in Arizona a week earlier. However, deficiencies in the Apple bug reporting process meant that the report was not acted upon by the company …\nInstead, the teenager made headlines when his mother shared their Apple communications on Twitter. Their claims were later proved to be legitimate.\nAround January 22, Apple Support directed them to file a Radar bug report, which meant the mother had to first register a developer account as an ordinary customer. Even after following the indicated steps, it does not appear that Apple’s product or engineering teams were aware of the problem until its viral explosion a week later.\nApple took down the Group FaceTime servers to prevent the bug from happening as a short-term workaround, a few hours after the bug was publicized by 9to5Mac. Customers are still waiting for an iOS software update to restore Group FaceTime.\nCNBC reports that an unnamed “high-level Apple executive” met with the Thompsons at their home in Tucson, Arizona on Friday. They apparently discussed how Apple could improve its bug reporting process and indicated that Grant would be eligible for the Apple bug bounty program.\n“They also indicated that Grant would be eligible for the bug bounty program. And we would hear from their security team the following week in terms of what that meant,” said Michele Thompson. “If he got some kind of bug bounty for what he found we’d certainly put it to good use for his college because I think he’s going to go far, hopefully. This is actually a field he was interested in before and even more so now.”\nApple’s bug bounty system is typically invite-only and limited to specific categories of security flaws, like accessing iCloud account data or demonstrating ways for iPhone apps to escape the security sandbox of iOS. Monetary rewards are not given out to any random individual who happens to find a bug in Apple software.\nTherefore, Thompson’s finding of a glitch in iOS that could cause people to hear the caller’s microphone without their knowledge, would not qualify according to those rules.\nIt appears the company is making an exception here given the embarrassingly public nature of the case, although further details about the reward have yet to be discussed.\nUnder the official bug bounty program, Apple pays between $25,000 and $200,000 depending on the severity of the exploit.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.19254588850197338
    },
    "article_1": {
        "title": "Huawei cloning Apple parts, rewarding employees for tech theft",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nChina's Huawei uses \"dubious\" tactics to try to reverse engineer technology from Apple and other competitors in the electronics market, a report charged on Monday.\nIn November, for example, a Huawei engineer heading up smartwatch development tracked down a supplier that helps build the Apple Watch's heart rate sensor, The Information said. The person arranged a meeting with the claim he could offer a manufacturing contract, but instead probed for details about the Apple Watch, an anonymous executive at the supplier said.\nThe engineer was accompanied by four researchers, and together the group is said to have spent an hour and a half asking about the Watch. With nothing given Huawei went silent.\nHuawei has reportedly used similar tactics against companies like Cisco, Motorola, and Akhan Semiconductor. The U.S. Justice Department in fact claims that Huawei has a program that rewards employees for stealing data, with better bonuses based on how confidential information is.\nAn earlier Apple-related incident, according to one source, involved Huawei copying a 2016 connector design used to make the MacBook Pro hinge thinner while linking the display to the logic board. A similar component then appeared in Huawei's 2018 MateBook Pro, something achieved by shopping Apple's schematic around to various suppliers — most of which recognized the design and refused to build it. Eventually the company found a willing partner.\nAnother alleged tactic is talking to people who formerly worked with Apple or its supply chain. In one case, a person interviewed with Huawei immediately after leaving Apple, only to be repeatedly asked about upcoming products and features. They refused and stopped taking interviews.\n\"It was clear they were more interested in trying to learn about Apple than they were in hiring me,\" the person explained.\nHuawei has become the center of a maelstrom surrounding the Chinese government's business policies. The company is believed to have government ties, which has led to calls in the U.S. and elsewhere to ban it from supplying 5G infrastructure. Chinese operatives have regularly conducted cyber attacks in the U.S.\nHuawei and its CFO, Wanzhou Meng, were recently hit with a barrage of U.S. charges accusing it of bank fraud, wire fraud, violations of the International Emergency Economic Powers Act, and conspiracy to commit money laundering. Theft of trade secrets is another item on the docket, though mostly because of a 2013 incident related to a T-Mobile phone-testing robot.",
        "sentiment": -0.45481227406937824
    },
    "article_2": {
        "title": "How did Apple’s AirPods go from mockery to millennial status symbol?",
        "body": "Of all the widely ridiculed tech products, Apple’s AirPods have experienced an extraordinary turnaround. Back in 2016, they were roundly mocked by the tech industry. Tiny wireless earbuds? It seemed like a recipe for disaster – streets would be littered with these lost headphones, which would clutter up city pavements like discarded gloves and babies’ socks.\n“If only there were an invention that could keep those AirPods tethered together, like a string,” wrote Ashley Esqueda from the tech website CNET on Twitter. “The beauty of the headphone cable is just like the beauty of a tampon string: it is there to help you keep track of a very important item,” wrote Julia Carrie Wong in the Guardian.\nBut fast-forward to 2019 and, somehow, the £159-a-pair little pods have transformed into a bona fide status symbol. Diana Ross has a pair, Kristen Stewart wears them and a woman in Virginia has even started a cottage industry by turning them into earrings for people (which does solve the problem of inevitably losing them).\nAnd so, the butt of the joke is not the AirPods themselves but the wealth and status of the people who wear them. Such as the former New York mayor Rudy Giuliani, who wore his upside down. As one viral tweet joked, the world’s Top 10 richest people are: 1. AirPod users; 2. The CEO of Amazon, Jeff Bezos; and 3. Bill Gates. One meme, of a man being knighted by a queen, featured the caption: “AirPod users welcoming new members who received them for Christmas.” All this has now become known as “AirPod flexing” – with the implication that showing off the headphones is gauche social signalling.\nBut is it fair? “The thing is, AirPods aren’t even the most expensive wireless headphones out there,” says Katy Leeson, the managing director of the social media marketing agency Social Chain.\nThat said, the jokes about them can’t have hurt Apple – if anything, the people mocking the product have led to a sales bump. “People who consume memes – millennials and so on – are really hard to reach through traditional advertising,” one digital marketing executive said. This online chatter creates a “desirability” all of its own. And, with rumours of AirPods 2 on the way, it seems like the little earbuds are here to stay.",
        "sentiment": 0.053428887304934586
    },
    "article_3": {
        "title": "Tim Cook says Apple will investigate app that lets Saudi men track and control women",
        "body": "Apple CEO Tim Cook has said the company will look into an app that can be used to track and limit the travel freedom of women in Saudi Arabia. “I haven’t heard about it,” the CEO said in an interview with NPR. “But obviously we’ll take a look at it if that’s the case.” In addition to accessing government services such as applying for passports or birth certificates, Insider discovered that the Absher app, also available in the Google Play store, allows male Saudi guardians to list “dependents” by name and passport number and then limit their ability to travel.\nApple and Google have been criticised for hosting the Absher app by human rights groups for facilitating human rights abuses. In comments provided to the Washington Post, Amnesty International said that the app highlights the “disturbing system of discrimination” in the country, while a spokesperson from Human Rights Watch joined their call for Apple and Google to investigate the app.\nThe app highlights a “disturbing system of discrimination”\nDemocratic Senator Ron Wyden went a step further in an open letter to Tim Cook and Google CEO Sundar Pichai, and called for them to remove the app entirely from their app stores. In the letter, he said:\n“I ask that you take immediate action to prevent your technical infrastructure, including your app stores, from being used by the Saudi government to enable the abhorrent surveillance and control of women. Your employees and your customers expect better, as do millions and millions of Americans who support America’s promotion of basic rights and dignity around the world.”\nUnder Saudi Arabia’s guardianship system, women from the country aren’t allowed to travel without permission from their male guardian, typically a relative. As well as placing limits on their ability to travel, guardianship rules also prevent them from making other major decisions such as getting married, or taking on a job with a private company without the approval of a male guardian.\nAbsher platforms for individuals and businesses have more than 11 million users, according to the Saudi Interior Ministry website.",
        "sentiment": -0.5986047031280274
    },
    "article_4": {
        "title": "Apple COO Jeff Williams ‘Very Aware Of’ Concerns Over Apple Product Cost",
        "body": "Apple COO Jeff Williams spoke at Elon University on Friday, Feb. 22 and spoke of his history in joining Apple in 1998. The Times News covers his talk in detail. Williams also took questions from students in the audience. One student asked Williams if Apple had any plans to reduce prices considering the seemingly large margins on Apple products based on analyst reports.\nWilliams dismissed those reports, suggesting the actual cost of development isn't considered:\n“The stories that come out about the cost of our products [have been] the bane of my existence from the beginning of time, including our early days,” Williams said. “Analysts don’t really understand the cost of what we do and how much care we put into making our products.”\nHe goes on to explain that to build the Apple Watch's activity tracker, Apple built a physiology lab with 40 nurses and 10,000 participants. Still, Williams conceded it's an area that they are paying attention to:\n“It’s something we’re very aware of,” he said. “We do not want to be an elitist company. That’s not — we want to be an egalitarian company, and we’ve got a lot of work going on in developing markets.”\nThe Times News article goes on to cover Williams' talk about his reasons for joining Apple back in 1998, as well as how it feels to be part of a company that has been so successful.\nPricing on Apple's flagship phones has been cited as a factor in iPhone sales underperformance in the last quarter. Apple's flagship ‌iPhone‌ has increased in price over the years with the most recent ‌iPhone‌ XS Max starting at $1099.",
        "sentiment": -0.03219223088983979
    },
    "article_5": {
        "title": "2019 iPhone reported to stick to Lightning port and same 5W USB-A charger in box",
        "body": "Whilst we have yet to see firm evidence on the design of the 2019 iPhone, there has been back and forth rumors about whether the new iPhone would use Lightning or USB-C.\nJapanese site Macotakara says that not only will the 2019 iPhone use Lightning, Apple will also continue to bundle the same 5W charger and USB-A to Lightning cable in the box. This is seen as a cost saving measure. It seems that customers wanting faster iPhone charge times will still have to buy accessories, like the 12W iPad charger.\nThe site explains that Lightning port is not going anywhere and Apple is resistant to changing the included accessories to maintain production costs. Apple can benefit from huge economies of scale by selling the same accessories for many generation.\nAs such, Apple apparently will keep bundling Lightning EarPods, Lightning to USB-A cable, and the 5W USB power adaptor, with the 2019 iPhone lineup.\nThis is disappointing as Apple began shipping an 18W USB-C charger with its iPad Pro line last fall, and many expected that accessory to become an iPhone standard too. Even if the iPhone keeps the Lightning port, Lightning can support fast-charging over the USB Type-C protocol.\nIt’s not clear if the cost savings of this decision would be passed on to consumers with lower cost 2019 iPhone pricing.\nAs the internal batteries of iPhones get larger, sticking to the same 5W charger means that the majority of iPhone users notice that it takes longer to charge an iPhone to 100%. Many believe it is a hardware defect, that their iPhone is merely charging slowly due to a fault, until the charging situation is explained.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.15176631796306797
    },
    "article_6": {
        "title": "Apple tells app developers to disclose or remove screen recording code",
        "body": "Apple is telling app developers to remove or properly disclose their use of analytics code that allows them to record how a user interacts with their iPhone apps — or face removal from the app store, TechCrunch can confirm.\nIn an email, an Apple spokesperson said: “Protecting user privacy is paramount in the Apple ecosystem. Our App Store Review Guidelines require that apps request explicit user consent and provide a clear visual indication when recording, logging, or otherwise making a record of user activity.”\n“We have notified the developers that are in violation of these strict privacy terms and guidelines, and will take immediate action if necessary,” the spokesperson added.\nIt follows an investigation by TechCrunch that revealed major companies, like Expedia, Hollister and Hotels.com, were using a third-party analytics tool to record every tap and swipe inside the app. We found that none of the apps we tested asked the user for permission, and none of the companies said in their privacy policies that they were recording a user’s app activity.\nEven though sensitive data is supposed to be masked, some data — like passport numbers and credit card numbers — was leaking.\nGlassbox is a cross-platform analytics tool that specializes in session replay technology. It allows companies to integrate its screen recording technology into their apps to replay how a user interacts with the apps. Glassbox says it provides the technology, among many reasons, to help reduce app error rates. But the company “doesn’t enforce its customers” to mention that they use Glassbox’s screen recording tools in their privacy policies.\nBut Apple expressly forbids apps that covertly collect data without a user’s permission.\nTechCrunch began hearing on Thursday that app developers had already been notified that their apps had fallen afoul of Apple’s rules. One app developer was told by Apple to remove code that recorded app activities, citing the company’s app store guidelines.\n“Your app uses analytics software to collect and send user or device data to a third party without the user’s consent. Apps must request explicit user consent and provide a clear visual indication when recording, logging, or otherwise making a record of user activity,” Apple said in the email.\nApple gave the developer less than a day to remove the code and resubmit their app or the app would be removed from the app store, the email said.\nWhen asked if Glassbox was aware of the app store removals, a spokesperson for Glassbox said that “the communication with Apple is through our customers.”\nGlassbox is also available to Android app developers. Google did not immediately comment if it would also ban the screen recording code. Google Play also expressly prohibits apps from secretly collecting device usage. “Apps must not hide or cloak tracking behavior or attempt to mislead users about such functionality,” the developer rules state. We’ll update if and when we hear back.\nIt’s the latest privacy debacle that has forced Apple to wade in to protect its customers after apps were caught misbehaving.\nLast week, TechCrunch reported that Apple banned Facebook’s “research” app that the social media giant paid teenagers to collect all of their data.\nIt followed another investigation by TechCrunch that revealed Facebook misused its Apple-issued enterprise developer certificate to build and provide apps for consumers outside Apple’s App Store. Apple temporarily revoked Facebook’s enterprise developer certificate, knocking all of the company’s internal iOS apps offline for close to a day.",
        "sentiment": -0.36799933426772
    },
    "article_7": {
        "title": "Apple Pay Now Accepted at Target Stores",
        "body": "It has now been confirmed to us that Apple Pay is now being accepted in Target retail stores. This is something that both Target and Apple promised for 2019 and it looks as though it is now available.\nPreviously, only their iOS app accepted it, which could be used for both online orders and items to be picked up in their stores once you paid through the app. However, now you can pay with your iPhone or Apple Watch in their retail stores.\nAlthough Target has not officially given a specific launch date, we have obtained a photo from a Twitter user that shows that they do indeed accept Apple Pay now.\nIn the photo, you can see the green dots across the top of the screen where it says “Swipe Card Now.” This indicates that the near field communication (NFC) is turned on, which will allow for devices like the iPhone and Apple Watch to read, take and accept your payment.\nLet us know in the comments below or from our Twitter account (@appleosophy) on whether or not Target is working in your local Target store.\nSpecial thanks to @Yartctls34 on Twitter for sending us this picture of a card reader at their Target store.",
        "sentiment": -0.08333191668821706
    },
    "article_8": {
        "title": "Intel says its 5G modems won't be ready until 2020, aligning with Apple's rumored 5G iPhone roadmap",
        "body": "Feb. 23rd 2019 5:00 am\nSeveral reports have suggested that the iPhone won’t feature support for true 5G until 2020, and now Intel itself has addressed those concerns. As reported by Reuters, Intel executives have said they don’t expect 5G modem chips to be ready for consumer phones until 2020.\nSandra Rivera, head of Intel’s networking chip business, said at an event this week that 5G modems won’t appear in consumer “products in the market” until 2020. This suggests that while Intel might have the technology ready at some point this year, it won’t be early enough for its 5G modems to appear in 2019 phones.\nFurther, today’s report from Reuters says that Apple executives “have held talks” with Samsung and MediaTex “over” 5G modems for this year’s iPhones. Ultimately, however, “the outcome of those talks is unknown.” This was first reported last month.\nA separate report earlier this year indicated that Apple had combined its modem engineering team with its processor chip team, with John Srouji heading the project. This shows that Apple is continuing to ramp up its efforts to build in-house modems, as opposed to relying on external suppliers like Qualcomm, Intel, MediaTek, and Samsung.\nBloomberg reported in December that Apple would not launch a 5G iPhone until 2020 at the earliest. While this puts Apple behind some of its Android competitors, it’s important to remember that the networking infrastructure for 5G isn’t there yet especially in the U.S.\nVerizon announced on Thursday that it will launch true 5G in 30 cities by 2020, which would be just in time for iPhone support of the new networking standard.\nWill you hold off on buying the 2019 iPhones if they don’t support 5G networking or do you see little point until the infrastructure is in place? Let us know what you think down in the comments.\nRelated stories:\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.16720775864087045
    },
    "article_9": {
        "title": "Apple Said to Release 16-Inch to 16.5-Inch MacBook Pro With All-New Design in 2019",
        "body": "Apple will release a new MacBook Pro with a 16-inch to 16.5-inch display and an all-new design in 2019, according to Apple analyst Ming-Chi Kuo.\nTonight, analyst ‌Ming-Chi Kuo‌ released a research note looking at Apple's releases in 2019. MacRumors has obtained a copy of the report and perhaps the most exciting prediction for Mac users is the revelation that Apple is working on a 16\"-16.5\" MacBook Pro. Unfortunately the report provides few details beyond that it is an \"all-new\" design, suggesting Apple is revamping their current MacBook Pro design.\nA 16\"-16.5\" screen would be the largest screen Apple has provided on a MacBook Pro since the discontinuation of the 17\" MacBook Pro in 2012. Close followers of Apple's MacBook Pro refresh cycle have been expecting Apple to continue with the current design until at least 2020. The MacBook Pro last saw a redesign only two and half years ago.\nKuo also says Apple may add a 32GB RAM option to the 13-inch MacBook Pro, without providing further details.\nMore Predictions from Kuo:\n- AirPower and New AirPods Said to Ship in First Half of 2019, New iPod Touch With Faster Processor Also Expected\n- Two New iPad Pro Models, 10.2-Inch iPad, and iPad Mini 5 Said to Launch in 2019\n- 2019 iPhones Can Wirelessly Charge Other Devices, Feature Frosted Glass and Larger Batteries, and More\n- Apple Said to Release 31.6-Inch 6K Display With Mini LED-Like Backlight Design in 2019",
        "sentiment": 0.18251179461367428
    },
    "article_10": {
        "title": "Security researcher demos macOS exploit to access Keychain passwords, but won't share details with Apple out of protest",
        "body": "Security researcher Linuz Henze has shared a video demonstration of what is claimed to be a macOS Mojave exploit to access passwords stored in the Keychain. However, he has said he is not sharing his findings with Apple out of protest.\nHenze has publicly shared legitimate iOS vulnerabilities in the past, so he has a track record of credibility.\nHowever, Henze is frustrated that Apple’s bug bounty program only applies to iOS, not macOS, and has decided not to release more information about his latest Keychain invasion.\nThe KeySteal demo app does not require administrator privileges to execute the attack. It also does not matter if Access Control Lists are set up. The exploit is also claimed to succeed on machines with System Integrity Protection enabled.\nHere’s the demo video of ‘KeySteal’.\nVia Heise.de, the exploit can purportedly access all the items in the “login” and “System” keychain. The iCloud Keychain is not susceptible as that stores data in a different way.\nUsers can proactively defend themselves by locking the login Keychain with an additional password, but this is not the default configuration and is not convenient to enable as it results in endless security authentication dialogs when using macOS.\nIt’s not clear if Apple is aware of the problem at this time.\nHenze encourages other hackers and security researchers to publicly release Mac security issues as he wants to put pressure on Apple to expand the bug bounty program to cover macOS in addition to iOS.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.5033645844669081
    },
    "article_11": {
        "title": "A New Survey Found That 70 Percent of Singles Would Rather Date iPhone Users",
        "body": "In the long and treacherous search for love, we aren't doing ourselves any favors. It turns out that seven in 10 single people would rather date an iPhone user than an Android user, according to a new survey from Decluttr. That means two things: We are too picky, and Apple has hacked our evolutionary instincts to achieve world domination.\nThe reasoning behind the Apple preference, vaguely stated, was that iPhones are more \"sophisticated\" and \"high-quality.\" But we all know that's really code for: no green text bubbles.\nSmartphone discrimination works in the other direction, too. While 65 percent of iPhone users would consider a first date with an Android user, only about half of Android users could say the same about iPhone users. We really, really aren't doing ourselves any favors.\nThis is a small online study of 1,502 people that hasn't exactly been vetted by the world's top researchers. But seeing as most of us will take advice on love from our bodega guy, it's as good a source as any. Go forth and find love with the text bubbles of your people.",
        "sentiment": -0.3958506324243816
    },
    "article_12": {
        "title": "Average iPhone upgrade cycle now lasts four years, up from three in 2018",
        "body": "Feb. 8th 2019 12:42 pm\nIt seems fair to say that since the release of iPhone 6, A-series processor updates have been more for future-proofing purposes rather than present necessity for the average user. As a result, biennial upgrades, let alone annual iPhone swaps, became increasingly rare — demonstrated by ever shrinking Apple Store lines proceeding a new launch. Now, the anecdotal findings are being corroborated by industry analyst Toni Sacconaghi from Bernstein, who says that the average iPhone upgrade time has increased to four years, up from three years in fiscal 2018.\nAs the need for a new smartphone each year to offer an enjoyable mobile experience has evaporated, Sacconaghi attributed in a note to investors on Friday that users see less of a need to upgrade as often due to Apple’s battery replacement program and increased prices.\nSacconaghi frames the issue as both critical and underestimated.\nIn our view, the single most important controversy surrounding Apple today is the iPhone replacement cycle – despite the iPhone installed base growing +9% last year, we now expect units to be down -19% in fiscal 2019, implying a material pushout in upgrade rates. Replacement cycles are elongating… a lot.\nLater on, he predicts that approximately 16% of the current iPhone base will upgrade this year, meaning that whatever Apple announces come September certainly isn’t expected to drive any sort of otherworldly upgrade rates.\nTim Cook has acknowledged slowing iPhone upgrade rates in the past, saying previously that customers are “holding onto” iPhones a bit longer than before.\nSlowing upgrade times and stagnating smartphone sales is not merely an Apple problem, however. We’ve reported on global shipments falling since last year, as data from IDC shows even Samsung seeing slowing sales.\nAs for AAPL, the stock has rebounded well over the past months, however, it’s down about $5 from earlier this week and still has a long ways to go before reaching $1 trillion once more.\nAAPL again became the worlds most valuable company this week, peaking at $175 per share on Wednesday in the 24 hours following the news.\nDo you believe the average user is upgrading their iPhone every four years now? If that’s the case, it means many iPhone 6s users could be splurging on iPhone 11 come later this year. Let us know what you think in the comments section below!\nRelated stories:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.018375725926537263
    },
    "article_13": {
        "title": "Apple being sued because two-factor authentication on an iPhone or Mac takes too much time",
        "body": "Apple being sued because two-factor authentication on an iPhone or Mac takes too much time\nTwo-factor authentication on an iPad and iPhone\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA class action suit has been filed that accuses Apple's two-factor authentication of being too disruptive to users, taking too much time out of a user's day when it is needed, and abusive since it can't be rolled back to a less safe login method after 14 days.\nThe suit, filed by Jay Brodsky in California alleges that Apple doesn't get user consent to enable two-factor authentication. Furthermore, once enabled, two-factor authentication \"imposes an extraneous logging in procedure that requires a user to both remember password; and have access to a trusted device or trusted phone number\" when a device is enabled.\nFiling paperwork associated with the suit also alleges that harm is being done, and potential class members \"have been and continue to suffer harm\" including economic losses, based on a waste of personal time for an extended login process that has become a multiple-step process.\nThe filer alleges that a software update enabled two factor authentication on or around September 2015. However, neither macOS El Capitan nor iOS 9 released in the timeframe put forth by the filer mandated two-factor authentication, nor implemented it without an explicit and multiple-step opt-in procedure requiring the user to consent. It is required to take advantage of some of Apple's services, like Home Sharing and HomeKit Hubs, however.\nBrodsky alleges that the email that Apple sends after two-factor authentication is enabled is insufficient to warn the user that the setting is irrevocable. The filing calls a link in an email to a page to reset the configuration \"unobtrusive\" but does not specify what would have been sufficiently noticeable in a three-paragraph email.\nEmail sent to user after two-factor authentication is activated on an iCloud account\nAccording to the suit, when two-factor authentication is demanded, the process as follows takes between two and five minutes.\nFirst, Plaintiff has to enter his selected password on the device he is interested in logging in. Second, Plaintiff has to enter password on another trusted device to login. Third, optionally, Plaintiff has to select a Trust or Don't Trust pop-up message response. Fourth, Plaintiff then has to wait to receive a six-digit verification code on that second device that is sent by an Apple Server on the internet. Finally, Plaintiff has to input the received six-digit verification code on the first device he is trying to log into. Each login process takes an additional estimated 2-5 or more minutes with 2FA.\"\nAppleInsider hasn't been randomly presented with any two-factor authentications on Saturday even following OS updates to an iPhone XS Max, an iPhone X, and two sixth-generation iPads, but was able to force the issue on a new device. The process took 22 seconds in total to accomplish.\nThe filer believes that Apple has interfered with the use of the device with the \"extraneous login process through two-factor authentication\" that has been \"imposed\" on the class. The time it takes to execute the extra login data is said to be \"continuous, systematic and ongoing\" and Apple has \"caused injury to Plaintiff and Class Members' rights to choose the level of security for Plaintiff and Class Member owned devices.\"",
        "sentiment": -0.6639084931285608
    },
    "article_14": {
        "title": "Apple Agrees Deal With France to Pay $571 million in Back-Taxes",
        "body": "Apple has reached a deal with French authorities to pay an undeclared amount of back-dated tax, according to multiple reports today.\nApple's French division confirmed the tax payment agreement to Reuters, but didn't disclose how much it had agreed to pay, although French media suggest the sum is around 500 million euros ($571 million).\n\"As a multinational company, Apple is regularly audited by fiscal authorities around the world,\" Apple France said in a statement. \"The French tax administration recently concluded a multi-year audit on the company's French accounts, and those details will be published in our public accounts.\"\nFrance has been working diligently to stop tech companies like Apple from exploiting tax loopholes in the country. The loopholes are said to have allowed Apple to \"minimize taxes and grab market share\" at the expense of Europe-based companies.\nFrench President Emmanuel Macron is one of the leaders behind the tax crackdown on international tech companies, with a goal of bringing a more unified corporate tax system across the nineteen euro area states.\nAs noted by iPhon.fr, Apple and French tax authorities reached the agreement for the payment of several years of unpaid taxes in December, according to French newspaper L'Expansion. The agreement followed a meeting in October between Apple CEO Tim Cook and President Macron, in which both reportedly agreed that a solution would ultimately be enacted by the European Union rather than France.\nApple has had trouble with French tax activist groups accusing the company of wide-scale tax evasion and occupying its Parisian retail stores. In February 2018, Apple sued the activist group \"Attac\" for its protests in stores, but the High Court of Paris denied Apple's request for an injunction that would have blocked the group from protesting.",
        "sentiment": -0.2999619039474055
    },
    "article_15": {
        "title": "Apple Apologizes About FaceTime Bug, Software Update With Fix Delayed Until Next Week",
        "body": "Apple issued the following statement to MacRumors today in which it apologized for a major FaceTime eavesdropping bug:\nWe have fixed the Group FaceTime security bug on Apple's servers and we will issue a software update to re-enable the feature for users next week. We thank the Thompson family for reporting the bug. We sincerely apologize to our customers who were affected and all who were concerned about this security issue. We appreciate everyone's patience as we complete this process. We want to assure our customers that as soon as our engineering team became aware of the details necessary to reproduce the bug, they quickly disabled Group FaceTime and began work on the fix. We are committed to improving the process by which we receive and escalate these reports, in order to get them to the right people as fast as possible. We take the security of our products extremely seriously and we are committed to continuing to earn the trust Apple customers place in us.\nWidely publicized on Monday, the FaceTime bug allowed one person to call another person via ‌FaceTime‌, slide up on the interface and enter their own phone number, and automatically gain access to audio from the other person's device without that person accepting the call. In some cases, even video was accessible.\nWe demonstrated the bug in a video earlier this week:\nApple disabled Group FaceTime as a temporary server-side solution, preventing the bug from working any longer. Apple is also working on a software update with a permanent fix that it originally said would be available this week , but it has been delayed until next week, according to Apple's statement.\nApple thanked the Thompson family for reporting the bug—supposedly over a week before it made headlines—and said it is committed to improving the process by which it receives and escalate these reports in order to quash bugs faster.\nApple already faces a lawsuit in Texas and a proposed class action lawsuit in Canada over the bug. Given the serious privacy implications involved, it is certainly possible there will be more class action lawsuits to come.",
        "sentiment": -0.042019903393728394
    },
    "article_16": {
        "title": "Apple beginning new push for subscription-based apps instead of single purchases",
        "body": "For a while now, Apple has been encouraging app developers to consider subscriptions as a key revenue source, and the company is introducing some new options for developers that it hopes will make the option more attractive. In the past few days, Apple has informed developers that they will now be able to target current and recent subscribers with promotional rates on subscriptions. That means developers will be able to offer discounts to try to get you back if you lapse, or they might try to entice you to stay if you're considering leaving.\nDevelopers could previously offer limited-time subscription discounts but only to new users. The new model is available in recent beta releases of iOS 12.2, macOS Mojave 10.14.4, and tvOS 12.2, and it is likely to be included in the final public release for each. Apple will facilitate three different types of offer for developers who want to retain or regain subscribers.\nHere's how they're described in Apple's App Store Connect post on the subject:\nFree\nCustomers access your subscription for free for a specific duration—for example, a 30-day trial for a subscription with a standard renewal price of $4.99 per month. Pay As You Go\nCustomers pay a promotional price for each billing period for a selected duration—for example, $1.99 per month for three months for a subscription with a standard renewal price of $9.99 per month. Pay Up Front\nCustomers pay a one-time promotional price for a specific duration—for example, $9.99 for the first six months of a subscription with a standard renewal price of $39.99 per year.\nTo deploy these offers, developers will need to implement new StoreKit APIs using the latest beta version of Xcode. They can test using the aforementioned iOS, macOS, and tvOS betas, but the offers will not become available to users until the \"the feature is publicly available.\"\nApple has actually already made similar offers to iPhone users for Apple Music, but this is the first time other developers on Apple's platform can reach lapsed subscribers this way.\nApple specifically positions the feature as one for resubbing lapsed users. The company writes, \"You can use subscription offers to help win back subscribers who have canceled their subscriptions or promote an upgrade to another subscription at a special price.\" Apple also clarifies that users will be able to take advantage of the offers even if they already participated in a similar initial sign-up offer when they first subscribed. Further, developers will be able to target users who have set subscriptions to end at the next pay date to use these offers to convince them to stay.\nAdvertisement\nApple reportedly gathered developers of all types—makers of games, productivity apps, photography apps, and so on—in New York in 2017 to make the case for subscriptions as a viable model, even on mobile.\nSamuel Axon\nSamuel Axon\nSamuel Axon\nSamuel Axon\nSamuel Axon\nGames and high-end productivity and creative work suites have long used the model on PCs, but it was previously somewhat rare on mobile. Anyone using new iOS apps regularly has probably seen that change. Games that rely on IAP now frequently offer optional subscriptions that allow players to progress faster or get discounts on other purchases. Photography apps charge a couple of dollars per month for access to powerful, AI-driven filters. And powerful productivity apps offer subscriptions not dissimilar to—though usually cheaper than—Adobe Creative Cloud and the like. In most cases, developers have chosen to make the subscriptions value-added rather than essential for basic function. But not always.\nApple takes a 30-percent cut of subscription revenues from apps in the App Store for the first year a subscriber is paying, but it drops the cut to 15 percent after the subscriber has passed the one-year mark. This drop is partly an effort to reward developers who produce apps of sufficient quality to entice subscribers to stay that long, but it's also a response to initial complaints that the terms were burdensome.\nThe subscriptions model is part of a larger strategic push at Apple to pivot to monetizing content, services, and experiences on its platforms in addition to revenue from hardware sales. This push is itself partly in response to and in anticipation of iPhone sales lulling slightly internationally and partly in response to the success that was the 2015 launch of Apple Music.\nListing image by Valentina Palladino",
        "sentiment": 0.13963315379805863
    },
    "article_17": {
        "title": "Touch ID that spans the entire iPhone display in the works at Apple",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nWhile Touch ID isn't being offered as a biometric authentication method in current-generation iPhones and the iPad Pro range, Apple is still considering the possibility of adding fingerprint recognition to its mobile devices, by using acoustic imaging on the display.\nFace ID has been a successful replacement for Touch ID, boasting fewer false positives than the more physical biometric security system while still remaining fast to use. While it has brought some benefits, there are still some advantages to using Touch ID over Face ID, such as in situations where it isn't prudent to use Face ID or to unlock the iPhone while it is still in the user's pocket.\nEven so, Touch ID has the major problem of requiring either a section of the front of the mobile device to be used for the fingerprint reader, reducing the potential screen size, or for it to be mounted on the back, a design choice Apple has yet to take. Based on a recently-granted patent, Apple has come up with a way to do Touch ID-style fingerprint reading, but without sacrificing the appearance of the iPhone itself.\nThe patent titled \"Acoustic pulse coding for imaging of input devices,\" describes how sound could be applied to a surface in order to detect how another object comes into contact with it. In short, this could enable a fingerprint to be read when it is pressed onto a display.\nAn illustration using two rows of transducers at the top and bottom of the display\nAccording to the patent, an array of acoustic transducers are positioned in contact with the surface, and can transmit a coded impulse signal, in response to a touch input. By monitoring the reflections from multiple coded signals, an image resolver can receive the reflection data and generate an image based on the input.\nIn effect, sound impulses are sent out and come into contact with the ridges of the user's fingerprint. These ridges interrupt the impulse's transit and are reflected, with these reflections then interpreted into a fingerprint image that can be analyzed.\nSuch a technique would provide a number of benefits compared to existing fingerprint reading technology, including a reduced thickness of the components required as the transducers can be placed on the edge and away from other components. There is also a lack of a need for electrodes to be placed on the display, which aside from reducing the complexity of display production, also means a potential speed boost for performing the authentication check in the first place, due to Apple suggesting it requires less processing power.\nAs it is based on sound transmittance, it could also feasibly allow for fingerprint reading to be performed anywhere on the display of the device, not just one specific point.\nOne version involves transducers surrounding the entire display area, potentially allowing for a more accurate scan by pinging from multiple sides.\nApple files numerous patents on a weekly basis, and while they do advise on areas of interest for the company, it doesn't necessarily mean the ideas disclosed will appear in a future product or service.\nThis is not the only time Apple has looked at alternative ways to perform fingerprint-based biometrics via the display, without using a designated sensor like Touch ID's Home button. In February 2017, a filing for an \"Acoustic imaging system architecture\" suggested a similar method of using acoustic pulses and waves from transducers to perform similar reflection-based analysis of objects in contact with the surface.",
        "sentiment": -0.10307325148268749
    },
    "article_18": {
        "title": "The Apple executive responsible for overseeing Siri for the past seven years exits role. The move appears to reflect a new direction for the Siri group under John Giannandrea, Apple's artificial intelligence senior vice president.",
        "body": "Siri has gotten its fair share of scrutiny over the years, with many believing it’s falling behind in the smart assistant game despite being the first major company to market with the technology. Bill Stasior, who was responsible for Siri over the last seven years, has recently left the company.\nAccording to a report from The Information, Stasior joined the Siri team in 2012, focusing on leading the group. This was after two of Siri’s creators had left the team, however, they remained at Apple working on other projects.\nStasior leaving the company is likely an effort by John Giannandrea, who is now Apple’s SVP of machine learning and AI strategy, after leaving Google earlier last year.\nThe report also says that Giannandrea’s team is now focusing on long-term research versus the short-term incremental updates Siri has been seeing over the past several years. He’s still looking for someone to lead the Siri team, however.\nWith the new focus on long-term research, it’s highly unlikely that we’ll see any major improvement in Siri this year with iOS 13, if any at all. However, under Giannandrea’s leadership, Siri may finally be getting the help it needs to become a great voice assistant, even if that means waiting another year to see improvements.\nRelated stories:\nFTC: We use income earning auto affiliate links. More.\nSubscribe to 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2514245327223431
    },
    "article_19": {
        "title": "Its free, for MacOS and it's Halo: CE online multiplayer AND the servers need more players!",
        "body": "HaloMD extends the life of Halo and makes mods fun again.\nNeither the retail nor demo version of Halo run on today's Macs.\nThis project relives the demo experience.\nDownload\nVersion history | Older versions\nNote: HaloMD will not run on macOS Catalina (10.15) and later. Sorry!\n(Latest 10.5 & 10.6 intel version can be downloaded here)",
        "sentiment": 0.1979398051276803
    },
    "article_20": {
        "title": "Apple Reportedly Shifts to In-House Modem Engineering Led by Johny Srouji",
        "body": "Apple has assembled an in-house modem engineering team led by its chipmaking chief Johny Srouji, according to Reuters.\nFrom the report:\nApple Inc has moved its modem chip engineering effort into its in-house hardware technology group from its supply chain unit, two people familiar with the move told Reuters, a sign the tech company is looking to develop a key component of its iPhones after years of buying it from outside suppliers.\nThe report claims Srouji, senior vice president of hardware technologies at Apple, took over the company's modem design efforts in January.\nThe in-house shift provides further evidence that Apple may be planning to develop its own cellular modem for future iPhones, as previously reported. Apple currently sources iPhone modems from Intel after cutting its ties with Qualcomm amid a major legal battle between Apple and Qualcomm.\nApple is expected to release its first 5G-enabled ‌iPhone‌ in 2020, but it's unclear if it will have an in-house chip ready by that time. If not, a previous report said Intel will supply Apple with 5G chips, but the ‌iPhone‌ maker is said to be \"unhappy\" with Intel's progress and may have to look elsewhere.",
        "sentiment": 0.1618656630494765
    },
    "article_21": {
        "title": "Apple Event Planned For March 25 Around A News Subscription Product",
        "body": "Apple has settled on a date for its first big product announcement of 2019. Sources tell BuzzFeed News that the company plans to hold a special event on March 25 at the Steve Jobs Theater on its Apple Park campus. Headlining the gathering: that subscription news service that has been all over the news today. Unlikely to make an appearance: next-generation AirPods, or that rumored new iPad Mini.\nSources described the event as subscription-services focused, but declined to say anything about Apple’s stand-alone video streaming service, which is also rumored to debut in 2019. Earlier this year, the Information reported that Apple had told studios and networks to be prepared for an April launch.\nApple has long held product events in late March, so it's hardly a surprise it has planned another one for 2019. That said, sources said there is a small chance the final date could shift a bit given the level of publisher pushback the company is getting over the revenue-sharing terms of the so-called Netflix for news service it hopes to debut.\nApple reportedly plans to claim half the proceeds of a $10 monthly subscription fee, divvying up the other half among participating publishers according to how many people read their stories. Publishers are, in the words of one executive, \"pissed\" at the terms, which they argue are not at all standard for these types of agreements.\nApple declined comment.",
        "sentiment": -0.08656026668507945
    },
    "article_22": {
        "title": "Screensaver with animated logos from Apple's Event on October 30, 2018",
        "body": "Screen Saver by Pedro Carrasco based on the animations presented during Apple Special Event (October 30, 2018) from the Brooklyn Academy of Music, Howard Gilman Opera House.\nFeatures ✅\nDoesn't require internet connection\nHomebrew support\nLight & Dark theme\nSelect which animations you want to see\nLoop each animation how many times you want\nMake the animations' order random\nInstallation 📦\nIndependently of how you install Brooklyn, please close your System Preferences.\nScreen savers can be set programmatically with this Terminal command :\ndefaults -currentHost write com.apple.screensaver moduleDict -dict moduleName Brooklyn path \" $HOME /Library/Screen Savers/Brooklyn.saver \"\nManual ✋\nClick here to Download Open Brooklyn.saver (double click) \"Brooklyn.saver\" can't be opened because it is from an unidentified developer will appear, press OK Open Preferences Select Security & Privacy Select General On the bottom side, select Open Anyway\nHomebrew 🍺\nOpen terminal Enter brew install --cask brooklyn --no-quarantine\nUninstallation 🗑️\nManual ✋\nRight-click on Brooklyn in System Preferences and select Delete Brooklyn , or\n, or Delete Brooklyn.saver either in /Library/Screen Savers or /Users/USERNAME/Library/Screen Savers .\nHomebrew 🍺\nOpen terminal Enter brew uninstall --cask brooklyn\nCompatibility 🔧\nRequires OS X El Capitan (10.11) or above.\nTroubleshooting 🤕\nThe Brooklyn screen saver can be blocked by the system as a malicious software. Sometimes on macOS Big Sur clicking Open Anyway in Security & Privacy is not fixing the issue.\nTo bypass this quarantine made by apple, you can use this command in your terminal :\nsudo xattr -d com.apple.quarantine ~ / \" Library/Screen Savers/Brooklyn.saver \"\nSupport Brooklyn ❤️\nHello there 👋\nI’m Pedro, a Portuguese iOS Engineer since February 2017. I’m an avid OSS enthusiast and contributor - help by sharing, learn by what’s shared.\nI've built and open-sourced multiple frameworks and applications, including Brooklyn and CocoaHub.\nI'm also a conference and meetup organizer, being part of SwiftAveiro and CocoaHeads Porto.\nIf you enjoy my work and would like to help me continue it, please consider:\nContributing 🙌\nFeel free to contribute to this project by providing ideas or opening pull requests with new features or solving an existing issue.\nLicense ⛔\nBrooklyn's available under the MIT license. See the LICENSE file for more information. Logo & original animations are Apple's property.",
        "sentiment": 0.0298802738847292
    },
    "article_23": {
        "title": "Report: 'Many' Publishers Have Agreed to Apple's 50/50 Split for Apple News Subscriptions",
        "body": "A new report on Wednesday claims a number of publications have signed with Apple for their Apple News-based subscription news service, in spite of the 50/50 revenue split Apple is requiring.\nApple is reportedly aiming to keep half of all revenue received by publications selling subscriptions on the Cupertino firm’s rumored premium new service. While some industry analysts have bashed Apple over the 50/50 split required by the deal, it appears many publications see value in the deal.\nA Wednesday report from Recode says “many” publishers have already signed deals to be included in the much-rumored news subscription service. The publishers see potential for growth by partnering with the iPhone maker.\nHere’s the short answer, which I’ve cobbled together by talking to industry sources: Apple has already signed many publishers to deals where they’ll get 50 percent of the revenue Apple generates through subscriptions to its news service, which is currently called Texture and will be relaunched as a premium version of Apple News this spring. And some publishers are happy to do it, because they think Apple will sign up many millions of people to the new service. And they’d rather have a smaller percentage of a bigger number than a bigger chunk of a smaller number.\n“It’s the absolute dollars paid out that matters, not the percentage,” said one unidentified publishing executive.\nWhile smaller publishers may be willing to share their revenue with Apple on such a dear scale, larger publishers continue to balk at signing for such a revenue split.\nThe New York Times and the Washington Post are two of the publishers that haven’t yet inked a deal with Apple for the service. Both publications have site paywalls and subscription offerings in place already. While The Wall Street Journal is also said to have similar concerns, its conversations with Apple have been described as “productive.”\nThe publications’ share of the $10 monthly fee paid to Apple would be much less than the fees the publications currently pay. The New York Times charges $15 per month, while The Washington Post’s tariff is $10 per month and The Wall Street Journal asks a hefty $39 per month.\nIt is feared current subscribers would cancel their direct subscriptions and they would switch over to the Cupertino firm’s much cheaper alternative. All three sites currently offer some of their content via the Apple News app, and offer subscriptions through the service, keeping 70% of subscription fees for the first year, while Apple takes 30%. Apple’s share drops to 15% in year two\nIn addition to the monetary concerns, publishers are rebelling at the idea of Apple controlling users’ email addresses and credit card information. That information is valuable to publishers, as they use it to create customer databases for marketing their products, and for sale to advertisers.\nApple is expected to unveil both its streaming TV service and its news service in a star-studded event on March 25.",
        "sentiment": -0.2139396108686924
    },
    "article_24": {
        "title": "Apple Watch fall detection credited with saving user in Norway after severe overnight fall",
        "body": "We’ve reported several times about the Apple Watch Series 4’s ECG functionality alerting unsuspecting users to seek medical attention. In addition to ECG, however, the Series 4 has a fall detection functionality. That feature is what one Norweigan Apple Watch user credits with saving his life.\nAs reported by NRK, 67-year-old Toralv Østvang was found “bloody and unconscious” on his bathroom floor by emergency authorities. According to the report, Østvang fell in his bathroom, with the Apple Watch automatically alerting emergency authorities.\nØstvang’s daughter says that he likely went to the bathroom in the middle of the night, but fainted and fell to the floor. During the fall, Østvang sustained three fractures in his face. The daughter explains (translated):\n“It could have gone so much worse. All morning we asked, ‘What had happened if he hadn’t worn a smart watch?’ He didn’t bring his mobile phone in the bathroom. It’s amazing that he got such quick help from the alarm, until the police found him. It was a serious fall, perhaps it saved his life.”\nThe daughter also adds that Østvang had never considered having any other form of alert system, making it all the more notable he was wearing his Apple Watch that just happened to have fall detection.\nFall detection on the Apple Watch is able to track when you fall and then ask you if you are ok. If it sees that you are unresponsive for 1-minute, it will automatically call emergency services and share your current location with them. That seems to be exactly what happened to Østvang.\nThis isn’t the first time Apple Watch fall detection has been credit with saving someone. Back in October, a user in Sweden reported that the Apple Watch had called emergency authorities when he had a sudden back injury and fell to the floor.\nApple Watch fall detection is enabled automatically for users 65-years-old and older. To enable it, go into the Watch app on your iPhone, choose “Emergency SOS,” and enable the fall detection slider.\nSubscribe to 9to5Mac on YouTube for more Apple news:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.21776798215102067
    }
}