{
    "article_0": {
        "title": "Apple CEO Tim Cook to the class of 2019: ‘My generation has failed you’",
        "body": "\"This problem doesn't get any easier based on whose side wins or loses an election. It's about who has won life's lottery and has the luxury of ignoring this issue and who stands to lose everything,\" Cook said. \"The coastal communities, including some right here in Louisiana, that are also making plans to leave behind the places they have called home for generations and head for higher ground. The fisherman who nets come up empty. The wildlife preserves with less wildlife to preserve, the marginalized, for whom a natural disaster can mean enduring poverty.\"\n\"Here today, in this very place, where thousands once found desperate shelter from a hundred-year disaster — the kind that seem to be happening more and more frequently — I don't think we can talk about who we are as people and what we owe to one another without talking about climate change,\" Cook said.\n\"You don't need to look far to find an example of that failure,\" Cook said, referring to New Orleans, where he was speaking, which was devastated by Hurricane Katrina in 2005.\n\"We have spent too much time debating, we have been too focused on the fight, and not focused enough on progress,\" Cook, 58 and a member of the Boomer generation , said. Generally, college graduates are part of Generation Z .\n\"In some important ways, my generation has failed you,\" Cook said Saturday in his commencement speech at Tulane University in New Orleans, La., at the Mercedes-Benz Superdome.\nMore broadly, Cook called on the class of 2019 to focus on helping others, starting with those who need the most.\n\"When we talk about climate change or any issue with human cost — and there are many — I challenge you to look for those who have the most to lose, and find the real, true empathy that comes from something shared. That is really what we owe one another,\" Cook said.\nFrom the Big Easy, the tech executive seemed to be taking a shot at the divisiveness taking root in Washington D.C. and corrupting the fabric of the country.\n\"When you do [find empathy], the political noise dies down and you can feel your feet firmly planted on solid ground. After all, we don't build monuments to trolls and we are not going to start now,\" Cook said.\nTo reduce that divisiveness, Cook pleaded with the young graduates to resist entrenched thinking and adopting points of view blindly.\n\"There are some who would like you to believe that the only way you can be strong is by bulldozing those who disagree or never giving them a chance to say their piece in the first place, that the only way you can build your own accomplishments is by tearing down the other side,\" he said.\n\"We forget sometimes that our preexisting beliefs have their own force of gravity. Today, certain algorithms pull towards you the things you already know, believe or like and they push away everything else. Push back. It shouldn't be this way,\" Cook said. \"But in 2019, opening your eyes and seeing things in a new way can be a revolutionary act.\"\nWork to understand the perspectives of those who see an issue differently than you do, Cook said.\n\"Summon the courage not just to hear but to listen. Not just to act but to act together. It can sometimes feel like the odds are stacked against you, that it isn't worth it. That the critics are too persistent and the problems are too great. But the solution to our problems begin on a human scale by building a shared understanding of the work ahead, and with undertaking it together. at the very least we owe it to teach other to try.\"\nAbove all, Cook called upon the graduating class to take action to improve the world they live in.\n\"Whatever you do, don't make the mistake of being too cautious,\" said Cook. \"Don't assume that by staying put, the ground won't move beneath your feet. The status quo simply won't last. So get to work on building something better.\"\nSee also:\nApple CEO Tim Cook: 'Don't work for money ... you will never be happy'\nThis start-up turns pollution from factories into fuel that powers cars — and one day planes\nApple CEO Tim Cook: 'The world is full of cynics and you have to tune them out'",
        "sentiment": -0.06390684180789524
    },
    "article_1": {
        "title": "Apple releases new iPod touch featuring A10 Fusion chip, 256 GB storage option",
        "body": "Apple has just announced a new iPod touch featuring an Apple A10 Fusion chip. The new iPod looks the same as the previous generation, with a 4-inch screen flanked by large bezels and a non-Touch ID physical home button.\nIn addition to the new chip, the device comes in a 256 GB model for the first time. The 2019 iPod touch is available to order online now at $199 for 32 GB storage, $299 for 128 GB and $399 for the 256 GB configuration.\nThe iPod touch was last refreshed in 2015. That model did not support features like ARKit or Group FaceTime as the A8 processor was not powerful enough.\nThis means the iPod touch finally joins the Group FaceTime compatible device family with today’s update.\nThe Touch continues to lag behind the rest of the iOS lineup. Its chassis design has not changed since 2012, which means it lacks biometric authentication of any kind: no Touch ID, no Face ID.\nIt also keeps the same 4-inch screen as before; a handheld games console could probably benefit from a bigger display. All the same, Apple’s marketing pages for the new Touch are already hyping up the Apple Arcade games subscription service, which is launching later this year.\nToday’s processor bump update is doubly disappointing as it doesn’t even get the latest-gen A11 chip, just a measly A10.\nApple is set to announce iOS 13 next week. For the iPod touch, the company often only supports the latest-generation device. With the release of the seventh-generation model today, it is likely that the 2015-2018 sixth-generation Touch will now be discontinued as far as software updates are concerned.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.06431510118658051
    },
    "article_2": {
        "title": "Apple increases iPhone cellular download limit from 150 MB to 200 MB",
        "body": "This week, Apple has upped the cellular download limit for iPhone and iPad that prevents users from downloading large files from Apple’s stores, including apps, games, video podcasts, iTunes Store films and more.\nThe cellular download limit has been increased from 150 MB to 200 MB. This means more apps and games are now allowed to be downloaded over cellular networks.\nThe file size limit prevents iOS users from accidentally downloading a big game on LTE and blowing through their carrier’s data cap. However, the cellular limit is often mocked as a stupid feature as Apple offers no opportunity to override the limit and force the download to succeed.\nIt is also silly because the cellular limit is enforced non-discriminately, which means even iPhone users with unlimited data plans are still barred from downloading apps and games over 200 MB.\nThe limit would be better implemented as a warning, informing the user that they are about to download a large file but including a ‘Continue Download’ button to allow the download to complete. Even users with capped data plans may need a big app in a pinch from time to time.\nThe cellular limit was last increased in September 2017, from 100 MB to 150 MB. It’s slow progress.\nOne important gotcha when testing iOS’ cellular download limit is that it is tested against the thinned, compressed file size. The App Store reports app file sizes before they are thinned.\nFor example, you can now probably successfully download a game over cellular that is listed around 240 MB in size on the App Store. This does not mean the cellular limit is 240 MB. What it means is the version of the game that is being downloaded — which has irrelevant assets stripped away, like artwork only used on the iPad version of the game — is below the real 200 MB limit.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.4264351493295501
    },
    "article_3": {
        "title": "Rumor suggests iOS 13 will not support iPhone 6, iPhone SE and iPhone 5s",
        "body": "A rumor from iPhonesoft.fr out today suggests that iOS 13 will cut off several generations of iPhone. With iOS 12, Apple supported every device that could run iOS 11, boosting performance across all models all the way back to iPhone 5s. If today’s report is to believed, it is the end road for a large chunk of active iPhone models.\nThe report claims that iOS 13 will drop support for iPhone 5s, iPhone SE, iPhone 6 and iPhone 6 Plus.\nFirst debuted in 2014, the iPhone 6 and iPhone 6 Plus cycle was incredibly successful for Apple and continues to hold the crown as the best-selling iPhone generation.\nIf this report is correct, there will be a substantial pile of devices that can no longer update to the newest iOS version come September. It would also mean that the iPhone 5s got one extra year of iOS updates than the iPhone 6 generation. iPhone SE users would really be drawing the short straw, as the product is only three years old.\nIt is possible that Apple wants to stop supporting 4-inch iPhone screen sizes with iOS 13; ending compatibility for 5s and SE would make strides towards that. The iPod touch remains a thorn in Apple’s side, as the company only sells one model of iPod touch … and that model features a 4-inch display.\nOn the iPad side, iPhonesoft reports that only the iPad mini 2 and the iPad Air will not be able to install iOS 13. The iPad Air was launched in 2013, the same year as iPhone 5s.\nWe’ll know for sure when Apple officially announces iOS 13 at WWDC on June 3.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.011031231260858476
    },
    "article_4": {
        "title": "Apple made informal bid to buy Tesla at $240 per share in 2013",
        "body": "Tesla Model X\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple's automotive ambitions could have been augmented with the acquisition of Tesla, an analyst claims, with the iPhone maker said to have made a \"serious bid\" to buy the electric car producer in 2013, a move that could have brought technology developed under \"Project Titan\" to commercialization far earlier.\nApple has seemingly harbored plans to produce its own brand of vehicle — or Apple Care — for some time under the codename \"Project Titan,\" though speculation has hinted at the possibility of Apple using its massive resources to get a head start in the market by purchasing an auto manufacturer instead of working entirely from scratch. According to a recent TV interview, it seems Apple tried to do just that.\nSpeaking on CNBC on Tuesday, Roth Capital Partners analyst Craig Irwin claimed Apple made a \"serious bid\" to purchase Tesla, around 2013, with the offer supposedly in the region of $240 per share. It is unclear how far along the alleged negotiations went, such as a \"formal paperwork stage\" that would signal an intent to purchase.\nWhile there is only the word of Irwin that the bid was made, he insists \"multiple checks\" were made with multiple sources, and he has \"complete confidence\" that it is \"credible.\" At this time there is barely any evidence or other claims that such a bid existed at all.\nA profile of Apple's mergers and acquisitions chief Adrian Perica in February 2014 included references to a meeting between Tesla CEO Elon Musk and Apple CEO Tim Cook in Cupertino in 2013, at around the same time as a German analyst wrote an open letter to Cook suggesting an Apple purchase of Tesla. That report cited multiple sources about the supposed meeting, but again with little proof it actually took place.\nIf Apple is still interested in acquiring a manufacturer to make its own vehicle, the televised segment suggests Tesla could be a good target for such a purchase once more, as the price has dropped down far enough to make it an attractive target. At the time of publication, Tesla is hovering at around $205 per share, far below the $240 supposedly bid six years ago by Apple.\nTesla's share price has taken a beating over the last six months, and is currently close to half the $376.79 recorded for the stock on December 13. The pain could continue for the Elon Musk-led company for a while longer, as the note proposed a worst case scenario of Tesla's stock dropping to just $10.\nIrwin's declaration about Apple continued with the claim \"Project Titan\" is still very much alive, including the continued development of advanced battery technology for use in future vehicles.\nSo far, Apple's public vehicular efforts have revolved around Lexus, with the manufacturer's cars used as a testbed for \"Project Titan's\" self driving systems. Volkswagen has also been linked to another effort dubbed PAIL, or Palo Alto to Infinite Loop, a project that uses modified T6 Transporter vans to shuttle employees between Apple offices.",
        "sentiment": -0.3372543699601117
    },
    "article_5": {
        "title": "Latest 2019 iPhone molds leak once again show square camera bump coming to all three new phones",
        "body": "As Apple readies its supply chain for the fall iPhone bonanza, we are getting leaks thick and fast. This latest image was uploaded to Twitter by Mark Gurman.\nIt reaffirms renders from OnLeaks that all three flagship iPhones this year will feature the new square camera bump design, including the iPhone XR that will only have two cameras.\nMolds are used by case manufacturers to test compatibility with upcoming cases, and are typically based on leaked schematics and dimensions coming out of the Apple/Foxconn factory. They may not show every crevice and indentation of a phone’s design, but width/height/thickness is usually accurate and they depict holes for things like speakers, cameras, buttons, and microphones, that accessory manufacturers need to ensure their cases do not cover important components.\nThe leaks for iPhone 11 have been somewhat controversial as the new camera bump is so large that it dominates the back of the device. In particular, the lenses inside the rounded-square are oddly arranged. They seem to follow a triangular layout, with the camera flash and microphone placed awkwardly above and below the spoke of the triangle. It’s a weird aesthetic for a module that is housed in a square.\nAt superficial glances, it seems cruder compared to the sleeker vertical dual-camera module used in iPhone X and iPhone XS. It is even more strange that the 2019 iPhone XR will seemingly also be getting a square notch even though it will only feature two cameras, not three.\nOnLeaks was first to share news of the square camera bump, posting accurate iPhone 11 renders as early as January.\nNow, Apple is widely expected to announce substantial camera upgrades that may justify the strange design. For example, the third camera coming to iPhone 11 and iPhone 11 Max is believed to be an ultra-wide lens made by Sony.\nThe explanation for the 2019 iPhone XR is less clear, although the consistent design does make up for a distinctive iPhone generational family. In a story last week, Bloomberg said the new camera will result in more detailed photos and Apple is purportedly working on a feature that will change the framing of a shot after a user has taken a picture, in cases where a person may have been accidentally chopped off.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2604353212647968
    },
    "article_6": {
        "title": "Apple hits $1 trillion market cap once again",
        "body": "Apple stock ($AAPL) has once again crossed the $1 trillion market cap level as its shares rose 6% in early trading following its Q2 earnings call.\nAAPL stock is currently priced at $212.68, with a market cap of approximately $1,003,000,000,000. The company stock closed at around $200 yesterday but rocketed upwards in the wake of Apple reporting its financial results for the financial quarter just gone.\nAlthough iPhone revenue declined 17% year over year, the sharp downturn in iPhone sales seen in the holiday quarter is steadily recovering with Tim Cook describing November and December as ‘the trough’. Combined, sales from all Apple’s hardware products was down 9% compared to the same period in 2018, but this shortfall is almost entirely due to the iPhone; it appears sales of iPads, Macs, and Watches are better than ever.\nMeanwhile, Apple’s Services division grew 16% and the iPad business saw its highest growth rates in six years. Apple is pushing the services narrative as its future growth trajectory, and everyone is watching to see how its new offerings like News+, Apple TV+, and Apple Arcade are received.\nFor the most recent quarter, wearables sales also continued to be strong. In fact, Apple’s ‘Wearables, Home and Accessories’ business segment now rivals the iPad in terms of revenue. Apple said that three-quarters of Apple Watch sales were to customers new to the product.\nOf course, the stock market is prone to volatility and stock prices change regularly. The trillion-dollar figure is a more symbolic gesture than anything else. Apple became the first publicly traded trillion-dollar company in August 2018. A fall in demand for iPhones in China promptly saw Apple’s valuation tumble in the last few months of the year. In 2019, Apple company value has gained 49% from the January lows.\nFor fiscal Q3, April to June, Apple expects revenues between $52.4-$54.5bn. This was higher than most analyst expectations and signals Apple’s confidence in the continued recovery of iPhone sales.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.08246035560181267
    },
    "article_7": {
        "title": "NYC subway riders will be able to swipe in with Apple Pay starting Friday",
        "body": "If you frequent the New York City subway’s 4, 5, 6 line, you’ve probably seen the new terminals at a variety of stations like Union Square and Grand Central. Located between turnstiles, they’ve all been sporting a curious “Test Phase/Coming Soon” screen. That finally changes this week.\nGoogle already announced its mobile pay solution would be arriving this week, and now its chief competitor is getting in on the action. Apple Pay is hitting select stations this Friday, May 31. When that kicks in, riders will be able to swipe their iPhone or Apple Watch to catch a ride.\nThe kiosks are actually active, at present, but using them requires a software update — iOS 12.3 and watchOS 5.2.1, respectively. Then a debit or credit card needs to be associated with Express Transit in Apple Wallet, using Face or Touch ID. Once installed, it should work on the iPhone 6s and SE or later, along with the Apple Watch Series 1, 2 and 3, using NFC to get you in.\nThe system works as you’d expect. Hold the phone or watch up to the display and it beeps you in with a big “Go” on the screen, and a “Done” registering on the device. As long as your credit card is up to date, you should be good to go. How quickly this all works when thousands of New Yorkers are all using the system is another question entirely, of course — there tends to be a kind of learning curve with these sorts of things. And no doubt there will be a bit of a logjam at the turnstiles before the novelty of the system wears off.\nOf course, that’s why this is still a kind of test period. At present, the system will be limited to the 4, 5, 6 line between Grand Central-42 Street in Manhattan and Atlantic Ave-Barclays Center in Brooklyn (16 stations in all), along with Staten Island buses. In the case of the 4, 5, 6, that’s almost certainly the most heavily trafficked stations on the most heavily trafficked subway line, so this will be an interesting sort of trial by fire.\nIt’s also worth noting that the system is currently limited to single-ride passes. That means those who buy daily, weekly or monthly passes (which applies to many New Yorkers, myself included) won’t be able to use the system in that capacity. More fare options are coming by late 2020, by which time the MTA expects to have rolled out Apple on all subway lines and buses, so riders will never have to worry about losing that Metro Card again.",
        "sentiment": -0.033922938718682245
    },
    "article_8": {
        "title": "iOS reportedly getting its very own swipe-to-type keyboard",
        "body": "Apple may be bringing an Android favorite to iOS at its software developers conference next month. Bloomberg’s Mark Gurman has published a big list of little software tweaks his sources say are coming to iOS at WWDC.\nOne of the more interesting notes is that Apple is reportedly going to be releasing its own swipe-to-text keyboard on iOS, something that has long been natively supported in Android. Users would no longer have to tap away on their keyboards in order to text and would be able to use the first-party keyboard to type just by dragging their finger between letters to form words.\nUsers desperate for the functionality on iOS haven’t had to look far as it’s been supported by adding a third-party keyboard through the App Store and enabling it in settings. We’ll see if Apple has anything new to bring to the keyboard’s mechanics.\nWWDC begins June 3.",
        "sentiment": 0.5550694321947438
    },
    "article_9": {
        "title": "Apple Expected to Remove 3D Touch From All 2019 iPhones in Favor of Haptic Touch",
        "body": "Four years after 3D Touch debuted on the iPhone 6s, the pressure-sensitive feature appears to be on the chopping block.\nLast week, in a research note shared with MacRumors, a team of Barclays analysts \"confirmed\" that 3D Touch \"will be eliminated\" in all 2019 iPhones, as they predicted back in August 2018. The analysts gathered this information from Apple suppliers following a trip to Asia earlier this month.\nThis isn't the first time we've heard this rumor. The Wall Street Journal said the same thing back in January.\nApple already replaced ‌3D Touch‌ with Haptic Touch on the iPhone XR in order to achieve a nearly edge-to-edge LCD on the device, and it is likely the feature will be expanded to all 2019 iPhones. Haptic Touch is simply a marketing name for a long press combined with haptic feedback from the Taptic Engine.\nIt's unclear why Apple would remove ‌3D Touch‌ from the next-generation ‌iPhone‌ XS and ‌iPhone‌ XS Max, since Apple has already proven that it can integrate the feature into edge-to-edge OLED displays without issue.\n‌Haptic Touch‌ on the ‌iPhone‌ XR works in fewer places than ‌3D Touch‌, including the flashlight and camera shortcuts on the lock screen, in Control Center to view hidden toggles, and to expand notifications. ‌Haptic Touch‌ does not support Quick Actions app menus or Peek and Pop for previewing content.\n‌3D Touch‌ features: Quick Actions on left, Peek and Pop on right\nPerhaps we'll see some hints that ‌3D Touch‌ is going away entirely in iOS 13, which Apple is expected to unveil at its WWDC 2019 keynote next Monday. That should be followed by new iPhones in September as usual.",
        "sentiment": -0.3963123392313719
    },
    "article_10": {
        "title": "Huawei CEO says China shouldn't punish Apple",
        "body": "Hong Kong CNN Business —\nRen Zhengfei, the CEO and founder of embattled Chinese tech company Huawei, is defending US rival Apple.\nAsked in an interview with Bloomberg about calls in China to boycott Apple (AAPL), Ren said he would be opposed to any such retaliatory action from Beijing even as tensions with the United States escalate.\n“That will not happen first of all, and second of all if that happens, I’ll be the first to protest,” Ren told Bloomberg.\n“Apple is the world’s leading company. If there was no Apple, there would be no mobile internet,” Ren said. “Apple is my teacher, it’s advancing in front of us, as a student why should I oppose my teacher?” he added.\nThe comments come as Ren’s company is in crisis mode.\nThe US Department of Commerce placed Huawei on a trade blacklist earlier this month, effectively barring it from conducting business with American companies.\nThe ban forced suppliers like Google (GOOGL) and ARM Holdings to cut off ties with the Chinese company. Top carriers in the UK and Japan are also delaying the launch of Huawei smartphones.\nThe US restrictions threaten Huawei’s position as the world’s largest telecommunications equipment maker and No. 2 smartphone brand.\nWashington’s ban on the Chinese company “could stir up the smartphone industry by pausing Huawei’s positive momentum,” analysts at Fitch Ratings wrote in a note on Sunday. The ban could also benefit industry leader Samsung as consumers around the world look for alternatives to Huawei smartphones, they added.\nHuawei and Apple have had vastly different fortunes in Huawei’s home market of China.\nHuawei shipped nearly 30 million phones in China in the quarter ended March, up 41% compared to the same period last year, according to research firm Canalys.\nMeanwhile, Apple saw its iPhone sales in China drop 30% in the same period. The country remains a key market for Apple. Greater China, which includes Taiwan and Hong Kong, accounted for nearly 18% of net sales in the quarter ended March.\nDuring an earnings call last month, Apple CEO Tim Cook said iPhone sales in China should be boosted by “improved trade dialogue” between Beijing and Washington and “very positive customer response to the pricing actions we’ve taken in that market.”\nBut since then, trade talks between Washington and Beijing broke down, and both sides ratcheted up tensions by slapping more penalties on billions of dollars worth of American and Chinese products.\nThe renewed trade dispute could hurt Apple, according to Fitch Ratings analysts.\n“Apple could be another victim of the US-China trade war and its market-share loss may accelerate in the Chinese market,” they said.\nUS President Donald Trump last week called Huawei “very dangerous,” but then said he could see the company being included in a broader trade deal with China.\nRen told Bloomberg that using his company as a bargaining chip is “a big joke.”’\n“How are we related to China-US trade?” he said.",
        "sentiment": -0.3714314422437123
    },
    "article_11": {
        "title": "Apple Watch Series 4's redesigned OLED screen crowned 'Display of the Year'",
        "body": "The Apple Watch Series 4 has today been crowned one of the “Displays of the Year” by The Society for Information Display. The award is given to “display products with the most significant technological advances and/or outstanding features.”\nThis year makes the 25th annual Display Industry Awards. The winners were announced at Display Week in San Jose, California. Dr. Wei Chan, chairperson of the Display Industry Awards committee, touted that the annual event serves as an opportunity to showcase innovative display advancements.\nDr. Chan said that this year’s winners “reflect the breadth and depth” of technology innovation:\n“The annual Display Industry Awards luncheon is always a much-anticipated highlight of Display Week because it allows us to showcase the high-quality, innovative work that is taking place in the display industry at every level – from components to end products,” said Dr. Wei Chen, Chair of the Display Industry Awards Committee for SID.\nThe Society for Information Display, or SID, praises the Apple Watch Series 4’s OLED display, which is 30 percent larger than its predecessor. The Apple Watch also uses a new LTPO technology to improve power efficiency. The SID explains:\nThe challenge for designers was to make the display bigger without noticeably increasing the size of the case or compromising the battery life. Narrower borders enable a viewing area that’s more than 30 percent larger, while a new display technology called LTPO improves power efficiency, helping users get through the day on a single charge.\nOther winners this year include Samsung’s modular microLED display, as well Sony’s crystal LED display system. Read the full press release below:\nSociety of Information Display Reveals 2019 Display Industry Award Winners\nSAN JOSE, Calif., May 8, 2019 /PRNewswire/ — The Society for Information Display (SID) today announced the winners of its 25th annual Display Industry Awards. The 2019 Display Industry Award recipients reflect the ever-evolving display product landscape, with products designed to support wearables, immersion, vehicles, augmented reality, personal productivity, and more. The honorees will be recognized during the awards luncheon on Wednesday, May 15, as part of Display Week, to be held this year at the San Jose Convention McEnery Center, May 12-17.\n“The annual Display Industry Awards luncheon is always a much-anticipated highlight of Display Week because it allows us to showcase the high-quality, innovative work that is taking place in the display industry at every level – from components to end products,” said Dr. Wei Chen, Chair of the Display Industry Awards Committee for SID. “This year’s winners reflect the breadth and depth of recent product development and technology innovation necessary to support the relentless pace of consumer and industrial electronics evolution.”\nAt the Display Industry Awards Luncheon, Saran Diakité Kaba, vice president R&D and global Design PSA Groupe, will speak on creating a seamless user experience for connected and autonomous vehicles. To be considered for a 2019 Display Industry Award, a product had to be available for purchase during the 2018 calendar year. The seven winners, divided into three categories, were chosen by a distinguished panel of experts who evaluated the nominees for their degree of technical innovation and commercial significance, in addition to their potential for positive social impact.\nThe winning products and a brief description of each are listed below.\nDisplays of the Year:\nGranted to display products with the most significant technological advances and/or outstanding features. The winners include:\nApple’s LTPO OLED Display for Apple Watch Series 4\nWhile retaining the original signature design, the fourth-generation Apple Watch has been refined, combining new hardware and software enhancements into a singular, unified form. The striking display, which is more than 30 percent larger at 40 mm or 44 mm, depending on the model, seamlessly integrates into the thinner, smaller case, while the new interface provides more information with richer detail. The display is the defining feature of Apple Watch, and Series 4 pushes that feature farther than ever. The challenge for designers was to make the display bigger without noticeably increasing the size of the case or compromising the battery life. Narrower borders enable a viewing area that’s more than 30 percent larger, while a new display technology called LTPO improves power efficiency, helping users get through the day on a single charge.\nSamsung Electronics’ Modular MicroLED Display (The Wall)\nThe Wall is a display based on microLED technology. It is made up of millions of individual pixels of self-emitting inorganic red, green, and blue microscopic LED chips to produce brilliant colors and deep blacks onscreen for striking picture quality. The display is immune to burn-in and has a lifespan of 100,000 hours. Along with its microLED-based technology, Samsung’s Quantum Processor Modular and AI-Upscaling help The Wall achieve pristine picture quality up to 8Kresolution, as well as pure colors, stunning high-dynamic range (HDR) 10+, and a peak luminance of up to 2,000 nits. MicroLED technology is a desirable alternative to other display technologies because, while it is made up of self-emitting pixels that turn on and off individually, its inorganic materials won’t degrade or cause screen burn-in over time. Additionally, Samsung’s unique Black Seal technology that is applied to each microLED creates a seamless, uniform canvas with deeper blacks than ever before. The Wall is a large-format modular display ideal for both luxury living and business.\nSony Corp.’s Crystal LED Display System\nThe Crystal LED Display System from Sony consists of a display controller and modular display units made from ultrafine microLEDs. This technology creates spectacular, large-scale video walls with lifelike realism. Crystal LED brings imagery to life with awe-inspiring visuals in any environment, with applications ranging from industrial product design and manufacturing to theme parks and museums, corporate meeting rooms and lobbies, retail showrooms, lecture theaters, and broadcast studios. In addition to high contrast, this display supports high-dynamic range (HDR), with 10-bit color depth and enormous color gamut. Sony has also developed active-matrix pixel-drive circuitry with micro ICs, which achieves an ultra-fast video response time with a 120-Hz refresh rate –ideal for sports, concerts, or training simulations requiring large-screen visuals with no delay or blur. The bezel-free design of the display unit ensures no visible seam between multiple display units and makes it possible to create impressive large-scale displays of virtually any dimension and aspect ratio.\nDisplay Components of the Year\nThis award is granted for novel components that have significantly enhanced the performance of a display. A component is sold as a separate part destined to be incorporated into a display. A component may also include display-enhancing materials and/or parts fabricated with new processes. The winners include:\nDexerials Corp.’s AR Films for Piano Black Design\nThe new Dexerials AR film, AR100-T0810, is glossy in appearance while maintaining a reflectivity of around 0.3 percent. The film’s structure has an anti-smudge top coating, dry-sputtered layers of high and low refractive-index coatings, and clear hard coat on triacetylcellulose (TAC) substrate. Dexerials manufactures the film in a roll-to-roll process under cleanroom conditions to achieve high quality. The development of the product was motivated by several OEM requests in the North American region. Another development target was curved cover-lens compatibility. While curved cover lenses make their way into automotive displays, the materials for displays still need to meet automotive requirements. This product represents a significant step in a display field in which consumers prefer piano-black vehicle interiors. Dexerials’ AR films help flat-panel and curved displays maintain a glossy appearance, achieve a dead-front aesthetic at various viewing angles, and ensure reflections don’t disturb the driver.\nSCHOTT’s RealView High-Refractive Index Glass Wafers\nSCHOTT RealView is a class of high-index glass wafers designed to propel the development of augmented-reality (AR) and mixed-reality (MR) smartglasses with superior image quality, enabling field-of-view closer to that of human peripheral vision. SCHOTT RealView high-index glass wafers capitalize on a total internal reflection (TIR) angle. The portfolio of refractive indices for RealView drives the field-of-view by up to 2x compared to conventional glass. SCHOTT leveraged more than 130 years’ experience in glass making to develop these extremely thin, lightweight wafers to ensure users of smartglasses find them comfortable. At the same time, SCHOTT RealView features an extremely low variation in total thickness, a property that produces extremely sharp, high-contrast imaging. In this important property, SCHOTT achieved up to a factor of 10 tighter specifications compared to normal glass wafers used for semiconductor and optoelectronic applications. Researchers at SCHOTT have leveraged their expertise in glass science, melting, and hot forming, as well as surface processing of optical materials, to create a product that features superior optical properties but can also be produced efficiently in mass-market quantities. SCHOTT has invested in a global manufacturing set-up for mass-producing the very thinnest RealView wafers.\nDisplay Applications of the Year\nThis award is granted for novel and outstanding applications of a display, where the display itself is not necessarily a new device. The winners include:\nJapan Display Inc.’s Curved LCDs for Automotive Dashboards\nIn 2016, JDI began design of 15.0-in. and 12.3-in. TFT LCDs for automotive cockpit use in collaboration with Volkswagen, Germany, culminating in the Tuareg SUV market introduction in May 2018. Both displays represent the world’s first curved TFT LCDs in production for automotive dashboards. The curved, 3D-shaped displays, used in combination, enable a stylish and aesthetically pleasing interior dashboard, allowing automotive OEMs more flexibility in design and styling. The 15.0-in. LTPS-TFT LCD has a concave R3,000-mm-radius curved design, with 1,920 x 1,020 resolution, LED backlight with 900 cd/m2 (min) luminance, and in-cell touch functionality. The 12.3-in. LTPS-TFT LCD has a concave R1,500-mm-radius curved design, with 1,920 x 720 resolution and an LED backlight with 780 cd/m2 (min) luminance. Furthermore, the 15.0-in. TFT LCD is the world’s first curved display in mass production with in-cell touch functionality.\nLenovo’s Yoga Book C930 with Dual Display\nThe Yoga Book C930 is the world’s first dual display laptop with E Ink — combining a QHD LCD with a multi-functional E Ink display that transforms with just one click. Type on the keyboard to send an email; sketch out your next project with a digital pen; or sit back with an e-book—all on one screen, with an extra screen to spare. First among the E Ink display’s multiple functions is the 10.8-in. on-screen touch keyboard. Featuring haptic feedback and an easily customizable layout, it offers a 22 percent increase in typing productivity from the previous-generation Yoga Book. And it’s powered by AI, which means the more it is used, the more accurate it becomes. The E Ink display easily transforms into a notepad—users can sketch, write, develop formulas, and more with the optional Lenovo Precision Pen, featuring 4,096 levels of sensitivity. When the project is done, it can be digitized with a few clicks and added to the main display. E Ink Note works seamlessly with Windows 10.\nA more comprehensive description of the award winners is included in the Display Week 2019 Show Issue of Information Display magazine or at www.informationdisplay.org.\nHigh Resolution Images are available upon request.\nAbout Display Week 2019:\nThe 56th Display Week, presented by the Society for Information Display (SID), will take place May 12-17 at the San Jose McEnery Convention Center in San Jose, Calif. Display Week is the world’s leading event focused on emerging electronic display and visual information technologies – their advancement, integration into products, and commercialization. Display Week attracts attendees from the entire ecosystem of R&D, engineering, design, manufacturing, supply chain, marketing, sales and financial, as well as commercial and consumer end-user markets. It delivers unparalleled learning opportunities, market-moving trends, sourcing, roadmaps-to-market, and connections for career and business growth. For more information on exhibiting and event sponsorship: Americas & Europe, contact Jim Buckley by email at jbuckley@pcm411.com, or call (203) 502-8283; Asia, contact Sue Chung by email at schung@sid.org, or call (408) 389-9596.\nAbout SID:\nThe Society for Information Display (SID) is the only professional organization focused on the electronic display and visual information technology industries. In fact, by exclusively focusing on the advancement of electronic display and visual information technologies, SID provides a unique platform for industry collaboration, communication and training in all related technologies while showcasing the industry’s best new products. The organization’s members are professionals in the technical and business disciplines that relate to display research, design, manufacturing, applications, marketing and sales. To promote industry and academic technology development, while also educating consumers on the importance of displays, SID hosts more than 10 conferences a year, including Display Week, which brings industry and academia all under one roof to showcase technology that will shape the future. SID’s global headquarters are located at 1475 S. Bascom Ave., Ste. 114, Campbell, CA 95008. For more information, visit www.sid.org.",
        "sentiment": 0.7475279364734888
    },
    "article_12": {
        "title": "AAPL drops 6% as Trump’s tariffs bite: Apple accessories at 25%, overall costs could rise 10%",
        "body": "AAPL fell almost 6% in yesterday’s trading in response to concerns about the impact of Trump’s tariffs on products imported from China.\nWhile it had initially appeared that Apple had escaped the current round of tariffs, some accessories are now taxed at 25%, and Apple’s component costs have also risen …\nAAPL shares fell 5.81% yesterday, greater than the 2.38% fall seen in the Dow Jones index, with yesterday’s antitrust ruling by the Supreme Court another factor.\nThe Verge reports that while most Apple products are not yet affected, some Apple accessories were already in the 10% band introduced in September of last year. Those products are now taxed at 25%.\nThe codes involved in Apple’s “adapters, chargers, cables and cords” stayed on the list, and, starting last September, they have been taxed at a 10 percent rate when they entered the US from China. The same is true for iPhone cases and the iPad’s leather covers, both of which are also subject to the tariff, per Apple’s letter. On Friday, that jumped to 25 percent. (Apple declined to comment when reached by The Verge.) So far, that cost has been born entirely by Apple and its suppliers. The prices listed on Apple’s website haven’t budged since the tariffs went into effect. At $70 for a charger (which would cost you as little as $11 under other circumstances), it’s possible Apple’s margins are wide enough that they’re able to simply eat the extra cost. It’s also possible that Apple’s Chinese manufacturing partners were willing to offer a slight discount in light of the tariffs. It could even be that, since September, Apple has been able to shift its supply chain around enough to dodge the impact of the tariff completely. But given Apple’s massive scale and intense quality demands, such a move might have been more expensive than just paying the tariff.\nBut the indirect impact of Trump’s tariffs goes further, as analysts Wedbush note.\nBased on our analysis the way the tariff situation stands today on some lithium batteries and other input materials the cost of making iPhones currently will go up by roughly 2%-3%.\nAnd the bigger fear – and the likely reason for the bulk of the share slide – is Trump’s threat to extend the 25% tariff across the board, which would then hit all Apple products.\nFears [are] running rampant on the Street that these latest tariffs could significantly increase the cost of iPhones globally [with Apple] seeing pressure on both ends of the spectrum from a supply and demand perspective […] If the Trump administration decides to levy a tariff on the additional $325 billion of Chinese goods over the coming weeks/months this would be more of a potential game changer from the perspective of the incremental costs to Apple and its iPhone production with expenses that could escalate by roughly 10%+.\nEven if Trump doesn’t go that far, Apple highlighted last year some other vulnerable categories that could be caught in even a small extension to the existing categories. These include the Apple Watch, AirPods and HomePod. Apple’s most recent earnings report show that these products plus accessories are now worth as much to the company as iPad sales.\nFTC: We use income earning auto affiliate links. More.\nPhoto: Shutterstock\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2682831231504679
    },
    "article_13": {
        "title": "China could hurt Apple profits by 29% if it avenged the Huawei ban, says analyst",
        "body": "Napier Lopez is a writer based in New York City. He's interested in all things tech, science, and photography related, and likes to yo-yo in (show all) Napier Lopez is a writer based in New York City. He's interested in all things tech, science, and photography related, and likes to yo-yo in his free time. Follow him on Twitter .\nTrump’s Huawei ban was bad news for China, as it effectively crippled the world’s second-largest smartphone maker from its largest source of income. But China is also very much in a position to retaliate, and Apple – the world’s third-largest smartphone maker – could be among the ones to suffer.\nGoldman Sachs analysts estimated in a note to investors that Apple could lose 29 percent of its profits if China decided to ban Apple sales in the country to retaliate against the Huawei ban in the US. 17 percent of Apple’s sales come from China, so such a move would undoubtedly be debilitating. Mind you, this is a theoretical scenario and China has no to ban Apple beyond politicking as far as we’re aware – though you could say the same about the Huawei ban.\nOn the other hand, the 29 percent figure is only an estimate of Apple’s losses should device sales in be halted. Apple products are also, you know, built in China.\nIf the country decided to inhibit the phone’s production, Apple would face much more difficult immediate consequences. Such a move would likely be ill-advised in the long term as “it could have negative implications for the China tech ecosystem as well as for local employment,” note the Goldman analysts, but it’s a scary possibility for Cupertino – not to mention the myriad of other American companies building their products in China. For its part, Apple has considered moving manufacturing outside of the country due to rising tariffs, but that’s a lot easier said than done.\nAs consumers, the best we can hope for is that the US and China make up soon. Otherwise, this trade war could have a major adverse effect on the tech landscape.",
        "sentiment": -0.17679144581779838
    },
    "article_14": {
        "title": "iTunes Expected to Be Retired After Over 18 Years",
        "body": "While it was initially reported that iTunes would live on in macOS 10.15, it now looks like the app will be retired, over 18 years after it was introduced by the late Steve Jobs at Macworld on January 9, 2001.\nApple will be replacing iTunes with standalone Music, TV, and Podcasts apps in the next major version of macOS, expected to be unveiled at WWDC 2019 next week, according to Bloomberg's Mark Gurman:\nEnd of iTunes iTunes has been the way Apple users listen to music, watch movies and TV shows, hear podcasts, and manage their devices for almost two decades. This year, Apple is finally ready to move into a new era. The company is launching a trio of new apps for the Mac – Music, TV, and Podcasts – to replace iTunes. That matches Apple's media app strategy on iPhones and iPads. Without iTunes, customers can manage their Apple gadgets through the Music app.\nThis information lines up with a recent report from 9to5Mac's Guilherme Rambo, who claimed that iTunes will be renamed to \"Music\" on the Mac. In other words, iTunes is going away and will be replaced by the new Music app, which is expected to become the new utility for syncing and managing Apple devices.\nSteve Jobs quote from Apple's press release about iTunes in 2001:\nApple has done what Apple does best — make complex applications easy, and make them even more powerful in the process. iTunes is miles ahead of every other jukebox application, and we hope its dramatically simpler user interface will bring even more people into the digital music revolution.\nHere's what iTunes looked like in 2001:\niTunes has attracted its fair share of criticism over the years for being bloated software, so its split into dedicated Music, TV, and Podcasts apps will be much welcomed. Earlier this week, leaked screenshots provided us with our first glimpse at what the Music and TV apps should look like on macOS 10.15.\nApple is widely expected to announce iOS 13, macOS 10.15, watchOS 6, and tvOS 13 at its WWDC 2019 opening keynote on Monday at 10 a.m. Pacific Time. MacRumors will have live coverage of the event on our website and through MacRumorsLive on Twitter, so be sure to follow along for the latest updates.",
        "sentiment": 0.20216175155448063
    },
    "article_15": {
        "title": "Apple Watch Series 4 discounted to $349 for 40mm and $379 for 44mm at Amazon and Best Buy",
        "body": "The Apple Watch Series 4 is currently $349 from Amazon and Best Buy. This is $50 less than the usual cost of the wearable, which has a 40mm watchface and GPS capability. If you want the larger 44mm model, it is $379, which is also $50 off of its regular price.\nBoth retailers offer this smartwatch in several stylings, including space gray, silver, or gold aluminum. Each model comes paired with a specific color of sport band, but you’ll be able to decide between a rubberized option and Apple’s loop band that has a woven look and feel.\nThe Apple Watch Series 3 is regularly available for around $199, but the Series 4 has a few improvements and new features that might make it a better option for you. It’s faster at managing everyday tasks, like texting, calling, and queueing up a workout. The display on the 40mm Series 4 is bigger, and it has a more edge-to-edge look by comparison.",
        "sentiment": 0.1861710036173463
    },
    "article_16": {
        "title": "Snapchat Employees Abused Data Access to Spy on Users",
        "body": "Although Snap has introduced strict access controls to user data and takes abuse and user privacy very seriously according to several sources, the news highlights something that many users may forget: behind the products we use everyday there are people with access to highly sensitive customer data, who need it to perform essential work on the service. But, without proper protections in place, those same people may abuse it to spy on users' private information or profiles.\nOne of the internal tools that can access user data is called SnapLion, according to multiple sources and the emails. The tool was originally used to gather information on users in response to valid law enforcement requests, such as a court order or subpoena, two former employees said. Both of the sources said SnapLion is a play on words with the common acronym for law enforcement officer LEO, with one of them adding it is a reference to the cartoon character Leo the Lion. Snap's \"Spam and Abuse\" team has access, according to one of the former employees, and a current employee suggested the tool is used to combat bullying or harassment on the platform by other users. An internal Snap email obtained by Motherboard says a department called \"Customer Ops\" has access to SnapLion. Security staff also have access, according to the current employee. The existence of this tool has not been previously reported.",
        "sentiment": -0.015649014049106173
    },
    "article_17": {
        "title": "Apple introduces first 8-core MacBook Pro, the fastest Mac notebook ever",
        "body": "Apple updated MacBook Pro with faster 8th- and 9th-generation Intel Core processors, bringing eight cores to MacBook Pro for the first time. MacBook Pro now delivers two times faster performance than a quad-core MacBook Pro and 40 percent more performance than a 6-core MacBook Pro, making it the fastest Mac notebook ever.1 These new processors, combined with powerful graphics, the brilliant and colorful Retina display, super-fast SSDs, the Apple T2 Security Chip, all-day battery life and macOS, make MacBook Pro the world’s best pro notebook.\n“Whether it’s college students mastering a course of study, developers building world-class apps or video editors creating feature films, we’re constantly amazed at what our customers do with their MacBook Pro,” said Tom Boger, Apple’s senior director of Mac Product Marketing. “Now with 8-core processors for an incredible performance boost, along with its stunning Retina display, fast storage, all-day battery life and running macOS, MacBook Pro continues to be the world’s best pro notebook and we can’t wait to get it into our customers’ hands to see what they do next.”",
        "sentiment": 0.7467714574187994
    },
    "article_18": {
        "title": "Minecraft Earth for iOS goes a step beyond Pokémon Go",
        "body": "Alex Kipman, Microsoft’s HoloLens and Kinect creator, is always enthusiastic about the future of computing. As he stands in front of me inside a Minecraft-themed conference room on Microsoft’s campus in Redmond, Washington, I’m immediately drawn to the stacks of Lego blocks on the table beside him. Lego is the perfect analogy for Minecraft. For a decade, it’s been a game that millions use to build their own creations out of virtual blocks of materials. Minecraft employees use Lego blocks to build miniature buildings during meetings, but over the past 12 months, they’ve been adventuring outside to secretly test a new way to play Minecraft.\nIn the same building where Microsoft is creating the next Halo game, a team of engineers and game designers have been dreaming up the future of Minecraft on mobile phones with the help of the HoloLens team. Minecraft Earth is a new free-to-play game for iOS and Android that’s surprisingly ambitious for Microsoft. We’ve already seen holograms through Microsoft’s HoloLens headset, but the company now wants to bring this technology to a much broader scale with the help of Minecraft Earth.\nPokémon Go saw 20 million people searching for pokémon in streets worldwide back in 2016, thanks to augmented reality. Minecraft has 91 million active players, and now Microsoft wants to take the Pokémon Go concept a big step further by letting Minecraft players create and share whatever they’ve made in the game with friends in the real world, away from TV screens and monitors.\n”Minecraft Earth proposes to completely break the dogma that has lived with us in computing since the beginning: this idea of a single person that holds a single device to create a single experience,” says Kipman. “With Minecraft Earth, that’s no longer the case. The content is in the real world.”\nImagine sitting at home and building something in Minecraft on your phone and then dropping it into your local park for all of your friends to see it together at the same exact location. Minecraft Earth aims to transform AR gaming from single-person experiences into a living, breathing virtual world that’s shared by everyone. If Microsoft succeeds, you’ll be able to walk into a mall and point your phone’s camera at a McDonald’s Minecraft adventure while you’re eating a Big Mac or see your own giant structures next to actual buildings.\nMicrosoft is being hugely ambitious with ‘Minecraft Earth’\nThis hugely ambitious project starts with some basics in the form of Minecraft Earth. The game will be available in beta on iOS and Android this summer, and I got to try various forms of it at Microsoft’s campus a couple of weeks ago. It’s fair to say the game I played was basic, occasionally buggy, but very impressive. While the regular version of Minecraft lets players play in modes like creative (with unlimited blocks and items) or survival (if you die you lose your items), Microsoft is blending these traditional modes into a new way to play Minecraft.\n“This is an adaptation, this is not a direct translation of Minecraft,” explains Torfi Olafsson, game director of Minecraft Earth. While it’s an adaptation, it’s built on the existing Bedrock engine so it will be very familiar to existing Minecraft players. “If you like building Redstone machines, or you’re used to how the water flows, or how sand falls down, it all works,” says Olafsson. All of the mobs of animals and creatures in Minecraft are available, too, including a new pig that really loves mud. “We have tried to stay very true to the kind of core design pillars of Minecraft, and we’ve worked with the design team in Stockholm to make sure that the spirit of the game is carried through,” says Olafsson.\nJust like Pokémon Go, you’ll need to venture out into the real world to collect things. Instead of pokéstops, Minecraft Earth has “tapables” that are randomly placed in the world around you. There are always two nearby, and you can walk to get more. These are designed to give you small rewards that allow you to build things, and you’ll want to collect as many of these as possible to get resources and items to build vast structures in the building mode.\n“We have covered the entire planet in Minecraft,” explains Olafsson. “Every lake is a place you can fish, every park is a place you can chop down trees. We’ve actually taken maps of the entire world and converted them to Minecraft.”\nThese maps, based on OpenStreetMap, have allowed Microsoft to start working out where to place Minecraft adventures into the world. These adventures spawn dynamically on the Minecraft Earth map and are designed for multiple people to get involved in. This is really where Minecraft Earth starts to get interesting and beyond anything I’ve played in other AR games like Pokémon Go. I tried a variety of adventures during my brief Minecraft Earth gameplay demo, and they range from peaceful and friendly to a little more risky, knowing you enter them and might lose all your treasure if you die to a monster.\nThe fascinating part of adventures is that you can be side-by-side with friends, all experiencing the same game on the exact same spot of a sidewalk or in a park at the same time. Microsoft is doing some impressive behind-the-scenes computational magic (more on that later) so that when you play an adventure, it’s in a precise location, beyond regular GPS coordinates, so that everyone is experiencing the same thing. You can fight monsters, break down structures for resources together, and even stand in front of a friend to block them from physically killing a virtual sheep.\nAll of the blocks that are collected during an adventure are shared with fellow players, so there are no player-versus-player battles here to kill each other and steal materials. You’ll even see the tools that fellow players have in their hands on your phone’s screen, alongside their username. The idea is that you essentially become your phone in Minecraft Earth, and your camera is a lens into this virtual world.\n‘Minecraft Earth’ lets you play with friends at the same spot at the same time\nOnce you’ve gathered lots of resources, you can then start building. Every player will have a library of build plates, with some that are as big as 200 x 200 feet. You can use build plates to sit a Minecraft build down on a table and build something with friends. Every piece of material that a friend uses on your own plate will then be part of your build, so it’s a collaborative effort to create giant structures; playing solo will mean a lot of searching around for materials.\nI sat for around 10 minutes creating a Minecraft build where I could see blocks flying onto the stcture from someone next to me. They could also see everything I was doing in real time, and we could build together block by block. I could, if I wanted to, also steal my friend’s blocks here to create my own mega building. That introduces an interesting social dynamic because, unlike most games, you’ll be physically next to the person you’re stealing from in the virtual world. “In order to steal, you would have to look up and go, ‘Hmm, I’m going to take your blocks,’” says Saxs Persson, creative director of Minecraft. “Shenanigans will come from when people have different opinions about what needs to happen, or they band together and do something meaningful.”\nOnce you’ve completed a build, you can then share a link to it for friends or followers to then play with your creation on a table or in giant scale in an open space. You’ll only be able to share a temporary copy of your build to friends, though. They can burn it down and massacre your animals, but it won’t get saved. Because every block, every animal, and every item came from somewhere, it’s a chance for Minecraft Earth players to show off how many hours they’ve put into the game. “This allows people to build something pretty and share it with their friends,” explains Olafsson. “It allows you to be inspired by other people’s craftsmanship.”\nThere’s also progression in Minecraft Earth with levels and experience points that are similar to a traditional role-playing game, rather than the classic Minecraft experience. Your character never gets reset, and you always have your same materials in a world that everyone participates in. “We think it’s important to kind of reward and recognize your progression,” says Olafsson. “We have levels that unlock content, and as you go up in levels, you’ll get access to more and more content and more build plates.” You’ll also start to earn Rubies, the in-game currency for Minecraft Earth that will let you buy things like build plates, potions, and more content.\nOne of the key parts of Minecraft Earth is having multiple people interact with adventures in a specific location in real time. This is actually a very difficult problem to solve with augmented reality, and it’s thanks to recent progressions in mobile technology that have allowed Microsoft to even try to tackle this. Eventually, Microsoft wants these to persist as “holograms” in the environment around us with exact precision. The problem is our phone cameras aren’t very intelligent. You can use GPS, Wi-Fi fingerprinting, and AR to determine a location, but you need computer vision algorithms to really work out where to place a virtual object that everyone is going to interact with.\nMicrosoft is using its new Azure Spatial Anchors technology in Minecraft Earth. It uses machine vision algorithms so that real-world objects can be used as anchors for digital content. These holograms, as Microsoft calls them, always stay in the same spot. Apple and Google are also working on ways to let multiple devices see and interact with the same virtual object in AR, but Microsoft is trying to create the infrastcture and tools to let developers use this across iOS and Android. This is the secret sauce of Minecraft Earth, if you will.\n“We rely on people going out and, essentially, not scanning the world, but seeing the world for us and then making that common play space,” explains Persson. This means that Minecraft Earth players are going to help inform where adventures should be placed. They’ll also contribute to making Microsoft’s Azure Spatial Anchors technology more powerful, simply by pointing their cameras at the environment around them. There are obviously privacy implications here, and Microsoft says all data and images will be anonymized so that the algorithms are only detecting feature points around you. Without this machine vision, Microsoft wouldn’t be able to be so ambitious with Minecraft Earth.\nMicrosoft used its HoloLens tech to bring ‘Minecraft Earth’ to life\n“To do this, we had to take some of the HoloLens algorithms for capturing images on device and turn them into a point cloud that we can share,” says Jason Cahill, an engineering architect for Minecraft. This allows Microsoft to locate every player in the game and precisely know where they are standing and where to place an adventure for everyone to interact with. Adventures will start off conservatively, and players will walk up to the rough area that Microsoft has designated a place to play. These will mainly be placed nearby where people are often collecting the tapables, and it will be up to the first few players in that area to decide exactly where an adventure gets placed. Once it’s been placed enough times in a safe area, it will persist for new players to simply walk up and start interacting with the adventure.\nMicrosoft is also being very careful about where these adventures are placed. Pokémon Go developer Niantic had to settle a lawsuit recently with angry homeowners who had pokéstops placed near their houses, and there are many challenges regarding blending augmented reality with private spaces. “This being Microsoft, we have an army of people that figure these things out for what’s a good place to play,” explains Persson. “And how do we help people that say, ‘No, that’s not for me. I don’t want it at my house or by my shop.’”\nPersistent holograms are obviously the end goal for Minecraft Earth, and it’s easy to imagine a future where players can drop these wherever they want once they’ve been approved. This user-generated content always comes with a mountain of risks, though. Whether that’s people building virtual penises or houses with swastikas, there’s always going to be people who would love to in the fun.\n“There are lots of very real challenges around user-generated content,” says Persson. “It’s a complicated problem at the scale we’re talking about, but that doesn’t mean we shouldn’t tackle it.” Microsoft is starting carefully at first without user-generated content being freely placed into the world, and then it plans to figure out how to get this content into Minecraft Earth in the future. “Our vision is that, over time, the collection, the building, the playing, the adventuring will lead to things that people demand they have a place to display,” says Persson. “I think we’ve definitely taken the right steps to get started on that journey. And then we’ll see how quickly we can find the right way for more people to see what you’re doing.”\nThere are clearly a lot of challenges to overcome for Minecraft Earth to work flawlessly, and Microsoft is certainly being ambitious here. From the demos I played, there’s a lot of potential for this to be a te killer AR app. It’s unlike anything I’ve experienced in AR before, but at times, the demos did feel a little chaotic with multiple people involved in adventures and building structures. I think the core game loops will work well with a few people side by side, but scaling that to have 20, 50, or even hundreds of people interacting with a holographic Minecraft adventure will be very challenging.\nThis game could help Azure and HoloLens in the future\nThat challenge will feed into Microsoft’s broader ambitions with HoloLens and augmented reality, in general. Microsoft sees devices like the HoloLens as the “third wave of computing,” but the company needs the scale of mobile to really understand the world and improve HoloLens and its own cloud offerings. I think Minecraft Earth is fundamental to helping improve Azure Spatial Anchors, HoloLens, and most of Microsoft’s cloud offerings. The learnings from this game could ultimately help improve the services, software, and even hardware that Microsoft offers to commercial customers.\n“I think the partnership will improve our overall product,” admits Neena Kamath, product lead for Azure Mixed Reality at Microsoft. “We discover so much… understanding how users interact with their world, and what the design points are. It’s a great partnership.” Microsoft has used the research and technology it built for HoloLens, and it’s now bringing it to iOS and Android devices with the help of ARKit from Apple and ARCore from Google. Now, the real-world data from these devices that everyone has in their pockets will feed back. “It’s a wonderful loop,” as Kamath puts it. Minecraft Earth won’t be launching on HoloLens anytime soon, though, despite Microsoft teasing it at E3 a few years ago.\nMicrosoft now plans to let Minecraft players access Minecraft Earth for a closed beta this summer. It’s not clear how many will be able to access the beta, or whether it will be restricted to the US initially. It’s early days for Minecraft Earth, and Microsoft doesn’t have all of the answers to many questions figured out just yet. Even monetization isn’t finalized. “We have a fortunate position that Minecraft in and of itself is doing fine from a financial point of view, which allows us to not have to focus too much on what happens with Minecraft Earth,” says Matt Booty, Xbox Game Studios head. “I have total confidence that the team will figure out what the right monetization is for the game.”\nI did spot a marketplace section in Minecraft Earth, but it wasn’t ready or populated, so monetization is very much a work in progress. Microsoft did hint that build plates could be sold, though, and it’s easy to imagine that you’ll be able to buy a bunch of Rubies to get more gear. Microsoft says it, understandably, won’t be using loot boxes, though.\nNo loot boxes for ‘Minecraft Earth’\nIt’s also reasonable to assume that we might even see Microsoft appear onstage at Apple’s Worldwide Developer Conference (WWDC) next month. While Microsoft is promising Android and iOS support, I only got to experience the game on Apple’s latest iPhone XS handsets during my brief hands-on time. Minecraft Earth is the best demonstration of augmented reality on an iPhone that I’ve ever seen, and Apple showcased Lego structures during last year’s demonstration of multiplayer mode for AR games.\nFor now, though, all we have is demos, and Microsoft wouldn’t let me take photos or video or any of the gameplay. The company is being unusually hesitant, most likely because early versions of the game are a little buggy. Aside from the summer beta, the company isn’t committing to a full launch date or plan for Minecraft Earth. I think that’s largely because the Minecraft team is still figuring out a lot of the tech and design decisions.",
        "sentiment": 0.2906346327290521
    },
    "article_19": {
        "title": "Apple Adds Eight-Year-Old iPad 2 Models to Vintage and Obsolete Products List",
        "body": "As expected, Apple has added all iPad 2 models to its vintage and obsolete products list.\nApple defines vintage products as those that have not been manufactured for more than five but less than seven years. Devices on the list are no longer be eligible for service at a Genius Bar or Apple Authorized Service Providers.\nThe only exceptions are in California and Turkey, where due to local laws, Apple will continue to service the ‌iPad‌ 2 until March 2021. From that date, the ‌iPad‌ 2 will finally go from \"vintage\" to \"obsolete\" worldwide.\nThe ‌iPad‌ 2 was originally launched in March 2011 and continued to be sold by Apple as a lower-cost option until March 2014. The big-bezeled ‌iPad‌ 2 featured a 9.7-inch display with 132 PPI, an A5 chip, and a 0.7-megapixel rear camera. It also had a 30-pin dock connector.\nAn internal memo obtained by MacRumors last month revealed Apple's plans to obsolete ‌iPad‌ 2 models by the end of April.",
        "sentiment": 0.13079654922087988
    },
    "article_20": {
        "title": "Justin Long says Steve Jobs rejected some \"I'm a Mac\" ads because they were too funny",
        "body": "Apple’s old “I’m a Mac”/”I’m a PC” ads starring Justin Long and John Hodgman went a long way toward establishing Apple’s extremely hip reputation, with Long portraying Macs as cool and laidback while Hodgman’s PC guy was a stuffy dork—just like how Mac users in real life are cool and PC users are lame even though they have access to better computer games. Appearing on People’s Couch Surfing (via Entertainment Weekly), Long shared some information about what it was like making those ads, and he revealed that there are hundreds of little passive-aggressive barbs between the Mac guy and the PC guy that we’ll never get to see.\nLong explained that he filmed “nearly 300\" Apple ads, but only 66 of them ever made it to air. After a while, he says he began to notice that “some of the funniest ones would never air.” Apparently, the reasoning behind this was that Steve Jobs “preferred when [the ads] weren’t super funny,” because then it would “detract from the point of the commercial.” The point of the commercials, apparently, was to sell Apple products and not just create entertaining comedy routines, which is a bit of a shame. If Apple really was as cool as it wanted everyone to believe, it wouldn’t care if people actually bought its products. There’s nothing less cool than caring about something.\nAnyway, here’s nearly 40 minutes of “Get A Mac” commercials.",
        "sentiment": 0.16664989747934872
    },
    "article_21": {
        "title": "Apple’s iPad Pro is up to $450 off including cellular models, today only",
        "body": "This offer has expired! Be sure to Be sure to follow us on Twitter for the latest deals and more. Sign-up for our newsletters and have our best offers delivered to your inbox daily.\nToday only, as part of its Deals of the Day, Best Buy is taking up to $450 off Apple’s previous generation 10.5-inch iPad Pro with cellular. The deals start at $480 with free shipping for all. This is the best price currently available and the lowest we’ve seen in 2019. Prefer the non-cellular version? Amazon has $249 off select models. Best Buy is also matching this offer. Apple’s 10.5-inch iPad Pro has a Retina display, Touch ID, an A10X Fusion Chip and compatibility with Apple Pencil. Add in cellular connectivity and you’ll be able to easily get work done, no matter where your travels take you.\nMeanwhile, Woot has the latest 11-inch iPad Pro 64GB with cellular for $739.99 Prime shipped. It sells for $949 in new condition. This is the best price we’ve tracked to date.\nWe mentioned compatibility with Apple Pencil right? Put your savings to work and grab Apple’s unique writing deice. You’ll be able to create all kinds of content on-the-go, sketching out designs, taking notes and more.\nApple 10.5-inch iPad Pro features:\n10. 5-Inch Retina Display with Promotion, true Tone, and wide Color\nA10X Fusion chip\nTouch ID Fingerprint Sensor\n12MP back camera, 7MP FaceTime HD Front camera\nFour speaker Audio\n802. 11AC Wi-Fi and LTE cellular data\nUp to 10 hours of battery life\nLightning Connector for charging and accessories\nIOS 12 with group FaceTime, shared augmented reality experiences, screen time, and more\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!",
        "sentiment": 0.2973765375092626
    },
    "article_22": {
        "title": "Tim Cook hopes Apple’s $30 million rehab of D.C.’s Carnegie Library will do more than sell iPhones",
        "body": "Comment on this story Comment Gift Article Share\nAs a company, Apple is less focused on selling stuff. It doesn’t sell as many iPhones as it once did and is more focused on selling subscriptions and services, none of which require a store for purchases or even consideration. Wp Get the full experience. Choose your plan ArrowRight This is why it is striking that, under chief executive Tim Cook, the company has made it a priority to open a flagship store next week in Washington. Why spend two years and probably more than $30 million renovating the 116-year-old Carnegie Library into an Apple Store?\n“Probably one of the least done things in an Apple Store is to buy something,” Cook said recently by phone. Instead, he said, people come to explore new products, of course, but also get training and services for iPhones or iPads they already own.\n“We should probably come up with a name other than ‘store,’ ” he said, “because it’s more of a place for the community to use in a much broader way.”\nAdvertisement\nHow true that is may determine the success of Apple’s new landmark in Washington, as well as its future as a retailer. The Carnegie Library store, opening Saturday May 11, will be one of 13 high-profile locations across the world that also utilize the company’s “town square” concept. Each local staff offers a bevy of classes for creative types to maximize their Apple products for shooting photographs, editing video or producing music.\nApple still sold a few iPhones last year (218 million), but sales fell 17 percent last quarter. Six weeks ago, Cook took the stage at the Steve Jobs Theater in the company’s Cupertino, Calif., headquarters and announced an array of new services — television, news, gaming, credit cards — that represent the company’s future.\nSo why invest so much time and money to turn the Carnegie Library, which is set in the middle of Mount Vernon Square, into a showcase for its wares?\nAdvertisement\nThe location, christened by President Theodore Roosevelt and Andrew Carnegie at a grand opening celebration in 1903, is one of the city’s most historically significant buildings. Carnegie donated the library’s $350,000 construction cost, which is a little more than $10 million in today’s dollars.\nThat pales in comparison, however, to what it appears Apple paid to restore the Beaux-Arts-style building.\nCook’s team declined to share details of how much the company spent on the project, but preliminary budget details shared with The Washington Post called for more than $30 million of work, including $7 million toward facade restoration, $300,000 to restore the stairwells and $2 million in site work and landscaping. On top of that, Apple agreed to lease the building — which has been nearly vacant for years — for $700,000 a year on a 10-year lease.\nAdvertisement\nCook said that reconstituting the Carnegie Library according to its original design standards was the company’s “most historic, ambitious restoration by far, in the world.” This from a company that has retrofitted stores in New York’s Grand Central Terminal and a 130-year-old former bank in Paris.\nHe said such signature projects will help the company showcase its new services through classes and programming the company calls Today at Apple.\nBut the Carnegie project is also aimed at achieving a higher purpose at the company, which is to deepen customers’ affiliation of Apple with something positive — creativity — at a time when the public finds itself increasingly at odds with big-tech companies over jagged political issues surrounding economic inequality, social media and privacy.\nSteve Jobs famously loved calligraphy and launched the Think Different advertising campaign during a time when adoring a tech company seemed far more innocent.\nAdvertisement\n“Our roots are in education and creativity,” Cook said. “You think about where the company started from and Steve and the team at the time were very focused on providing people tools that allowed them to do incredible things.”\n“We’ve been serving the creative community as a company since the founding of the company, and the truth is everyone should be a part of the creative community,” Cook added, “so this is our way to democratize it.”\nOn a recent Friday afternoon in Apple’s store in Georgetown, dozens of people lined up at the Genius Bar service station for help with fixing cracked screens, rebooting computers and updating iPads.\nAt a set of wooden tables in the back, away from the products, the store showcased a slate of creative programs, including a tutorial on family portraits that a father and son enjoyed midday.\nAdvertisement\nBut no one at the Georgetown location would confuse the store’s purpose: devices. How to fix them, upgrade them, buy accessories for them.\nDeirdre O’Brien, the new head of Apple retail, said the arts programming isn’t envisioned as a way to drive sales.\n“We created Today at Apple to take our customers further, deepen their relationship with their product,” she said. “We didn’t necessarily create it with the idea of driving more revenue. It’s part of the experience of visiting our store.”\nWill Cook and O’Brien succeed in persuading people to view the new store as something more than a store? Although it is built in a former public library, the city’s downtown library is a few blocks away. The Apple logo will glow on the side of the building the way it does on the back of an Apple laptop.\nOn the other hand, the store at the Carnegie Library will hardly resemble the Georgetown location.\nAdvertisement\nVisitors (customers?) will enter through pristinely restored marble entryways to a naturally lit central events area that the company says is open to whoever wanders in. No sales pitch. No questions asked. Devices and services will be tucked into side rooms.\nThe nonprofit Historical Society of Washington, D.C., which will share the building with Apple rent-free, will also enjoy a completely upgraded space where it will open a new D.C. History Center. The organization is planning to launch a retrospective on 20th-century Washington through panoramic photographs.\nApple has planned six weeks of programs headed by local artists that begin May 18. The programs include a performance by D.C. rapper GoldLink and a party hosted by local arts group No Kings Collective.\n“It's a great sort of intersection — technology with humanities,” said John Suau, the Historical Society’s executive director. “Hopefully, it makes people feel like they have a sense of place here.”\nAdvertisement\nCity officials, including Mayor Muriel E. Bowser (D), are celebrating the Apple project. For all its history and beauty, the Carnegie Library hasn’t been fully utilized in more than 15 years, despite repeated failed attempts.\nThe city provided the building to the Historical Society on a 99-year, no-cost lease in 1999. After raising $20 million, the group opened a museum dedicated to D.C. history there, but it lasted less than two years. Another group planned a music museum, which never even opened.\nMost recently, the International Spy Museum’s owners proposed a major expansion and overhaul of the building for their museum’s new home. The D.C. panel tasked with protecting historical buildings turned down that plan three times before the effort fell apart.\nThe building remains isolated in an island surrounded by busy lanes of traffic, a good distance from other shopping. But new office buildings, hotels and restaurants have opened around it in recent years.\nAdvertisement\nBowser visited one of the company’s other signature stores last year during a visit to Silicon Valley and said she came away impressed at how open the space was to the public and the activity it generated around it.\n“We were very careful about making sure that we brought back the historical society space and the very significant public benefit restoration of the Carnegie Library,” she said.\nNot everyone is thrilled that a $900 billion company seems to be further encroaching on what used to be largely public places and ideas.\n“I think this says so much about the corporate seizure of America as we know it,” said Mara Verheyden-Hilliard, executive director of the Partnership for Civil Justice Fund, an advocacy group. “When we think about the town square concept, it’s in this cherished view of a place as a core element of a Democratic society. Apple’s ‘town squares’ are not going to be that. They’re going to be sanitized places for people to gather within the confines of commercialism.”\nPerhaps it will end up somewhere in between. O’Brien, who has been with the company more than 30 years, was part of the team that dreamed up the first Apple store, which opened in 2001.\n“It was a major shift for Apple, and we’re very thoughtful about how to do it in a way that will be successful,” she said. Despite all that has changed since then, she thinks the retail locations still stand for the same thing: “What you see is the Apple logo. That’s what you get. You get Apple.”\nGiftOutline Gift Article",
        "sentiment": 0.15308376723160483
    },
    "article_23": {
        "title": "Kuo: 2019 iPhones to feature redesigned antenna structure with focus on improved indoor navigation",
        "body": "TF Securities analyst Ming-Chi Kuo is out today with a new report on Apple’s supply chain as it pertains to the 2019 and 2020 iPhones. According to Kuo, the 2019 iPhones will feature “vast changes” in antenna structures due to a shift in suppliers and technology.\nKuo explains that the 2019 iPhones will use a new modified-PI antenna structure, a claim he first made in November of 2018, but is now doubling down on. The analyst explains that the iPhone XS, iPhone XS Max, and iPhone XR are limited by their liquid crystal polymer (LCP) antenna technology. Kuo says production issues around LCP cause problems for high-frequency cellular transmission.\nMeanwhile, the switch to modified-PI antenna structure in the 2019 iPhones will bring both cost and production improvements for Apple. For consumers, it offers performance that is essentially the same as LCP when it comes to 4G LTE.\nIn total, however, Kuo explains that the cost of the antenna technology in the 2019 iPhones will be up 10-20 percent year-over-year due to new ultra-wideband upgrades. This will improve the iPhone’s performance when it comes to indoor navigation. Kuo first mentioned this upgrade in February.\nKuo also says that Apple supplier Career will lose orders for the iPhone this year. This could explain why earlier this year, Career was accused of forcing 200 Apple supplier employees to “voluntarily resign.” Kuo further notes that Career won’t receive any new orders from Apple in 2019 for iPad and Apple Watch production, either.\nLastly, Kuo notes that iPhone shipments in the second half of 2019 will be flat year-over-year. He also reiterates that the 2020 iPhones will adopt 5G technology, and switch back to the aforementioned LCP antenna tech. Last month, Kuo predicted that the 2020 iPhones will use modems from Samsung and Qualcomm, and said the switch to 5G could help Apple drive 200 million iPhone shipments in 2020.\nRead more:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.02640930340728826
    },
    "article_24": {
        "title": "Report: iPhone 11 could let users send music to two Bluetooth devices at the same time",
        "body": "iPhone and iPad currently support multiroom audio to AirPlay 2 speakers. A new report from Macotakara says that Apple is adding dual Bluetooth audio support for the next iPhone.\nDual Bluetooth output could potentially enable two people to listen to music from the same phone, connecting two sets of AirPods simultaneously.\nCurrently, the iPhone software only supports connecting to one audio profile device at a time.\nYou can be paired to multiple headphones but the sound can only ever come out of one set. The iPhone supports multiple connections of different types already; for example, it is possible to be connected to headphones and the Apple Watch simultaneously.\nDual Bluetooth Audio is already supported by some Android devices.\nThe example use case that Macotakara quotes in its story is that an iPhone could be connected to a car and wireless earphones, sending navigation speech utterances to the car speakers whilst also sending music to their headphones.\nAs seen from existing implementations on Samsung phones, dual Bluetooth audio modes can suffer from synchronization issues so it probably isn’t going to be useful to output to a multi-room setup.\nDual Bluetooth Audio could be a cool way for you and a friend to listen to the same thing together, pairing two sets of AirPods at once.\nApple is also expected to be adding bilateral wireless charging to the iPhone 11. This would enable users to quickly charge their AirPods by simply placing the case on the back of their phone, sharing the power from the iPhone’s battery.\nThe new iPhone lineup is expected to be announced in the fall, probably at a September media event. Dual Bluetooth Audio is part of the Bluetooth 5 specification, although it’s not clear if the Bluetooth 5 radios present in the iPhone since 2017 can support it. If so, it is possible Apple could also add this feature to iPhone 8, iPhone X, iPhone XR, and iPhone XS with a software update.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.06681848739219062
    }
}