{
    "article_0": {
        "title": "Apple unveils new iPad Pro with LiDAR Scanner and trackpad support in iPadOS",
        "body": "Apple today also introduced the new Magic Keyboard for iPad Pro. With a floating design with smooth angle adjustment, a backlit keyboard and trackpad, the Magic Keyboard delivers the best typing experience ever on iPad. The Magic Keyboard will be available for purchase in May.\n“The new iPad Pro introduces advanced technologies never before available in mobile computing,” said Phil Schiller, Apple’s senior vice president of Worldwide Marketing. “Combining the most advanced mobile display with powerful performance, pro cameras, pro audio, the breakthrough LiDAR Scanner and new Magic Keyboard with Trackpad, this is another huge leap forward for iPad. There’s no other device in the world like the new iPad Pro and we think our customers are going to love it.”\n“We’re making iPad even more capable and versatile by bringing trackpad support to iPadOS,” said Craig Federighi, Apple’s senior vice president of Software Engineering. “We carefully considered the best way to integrate trackpad use into a touch-first environment while retaining everything our customers know and love about iPad. We’re thrilled to bring this new way of interacting with iPad to the millions of people using iPadOS today.”\nPro Performance with A12Z Bionic Chip\nBuilt for the most demanding tasks, like editing 4K video or designing 3D models, iPad Pro gets another performance boost with the new A12Z Bionic chip. The eight-core GPU in the A12Z Bionic, along with an enhanced thermal architecture and tuned performance controllers, gives iPad Pro the highest performance ever in an iPad. Combined with the eight-core CPU and the powerful Neural Engine, which enables next-generation apps, there’s no other chip that can offer the incredible performance found in the thin and light design of iPad Pro. With great battery life lasting up to 10 hours,1 faster Wi-Fi connectivity2 and gigabit-class LTE that’s 60 percent faster3 with support for more LTE bands than any other tablet, customers can stay productive and creative all day.",
        "sentiment": 0.7226391422490661
    },
    "article_1": {
        "title": "Zoom iOS app quietly sending data to Facebook, even if you have no account",
        "body": "Mar. 27th 2020 4:59 am\nUpdate: The app has now been updated to remove this data transfer. See below for an explanation from the company.\nThe Zoom iOS app is sharing data with Facebook, without declaring it in the privacy policy. This happens whether or not you have a Facebook account.\nData shared with Facebook includes your iPhone or iPad model, your time-zone, city, phone carrier and a unique identifier which can be used for ad-targeting …\nThe discovery was made by Motherboard and confirmed by iOS security researcher Will Strafach.\nUpon downloading and opening the app, Zoom connects to Facebook’s Graph API, according to Motherboard’s analysis of the app’s network activity. The Graph API is the main way developers get data in or out of Facebook […] Zoom is not forthcoming with the data collection or the transfer of it to Facebook. Zoom’s policy says the company may collect user’s “Facebook profile information (when you use Facebook to log-in to our Products or to create an account for our Products),” but doesn’t explicitly mention anything about sending data to Facebook on Zoom users who don’t have a Facebook account at all.\nThe piece notes that it’s not uncommon for apps to use a Facebook SDK.\nThis sort of data transfer is not uncommon, especially for Facebook; plenty of apps use Facebook’s software development kits (SDK) as a means to implement features into their apps more easily, which also has the effect of sending information to Facebook.\nWhat is not permitted by Facebook, however, is to do this without notifying users.\nZoom users may not be aware it is happening, nor understand that when they use one product, they may be providing data to another service altogether […] Facebook told Motherboard it requires developers to be transparent with users about the data their apps send to Facebook. Facebook’s terms say “If you use our pixels or SDKs, you further represent and warrant that you have provided robust and sufficiently prominent notice to users regarding the Customer Data collection, sharing and usage,” and specifically for apps, “that third parties, including Facebook, may collect or receive information from your app and other apps and use that information to provide measurement services and targeted ads.”\nZoom is seeing record use during the coronavirus crisis, as both businesses and consumers use it to keep in touch via group video calls.\nIt’s not the first time there has been a privacy issue with Zoom. A major vulnerability last year meant that websites were able to activate Mac webcams without first asking permission. And it was recently suggested that the host can monitor other apps in use, though this appears to apply only to corporately-managed machines.\nSee more Everyone working remotely: ZOOM monitors the activity on your computer and collects data on the programs running and captures which window you have focus on. If you manage the calls, you can monitor what programs users on the call are running as well. It's fucked up. — Wolfgang ʬ 🇹🇼 🇭🇰 (@Ouren) March 21, 2020\nA the time of writing, the company had not commented on this issue with the Zoom iOS app.\nUpdate: Vice now reports that the Facebook code has been removed from Zoom.\n“Zoom takes its users’ privacy extremely seriously. We originally implemented the ‘Login with Facebook’ feature using the Facebook SDK in order to provide our users with another convenient way to access our platform. However, we were recently made aware that the Facebook SDK was collecting unnecessary device data,” Zoom told Motherboard in a statement on Friday.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2372844015647258
    },
    "article_2": {
        "title": "Apple giving retail and hourly workers unlimited sick leave for coronavirus-like symptoms",
        "body": "In addition to offering many of its employees the ability to work from home this week, Apple is also taking steps to ensure the well-being of its retail workers. 9to5Mac has learned that Apple hourly employees, including retail workers, are getting unlimited sick leave if they experience COVID-19 symptoms.\nApple retail workers are not required to submit a doctor’s note for this time off. This means that if they’re experiencing the COVID-19 symptoms, they can take the time that they need without having to worry about running out of sick days or providing a note to management.\nAs of right now, Apple retail stores are staying open during the coronavirus outbreak. Apple, however, is implementing crowd control measures to reduce density, such as limiting Genius Bar openings and canceling many Today at Apple sessions.\nOver the weekend, Tim Cook sent a memo to Apple employees about the ongoing coronavirus outbreak. Cook told workers at Apple offices in California, Seattle, South Korea, Japan, Italy, Germany, France, Switzerland, and the United Kingdom that they can work from home this week if their “job allows” for it. Retail stores are staying open to service Apple customers, Cook said.\nThe coronavirus situation is evolving at a rapid pace, and it’s always possible Apple ends up closing retail stores or dramatically reducing hours. It’s also possible that policies currently in place change on a daily or case-by-case basis.\nRead more:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.06016339655392445
    },
    "article_3": {
        "title": "Apple buys Dark Sky weather app",
        "body": "By Adam Grossman on June 6, 2022 .\nUpdate: As previously announced, the Dark Sky iOS app will no longer be available beginning on December 31st, 2022 and, as of this date, already purchased versions of the app will no longer provide weather data. The Dark Sky API and website will continue to function until March 31st, 2023.\nDark Sky's forecast technology is now enhanced and integrated into the all-new Apple Weather forecast, powering Apple’s updated Weather app. Click here to learn more.\nDevelopers, Apple’s new WeatherKit API lets you incorporate Apple Weather forecast data into your app and is available for iOS, iPadOS, macOS, tvOS, and web. Learn more here.\nBy Adam Grossman on August 1, 2020 .\nUpdate: The Android and Wear OS apps shut down on August 1, 2020. Subscribers who were active at that time will be receiving a full refund. Weather forecasts and maps on the Dark Sky website remain active.\nBy Adam Grossman on July 1, 2020 .\nUpdate: Service to existing users and subscribers of the Android app will now continue until August 1, 2020, at which point the app will be shut down. Subscribers who are active at that time will receive a full refund. Weather forecasts, maps, and embeds available on the Dark Sky website will also shut down on August 1, 2020.\nBy Adam Grossman on March 31, 2020 .\nToday we have some important and exciting news to share: Dark Sky has joined Apple.\nOur goal has always been to provide the world with the best weather information possible, to help as many people as we can stay dry and safe, and to do so in a way that respects your privacy.\nThere is no better place to accomplish these goals than at Apple. We’re thrilled to have the opportunity to reach far more people, with far more impact, than we ever could alone.\nWhat happens to our existing products?\niOS App\nThere will be no changes to Dark Sky for iOS at this time. It will continue to be available for purchase in the App Store.\nAndroid and Wear OS App\nThe app will no longer be available for download. Service to existing users and subscribers will continue until July 1, 2020, at which point the app will be shut down. Subscribers who are still active at that time will receive a refund.\nWebsite\nWeather forecasts, maps, and embeds will continue until July 1, 2020. The website will remain active beyond that time in support of API and iOS App customers.\nAPI\nOur API service for existing customers is not changing today, but we will no longer accept new signups. The API will continue to function through the end of 2021.\nAs part of this transition, use of Dark Sky by Apple is subject to the Apple Privacy Policy, which can be found at apple.com/privacy.\nThank you!\nTo our customers, family and friends, we are grateful for your support over the past eight years. We look forward to continuing to build great products, so stay tuned…\nThe Dark Sky Team",
        "sentiment": -0.07443269788090026
    },
    "article_4": {
        "title": "Conan O'Brien to shoot full shows on iPhone during coronavirus outbreak",
        "body": "For the most up-to-date news and information about the coronavirus pandemic, visit the WHO and CDC websites.\nAs public health officials urge social distancing amid the coronavirus pandemic, late-night talk show hosts are figuring out how to offer comic relief without a studio, crew or live audience.\nConan O'Brien will shoot episodes of this TBS show, Conan, with an iPhone and Skype in guests, the comedian tweeted Wednesday.\n\"This will not be pretty, but feel free to laugh at our attempt. Stay safe,\" he said, also noting the episodes will start airing March 30.\nI am going back on the air Monday, March 30th. All my staff will work from home, I will shoot at home using an iPhone, and my guests will Skype. This will not be pretty, but feel free to laugh at our attempt. Stay safe. — Conan O'Brien (@ConanOBrien) March 19, 2020\nO'Brien isn't the only late-night talk show host going low tech.\nJimmy Fallon is doing mini-episodes from his house too, with cameos from his kids and video chat appearances from the likes of Lin-Manuel Miranda on Thursday's show.\nSimilarly, Trevor Noah will be doing shortened versions of The Daily Show from home. Stephen Colbert joined in the at-home trend for a truncated version of The Late Show with Stephen Colbert before a previously scheduled hiatus kicks in. Samantha Bee, who hosts Full Frontal With Samantha Bee, is calling her digital series, Beeing At Home With Samantha Bee! And Jimmy Kimmel, who hosts Jimmy Kimmel Live, is offering a \"mini-monologue\" each weeknight.",
        "sentiment": -0.20373578270276388
    },
    "article_5": {
        "title": "19 years ago Steve Jobs announced the iPod...People were not impressed. Forum from 2001",
        "body": "not that dissapointing\nThe reason why everyone's dissapointed is because we had our hopes up for this incredible device that would do everything you could possibly use the word \"digital\" in and most of the things you can't. The truth is that is really is revolutionary. 5 gigs? Where do you see 5 gigs in an Mp3 player?\nIf Apple had gone with something completely and utterly new, it would probably go down the hole that the cube and the newton went down... they were ahead of their time, and suffered because of it. Apple can't have another disaster like the Cube, so they decided to stay just a bit ahead of the game. As long as apple markets it effectively, I think it's gonna do really well.\nThe product really looks great, give it a chance guys!",
        "sentiment": -0.05390484677627683
    },
    "article_6": {
        "title": "Zoom Updates iOS App to Stop Sending Data to Facebook",
        "body": "Zoom, a video conferencing app that many people are using at the current time to keep in touch with coworkers while working from home, was sending data to Facebook without disclosing the data sharing to customers.\nAs of today, Zoom has updated its iOS app to remove the SDK that was providing data to Facebook through the Login with Facebook feature, according to Motherboard, the site that first discovered Zoom's data sharing practices.\nZoom was providing Facebook with data that included when a user opened the app, plus their timezone, city, and device details. Zoom's privacy policy did not make it clear that the data was shared with Facebook.\nIn a statement, a spokesperson for Zoom said that Zoom was unaware that the Facebook SDK was collecting unnecessary device data.\n\"Zoom takes its users' privacy extremely seriously. We originally implemented the 'Login with Facebook' feature using the Facebook SDK in order to provide our users with another convenient way to access our platform. However, we were recently made aware that the Facebook SDK was collecting unnecessary device data.\" \"The data collected by the Facebook SDK did not include any personal user information, but rather included data about users' devices such as the mobile OS type and version, the device time zone, device OS, device model and carrier, screen size, processor cores, and disk space.\" \"We will be removing the Facebook SDK and reconfiguring the feature so that users will still be able to login with Facebook via their browser. Users will need to update to the latest version of our application once it becomes available in order for these changes to take hold, and we encourage them to do so. We sincerely apologize for this oversight, and remain firmly committed to the protection of our users' data.\"\nMotherboard has since verified that the iOS app is no longer sending data to Facebook when it is opened.",
        "sentiment": -0.3856467982897392
    },
    "article_7": {
        "title": "Apple to Close All Retail Stores Outside of China Until March 27th.",
        "body": "Apple today announced that it is closing all of its retail locations outside of Greater China until March 27 due to the continuing spread of the coronavirus, which means Apple Stores worldwide will be shuttered for the next two weeks.\nIn a letter letting customers know about the store closures, Tim Cook says that China has taught us that the most effective way to minimize the risk of the coronavirus's transmission is to reduce population density and maximize social distance, which is why Apple Stores are closing. Apple had already closed all of its stores in Italy and Spain, but stores in other countries like the United States have remained open until now.\nAs of today, all of our stores in Greater China have reopened. I also want to thank our operations team and partners for their remarkable efforts to restore our supply chain. What we’ve learned together has helped us all develop the best practices that are assisting enormously in our global response. One of those lessons is that the most effective way to minimize risk of the virus’s transmission is to reduce density and maximize social distance. As rates of new infections continue to grow in other places, we’re taking additional steps to protect our team members and customers. We will be closing all of our retail stores outside of Greater China until March 27.\nCook says that customers who need to purchase devices or accessories can do so on Apple's website or through the Apple Store app. Customers who need service and support can use Apple's support site.\nApple plans to continue to pay its hourly workers during the store closures and has expanded leave policies to accommodate personal or family health circumstances created by COVID-19, including recovering from an illness, caring for a sick loved one, mandatory quarantining, or childcare challenges.",
        "sentiment": 0.19482229820763072
    },
    "article_8": {
        "title": "Apple tells retail employees not to offer AirPods or Apple Watch try-ons as coronavirus precaution",
        "body": "Mar. 11th 2020 4:45 pm\nApple is rolling out additional changes to its retail store practices as the coronavirus pandemic continues. Business Insider reports that Apple Store employees are being told not to offer Apple Watch or AirPods try-ons for the foreseeable future.\nThis is part of Apple’s work to protect Apple Store employees and customers during the coronavirus outbreak, the report says, but there is not an outright ban on try-ons. If a customer specifically requests to try-on AirPods or an Apple Watch, employees can oblige. The key here is that employees are being told not to offer try-ons.\nThe report explains:\nApple is scaling back Apple Watch try-ons at some of its retail stores in an effort to combat the ongoing coronavirus outbreak, according to sources familiar with the matter. Apple Store employees are being instructed not to encourage customers to try on products like the Apple Watch and AirPods, and to only allow customers to do so upon request.\nApple Stores have long offered Apple Watch try-ons, allowing users to try out the different case sizes and band designs. Customers can also try on AirPods Pro to experience the in-ear fit and different sizing options.\nApple retail stores remain open around the world during the coronavirus outbreak, but with new measures to help control crowd sizes as well as deep cleaning protocols and hand sanitizing stations. Apple has closed all of its retail stores in Italy for the indefinite future, it announced this afternoon.\n9to5Mac reported earlier this week that Apple is giving retail and hourly workers unlimited sick leave for coronavirus-like symptoms — with no doctor’s note required. As we said at the time, the coronavirus situation is evolving at a rapid pace, and it’s always possible Apple ends up closing retail stores or dramatically reducing hours.\nRead more:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.04258711694274098
    },
    "article_9": {
        "title": "Plague Inc. skyrockets to top of Apple's paid iPhone apps as fears of coronavirus spread",
        "body": "A video game about the spread of a deadly plague reached the top of the charts Monday as the world grapples with the spread of coronavirus in the real world. Plague Inc., which was created in 2012 by Ndemic Creations, has seen a spike in purchases since the virus outbreak.\nPlague Inc. is a simulation strategy game that involves the user creating and evolving a pathogen to destroy the human population while countering the efforts of governments to contain it. As of Monday morning, the $0.99-game is the top paid iPhone app, beating out the likes of the hugely popular Minecraft.\nIts surge in popularity comes as the coronavirus outbreak continues to spread. So far the disease has killed more than 3,000 people, a vast majority in China.\nChina removed the game from sale in the country's app store last week, Ndemic Creations said.\n\"We have a huge amount of respect for our Chinese players and are devastated that they are no longer able to access and play Plague Inc.,\" the company wrote in blog post Thursday. \"It's not clear to us if this removal is linked to the ongoing coronavirus outbreak that China is facing.\"\nIn January, as the outbreak was first emerging in Wuhan, China, Ndemic Creations wrote: \"Plague Inc. has been out for eight years now and whenever there is an outbreak of disease we see an increase in players, as people seek to find out more about how diseases spread and to understand the complexities of viral outbreaks.\" The company added, \"We specifically designed the game to be realistic and informative, while not sensationalising serious real-world issues.\"\nThe game has been praised by the likes of the U.S. Centers for Disease Control and Prevention for being an educational way to learn how pandemics unfold. The CDC said the game creates a \"compelling world that engages the public on serious public health topics.\"\nFollowing a similar trend, the 2011 movie \"Contagion\" has also gained newfound popularity because of the coronavirus. The film focuses on a global pandemic that starts off in China before spreading into the rest of the world.\nWhile the number of new cases recorded daily in China has declined recently, the virus continues spreading fast in South Korea, Iran and Italy, prompting increased travel warnings and restrictions, and new cases are being reported daily in the U.S.",
        "sentiment": -0.2836795171101888
    },
    "article_10": {
        "title": "Apple loses $1 trillion status for now as coronavirus fallout slashes market",
        "body": "As the coronavirus pandemics continues on, AAPL is seeing further declines along with the rest of the market. This morning with the opening bell, Apple’s stock dropped another 3% which put the company below a $1 trillion-dollar valuation.\nUpdate 3/24: The entire US market saw a boost with the opening bell this morning tied to a potential rescue bill for the economy.\nAAPL is up 5% at the time of writing at $235 a share, putting it back over the $1 trillion-dollar market cap mark.\nJust after the markets opened this morning we saw the DJIA, NASDAQ, and S&P 500 indices, along with AAPL and most other stocks take another hit as the global health pandemic spreads.\nAt the time of writing, AAPL is hovering around the $220 mark, which is the value we saw Apple stock at in October of last year. That’s coming from a high of $327 just last month (which also happens to be the 52-week high).\nThe current share price puts Apple’s market cap at around $965-$975 billion (depending on source).\nFor now, it’s just Microsoft holding on to the remaining trillion-dollar valuation…\nFor the bigger picture, the economic impact has been so severe that the S&P 500 has dropped to the same value it saw back in 2017 when Trump took office.\nBREAKING: S&P 500 has erased all of its gains since President Trump's inauguration https://t.co/DbN3KVGJ9J pic.twitter.com/JlHIQWbM0z — CNBC Now (@CNBCnow) March 23, 2020\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.3787943093249431
    },
    "article_11": {
        "title": "Apple A14 in 'iPhone 12' said to be as fast as the iPad Pro (almost identical in multicore; 50% faster in single-core)",
        "body": "Apple A14 in 'iPhone 12' said to be as fast as the iPad Pro\nThe iPad Pro has an A12X chipset with improved graphics performance and more cores\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nGeekbench scores that may be for the next iPhone processor, the \"A14,\" have surfaced online, and show massive jumps in multi-core performance and speed.\nApple improves on their A-series processors every year for each new iPhone release, so a successor to the current iPhone 11 A13 chipset is expected in the fall of 2020. Each year as the iPhone flagship release approaches, benchmark scores for said to be from the new processor in the device start to populate popular benchmark tools, like Geekbench.\nThe A12X (left) vs the supposed \"A14\" (right)\nIt is expected that the \"iPhone 12\" will have improved performance, and these scores show massive gains year-over-year. Apple has been seeing huge gains in their chipsets despite the rest of the industry hitting a bit of a performance wall.\nNew Geekbench testing, discovered by AppleInsider purporting to be from the A14 processor shows the first A-series processor to cross the 3.0 GHz mark.\nThe 12.9-inch iPad Pro has an A12X chipset with 8 cores and scores 1110 on a single core, and 4568 on the multi-core. The scores for the alleged A14 go beyond even that.\nSingle core performance of the device shows a 1658 score, with a 4612 multi-core score. This indicates a huge gain in its overall performance and will make multitasking and navigating apps smoother than ever.",
        "sentiment": 0.3046930991113186
    },
    "article_12": {
        "title": "Apple reopens all 42 China stores after coronavirus closures",
        "body": "LOS ANGELES (BLOOMBERG, REUTERS) - Apple Inc has reopened all 42 of its stores in China after it was forced to close them last month due to the coronavirus outbreak in the country.\nThe closures were one of two primary reasons Apple cited for pulling down its revenue forecast for the March quarter. China is Apple's third-biggest market.\nSince shutting the stores, Apple gradually reopened them, and 38 of the 42 stores were operating as of last week. The final four will open their doors on Friday (March 13) local time, according to Apple's website. An Apple spokesman confirmed the move.\nChina placed curbs on travel and asked residents to avoid public places in late January, just ahead of the Chinese New Year festival, a major gift-giving holiday. Those restrictions stayed largely in place through most of February.\nThe company sold fewer than half a million iPhones in China in February, government data showed on Monday, as the outbreak halved demand for smartphones. Apple had announced the shuttering of its branded stores in early February.\nApple was also forced to close all 17 of its stores in Italy earlier this week as the virus spread there.\nMeanwhile, Apple has also started creating more space in its retail stores and cancelling some classes to limit Covid-19 transmission. It also encouraged employees at several of its offices to work remotely this week.",
        "sentiment": -0.2194711361080408
    },
    "article_13": {
        "title": "The Apple Watch Doesn’t Need Sleep Tracking Until It Gets Better Battery Life",
        "body": "The Apple Watch is widely considered to be the best smartwatch out there, even though it doesn’t work with Android phones. Personally, I had never used an Apple Watch until a couple weeks ago when I started using our Series 5 unit as my smartwatch of choice with my iPhone.\nAs one would expect, everything works great and in tandem between this watch and my phone, and it’s all great. However, I’ve had many people come up to me asking why the Apple Watch doesn’t come with sleep tracking built in. After all, it is a feature you’d find in almost every smartwatch out there, even on fitness bands. After thinking about that for a bit, and having used the watch for long enough to no longer be constantly amazed by things about it, I think the Apple Watch doesn’t need sleep tracking to be built in until the battery life gets better.\nSo You Thought the Battery Life Was Good Enough?\nYou’re not entirely wrong if that’s the impression you have about the Apple Watch. The Series 5 I’m using (GPS only) easily goes through the day with Always On Display turned on. That’s when my usual day starts from around 7AM to 10PM. In that time, the watch is anywhere between 50 to 60% when I place it back on that magnetic cradle.\nThat’s good. It’s not great, and it’s definitely not enough to be worn through the night because guess what, you need to wear it again the next day, so when exactly would you charge it?\nI won’t blame you if you were thinking you could just charge it the next morning before heading out to work, but the Series 5 just doesn’t charge fast enough.\nBy Apple’s own testing, the Series 5 takes 1.5 hours to charge from 0 to 80%, and a total of 2.5 hours to go from 0 to 100%. Now I don’t know about you, but it usually doesn’t take me 2.5 hours to get ready for work.\nWhat If You Really Need Sleep Tracking?\nSure, there’s an argument to be made about someone needing to keep a track of their sleeping habits, and considering the amount of attention Apple pays to making sure the Apple Watch is a great fitness companion (it really is), it seems like sleep tracking should be somewhere high-up on their to-do list for watchOS.\nWho knows, maybe Apple finally does bring sleep tracking to the Apple Watch with the Series 6 this year. Maybe. I don’t think they should though.\nBefore Apple implements sleep tracking in the Apple Watch, the company needs to figure out one of two things (preferably both, actually):\nThe battery needs to last much longer, or,\nThe watch needs to charge considerably faster than it does.\nSee, if the battery on the Apple Watch lasted, say, 3 days, sleep tracking would be great. You wear your watch continuously for three days, including while you sleep, and then one night you let it charge. Sure you don’t get sleep data for one night, but it’s better than not getting sleep data ever.\nSecond, if the watch charged faster than it does, the current battery situation would resolve itself. You can wear the watch the whole day, sleep with it still on your wrist, and just charge it the next morning while you get ready for work (or play).\nThat’s wishful thinking, and while I certainly hope Apple will figure out some way to get this done, I won’t hold my breath for it, and I will definitely not be happy about the Apple Watch based on my own hopes for what the future holds for this product.\nAs of right now, if you really need sleep tracking on the Apple Watch, there are a bunch of apps you can go with. I would recommend Pillow (Free, with in-app purchases), or AutoSleep ($2.99 | ₹249) because these are the only two apps that have a nice design, and also automatically track sleep. You can also check out Sleep++ (download) which is completely free, doesn’t look all that great, but gets the job done.\nApple Needs to Up the Apple Watch’s Battery Life\nEverything said and done, I have to say I really love the Apple Watch, and it’s not just based on the merits of this watch as a device (even though it has a lot of those individual merits), it’s also because I am deep into the Apple ecosystem right now, and the Apple Watch works seamlessly with everything else I use.\nHeck, I’m not even mad about the battery life because I don’t really have a use for sleep tracking. That said, I would love not having to charge my watch every night, because that will be a nightmare on vacations or weekend trips. There are some tips that you can use to improve battery life on Apple Watch Series 6, but they are not enough if you want to get multi-day use out of it.\nLook, I don’t know what Apple is planning to do with the Apple Watch Series 6 when it launches this fall, but I am hoping that if the company decides to add sleep tracking, they will also make major improvements in the battery department. Until then, I’m happily sleeping off with my Series 5 on its charging cradle overnight, right along with my iPhone.",
        "sentiment": -0.11329762597341796
    },
    "article_14": {
        "title": "PSA: Alto’s Odyssey and Alto’s Adventure are free on the Appstore.",
        "body": "Just beyond the horizon sits a majestic desert, vast and unexplored.\n“Apple Design Award Winner, 2018”\n– Apple\n“The art of the perfect sequel”\n– The Verge\n“A true joy”\n– TechCrunch\n“Dramatic and driving”\n– Kotaku\n“A beautiful labor of love”\n– The Next Web\n“Vibrant and poetic”\n– MacStories\n“Gorgeous”\n– Engadget\n“Incredibly beautiful”\n– TouchArcade\n“Dazzling”\n– Macworld\n“A relaxing experience”\n– Ars Technica\nJoin Alto and his friends and set off on an endless sandboarding journey to discover its secrets.\nSoar above windswept dunes, traverse thrilling canyons, and explore long-hidden temples in a fantastical place far from home.\nAlong the way, you’ll grind across vines, bounce atop hot air balloons, ride towering rock walls, and escape mischievous lemurs – all while uncovering the desert’s many mysteries.\nFeatures:\n• A standalone experience. Alto’s Odyssey is the follow-up to the critically acclaimed Alto’s Adventure, but you don’t need to have played one to enjoy the other.\n• Easy to learn, difficult to master. At the heart of the Alto series is an elegant one-touch trick system. Chain together combos, and complete 180 goals — all with intuitive controls.\n• Explore Biomes. From the dunes, to the canyons, to the temples, explore a rich and diverse landscape, with each area boasting unique visuals and gameplay.\n• Newfound heights. Discover secrets in the sky with hot-air balloons, moving grind rails, and wall riding.\n• Master the elements. In addition to dynamic lighting and weather effects like sandstorms and shooting stars, the desert is home to swirling wind vortexes and rushing water.\n• Meet Alto and friends. Unlock six unique characters, each with their own attributes and abilities.\n• Zen Mode. Complete with its own serene soundtrack, this relaxing mode distills Odyssey down to its purest elements: no scores, no coins, and no power-ups. Just you and the endless desert.\n• Photo Mode. From the pause screen, get behind the lens and take stunning photos of your trip through the desert. Pinch, swipe, pan and zoom to frame the ideal shot, and share them with friends and family.\n• Original music and handcrafted audio. Headphones recommended!\n• Universal app with iCloud support. Play on your iPhone, iPad, and Apple TV, and your progress will always be in sync.\nAlto’s Odyssey is a premium game with no ads or in-app purchases. Purchase once, play forever.",
        "sentiment": 0.8318578391496477
    },
    "article_15": {
        "title": "Apple cancels 'Today at Apple' &amp; closes one store in Italy over coronavirus concerns",
        "body": "Apple Oriocenter | Image Credit: Apple\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple is taking action in Italy to help contain the coronavirus, and this week canceled all \"Today at Apple\" sessions across the country until March 19.\nIn addition to the \"Today at Apple\" session cancellations, Apple will close one store, Apple Oriocenter, in the province of Bergamo on March 7 and 8 on orders from the Italian government.\nAnyone who plans on visiting is advised to either call ahead or visit the store's retail site.\nApple Stores across mainland China, such as Beijing's Apple Mall China, are also still seeing reduced hours in the aftermath of the outbreak.\nThe 2019 Novel Coronavirus, or COVID-19, continues to spread in more regions worldwide, with nearly 100,000 cases globally. Italy has been hit especially hard by the virus. Global health officials report that Italy has over 3,800 cases of COVID-19, including nearly 150 deaths.",
        "sentiment": -0.33216872066259384
    },
    "article_16": {
        "title": "Apple reveals the best Night mode photos shot on iPhone",
        "body": "iPhone photographers around the world answered the call to participate in the Night mode photo challenge, sharing their captivating Night mode images shot on iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max. A curated panel of judges selected six winning photos from thousands of submissions worldwide. The winning images will be featured in a gallery on apple.com and Apple Instagram (@apple) and will appear globally on billboards.\nThe winning photographers represented countries from China, India, Russia and Spain, sharing their various perspectives of the beauty and colors of night in the cultures surrounding them.\nOur panel of judges included Malin Fezehai (US), Tyler Mitchell (US), Sarah Lee (UK), Alexvi Li (China), Darren Soh (Singapore), Phil Schiller, Kaiann Drance, Brooks Kraft, Jon McCormack and Arem Duplessis. Each shared their thoughts on what made these photos stand out from the pack.\nShot on iPhone Night mode challenge — the winners",
        "sentiment": 0.831978153437376
    },
    "article_17": {
        "title": "Apple's A14 Chip Rumored to Become First Arm-Based Mobile Processor to Exceed 3GHz",
        "body": "Apple's unreleased A14 chip is rumored to be the first Arm-based mobile processor to officially exceed 3GHz, according to a new report by Research Snipers.\nApple's A14 processor, the successor to the A13 chip in both the iPhone 11 and ‌iPhone‌ 11 Pro, is expected to debut this fall in Apple's \"iPhone 12\" models. The report highlights the suspected Geekbench 4 score of the A14 chip, with a frequency reaching 3.1GHz. This would be 400MHz higher than Apple's current A13 Bionic chip with a frequency of 2.7GHz.\nAt such a frequency, the chip's Geekbench 5 running points have surged. The report mentions that the A14's single-core performance shows a score of 1658 (up 25% from the A13), and a multi-core score of 4612 points (up 33% from the A13). The extra processing power will be helpful in running simultaneous workflows, navigating through apps, and more.\nApple chipmaker TSMC is expected to ramp up production of Apple's 5nm-based A14 chipsets in as early as April of this year.\nIn addition to the A14 chip, rumors recently have mentioned both Arm processors with Mac Pro level performance and a Mac with an Apple-designed Arm processor are in the works.",
        "sentiment": -0.23029308517773947
    },
    "article_18": {
        "title": "Apple reportedly recommending Apple Park employees to work from home due to coronavirus concerns",
        "body": "Mar. 6th 2020 10:42 am\nAccording to a report from Business Insider, Apple is telling employees at its Cupertino campuses, Apple Park and Infinite Loop, that it recommends working from home today as an “additional precaution” (via Mark Gurman).\nFurther details on the policy are not clear at this time. Many divisions of Apple may struggle to do their jobs remotely effectively, which is perhaps why this is a recommendation rather than a requirement at this stage. Apple is yet to confirm the arrangements publicly.\nYesterday, advice from the Santa Clara Public Health department instructed Silicon Valley companies to “consider use of telecommuting options for appropriate employees.” So, perhaps today’s report is coming from Apple’s implementation of the health guidance.\nThe same notice also said that companies should minimize or cancel “large in-person meetings and conferences.” Apple has already announced it would no longer participate in SXSW, where it had planned to debut premieres of upcoming three Apple TV+ shows.\nHowever, the company has yet to comment on its plan for WWDC, which typically draws in 5,000 Apple developers around the world for a one-week conference held in June.\nApple joins other tech titans like Amazon, Google, Facebook, Twitter, and Microsoft in adopting remote work schedules in the wake of the coronavirus outbreak.\nLatest government data reports there have been 231 cases of novel coronavirus in the United States so far. Worldwide, the number of cases is believed to have crossed 100,000.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.24917395984133084
    },
    "article_19": {
        "title": "Apple allowing ads in push notifications is a path better left unwalked",
        "body": "Apple has recently updated its developer guidelines, and in particular, we should pay attention to the changes to the rules about notifications. Because they're pretty gross, and it's down a road that I wish Apple wouldn't walk.\nDevelopers will be able to use notifications for promotions or direct marketing thanks to changes to section 4.5.4.\nSection 4.5.4 (opens in new tab) now reads thusly:\n4.5.4 Push Notifications must not be required for the app to function, and should not be used to send sensitive personal or confidential information. Push Notifications should not be used for promotions or direct marketing purposes unless customers have explicitly opted in to receive them via consent language displayed in your app's UI, and you provide a method in your app for a user to opt out from receiving such messages. Abuse of these services may result in revocation of your privileges.\nLook, this really feels like a gut-check kind of thing, and my gut says allowing advertisement in notifications is gross. It's bad enough that Apple advertises using notifications in its own apps (especially when you're not a subscriber to its services), but to allow it for developers now just makes me uncomfortable.\nWe're overloaded with advertising these days. We don't need more of it, especially for a device that's on us all of the time. It's one thing to encounter a lot of ads on the web on, for instance, your Mac. To have them on a device that you always have with you, buzzing or beeping all of the time, is user-hostile.\nThere are sure to be developers out there who won't use this feature. And there are going to be developers who use it sparingly, or maybe even in inventive ways that enhance your experience. If a favorite game gets a new piece of content or puts something on sale, then sure, I wouldn't mind knowing about it.\nBut you and I both know you're going to see company after company tries to abuse this system. Sales, new content, oh, and did you remember to upgrade to a premium membership? You should really upgrade to a premium membership.\nNow, some might say that I'm overblowing this. After all, the new rules say that you can't send these notifications unless users have explicitly opted in. There needs to be explicit consent language and easy opt-out. Well, excuse me if I don't place my faith in an app review system that regularly gets its wires crossed.\nI'd put real money on bad actors slipping by these provisions. Maybe they'll be caught right away. Maybe they won't. Maybe it'll be a big company, like Facebook, who says, \"No, we're going to do it this way, and if you try and make us change it, we'll leave.\"\nBut also, people often just tap 'Yes' or 'Agreed' or 'Continue' on pop-ups on their phones. They don't read carefully enough. They'll permit these types of notifications, almost accidentally, and the next thing you know, they'll be spammed by the bad actors of the App Store that they've installed on their phone.\nMaybe they should read things more carefully. But the kind of people that will abuse this system know that they won't and they take advantage of that. A lot of people are impatient. It doesn't mean they deserve it when someone takes advantage of them because they didn't read the fine print.\nAnd what's to say that these rules won't be relaxed further somewhere down the road? Slippery slope arguments are a fallacy to be sure. Still, I think we've all be burned badly at least one time before by a company we trusted, so I don't think we can put complete faith in Apple here to hold this particular line, especially when they didn't even hold the previous line for themselves.\nThe world doesn't need additional opportunities to advertise to us. Keep it confined inside of your app. Opening this door is the wrong move by Apple, and I'm not excited to see how some developers will take advantage of it.\nBut what do you think? Do you take this as a bad sign, or are those among us worried about this just overblowing it? Let us know in the comments.",
        "sentiment": -0.3435469187692636
    },
    "article_20": {
        "title": "Tim Cook, Eddy Cue exposed to coronavirus at birthday party",
        "body": "Apple's Tim Cook and Eddy Cue at Sun Valley 2018 (via Alex Heath/Twitter)\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nUniversal Music's CEO, Lucian Grainge, has tested positive for the Coronavirus — meaning that Tim Cook and Eddy Cue may have been exposed after attending his 60th birthday party.\nTim Cook and Eddy Cue had attended the CEO's party 16 days ago. Symptoms of COVID-19 can appear anywhere from 14 to 21 days after exposure to the virus. Currently, it is not known if either Cook or Cue have been tested for the 2019 Novel Coronavirus.\nThe party in question was held at La Quinta's Madison Club, which has been shut down in response to the illness, including the clubhouse and golf course.\nUMG Santa Monica has also been closed down in response after learning that Grainge tested positive for COVID-19. All staffers had been ordered to leave the building as soon as possible and in an orderly manner. According to a source close to the matter, many of the staff had already begun working from home before the announcement.\nAn internal memo obtained by Variety confirms the closure.\n\"Previously, we have committed that if there were to be a confirmed case of coronavirus infection in any of our offices, we would immediately close that location,\" reads the memo. \"We have just been informed that there is a confirmed case of infection in an employee based in our 2220 Colorado Avenue offices. Accordingly and out of an abundance of caution, we are immediately closing all of our Santa Monica offices, and all Santa Monica staff are required to work from home until further notice.\"",
        "sentiment": -0.569621585882627
    },
    "article_21": {
        "title": "Unlike Google-Verily, Apple's Coronavirus Screening Site Requires No Personal Info in order to use",
        "body": "Apple can now help you determine whether you should request a coronavirus test.\nOn Friday, the company released(Opens in a new window) its COVID-19 screening tool, which will ask you questions about any coronavirus-related symptoms you’re feeling, and what to do next.\nApple created the tool in partnership with the CDC, the White House Coronavirus Task Force, and FEMA, to make it easier for people in the US to receive trusted information on illness, which has now infected(Opens in a new window) more than 93,000 people in the country.\nThe test is open to all users, and available at apple.com/covid19(Opens in a new window). You can also download it from the iOS App Store(Opens in a new window). No personal information, such as name or email address, is required. The company also says it won’t share any answers you give to the screening tool to Apple or the CDC, unless you give them permission to do so.\nWhether the tool is actually helpful is another matter. If Apple determines you may have contracted the illness, the screening tool will simply suggest you contact a doctor’s office or local health department about getting a coronavirus test, which is the same guidance(Opens in a new window) from the CDC. Apple’s site will also recommend you isolate yourself to prevent infecting others. Other tips include getting rest and monitoring your symptoms.\nIf Apple's tool suspects you may have the illness.\nThe site won’t fix the current difficulties in obtaining a coronavirus test. Rather, Apple’s focus is to supply information about the illness and how to protect yourself. The same tool includes educational pages on the need to wash your hands and to practice social distancing, in addition to who should get tested and why.\n“Along with the new COVID-19 app and website, customers across the US may also ask Siri, ‘How do I know if I have coronavirus?’ to access guidance and resources from the CDC and a curated collection of telehealth apps available on the App Store,” the company said in today’s announcement.\nApple's advice on testing.\nAll the major tech companies have been trying to educate the public on the disease. For example, Microsoft also partnered with the CDC to create a chatbot(Opens in a new window) that can consult users about the coronavirus and whether they should seek out a test. You can also ask Amazon's Alexa about your symptoms.\nGoogle, on the other hand, was ensnared in some controversy after President Trump wrongly claimed the company was working on a website to direct US users to immediate coronavirus testing. The actual site comes from Google’s sister company, Verily, and remains an early stage operation confined to California in four locations. In the meantime, Google created an informational site(Opens in a new window) devoted to preventing COVID-19 infections.\nHow to Keep Your Phone Clean and Safe From Carrying Coronavirus How to Keep Your Phone Clean and Safe From Carrying Coronavirus",
        "sentiment": -0.19424240749018887
    },
    "article_22": {
        "title": "Nike, Apple among dozens of major brands implicated in report on forced labour",
        "body": "Nike, Apple and a major manufacturer building trains in Australia are among the dozens of global brands implicated in a new report on forced labour in China, amid growing international concern over the treatment of the Uighur people.\nThe report, by the US State Department-funded Australian Strategic Policy Institute, alleges some factories that supply the brands appear to be using Uighur workers sent directly from re-education camps.\nNike said it strives to conduct business ethically. Credit:Bloomberg\nThe Chinese government maintains the camps, which it describes as vocational education facilities, are needed to combat terrorism in the Xinjiang region and to \"ensure its smooth economic transition\".\nIt has dismissed claims that up to a million members of the Uighur muslim minority have been detained in the camps as \"fake news\".",
        "sentiment": -0.5564235679805278
    },
    "article_23": {
        "title": "'iPhone SE 2' Said to Have Entered Final Production Verification Stage Ahead of Launch",
        "body": "Apple's rumored lower-cost iPhone model recently entered the final phase of production verification at an assembly plant in Zhengzhou, China, according to industry sources cited by Taiwanese publication DigiTimes.\nA paywalled preview of the report:\nNew LCD iPhone enters final verification stage\nApple will soon introduce a new LCD iPhone series, dubbed tentatively SE2, which has recently entered the final phase of verification at an assembly plant in Zhengzhou, China, according to industry sources.\nApple is widely expected to announce an entry-level iPhone dubbed \"iPhone SE 2\" or \"iPhone 9\" within the next few months. The device is expected to resemble the iPhone 8, with a 4.7-inch LCD screen and a Touch ID home button, but with a faster A13 chip and an increased 3GB of RAM. Pricing is estimated to start at around $399 with 64GB of storage in the United States.\nLast month, analyst Ming-Chi Kuo said Apple still plans to release the iPhone in the first half of 2020. Multiple reports have indicated that Apple aims to announce the device by the end of March, but those plans may change due to the uncertainty of the SARS-CoV-2 coronavirus outbreak around the world.\nWith major tech conferences like Google I/O and Facebook F8 having been cancelled on a physical basis due to public health considerations, it sounds increasingly unlikely that Apple will host a March event as rumored. Apple could always announce the lower-cost iPhone and other products with press releases, while offering one-on-one briefings with the media in Cupertino and New York City.\nEven if the lower-cost iPhone is announced in March, initial supply may be limited until Foxconn and other Apple suppliers resume normal operations and ramp up mass production in the second quarter.",
        "sentiment": 0.00923321656882763
    },
    "article_24": {
        "title": "New MacBook Air has more to love and is now just $999",
        "body": "1 The new 2 and up to 80 percent faster graphics performance,3 letting customers breeze through daily activities and play more games. Now starting with 256GB of storage, MacBook Air allows customers to store even more movies, photos and files. With its brilliant 13-inch Retina display for vivid images and sharp text, Touch ID for easy login and secure online purchases, spacious trackpad, and all-day battery life combined with the power of macOS Catalina, it’s the best MacBook Air ever made. Cupertino, California — Apple today updated MacBook Air, the world’s most loved notebook, with faster performance, the new Magic Keyboard, twice the storage and a new lower price of $999, and $899 for education.The new MacBook Air delivers up to two times faster CPU performanceand up to 80 percent faster graphics performance,letting customers breeze through daily activities and play more games. Now starting with 256GB of storage, MacBook Air allows customers to store even more movies, photos and files. With its brilliant 13-inch Retina display for vivid images and sharp text, Touch ID for easy login and secure online purchases, spacious trackpad, and all-day battery life combined with the power of macOS Catalina, it’s the best MacBook Air ever made.\n“From students and consumers buying their first computer to customers looking to upgrade, everyone loves the Mac, and they especially love MacBook Air. Today we’re giving it a huge update, with two times faster performance, the new Magic Keyboard, double the storage, a new lower price of $999 and an even lower price of $899 for education,” said Tom Boger, Apple’s senior director of Mac and iPad Product Marketing. “With its stunning, thin and light design, brilliant Retina display, all-day battery life and the power and ease-of-use of macOS, MacBook Air is the world’s best consumer notebook.”\nFaster Everyday Performance\nOffering quad-core processors for the first time, MacBook Air now delivers even more speed across everyday activities, from organizing photos and creating presentations to editing videos. Featuring the latest 10th-generation Intel Core processors up to 1.2GHz quad-core Core i7 with Turbo Boost speeds up to 3.8GHz, MacBook Air delivers up to two times faster performance when compared to the previous generation. And with Intel Iris Plus Graphics, MacBook Air now delivers up to 80 percent faster graphics performance, so graphics-intensive activities like playing games and editing video are faster than ever.",
        "sentiment": 0.7032850870432762
    }
}