{
    "article_0": {
        "title": "Apple reportedly abandoned plans to roll out end-to-end encrypted iCloud backups, apparently due to pressure from the FBI",
        "body": "According to a report from Reuters, Apple abandoned plans to release an end-to-end encrypted version of iCloud backups after facing complaints from the FBI who told Apple that it would hinder their investigations.\nThe report says that Apple was working on the feature more than two years ago, but it was cancelled after the FBI raised concerns. One employee said “legal killed it, for reasons you can imagine”.\nEnd-to-end encryption works by making an encryption key based on factors that are not stored on the server. This may mean entangling the key with a user password, or some cryptographic key stored on the hardware of the local iPhone or iPad. Even if someone hacked into the server and got access to the data, the data would look like random noise without having the entangled key to decode it.\nApple currently stores iCloud backups in a non end-to-end encrypted manner. This means that the decryption key is stored on Apple’s servers. If a police entity comes to Apple with a subpoena, then the company has to give over all of the iCloud data — including the decryption key. This has further rounds of ramifications. For instance, whilst the iMessage service is end-to-encrypted, the conversations stored in an iCloud backup are not.\nIn the case of the widely-publicized Pensacola shooter, Apple said that it handed over gigabytes of iCloud information (likely mostly consisting of user photos) when attorney general Barr criticized the company for not doing enough to help.\nIn 2016 in fact, both The New York Times and the Financial Times said that Apple was developing more comprehensive end-to-end encryption features. No changes to iCloud Backup have been rolled out in the years since, though, and the Reuters report today suggests it is no longer on the roadmap either.\nReuters says that it is possible that other factors led to the decision to drop the initiative, such as the fear that customers would accidentally enable end-to-end backups without realizing the consequences, then forget their password and lose all access to important personal information like their photo library.\nAs shown on this webpage, Apple uses end-to-end encryption selectively. Data such as the Health database or Home configuration, iCloud Keychain and WiFi passwords is stored in an end-to-end encrypted form. However, the most personal and most sensitive categories of information like email, photos and iCloud Drive files do not offer that extra level of security, even as an option for those that would want it. Messages are also stored using end-to-encryption but as said earlier, this is nullified if the user also enabled iCloud Backup.\nThe Electronic Frontier Foundation has repeatedly requested that Apple and other tech companies offer end-to-end backup solutions.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.38877649275078013
    },
    "article_1": {
        "title": "There's been a nearly 70% decline in always-on location data, since iOS 13 rollout",
        "body": "Perhaps more than GDPR or CCPA, Apple’s iOS 13 privacy controls and location alerts may impact the availability of user location data — just as it’s becoming a critical tool for marketers. According to research from location verification company Location Sciences, since the adoption of iOS 13 the company has seen “a 68% decrease in background location data.”\nDecline in background location data. Background location is “always-on” location collected at the device level as the user proceeds through the day and moves from place to place. Foreground location is captured only when a user has an app open.\nBackground location is generally more accurate for a range of marketing purposes than isolated data points collected while an individual is using an app. That’s because always-on location regularly taps into a GPS signal to provide a moment-by-moment view of user movements vs. only a few hits throughout the day or week (or less frequently).\niOS 13 location alerts and privacy controls\nSource: Location Sciences\nThe above finding is based on an analysis of “two billion background location events” analyzed during September and October 2019 for a single UK-based app publisher. Accordingly, it’s unclear how representative this data is of the broader market, but it’s probably directionally accurate at a minimum. (An earlier survey-based study from Blis found that people are consciously exercising greater control over allowing their locations to be tracked.)\nDecline in data accuracy. In addition, Location Sciences says it has seen “a 24% decrease in GPS data post iOS 13, nearly doubling the amount of low accuracy IP. This signals a shift in location data quality priorities in the face of privacy.”\nGPS data is generally accurate to within a few meters. IP-based location, which comes from mobile phone carriers and ISPs, is much less accurate, between 1 kilometer and 20 kilometers for fixed IP address and less accurate for dynamic IP. But it’s much more widely available.\nDecline in supply of available background location\nSource: Location Sciences\nLocation Sciences infers in its report that “The decrease in background location data vs. that of foreground location data suggests that consumers are more averse to sharing data when they are not using the app or receiving location-specific value in exchange for shared data.” As a general proposition, the majority of mobile users are now aware of location tracking. Consumers have indicated in numerous surveys that they’re typically willing to share location when they understand the benefits of doing so or are rewarded in some way.\nWhy we care. If background and high-quality location data become less available over time, according to Location Sciences, this will “ripple through media delivery, personalized ad experience, audience segmentation and most importantly location analytics.” The company says that high-quality location data (or marketing supported by it) will likely cost more in the future.\nMarketers will need to better understand location data sources and perhaps consider using a third party to audit location data. For developers and publishers, enticing users to share location — except for things like maps — will require a better user experience or improved incentives.\nOpinions expressed in this article are those of the guest author and not necessarily MarTech. Staff authors are listed here.",
        "sentiment": -0.14901385642588139
    },
    "article_2": {
        "title": "App tracking alert in iOS 13 has dramatically cut location data flow to ad industry - Apple's initiatives to minimize tracking by marketers is continuing to make life harder for the advertising industry, forcing advertisers to use inefficient data sources to pinpoint users.",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple's initiatives to minimize tracking by marketers is continuing to make life harder for the advertising industry, forcing advertisers to use inefficient data sources to pinpoint users.\nOver the years, Apple has enhanced how it protects the privacy of its users online, typically by limiting what data can be seen by advertisers tracking different data points. Initiatives such as Intelligent Tracking Protection in Safari has helped secure more privacy by making it harder to track individual users, which advertising executives in December admitted has been \"stunningly effective.\"\nWhile ITP and other improvements have helped to minimize the tracking of users, marketers are also being affected by another element of iOS 13, one where users are regularly notified of apps that are capturing their location in the background. The warning gives options for users to allow an app to continue to track all the time or to do so when it is open, with users often selecting the latter.\nAccording to data from location-verification firm Location Sciences seen by DigiDay, approximately seven in ten iPhone users analyzed by the company downloaded iOS 13 in its first six weeks of availability. Of those users who installed the update, around 80% of them stopped all background tracking by apps.\nAd tracking company Teemo suggests the opt-in rates to share data with apps when not in use are often below 50%, whereas three years ago, the same rates were close to 100%. The higher rates were due to it being a time when users were largely unaware there were options to disable tracking in the first place.\n\"People have decided to stop their phones' sharing location data at a universal level,\" Location Sciences chief business officer Jason Smith admitted.\nThe trend of disabling tracking makes it harder for firms to rate the effectiveness of campaigns, Starcom managing partner Paul Kasamias suggests. The change impacts \"the ability to tie users that research online and purchase in store,\" as well as making measuring footfall in stores a \"far more opaque\" process for clients.\nA drop in advertiser spending is likely to occur from small or medium-sized advertisers, Kasamias believes, as they are clients \"where cost efficiency is paramount and there is a physical footprint, as targeting the right user at the right time will become more difficult.\"\nThe change has already led to a reduction in \"sales pitches from providers of location-data solutions,\" Havas Media EVP Sargi Mann claimed, with there being more of a need to address the location issue \"transparently up front as part of bigger deals\" with marketers.\nDespite the reduced amount of location data available, the amount that is still available to use is more valuable, while the market for location data continues to thrive.\n\"We're still being approached by location data businesses that are telling us they're growing, said Rippll CEO Doug Chisholm. \"More importantly, they have more data than they did a year ago.\"\nThe quality of that data is still a problem, as ad buyers notice it is of a lower quality than data that was previously available. According to Smith, Location Sciences is seeing less location data derived from a smartphone's GPS, \"which is the most precise source of mobile location data.\"\nInstead, Smith highlights the presence of \"lower quality data\" sourced from carriers or other Internet protocols. \"Often the least accurate sources of mobile location data available\" to a marketer in his opinion.",
        "sentiment": -0.38578961891206826
    },
    "article_3": {
        "title": "[News] Samsung steals Face ID icon",
        "body": "Samsung just can’t help itself: during a CES keynote yesterday, its executives brought up a slide to explain Samsung Pass which had what looks to be Apple’s Face ID icon on it.\nSamsung Pass is the company’s new biometric identity management as-a-service product.\niMore first spotted the logo which appears to have been borrowed from the Face ID glyph. It should be noted that Apple has registered the Face ID logo in multiple countries around the world so it will be interesting seeing whether it will send its legal sharks after Samsung.\nKeep in mind that it’s entirely possible that Samsung Pass is coming to the iPhone, in which case users may be able to authenticate using Face ID. And if that’s what’s happening here, then Apple probably gave Samsung permission to use its Face ID logo.\nSamsung previously also “borrowed” Apple’s Touch ID logo.\nAnother possibility: Samsung being Samsung. And with that scenario in mind, what are the options that Apple’s legal team has to protect its intellectual property?\nCult of Mac explains:\n‘In terms of copyright, the threshold for protection for user interface metaphors—such as using a trashcan to signify deletion—is quite high,’ Anna Ronkainen, an intellectual property scholar at the University of Helsinki, told Cult of Mac. If Apple chooses to defend its trademark in this latest instance, Ronkainen thinks Samsung could make an argument about the transparent nature of the icon. That means arguing that the average consumer will associate the icon with generic biometric login via facial recognition. Samsung could argue that the trademark should never have been granted in the first place. If that’s the case, Ronkainen said, ‘off to the courts we go.’ Literally. ‘The outcome is impossible to predict at this point.’ Impossible, that is, other than the high probability that it would involve years more Apple vs. Samsung battling in court.\nResembling the original smiley face Macintosh logo from the 1980s, the Face ID glyph was first used by Apple with the iPhone X that released in 2017.\nhttps://www.youtube.com/watch?v=YMYvs5PhwXg\nThis isn’t the first time Samsung has slavishly copied work by its rivals. In fact, the South Korean firm is regularly accused by its competitors of stealing their industrial designs and ideas. Samsung was famously sued by Apple for copying the iPhone look and feel.\nIt was eventually confirmed by courts that Samsung did lift Apple’s copyrighted work wholesale. As a result, the Galaxy maker is now on the hook for millions of dollars in damages.\nWhat’s your opinion? Has Samsung just ripped off the Face ID icon and called it its own?\nMeet us in comments!",
        "sentiment": -0.376955163504543
    },
    "article_4": {
        "title": "Report: The FBI recently unlocked an iPhone 11 Pro with GrayKey, raising more doubts about the Pensacola case",
        "body": "As Apple stands firm against requests to break iPhone encryption, many people have questioned why the FBI needs Apple’s help in the first place. There are plenty of tools available from third-party companies that are more than capable of unlocking the iPhone 5 and iPhone 7 used by the Pensacola gunman.\nFurther emphasizing that point, a new report from Forbes says that the FBI recently used one of those black/gray market tools to unlock the newest — and theoretically the most secure — iPhone that Apple sells.\nAccording to the report, FBI investigators in Ohio used the GrayKey hardware box to unlock an iPhone 11 Pro Max. The phone in question belonged to Baris Ali Koch, who was being accused of helping his convicted brother escape the country by letting him use his passport.\nKoch’s lawyer confirmed to Forbes that the iPhone in question was locked with a passcode, and that Koch had never given up that passcode, nor is it possible that Face ID could have been used. This corroborates Forbes’ claim that GrayKey was used.\nThe “GrayKey” is a hardware box sold by forensics firm Grayshift that has long been used by law enforcement and investigators to gain access to locked iPhones. Details about the GrayKey are usually kept under wraps, including whether it works on Apple’s newest operating systems and iPhones. This is generally to make it harder for Apple to patch the vulnerabilities Grayshift uses.\nThe two iPhones used by the Pensacola shooter were an iPhone 5 and an iPhone 7. As we’ve said before, the FBI can easily unlock these devices using third-party solutions. In fact, the FBI could likely use the same exploit it used to unlock the iPhone 5C used by the San Bernardino shooter in 2015.\nSo why are the FBI, Donald Trump, Attorney General William Barr, and others all calling on Apple itself to break iPhone encryption? The most obvious possibility is that it’s a political move, designed to help push through legislation that would require Apple and other tech companies to include backdoors in all hardware and software.\nThere’s also the money argument. If Apple was required to build backdoors into iOS and the iPhone, the FBI would no longer have to pay firms like Grayshift and Cellebrite.\nWhat do you think? Why is the FBI taking a public stance against Apple, when it seemingly knows and has even used tools capable of unlocking the iPhones? Let us know in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2596572338688103
    },
    "article_5": {
        "title": "iPhone 11 Series Was a Smashing Hit During U.S. Holiday Season; $699 Model Made up 39 Percent of Total Sales",
        "body": "New data published by CIRP reveals that Apple’s iPhone 11 series comprising of the iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max are a major hit in the U.S. For some, the term ‘major hit’ might be a bit of an understatement because all models launched last year have accounted for 69 percent of total iPhone sales. If that didn’t impress you, the $699 model, which is the iPhone 11, accounted for 39 percent of all iPhone sales. Looks like Tim Cook was right all along when he stated during Apple’s fourth quarter earnings that the iPhone 11 is off to a tremendous start.\nApple’s 2018 iPhone XR Continues to Do Well During the Holiday Season, Thanks to Its $599 Starting Price\nApple hasn’t released official unit figures, meaning that these estimates have been taken from analyst’s surveys. So far, the information appears to be convincing, as the iPhone 11 is the most popular model between October and December 2019. It appears that Apple’s strategy of further cutting the starting price of its entry-level, yet highly capable model has paid off wonders.\nThe iPhone XR, which has reported to be the most popular smartphone in the world for 2019, continues to sell well. Its high-end features coupled with it’s $599 starting price are no doubt the deciding factors for its success. However, between 2018 and 2019, CIRP reports that the average selling price or ASP fell from $839 in December 2018 to about $809.\nThis decline was expected as the iPhone 11 launched at a price that’s $50 cheaper than the cheapest model launched back in 2018. That was the iPhone XR, which was unveiled for $749 during Apple’s 2018 keynote. CIRP also notes that the base storage models ended up being the most popular.\nA majority of customers of the iPhone 11 and older models picked up the 64GB variants, while two-thirds of iPhone 11 Pro customers picked up a 256GB or 512GB version. Since Apple will announce its quarterly earnings on January 28, we’ll know just how well the company did after the iPhone 11’s inception. Hopefully, it will be positive news for the technology giant.\nYou might also like to check out:\nNews Source: 9to5Mac",
        "sentiment": 0.08866117357586821
    },
    "article_6": {
        "title": "Apple Now Allowing AirPods Charging Cases to Be Engraved With Emojis",
        "body": "Apple today added updated engraving options for the AirPods Charging Case, allowing customers who purchase AirPods to choose to engrave emoji characters on their devices.\nAirPods have always been able to be engraved, but the engravings were limited to text and there was no option to add an emoji character. Apple is highlighting the engraving options on its main site and when customers visit one of the AirPods product pages.\nCustomers who choose to personalize their AirPods during the purchase process can choose from several emoji characters, though not all emojis are available. Options like smiling face, face with tongue out, and thumbs up are available, as are multiple animals.\nThere's a ghost, unicorn, bear, skull, dragon, poop, snake, and others, including the animals from the Chinese zodiac. Customers can choose text or an emoji, but not both as the emoji is done in a larger style. Apple has also tweaked the text that can be added to the AirPods, bumping up the size.\nCustomization options with emoji are available for all AirPods models and apply to the Charging Case for each order.\nThanks, Stanford!",
        "sentiment": 0.1907911453396082
    },
    "article_7": {
        "title": "Two iPhones or the privacy of billions: Why Apple vs. the FBI matters",
        "body": "Two iPhones have put Apple back into the FBI’s sights.\nThe phones belonged to a deceased Saudi national accused of fatally shooting three people at a Florida naval base in December. They could contain important information about his connections and motivation, but the phones are locked and the FBI says it can’t get in. It wants Apple’s help to unlock the phones.\nBut Apple is saying no, and it has its reasons, even at the risk of attracting mocking tweets from President Donald Trump.\nApple and technology security experts have heard this kind of request before. And they say it’s not about the phones — it’s about a yearslong push by the Department of Justice for broader government oversight of mobile technology. If Apple says yes to this request or anything like it, they say, it would jeopardize the privacy of every single iPhone user.\nAlmost four years after a nearly identical situation ended with the FBI backing down — when private companies helped them crack the iPhone's security — the debate about whether Apple should create a way to break into their own phones is back.\nThe circumstances, however, have changed. Apple has limited its own capability to break the encryption of iPhones, so it may not be able to do much even if it were willing to, while Facebook and other tech companies have moved to embrace encryption in other forms such as messaging apps, raising the stakes of the fight.\nAnd politically, the tech industry may be vulnerable in a way that it’s never been before.\n“There’s blood in the water,” said Riana Pfefferkorn, associate director of surveillance and cybersecurity at the Stanford Center for Internet and Society. “And this becomes a way for law enforcement to try to draw attention to encryption.”\nWhile the core argument remains the same — there’s no way to give the government access without introducing an opening that can be exploited by nefarious actors — it’s taking place at a time when tech companies are now routinely grilled on Capitol Hill and the public is less likely to trust that they know best.\nTech industry veterans and academics believe the Justice Department sees an opportunity to not just crack a couple iPhones but also to capitalize on growing skepticism of tech companies to spur legislative change that will render encryption moot in all contexts.\nNicholas Weaver, a computer scientist at the University of California, Berkeley, said that the FBI’s efforts to push Apple to crack its own iPhones were “more disingenuous than normal.”\n“It’s entirely about legislation, not the courts,” he said.\nAt issue are two iPhones owned by the gunman who carried out a shooting last month that killed three people at the Naval Air Station Pensacola, in Florida. There are some parallels with the FBI efforts four years ago to get Apple to unlock an iPhone from the San Bernardino shooting that killed 14 people — a dispute that ended with the government breaking the phone’s security with the help of an outside vendor.\nIn the Pensacola case, the phones have been described as earlier model iPhones 5 and 7, which many technology experts say the FBI should also be able to unlock with the help of outside security vendors.\nSo if the FBI can break into the phones, why is Attorney General William Barr formally asking Apple to provide the key? The answer appears to lie in the legal history of the matter, and the government’s desire for a permanent solution.\nIn the time since the San Bernardino dispute, government officials have been dealt two major setbacks in court: a 2016 ruling in an unrelated but similar case in Brooklyn, New York, siding with Apple and never appealed, and a 2018 ruling out of Fresno, California, though the details of that case and ruling are sealed and the case is on appeal.\nThat’s left the Justice Department with narrower legal options to push tech companies to crack their own security systems.\n“They have recognized that the law as it stands is not on the government’s side,” Pfefferkorn said.\nThere is not consensus in the government that the Justice Department is pursuing the right course of action. While President Donald Trump tweeted for Apple to give in to the FBI, other agencies have disagreed with the Justice Department and the FBI, and the Trump administration hasn’t released a consensus policy document.\nMorgan Reed, president of The App Association, a trade group for software companies that says it has more than 5,000 members, met on Thursday with staff from the White House National Economic Council and the Office of Science and Technology Policy.\nHe said that despite the president’s tweets, the two offices are concerned that the FBI’s efforts could hurt U.S. companies.\n“They want to solve the problem, as well, but they want to solve the problem in a manner that protects the economic security of the United States,” he said.\nReed also said the Justice Department's efforts were more to spur legislative change than to gain access to any particular iPhone.\n“They’re using this crisis to essentially drive for a policy change that ultimately would require some potentially devastating technological changes that would put people’s personal information at risk,” he said.\nThe White House had no immediate comment Friday. Representatives for the Justice Department did not immediately respond to a request for comment.\n“It is very important to know with whom and about what the shooter was communicating before he died,” Barr said Monday.\nNo such split exists in the broader technology industry. Tech companies and privacy advocates who are often at odds on most topics remain united in their opposition of the FBI’s efforts.\nBut the tech industry does face shifting social and political dynamics that have put it on the back foot. A Pew Research Center survey from June 2019 found that the percentage of both Republican and Democratic supporters who see tech as having a positive impact has dropped sharply in recent years, and a survey by Axios and SurveyMonkey found growing support for greater regulation of tech companies. Democratic presidential candidates now include tech policy ideas as part of their platforms.\nGovernment efforts to limit or compromise encryption have also gained traction outside the U.S., drawing more coordinated efforts in the tech industry. In December, a coalition of 102 organizations and individuals sent a letter to senior officials in the U.S., the United Kingdom and Australia warning that compromising encryption would hurt the privacy and security of billions. The three countries had earlier sent a letter to Facebook CEO Mark Zuckerberg asking him to delay plans to expand end-to-end encrypted messaging.\nThe FBI has likewise been grilled on its own credibility. An inspector general report from 2018 said that the FBI headed to court against Apple in the San Bernardino dispute without first exhausting its technical options. And the FBI acknowledged to The Washington Post that it had repeatedly inflated the number of devices it couldn’t access.\n“We don’t have any actual data proving this is a serious problem,” said Andi Wilson Thompson, a senior policy analyst at New America’s Open Technology Institute.\nFor now, technologists and lobbyists see something of a stalemate, with no pending legislation or compromise gaining traction. Previous efforts to pass legislation around encryption and government access have fallen flat, with a 2016 bipartisan encryption bill roasted by critics as “technically illiterate.”\nAnd with much of Washington focused on the ongoing impeachment trial, Pfefferkorn said she is not too worried in the near term.\n“Congress seems to be a little busy right now,” she said.",
        "sentiment": -0.4408469610184861
    },
    "article_8": {
        "title": "Rumor: iOS 14 to support all of the same iPhones as iOS 13, including iPhone SE",
        "body": "Apple is expected to unveil iOS 14 and iPadOS 14 at WWDC in June. Ahead of that release, a new rumor from French site iPhonesoft suggests that this year’s iOS release will support all of the same devices as iOS 13 did last year, but iPadOS will make some cuts.\nAccording to the rumor, iOS 14 will continue to to support the iPhone SE as well as the iPhone 6s. Every other device introduced since then will also be supported, the rumor says.\niOS 14 devices:\niPhone 11 Pro\niPhone 11 Pro Max\niPhone 11\niPhone XS\niPhone XS Max\niPhone XR\niPhone X\niPhone 8\niPhone 8 Plus\niPhone 7\niPhone 7 Plus\niPhone 6s\niPhone 6s Plus\niPhone SE\niPod touch (7th generation)\nOf course, iOS 14 will also support all of the 2020 iPhones, including the rumored low-cost iPhone SE 2/iPhone 9, as well as the iPhone 12 lineup. Today’s rumor also hedges that it’s possible Apple may end up dropping support for the iPhone SE and iPhone 6s depending on the next several months of development.\nAs for the iPad lineup, today’s rumor says Apple will drop support for the iPad mini 4, originally introduced in September of 2015, and the iPad Air 2, introduced in October of 2014. These devices are powered by the A8 and A8X chips.\n12.9-inch iPad Pro\n11-inch iPad Pro\n10.5-inch iPad Pro\n9.7-inch iPad Pro\niPad (7th generation)\niPad (6th generation)\niPad (5th generation)\niPad mini (5th generation)\niPad Air (3rd generation)\nThis rumor should be treated with some skepticism, though. Last year, iPhonesoft said that iOS 13 would drop support for the iPhone SE, but that ultimately was not the case. The site did accurately predict that the iPhone 5s and iPhone 6 would be left on iOS 12, however.\nApple has an incentive to keep as many iPhone and iPad devices on the latest version of iOS 14 as possible, namely security and access to the latest features of subscription services like Apple TV+ and Apple Arcade. That, of course, is also part of the reasoning behind the upcoming iPhone SE 2/iPhone 9.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.010381981606284778
    },
    "article_9": {
        "title": "I made an Apple Watch app to keep score of 9 or 18 rounds of golf. It's totally independent from the phone and has no in app purchases/ads, and no signup process. I just wanted to learn how to make watch apps.",
        "body": "shannon_mac ,\nThis watch app as a scorecard works GREAT. Intuitive, simple and just what I needed without a ton of other stuff I don’t want. I appreciate that you get movement and workout credit for closing your activity rings in the health app and keep the app in the forefront on the watch while playing without having to keep opening the app.\nThe BUT is for the things I wish it did.\n1. (Even as a stand-alone watch app) I wish you could add a course name so you could know what course you played. For now I just screenshot my score. I don’t like the method but it’s not enough to dump the app at this point.\n2. I wish it also had a phone app that you could save all your scores to. Or to be able to export your scores to something (like a note?) to be able to look back at etc.\nMinor but not yet a dealbreaker.",
        "sentiment": 0.17874453847224897
    },
    "article_10": {
        "title": "Apollo for Reddit adds comment search, GIF sounds, community icons, and much more",
        "body": "Apollo for Reddit is the leading third-party Reddit app for iOS, and it’s getting even better today. The app has been updated to version 1.7, bringing a host of new features and capabilities: comment search, GIF sounds, advanced filters, and more.\nFor those unfamiliar, Apollo for Reddit is a powerful Reddit client for iOS with a focus on streamlined navigation and a media-first design. Its gesture-based system sets it apart from the official Reddit app for iOS.\nWith today’s update, Apollo for Reddit has added support for searching in comments. This feature is currently available to Apollo Pro users, but it will be available to all users in March. There’s also now support for searching saved items.\nJust like on desktop Reddit you can now search through a comments thread for keywords and jump directly to them, it’s so handy for seeing if something specific was mentioned, or finding a user, or a mirror for a video.\nApollo for Reddit also now supports GIF sounds. GIFs that have audio are becoming increasingly popular, and this update means you can now take part in the fun with Apollo. Here are the details on new filtering:\nA few parts to this. The first is now for people who like to filter a lot of things, you can now filter more than 100 subreddits from r/All and r/Popular. Reddit has an account limitation that limits it to 100 (which was why you couldn’t before) but now for Pro users once you hit 100 it’ll store them locally on your phone and handle it from there. The other element is that it’s a lot easier to add filters now, you can filter subreddits directly from the post/subreddit and you can block users directly from their profile, no more needing to manually type it in.\nVersion 1.7 of Apollo for Reddit includes quite a few other changes as well. There are new photo uploading and saving features, new sorting options for threads, the ability to mute and unmute comment threads, and much more. From a design standpoint, there are also new custom icons available with today’s update.\nThe full release notes can be viewed in the announcement post on Reddit.\nThe Apollo for Reddit update is rolling out now on the App Store. The app is a free download with in-app purchases.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.4228902568363331
    },
    "article_11": {
        "title": "Indie Apple Watch developer donating all proceeds to help battle the Australian bushfires",
        "body": "The developer behind widely popular Apple Watch applications like Chirp, Nano for Reddit, and MiniWiki is giving 100% of the proceeds from this weekend’s sales to help combat the widespread bushfires in Australia.\n$3051 Three thousand, and fifty one dollars! THREE THOU… ok you get it… That's how much we just raised for the @CFA_Updates, @NSWRFS, and @CFSAlerts. Thank you so so much. Seriously was hoping for $500, or $1000 at most. You have all blown me away. Thank you. — Will Bishop (@WillRBishop) January 7, 2020\nDeveloper Will Bishop lives in Australia and knows first-hand how bad the Australian fires have gotten. According to The New York Times, Australian bushfires have resulted in 23 deaths and destroyed 1,300 homes so far. That’s in addition to countless animals and the tens of thousands of acres of national park and forest land that has burned.\nWill develops three popular and powerful Apple Watch apps: Chirp for accessing Twitter on your Apple Watch, Nano for browsing Reddit from your Apple Watch, and MiniWiki for Wikipedia access from your Apple Watch. All three of these applications feature a “pay-what-you-want” system for their “Pro” tier.\nWill has committed to donating 100% of the proceeds from those “Pro” upgrades to the rural fire services in South Australia, New South Wales, and Victoria. All proceeds from yesterday (Friday) through Sunday will be donated. This means that if you upgrade to the “Pro” version of these applications, the amount you chose to pay will go directly to help fight the Australian bushfires and associated relief efforts.\nAnd, if you’ve already bought the Pro version in any of Will’s applications, each of them also has an in-app tipping jar where you can contribute however much you want to the cause.\nYou can download Will’s apps on the App Store at the links below:\nWill’s apps for the Apple Watch are some of the best around, and if you’ve been holding out on upgrading to the “Pro” versions, there’s no better time to do it.\nFor the next 48 hours, all proceeds from Chirp, Nano, and MiniWiki will be donated to rural fire services across New South Wales and Victoria! If you already bought the upgrades, please consider using the tipping jar.#AustraliaBushfires #AustraliaOnFire #RT Appreciated! — Will Bishop (@WillRBishop) January 4, 2020\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.012352213602174412
    },
    "article_12": {
        "title": "Future iPhones may act as emergency beacons even without cell service",
        "body": "Future iPhones may switch off the screen to save power and broadcast an emergency signal\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA new patent describes multiple ways in which an iPhone could use cell signals, wi-fi or even other nearby devices to get an emergency distress beacon out, plus ways of prolonging the battery until rescue arrives.\nExisting iPhones are able to alert the authorities on command, but Apple is planning new ways to help users in areas where regular cellphone coverage is either unavailable or problematic. A new Emergency Power Save Mode (EPSM) will be able to broadcast a distress signal in multiple different ways while also minimizing battery use in order to keep the device working until the user is rescued.\n\"Mobile electronic devices may take the form of smart phones or tablets that a user typically carries,\" begins Apple in US Patent No 20200015169, \"Enhanced Emergency Beacon Sending Procedure\".\n\"These and other devices may be carried by users in remote locations and a user may desire to broadcast an emergency beacon in a location that is not covered by cellular service,\" it continues.\nApple intends its procedures to become as much of a universal standard as possible, to the extent that the patent describes it being implemented on devices from PlayStation Portable to smart glasses and Android phones. Apple refers to all of these devices as User Equipment (UE).\n\"[The] UE may be configured to broadcast an emergency beacon in response to user input,\" says the patent. \"For example, a user may become lost or injured while hiking and may use an emergency beacon broadcast feature to notify other users or base stations in the area... and as described in greater detail below, the emergency beacon broadcast feature may operate as an off-grid radio service (OGRS) when the UE does not have an active connection to a base station or other wireless access point.\"\nThere are broadly two elements to the procedure in the patent, starting with power saving.\n\"If a user of a UE is in a dire situation or another situation that would benefit from emergency beacon broadcasting or beacon broadcasting in general, a significant amount of time may pass before a broadcast emergency beacon is successfully received by another user or a base station and help is mobilized to assist the user,\" it says.\n\"For example, a user in a remote rural location may not be within a communicatively effective distance from other UEs or base stations capable of receiving the emergency beacon. As such, it may be desirable for the UE to be able to broadcast emergency beacons over an extended period of time, to increase the likelihood of a successful reception of the broadcast,\" it continues.\nDetail from the patent showing that the screen is the first thing to be switched off in order to save power in emergencies\nSince such a user is unlikely to have access to power to recharge the battery, Apple says the power level \"may potentially reduce the chance that the emergency beacon is successfully broadcast and received before the battery is drained.\"\nUnder Apple's proposed system, a user could elect to manually turn on the Emergency Power Save Mode. Or could choose beforehand to have it be automatically turned on when the battery falls below a specified amount.\nIn either case, once enabled, the EPSM would switch off the display, one of the biggest drains on battery life. The patent details the different power demands of the display, backlighting and \"various other processes... over Wi-Fi and... GPS.\"\n\"[EPSM will] preserve battery while enabling emergency beacon broadcasting through efficient handling of the display of the device and radio frequency (RF) signaling.\"\nThe second part of the procedure involves how the emergency signal is broadcast. That includes attempting to locate and use a nearby cell service or local wi-fi network.\n\"[Alternatively,] emergency beacon may be an off-grid radio service (OGRS) device-to-device (D2D) communication. For example, the UE may broadcast an emergency beacon according to existing D2D communication protocols,\" says the patent. \"The emergency beacon may be receivable by other UEs and/or by base stations.\"",
        "sentiment": -0.31622232764959335
    },
    "article_13": {
        "title": "Every Mac wallpaper from 10.0 Cheetah to 10.15 Catalina – in a single image",
        "body": "What would happen if you took the default image for every Mac wallpaper from Cheetah to Catalina, and combined them into a single image? The above, is what…\nI’m a Brit, so not prone to using a word beloved of many Americans, but I think this may be officially awesome.\niOS theme developer Jenny Vanille chose Xmas day to tweet her work, so not many noticed it, but TNW spotted it today.\nIt’s phenomenal. It’s like a magic eye painting. Or one of those weird drawings an AI created. In other words, it’s art.\nVanille thinks no-one will ever use it.\nNo one asked for this. But here it is: every macOS wallpaper from Mac OS X 10.0 Cheetah to macOS 10.15 Catalina combined. I highly doubt that anyone will ever use this.\nI can already prove her wrong.\nIf you want to use it as your own Mac wallpaper, you can download a 5K version here. While you’re there, you can also grab every iOS wallpaper in one image, as well as all the iPhone 11 wallpapers combined.\nTNW doesn’t show every Mac wallpaper used but does provide an overview of the various generations to give a feel for how they’ve evolved over the years. As well as fantasizing about what I agree would be the best job in the world.\nI like to think that somewhere inside the bureaucratic labyrinth of Apple’s employee structure, there’s a single person with the world’s greatest job. Each year, they only have to do a single thing: Traverse the world and try to take a sick photo of a landscape for the latest macOS wallpaper.\nI suspect the reality is more like sitting at a desk searching photography sites for images offering exclusive rights for sale …\nWhich is your favorite default Mac wallpaper? And what do you think of this one? Let us know in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.10103295662480852
    },
    "article_14": {
        "title": "36 Years Ago Today, Steve Jobs Unveiled the First Macintosh",
        "body": "On January 24, 1984, former Apple CEO Steve Jobs introduced the first Macintosh at Apple's annual shareholder's meeting in Cupertino, California, debuting the new computer equipped with a 9-inch black and white display, an 8MHz Motorola 68000 processor, 128KB of RAM, a 3.5-inch floppy drive, and a price tag of $2,495.\nThe now iconic machine weighed in at a whopping 17 pounds and was advertised as offering a word processing program, a graphics package, and a mouse. At the time it was introduced, the Macintosh was seen as Apple's last chance to overcome IBM's domination of the personal computer market and remain a major player in the personal computer industry.\nComputerland newspaper ad from the day the Macintosh was introduced\nJobs pulled the Macintosh out of a bag at the event, powered it on, and the Mac had a little message for everyone in attendance.\nHello, I'm Macintosh. It sure is great to get out of that bag. Unaccustomed as I am to public speaking, I'd like to share with you a maxim I thought of the first time I met an IBM mainframe: NEVER TRUST A COMPUTER YOU CAN'T LIFT! Obviously, I can talk, but right now I'd like to sit back and listen. So, it is with considerable pride that I introduce a man who's been like a father to me... STEVE JOBS.\nDespite the high price at the time, which was equivalent to around $6,000 today, the Macintosh sold well, with Apple hitting 70,000 units sold by May 1984. The now iconic \"1984\" Super Bowl ad that Apple invested in and debuted days before the Macintosh was unveiled may have helped bolster sales.\nAfter the Macintosh, Apple introduced the Macintosh II, the Macintosh Classic, the PowerBook, the Power Macintosh, the iMac G3, the iBook, and so on, eventually leading to the current Mac lineup, which includes the MacBook Air , MacBook Pro, ‌iMac‌, ‌iMac‌ Pro, Mac mini , and Mac Pro\nToday, Apple is one of the leading PC vendors in the world, shipping an estimated 18 million Macs worldwide in 2019. Then Apple competitor IBM is no longer in the personal computer business, having sold its technology to Lenovo back in the early 2000s.\nApple in the future is expected to continue expanding its popular Mac lineup, and current rumors suggest we can expect to see new 16-inch MacBook Pro models, a refreshed 13-inch machine with scissor keyboard, and, eventually, an ARM-based Mac.",
        "sentiment": 0.3557835020391004
    },
    "article_15": {
        "title": "Apple’s iPad changed the tablet game 10 years ago today.",
        "body": "Steve Jobs stepped onstage 10 years ago today to introduce the world to the iPad. It was, by his own admission, a third category of device that sits somewhere between a smartphone and a laptop. Jobs unveiled the iPad just days after the annual Consumer Electronics Show ended in Las Vegas and at a time when netbooks were dominating personal computing sales.\n“They’re slow, they have low quality displays, and they run clunky old PC software,” said Jobs, mocking the PC industry’s obsession with netbooks. “They’re not better than a laptop at anything, they’re just cheap laptops.”\nApple had an answer to the netbook: a 9.7-inch tablet that allowed you to hold the internet in your hands. Central to the iPad and Jobs’ marketing pitch was the ability to have a full browser that you could manipulate with your fingers. Apple’s iPhone had been pushing the boundaries of the mobile web at the time, but Jobs boasted that the iPad was “the best browsing experience you’ve ever had.”\nApple was also looking to create a third category of device that was better at certain tasks than a laptop or smartphone. The iPad was designed to be better at web browsing, email, photos, video, music, games, and ebooks. “If there’s going to be a third category of device it’s going to have to be better at these kinds of tasks than a laptop or a smartphone, otherwise it has no reason for being,” said Jobs.\nRumors about the iPad had been persistent in the build-up to Apple’s press event in January 2010. CES attendees were anticipating some type of slate device, and Microsoft employees who I spoke to at the time laughed off the rumors. Microsoft had just launched Windows 7, and it had some minor improvements to touch capabilities.\nSteve Ballmer, Microsoft’s CEO in 2010, used his keynote at CES to demonstrate “slate PCs” from manufacturers like Pegatron, Archos, and HP. These devices were running the “clunky old PC software,” that Jobs mocked days later, and Ballmer struggled to navigate the HP Slate device to demonstrate Kindle software and video playback. It was just Windows 7 squeezed onto a new form factor, with very little changes. Microsoft had originally attempted to launch the idea of tablet PCs back in 2001, with a Windows XP Tablet PC Edition derivative, and even special ultra-mobile PCs in 2006 — but both initiatives flopped.\nApple’s iPad presented something new a decade ago, something that looked like a significant challenge to netbooks, laptops, and even Windows itself. The idea of a third category of devices, namely tablets, was difficult for many to process at the time. The iPad was widely mocked for its name in the days after the announcement, and some analysts had already predicted it would flop before it was even announced. Wired labeled it “little more than a giant iPhone,” and there were predictions that it wouldn’t be a significant product line for Apple.\nApple went on to sell 300,000 iPads on the first day of sales, and it broke 2 million sales less than two months later. After selling 7.5 million iPads in 2010, Apple sold 32.4 million iPads in 2011, 58.3 million in 2012, and 71 million in 2013. The naysayers were proven wrong almost immediately, and Apple has sold well over 350 million iPads to date, even though sales peaked in 2013.\nResponses to the iPad have been varied since its 2010 introduction. Microsoft pivoted hard to a touch-friendly user interface in Windows 8 for its launch in October 2012, and the company even launched its own line of Surface tablets that were designed to compete with the iPad. PC makers rushed to create a range of different tablet and laptop hybrids, but Microsoft went too far with Windows 8 and walked a lot of its touch-friendly changes back with subsequent updates and the launch of Windows 10.\nMicrosoft’s Surface RT tablet.\nAndroid OEMs have also tried to compete with the iPad with varying degrees of success. Samsung launched its Galaxy Note series of tablets and smartphones nearly two years after the iPad’s introduction, and the smaller phone-like versions have certainly proved more memorable than the larger tablets.\nAmazon also launched a range of Fire tablets, which have become Apple’s closest competitor in the tablet space simply due to their low prices. Android has struggled to adapt to larger screen sizes, and app developers haven’t fully embraced tablet apps on Android.\nThe success of the Galaxy Note and Apple’s experiments with the iPad Mini have all left the market open for Android to really succeed with larger phones rather than tablets. This has meant that, even today, there’s still no clear competitor to the iPad. Amazon, Samsung, Microsoft, and others have simply carved out a different part of the overall tablet market to offer something different to the iPad.\nApple has also adapted along the way. While the iPad launched as a pure tablet device 10 years ago, it looks a lot more like it wants to be a Surface in 2020. All of Apple’s bigger iPad devices now support a keyboard and stylus input. Those have been key to the Windows tablet market for years, and Apple has also been adapting its iPadOS so the operating system and hardware is capable of more laptop-like tasks.\nThe iPad has long been an in-between device as Apple intended, and it has largely achieved its goals of being good for the consumption tasks that Steve Jobs laid out. It never killed netbooks, though, as they merely adapted and morphed into touchscreen laptops. Intel’s big Ultrabook push helped here, and the technology has trickled down to the point where every Windows laptop ships with a touchscreen now, even at very low price points.",
        "sentiment": -0.026843349384360535
    },
    "article_16": {
        "title": "[SPS] My first ever mobile game: “Disc Brick”. No ads, no consumables—a simple, but fun, completely free-to-play game",
        "body": "Uegwjjwkajsgu ,\nSaw this game after the creator posted it on Reddit and I love it. I’ve spent wayyyy to much time on this game for my own good (just hit 174). It gets 4 stars due to a few simple things that should be changed. The main one is that the 2x power ups should be stackable, as I find almost no reason to save them after another one shows up on the board. The second thing is that the 2x power ups should be more consistent. Sometimes I’ll be playing and they will show up twice in a short period of time when i don’t even need them, and then other times I will have gone through 30-40 before finding them. This brings me to my last point, which is the predictably. After playing this game for about a month at least 2 hours a day, I can name exactly when the big waves of blocks come. There are ones ~ 30,50,68,88,114,135,150,180. I don’t think i should be able to say that. One more thing, there is this feature where two blocks that are next to each other can be hit at the same time. I’ve tried mastering the skill of consistently hitting them, but it is always a gamble. I can’t tell if this is a bug or a feature, but IMO it either needs to be turned off or given a larger margin of error so it can be used as a real strategy instead of a gamble.",
        "sentiment": -0.37144705882439244
    },
    "article_17": {
        "title": "Apple Plans to Switch to Randomized Serial Numbers for Future Products Starting in Late 2020",
        "body": "In an internal memo shared with Apple Authorized Service Providers, Apple has indicated that it plans to update its serial number format to a randomized alphanumeric string for future products starting in late 2020 (update: Apple now says 2021). Apple says all serial numbers that exist before the change is made will remain the same.\nApple already uses alphanumeric serial numbers, but it has long been possible to determine the date and location that a product was manufactured based on the current format. Readers would often use serial numbers to glean more information about their devices. The randomized format would likely not be decipherable, or at least hard to, and it could also help to reduce fraud.\nThe memo was published today and obtained by MacRumors from a reliable source. It is unclear if the change will apply worldwide.\nUpdate: Apple has delayed this change until some point in 2021, according to an internal document viewed by MacRumors.",
        "sentiment": -0.43796193099115044
    },
    "article_18": {
        "title": "Apple Now Has 1.5 Billion Active Devices Worldwide",
        "body": "In today's earnings release where Apple reported record numbers due to the strength of iPhone sales, wearables, and services, Apple said that it now has 1.5 billion active devices.\nApple CEO Tim Cook said that the milestone was hit over the holiday period, and serves as a \"powerful testament to the satisfaction, engagement and loyalty of our customers -- and a great driver of our growth across the board.\"\nApple's active installed base include ‌iPhone‌, iPod touch, iPad, Mac, Apple TV, and Apple Watch models in use around the world.\nThe active install base has grown from 1.4 billion, a number that Apple reported in January 2019.",
        "sentiment": 0.3562709406251088
    },
    "article_19": {
        "title": "The Unofficial Apple Archive is on a mission to save Apple history and inspire new creators",
        "body": "“I totally forgot that Rihanna was used as the track for an iPad 2 guided tour. What a weird year.” Sam Henri Gold was giving me a progress update on what would eventually become The Apple Archive. He had just made it to 2011. Compiled from hundreds of videos and images spanning Apple’s near 44-year history, the collection is believed to be one of the largest of its kind ever made available. It launches today.\nLike Sam, I had no recollection of Rihanna’s introduction to the iTunes Store app on iPad 2. I wasn’t aware of the Apple Store demo loops for the Power Mac G4, either. But I am fond of the “Solar” spot that launched the first aluminum iMacs and helped spark my lifelong interest in Apple. And I could never forget the “Next Level Fun” ad for the third-generation iPod touch that I watched frame by frame and attempted to recreate in my basement as a teen with more time than resources.\nThat’s what The Apple Archive is all about. Sam hopes the collection he’s compiled will inspire the next generation of designers, developers, and Apple fans by preserving the company’s legacy of creativity. His first Apple product was a 2005 iPod nano, gifted to him on his fourth birthday. The rest, you might say, is history.\nApple online store launch press images, 1997\n“The whole project began for me when the EveryAppleAds YouTube channel was taken down in April 2017,” Sam says. “I was away in Massachusetts at the time, so I just started by going on YouTube and typing in “apple commercial 1976,” downloading whatever I could, and stuffing the videos in an iCloud Drive folder. I only had a hundred or so videos when I started up a YouTube channel. I think it remained up for a whopping six days before my channel was abruptly removed without a trace. Had it remained up on YouTube, I think I would’ve neglected the archive a lot more than I have.”\nIn June 2019, Sam opened up an early version of his archive as a public Google Drive folder. But the project didn’t last. Traffic quotas and security vulnerabilities sunk the ship. A promising collaboration with The Internet Archive fell through when Sam needed to find a way to stop people from bulk downloading the entire collection. Now he’s landed on a solution that works. Vimeo provides a locked-down player to deter downloads and significantly less video compression than YouTube. The Apple Archive has never been about piracy. Its mission is preservation.\nhttps://player.vimeo.com/video/375316032\n“Gamma” (1080p), 2008\nFinding content for the archive hasn’t been easy. YouTube is littered with unorganized duplicates and low-res uploads that have been distorted through an online game of telephone. Many of the clips and images were virtually lost to time until being resurfaced over the past year (have you ever seen the 2000 “Snowglobe” ad for the iMac G3?) Sam says these unreleased odds and ends are some of his favorite parts. “While I’m not willing to share how I’ve obtained them in order to protect my sources, they’ve been very accommodating to this very charming young man and his passion project,” he adds.\nNow that The Apple Archive has a permanent home, complete with appropriately-styled title cards for each year in Apple’s timeline, Sam is undertaking several projects to expand and streamline the collection. Videos are being transcoded to save space and subtitles added for accessibility where Apple has already created .vtt files.\niPhone 4s print ads, 2011\nThe full collection spans over 15,000 files and just under 1TB of data. PDFs, print ads, WWDC sessions, obscure clips from the ‘80s, and an unabridged collection of macOS and iOS wallpapers are among the additions still on the way. New content will be announced on Twitter.\nMaintaining a project this large is costly in both time and resources, so Sam welcomes monetary donations to keep the archive running. Content donations are also appreciated. “I’m always looking for nice, higher resolution copies of anything. I’m even open to accepting physical media,” he adds. That invitation extends to creatives who’ve worked with Apple and may wish to anonymously donate material.\nSam knows his efforts could be rendered useless with one word from Apple. But he hopes the amicable and educational nature of the archive will keep it online, because the Apple community deserves no less.\n“I think we’ve seen what a world without a public archive would look like, a world littered with tiny archive channels, maybe one or two god-awful screen recordings of keynotes with giant *UNREGISTERED HYPERCAM 2* watermarks. That’s not a world I want to live in. That’s not a world anyone should have to live in. When I got my nana’s 2006 iMac, I bought iWork solely to recreate Macworld keynotes I had watched on YouTube, right down to the slide transition. I don’t know if there are still kids that do that, but I hope this project and the past three years of file management hell I’ve put myself in will help that kid with their Stevenote re-creation.”\nYou can take a trip down memory lane and browse The Apple Archive here.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.17586112081038732
    },
    "article_20": {
        "title": "Apple Providing Free Replacement AirPods Pro Tips Under AppleCare+",
        "body": "Customers who have AirPods Pro that also purchased an AppleCare+ protection plan for $29 appear to be able to receive free replacement tips for their ‌AirPods Pro‌.\nMultiple MacRumors readers have reported being provided replacement tips at no cost after going through Apple's support repair steps for the ‌AirPods Pro‌.\nFrom MacRumors reader Boshii:\nI'm not sure if it's an AppleCare+ thing or not but I set up the replacement online and there was no fee. I was under the impression that there will be a cost even with AppleCare+.\n‌AirPods Pro‌ owners with ‌AppleCare‌+ who want to order replacement tips can do so by going to the Apple support site, choosing the ‌AirPods Pro‌, picking the option to replace an AirPod or an ear tip, selecting the option to replace the ‌AirPods Pro‌ ear tips, and then choosing the order replacement option.\nWhen ordering replacement tips, Apple sends one pair in a specified size only, and it's not clear if there's a limit on the number of free replacement tips that can be ordered.\nApple's support site and the ‌AppleCare‌+ page for headphones don't mention the possibility of free replacement tips, instead suggesting the tips will have a $3.95 replacement fee. Ordering AirPods tips without ‌AppleCare‌+ incurs the aforementioned $3.95 fee.",
        "sentiment": -0.0439685070887208
    },
    "article_21": {
        "title": "iPhone 12 Lineup Rumored to Feature All-New Navy Blue Color Option",
        "body": "At least one iPhone 12 model will come in a new Navy Blue finish, according to XDA Developers writer and leaker Max Weinbach, who shared his information with YouTube channel EverythingApplePro.\nWeinbach believes that Navy Blue could replace the Midnight Green finish available for iPhone 11 Pro models. In line with this, EverythingApplePro created a mockup of what the iPhone 12 Pro in Navy Blue could look like.\niPhone 12 Pro in Navy Blue concept via EverythingApplePro/Max Weinbach\nWeinbach has accurately revealed a new iPhone color in the past. In May 2019, through his Twitter account PineLeaks, he said the successor to the iPhone XR would come in a new light green color. However, he said the green option would replace yellow, and the iPhone 11 is available in both green and yellow.\nWeinbach also accurately predicted that the volume HUD would become less obtrusive in iOS 13, but he has also shared several Apple-related rumors that did not pan out, including the iPad getting a native Calculator app in iOS 13 and the HomePod launching in Austria and Italy within 2019.\nThe iPhone XR successor will come without the yellow color we saw last year, but with a new light green color.\nThe shade of this green is comparable with the blue we currently have. It will be a quite bright color, but not too flashy. — Pine (@PineLeaks) May 10, 2019 So just got some amazing news... In iOS 13 the volume HUD is gone! Apple is finally fixing their software!\nIt's also supposed to be ground breaking but whatever. — Max Weinbach (@MaxWinebach) February 19, 2019\nWeinbach has a more established track record with Android-related rumors, most recently including alleged Samsung Galaxy S20 leaks\nWatch this EverythingApplePro video for a closer look at the Navy Blue concept:\nApple plans to release five new iPhone models in 2020 , including the so-called \"iPhone 9\" or \"iPhone SE 2\" with a 4.7-inch display in the spring and a higher-end, OLED-and-5G lineup with one 5.4-inch model, two 6.1-inch models, and one 6.7-inch model in the fall, according to analyst Ming-Chi Kuo.",
        "sentiment": 0.04749063096408333
    },
    "article_22": {
        "title": "Revamped Apple Maps Completes US Rollout",
        "body": "Apple in December began testing an expansion of its more detailed Apple Maps app in the Central and Southeastern parts of the United States, along with Alaska, and that updated Maps content is now rolling out to all customers.\nThe revamped Maps app features more extensive geographical details, with updated buildings, roads, parks, sports fields, parking lots, foliage, pools, pedestrian pathways, and bodies of water.\nTo get its mapping data, Apple uses its own vehicles equipped with LIDAR sensors and cameras. Apple has been using this method to collect mapping information for years now.\nApple began rolling out its updated mapping app to customers starting in iOS 12, and at the 2019 Worldwide Developer Conference, Apple said all customers in the United States would receive the improved Maps app by the end of the year.\nApple has made good on that promise with the rollout of the new mapping terrain to large swathes of the United States, and the updated Maps are now becoming available across most of the country. It could still take some time for all users in the Central and Southeastern areas of the U.S. to see the new content. Apple plans to bring the new Maps app to additional countries in 2020.\n(Thanks, @tricil and @NateThompson!)\nUpdate: Though Apple has begun releasing the new mapping updates across the United States, updated Maps features are not yet showing up for all users in the Southeast at this time.\nUpdate 2 — Jan 30, 2020: The rollout of revamped ‌Apple Maps‌ in the Southeast and Central United States now appears to be complete. This includes the addition of traffic lights and stop signs in ‌Apple Maps‌ on CarPlay.",
        "sentiment": 0.2597927851602435
    },
    "article_23": {
        "title": "AirPods Pro owners complain of worse noise cancellation after firmware updates",
        "body": "Some AirPods Pro owners have been complaining about degraded noise cancellation in recent weeks, claiming that Apple’s latest earbuds suddenly got less effective at silencing ambient noise after receiving a firmware update. Rtings.com retested the AirPods Pro and found their noise canceling capabilities to be worse after firmware update 2C54. But affected customers say the trouble began even earlier with firmware version 2B588, which rolled out in November. (Apple later pulled firmware 2C54 for unknown reasons.)\nThis phenomenon — the perception that a software update has “ruined” noise cancellation — has also been reported by owners of Bose and Sony headphones. Bose has faced a months-long controversy over its QuietComfort 35 II headphones, with some customers insisting that an update drastically worsened the level of noise cancellation from the cans compared to their original out-of-the-box performance. There are a lot of people who say they’ve experienced this issue, and it’s escalated to the point where Bose is now visiting customers at home to get a handle on whatever’s going on. Sony also dealt with similar complaints about its 1000XM3 headphones.\nAre companies really screwing up this badly, or are customers imagining a problem where one doesn’t exist? The Rtings tests suggest something changed; the site found that Apple has also been slightly tweaking the sound profile of the AirPods Pro with these updates. A few editors at The Verge think they’ve noticed a difference, and others haven’t, but that’s by no means scientific.\nSince the original AirPods, Apple has chosen to make the firmware update process completely invisible to customers. The entire process happens in the background without so much as a single notification. You can’t reject AirPods software updates, nor is there any direct way to force the update process on demand; you plug a charging cable into your AirPods case, put them near your iPhone, and wait. Once a firmware update is installed, you’ll notice the new version in settings.\n(To check, open Settings, then pick General, then About. Whenever your AirPods are connected to your iPhone or iPad, you’ll see a section for them beneath the “EID” row.)\nThis everything-happens-in-the-background approach means there’s no way to downgrade or revert an AirPods Pro update back to a previous one if you encounter a problem. Some AirPods Pro owners are convinced noise cancellation took a downturn right after that first 2B588 update, and they were left without any method of going back.\nUnlike other earbud makers including Sony and even Amazon, Apple doesn’t let you adjust the intensity of noise cancellation from the settings menu. The AirPods Pro are designed to dynamically adjust how much noise cancellation is applied on the fly based on your environment.\nBut to the end user, the feature is either on or off, and that’s not what I’d call ideal. Some people always want the maximum amount — especially on a plane or during a noisy commute — but others can feel a slight discomfort from the noise cancellation technology (or in some cases even get a little dizzy) when it’s fully cranked up.\nIt’s possible that Apple decided to turn the maximum noise canceling knob down ever so slightly without telling anyone to avoid any ill effects, but I really hope not. Letting customers choose from multiple levels of noise cancellation would make the AirPods Pro a hair more complicated to use, but might solve this situation for everyone. People who want their cocoon of silence (and have no issues when noise cancellation is dialed up to 11) can have it, and everyone else can find whatever level offers the best balance of comfort and NC.",
        "sentiment": -0.47489424533425617
    },
    "article_24": {
        "title": "Apple Launches Replacement Program for Smart Battery Cases Designed for iPhone XS, XS Max, and XR",
        "body": "Apple has determined that some Smart Battery Cases made for iPhone XS, iPhone XS Max, and iPhone XR may experience charging issues. An affected Smart Battery Case may exhibit one or more of the following behaviors:\nBattery case will not charge or charges intermittently when plugged into power\nBattery case does not charge the iPhone or charges it intermittently\nAffected units were manufactured between January 2019 and October 2019. This is not a safety issue and Apple or an Apple Authorized Service Provider will replace eligible battery cases, free of charge.",
        "sentiment": -0.32370160706341267
    }
}