{
    "article_0": {
        "title": "The cheapest iPhone now has a more powerful processor than the most expensive Android phone",
        "body": "Apple has updated the little iPhone SE for 2020, and even an Android fan has to see that it's a great phone at an even greater price of $399 for the base model. It's essentially an iPhone 8 with one big difference: it has Apple's A13 Bionic chip buried inside. And that's a big deal for a number of reasons.\nI expect that some people are going to tell me about single thread versus multi-threaded performance and how the A13 GPU isn't that great or how iPhones have much lower resolution screens so the chips don't have to work as hard. All this is true, but another thing is true: the A13 is a stronger chip than the Snapdragon 865 for daily use in every category — we've seen this applied in real life in the iPhone 11 already. The only area it misses out is 5G, and that's because Apple just doesn't care about 5G yet. (The rumored iPhone 12 will almost certainly have a Qualcomm 5G chipset inside, for what it's worth.)\nThe Apple A13 is powerful enough to drive a laptop, let alone a smartphone.\nNerdy things like CPU threads aside, you'll notice how well the new iPhone SE performs when you use it. Everything in a modern smartphone from web browsing to camera performance to less-used things like AR depends on the processor. You need to crunch numbers really fast if you want your phone to respond really fast. The $399 iPhone SE will be able to do these things faster than the new OnePlus 8 Pro or the Samsung Galaxy S20+.\nIt sounds crazy to say that Apple including its expensive new chip in its budget phone makes sense, but it does. Apple has but a single processor to design, manufacture, support, store, and deliver. The cost over an older chip like the A11 is surely significant, but isn't going to be as high as supporting and shipping that A11 in what will likely be a very popular smartphone.\nWhen iOS 16 comes out the iPhone SE will get it on day one. We'll see the same for iOS 17, too.\nWhat sounds less crazy, and great to consumers, is that by using the A13 Apple can support the iPhone SE for years — and this phone will outlive the iPhone 8 it is slated to replace for a handful of extra years because of the new chip. Basically, if the iPhone 11 can get updated, so can the iPhone SE. This is cool to hear today, but it will be really important in three years when another version of iOS is released and your $399 iPhone gets it on day one.\nGet an iPhone SE with Mint Mobile service for just $30/mo (opens in new tab)\nAll of these reasons are also why it's so important that Google finds a way to build its own chips for its smartphones. It's been recently rumored (again) that Google is doing just that and has designed a new 5nm chip that will soon begin production for 2021 phones. This would allow Google to provide as many software updates as it pleases as well as build an in-house version of Android tailored for specific hardware that it controls.\nApple is laying out a roadmap for exactly what Google needs to do with its own chips.\nBuilding your own mobile chipset brings many advantages, and Apple is leveraging them today. Google really needs to do the same, and soon. It isn't guaranteed to be a win, as we've watched Samsung historically struggle with its in-house developed Exynos processors, but the potential upside is clearly there.\nThe iPhone SE may not be a better phone than something like the latest Pixel, Galaxy or OnePlus. It has a lesser screen, weaker single camera, doesn't have the wealth of OS features we've come to expect from an Android flagship, and you're still stuck with a lightning connector instead of a universal solution in USB-C. But when it comes to processor performance and future-proofing for software updates, the iPhone SE beats that Android flagship you're holding right now.",
        "sentiment": 0.04347826431815823
    },
    "article_1": {
        "title": "The new iPhone SE is a shockingly good value.",
        "body": "Yesterday, Apple announced the new $399 iPhone SE. The TL;DR appears to be really simple: the iPhone 8’s body, the iPhone 11’s processor, and the iPhone XR’s camera system with a few new capabilities. I’ll obviously wait to review this phone to tell you if it’s any good, but assuming Apple lives up to its usual standards I can tell you something right away:\nAt $399, the second-generation iPhone SE is a shockingly good value.\nThe most important thing to know about the SE’s value proposition is simply that it has the A13 Bionic processor, which is bar-none the fastest processor you can get on any smartphone at any price, full stop. You could spend $1,449 on a fully maxed-out iPhone 11 Pro Max and it wouldn’t be faster than the iPhone SE. You could spend $1599.99 on a maxed-out Samsung Galaxy S20 Ultra 5G and it would be theoretically slower (with the exception of 5G downloads).\nThis isn’t just a matter of processor megahertz per buck, it’s a matter of the longevity of the phone itself. More than any other phone company, Apple supports its phones for a very long time. Since this iPhone SE has the most modern processor available, it’s quite likely that it will receive software updates for many years to come.\nYou are reading Processor, a newsletter about computers, software, and tech by Dieter Bohn. Dieter writes about consumer tech, software, and the most important tech news of the day from The Verge. You can read an archive of Processor newsletters here and subscribe to all of The Verge’s great videos here! Subscribe\nBy subscribing, you are agreeing to receive a daily newsletter from The Verge that highlights top stories of the day, as well as occasional messages from sponsors and / or partners of The Verge.\nHell, Apple even did the right thing with storage: offering a humane 64GB at the base level and making the 128GB model only $50 more.\nOver the course of 2019, we marveled at the level of quality you could get in a long series of relatively inexpensive Android phones. That’s still true today, but those phones will receive three years of updates from Google at most. And as my colleague Chris Welch will argue later today, the iPhone SE sets a bar that the upcoming Google Pixel 4A will have an incredibly difficult time clearing.\nAgain, we’ll need to review the new iPhone SE and the Pixel 4A to know whether one of them has an advantage with any particular feature (like the camera). So no final judgements here. But I just need to point out that for most of 2018 and 2019, every Android maker has had a bit of a green field to play in: phones that cost less than $500.\nGoogle, Asus, Samsung, and many others did good work in that green field, but now there’s real competition from Apple.\nOn Tuesday in this newsletter, I had half a thought about these low-cost phones. Forgive me for quoting myself:\nIncreasingly, I find that “flagship” phones are mainly about luxuries instead of tangible benefits to most people. Those luxuries include screen quality, 5G, wireless charging, face unlock, speed, overall build quality, camera quality, and a smattering of other things.\nWill the iPhone SE match the iPhone 11 or 11 Pro on most of those metrics? Nope. But when I wrote that I hadn’t imagined that Apple would use its newest chip. The inclusion of the A13 Bionic means the SE will match the most luxurious phone on speed and on longevity.\nI know I’ve now brought up software updates twice now, but it’s super important. $399 spent on this iPhone SE means it’s less likely you’ll be forced to spend another $399 next year or the year after.\nThere are several things to be bummed about with the iPhone SE 2 — starting with the fact that Apple calls it the “second-generation iPhone SE,” which is a bad name. Eventually we’ll settle on what to call it, but until then prepare for iPhone SE, second-generation iPhone SE, iPhone SE 2, iPhone SE (2020), the new iPhone SE, and probably something I can’t imagine right now. Ugh.\nIt doesn’t matter that it’s a parts bin phone if the parts are good\nI kid, that’s not really a real problem. Neither is the claim that this is just a “parts bin” phone. Yes, Apple is using a lot of parts that have been bouncing around its product lines for years. But, and I want you to really feel this: who cares? It doesn’t matter how old the parts are if they’re good.\nNo, there are real issues we know about already just from the basics. For example, this form factor — the same as the iPhone 6 — isn’t especially inspiring. I hate the size of the bezels. It seems like a petty complaint, but reducing them really does change your experience. You get more screen in a smaller body. Plus, it’s something most Android phones accomplished by putting a fingerprint sensor on the back or under the screen.\nSpeaking of size, this iPhone SE is larger than the last iPhone SE, which means that even ‘small’ phones are big now, as Dan Seifert observed yesterday. Finding a truly good, truly small smartphone is nigh impossible right now.\nYes, it’s okay to be a little bummed about the missing headphone jack\nAnd though I know many people will tell me to just get over it already, the fact that this low-cost iPhone lacks a traditional headphone jack is a bit of a bummer. Other low-cost Android phones explicitly include them. Bluetooth headphones aren’t just another thing to charge, they’re another thing to buy and another thing that could break.\nApple has a reputation for overcharging for hardware. It’s become a point of contention in the flamewars between Apple, Windows, and Android stans. My take is that sometimes Apple is guilty and sometimes it’s not. The new MacBook Air is a great value. Selling Mac Pro wheels for $699 and literal metal posts for $299 is so incredibly hilarious that even pointing out that it’s become self-parody feels so obvious it’s embarrassing.\nOn that spectrum, the new iPhone SE (or whatever we decide to call it) is not just a good value for Apple. It’s one of the very best values I’ve seen in the smartphone market in years. In theory, at least: now we just have to test it and see if it lives up to its spec sheet.\nMore from Apple’s announcements\n┏ Apple’s second-gen iPhone SE is here: all the news and details. Here’s a story stream of all of our iPhone SE 2 coverage.\n┏ The iPhone SE 2’s camera setup is going to lean on Apple’s software. Jon Porter on how Apple’s advances in image processing are going to be vital to this phone’s success.\n┏ Apple’s new iPhone SE doesn’t come with custom U1 locator chip. It’s not in the new iPad Pro with LiDAR either, where you would think it would make sense as the iPad Pro is practically designed for AR and AR development. I don’t know what’s up with the U1 chip (or AirTags), but increasingly it feels like something is weird about the whole thing.\n┏ Apple’s new Magic Keyboard for the iPad Pro goes up for preorder, ships next week. Here’s something unexpected! Long ago I promised to share my thoughts on the trackpad support in iPadOS but haven’t really finished that thought yet. When I review this, I will.\nMore from The Verge\n┏ Dell’s new XPS 13 is everything a Windows laptop should be. Monica Chin on what is going to be a contender for best Windows laptop of 2020, if not best laptop full stop:\nThe XPS 13 speaks for itself. This isn’t a laptop that’s trying to push boundaries or rewrite the rules; it’s just giving users what they want. I would take a better webcam, I would take better cooling, I would take a USB-A, and I would take a slightly more color-accurate screen. But none of those are glaring flaws because they aren’t big impediments to the user experience. And in the areas that matter most — build, display, keyboard, touchpad, battery life, performance — the XPS 13 doesn’t just check all the boxes. It blows the boxes off the page.\nThe TurboGrafx-16 Mini fills a different niche. For many people, it won’t be a chance to revisit classic games from their youth, but instead an opportunity to discover a period of retro gaming they likely missed the first time.\n┏ Google and Apple’s COVID-19 tracking system can’t save lives all on its own. Nicole Wetsman on what the rollout of this system should actually look like. It’s clearly built to be part of a larger system of testing and communal action. If the latter doesn’t come, the former won’t be of use (and could actually be a detriment). As ever, we need more testing, more PPE, and consistent guidance from political leaders. All three are in short supply.\n┏ How GM and Ford switched out pickup trucks for breathing machines. Sean O’Kane explains how ventilators are much more complicated than you might realize.\nAutomakers are well-suited for these partnerships for a few reasons, according to Adrian Price, the global vehicle engineering director at Ford who’s overseeing the company’s ventilator effort. Not only do these companies already work with components that are similar to the ones found in ventilators, but cars are highly complex products that require a unique amount of knowledge, planning, coordination, and logistics to build.\n┏ Russia conducts another test of its missile system to take out satellites. Loren Grush explains many of the reasons why these tests are not a good idea.\nASAT tests are also widely condemned by many in the space community, as these demonstrations typically create hundreds to thousands of pieces of debris that can last for months, and even years, in orbit. Because these tests are high speed and high impact, the resulting debris can spread far and wide. Those pieces then pose a threat to other functioning spacecraft. A fast-moving piece of junk can render an operational satellite inoperable if they hit head on.\n┏ What ‘Payment Status Not Available’ on the IRS coronavirus aid site means. Bad error messages are terrible in the best situations. Here, it’s awful, and Adi Robertson tells us exactly why this dark pattern is a huge problem.\n┏ How a new book about Instagram changes our understanding of the founders’ departure. Casey Newton has a review and some insight on Sarah Frier’s new book: No Filter: The Inside Story of Instagram. I’ve fallen out of my reading habit since I started working from home so much, but I am excited enough about this book that I think it’ll push me back into it again.\n┏ Ecobee’s new security camera doubles as an Alexa speaker. Dan Seifert looks at Ecobee’s new product line, which you can turn into an inexpensive home security system.",
        "sentiment": 0.023912312490588956
    },
    "article_2": {
        "title": "Ex-NSA hacker finds new Zoom flaws to takeover Macs again, including webcam, mic, and root access",
        "body": "Zoom, the popular video call service has had a number of privacy and security issues over the years and we’ve seen several very recently as Zoom has seen usage skyrocket during the coronavirus pandemic. Now two new bugs have been discovered that allow hackers to take control of Macs including the webcam, microphone, and even full root access.\nUpdate 4/2: Zoom has issued an apology for its privacy and security gaffes, patched these two most recent Mac bugs, and laid out a plan for the next 90 days to improve the service.\nBut if you’re still wanting to switch to another option, check out our roundup of 10 Zoom alternatives here.\nReported by TechCrunch, the new flaws were discovered by Ex-NSA hacker Patrick Wardle, now principal security researcher at Jamf, who detailed his findings on his blog Objective-See.\nWardle goes through a history of Zoom’s privacy and security issues like the webcam hijacking we saw last summer, the calls not actually being end-to-end encrypted as the company claims, the iOS app sending user data to Facebook, and more.\nThat brings us to today. Wardle’s new bug discoveries mean Macs are vulnerable to webcam and mic takeover again, in addition to taking gaining root access to a Mac. It does have to be a local attack but the bug makes it relatively easy for an attacker to gain total control in macOS through Zoom.\nAs such, today when Felix Seele also noted that the Zoom installer may invoke the AuthorizationExecuteWithPrivileges API to perform various privileged installation tasks, I decided to take a closer look. Almost immediately I uncovered several issues, including a vulnerability that leads to a trivial and reliable local privilege escalation (to root!).\nWardle describes the entire process in technical detail if you’re interested but the flaw comes down to this:\nTo exploit Zoom, a local non-privileged attacker can simply replace or subvert the runwithroot script during an install (or upgrade?) to gain root access.\nThen, a second flaw Wardle discovered allows access for hackers to access a Mac’s camera and mic and even record the screen, all without a user prompt.\nUnfortunately, Zoom has (for reasons unbeknown to me), a specific “exclusion” that allows malicious code to be injected into its process space, where said code can piggy-back off Zoom’s (mic and camera) access! This give malicious code a way to either record Zoom meetings, or worse, access the mic and camera at arbitrary times (without the user access prompt)!\nZoom didn’t respond to TechCrunch after a request for comment. With the millions of people using Zoom with the current global health crisis, hopefully, we see a fix real fast!\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.224988813112889
    },
    "article_3": {
        "title": "iPhone SE outperforms OnePlus 8 Pro and Samsung Galaxy S20+",
        "body": "Apple's A13 Bionic isn't just faster, it's deployed wider than any high-end Android chip\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nSeveral years ago, Apple's best chips began decisively beating the performance of the best chips available to high-end Android phones. Now, even Apple's $399 iPhone SE uses a more powerful brain than even the most advanced Android flagships with prices above $1,000. How is this possible?\n\"Apple is using the A13 Bionic in the 2020 edition of the iPhone SE and it outperforms the Snapdragon 865 in almost every way,\" noted Android Central blogger Jerry Hildenbrand. \"That's a big deal for a number of reasons,\" he added.\nApple's A13 Bionic vs Qualcomm's Snapdragon 865\n\"The A13 is a stronger chip than the Snapdragon 865 for daily use in every category,\" Hildenbrand noted, linking to the details of Qualcomm's introduction of its Snapdragon 865 as its best chip for premium Androids this year.\nLike Apple's A13 Bionic, Qualcomm's Snapdragon 865 is a 7nm component that bundles an ARM CPU, mobile GPU, an NSP for machine learning, an ISP for camera logic, and a variety of other audio, video, and security engines together into a single SoC or \"System on a Chip.\"\nYet despite all of Qualcomm's efforts, the Snapdragon 865 continues to fall behind Apple's best chip in basic CPU and GPU processing power. That has focused Qualcomm's marketing on promoting its support for 5G mobile networking instead, allowing it to advertise that at least in one respect, it is faster.\nHowever, 2020 is turning out to be a bad year to be pushing 5G as your only strength. It will be some time before 5G becomes broadly available outside of a few leading markets such as South Korea and specific urban markets. For budget phone buyers, 5G offers little more than faster battery drain and often the requirement to pay extra for mobile service, whether that 5G service is consistently available and capable of delivering noticeably better, real-world mobile data speeds than the best 4G LTE or not.\nSpeed and longevity\nOn the other hand, a fast, modern mobile chip with an advanced CPU and GPU delivers two major benefits. The first is its overall performance when you use it. As Hildenbrand noted, \"you'll notice how well the new iPhone SE performs when you use it.\"\nHe added, \"everything in a modern smartphone from web browsing to camera performance to less-used things like AR depends on the processor. You need to crunch numbers really fast if you want your phone to respond really fast. The $399 iPhone SE will be able to do these things faster than the new [$899] OnePlus 8 Pro or the [$1,000] Samsung Galaxy S20+.\"\nA second benefit to having Apple's newly released chip in its value-priced iPhone is the assurance that Apple will continue to support it for many years— likely as long as the iPhone 11 family using the same processor. When Apple drops support for older devices from a new release of iOS, it's often because they lack the silicon to take advantage of its latest advancements.\n\"When iOS 16 comes out the iPhone SE will get it on day one. We'll see the same for iOS 17, too,\" the Android Central piece predicted. Apple's latest iOS 13 continues to support iPhone 6s, a phone from 2015. That's ancient, particularly when considering that it's unusual for an Android to get updates for even two years, with supported devices often not getting the latest update until months after its release.\nBecause the new iPhone SE is expected to be officially supported by Apple in its latest iOS release for several years, the resale value for the phone will also remain much higher than basic Androids near the same price, or even higher-end Android flagships that lose their value faster and have more to lose.\nAndroid Central concluded that Apple's advantage in silicon speed and longevity is why \"it's so important that Google finds a way to build its own chips for its smartphone.\" But if a blogger in 2020 has figured that out, why didn't Google do the work to deliver advanced chips years ago?\nWhy is Apple so far ahead?\nGoogle did undertake a relatively ambitious effort in designing part of the brain of a mobile phone. Back in 2017 it created a standalone ISP for advanced photo imaging that it used in Pixel phones. But the problem was that while the camera was probably the best feature to focus on, it wasn't the only reason motivating phone buyers.\nThe only Pixel phone that's sold above minimal volumes was the 2019 Pixel 3a, which dropped Google's custom camera silicon to reach its price point. Pretty clearly, advanced custom silicon is harder to deliver than a lot of observers imagine it is.\nEven Android Central noted that Samsung's own attempt at developing its Exynos custom SoCs ended up in failure, despite building a campus and assembling leading talent without much of a budget holding them back. Samsung was still forced to make design concessions to minimize its cost, which resulted in poor performance that couldn't keep up with Qualcomm's, let alone Apple's.\nA decade ago, Android enthusiasts predicted that Apple would have a very difficult time competing against all of the hardware makers collaborating on Android. Parallels were drawn with Windows PC makers who were able to introduce new Intel CPUs faster than Apple could get its PowerPC chip partners to deliver new upgrades. Even after Apple shifted its Macs to Intel chips in 2006, it was still often at a disadvantage in rolling out Macs with a performance edge at a competitive price.\nThe prediction that this would repeat in mobile devices didn't materialize, however. Instead, Apple's business of building premium mobile devices— including iPhones with an average selling price of nearly $800 — has proven to be far more commercially successful than any specific Android maker— or all of the Android licensees put together.\nThis has had a greater and far more important impact than merely making Apple profitable. It has also allowed Apple to reinvest its profits in aggressively building the most advanced mobile processors. Designing and building state-of-the-art processors is not only fantastically expensive; it's also a high-risk effort.\nDeveloping advanced, custom silicon for devices that don't end up selling well has been a disastrous issue for a series of companies that have since exited the business of building chips for Android mobile makers, starting with Texas Instruments' OMAP and Nvidia Tegra, and continuing with Intel Atom.\nThe number of high-end Android phones supporting the production of advanced Qualcomm Snapdragon chips is not growing dramatically. Instead, the overall market for Android phones is retreating from iPhone-class competition and moving downmarket to the middle tier, where phones sell for around $300-$400.\nThis winter, Apple introduced iPhone 11 alongside a pair of ultra-premium iPhone 11 Pro models priced above $1,000. Yet rather than selling mostly older, cheaper models, Consumer Intelligence Research Partners estimated that just over a third of Apple's U.S. sales opted for the $699 iPhone 11, and nearly another third opted for the $999 and up iPhone 11 Pro.\nTwo thirds of Apple's iPhones sales are its best new high-end models\nFor over a decade, iPhone has maintained an incredible, unprecedented demand for fancy high-end products with innovative features, longevity, security, and battery life— all of which are driven by Apple's ability to deliver a steady stream of advanced new silicon every year.\nSamsung has never come close to selling such a high-end mix of Android phones, and most Android makers sell an even lower-end combination of devices. The average selling price of Androids has hovered around $250 to $300 for many years. That can't fund the competitive development of the most advanced chips, particularly when that cost is outsourced to a third party seeking to maximize profits in selling advanced chips to handset licensees.\nYet Apple also has another advantage in silicon: it's not just making iPhones. Apple's first A4 chip was introduced by Steve Jobs at the introduction of iPad in 2010. It was only released for iPhone 4 later that same year when it also debuted in Apple TV.\nApple's broad use and reuse of its chips— such as putting the A8 in its HomePod — enables the company to wring the most value of the work it has already invested in building custom silicon for iPhone and iPad. Additionally, its confidence that it will be able to sell tens of millions of iPads and hundreds of millions of high-end iPhones each year enables the company to drive an intense pace of annual upgrades that no other chip maker or device assembler can match.\nFurther, following the parallel leap in reinventing the classic iPhone to deliver iPhone X as a new form factor driven by swipe gestures and Face ID rather than a Home button and Touch ID has enabled Apple to sell its product to two totally different markets: the high-end of discerning tech adopters who are willing to pay a high premium for the best phone available, and a lower tier of customers who want a basic phone at a basic price.\nOver the holidays, Apple nearly satiated all the demand for expensive phones with its iPhone 11 family. It can now offer iPhone SE with the same processor and sell it to a class of users who are more concerned about price than some of the very latest features available.\nApple's previous iPhone 8 targeted the same group of basic iPhone buyers, which ranges from parents buying for their younger kids to enterprise deployments serving devices to their employees. iPhone SE effectively upgrades iPhone 8 to use an A13 chip and better lenses and cameras, while remaining differentiated from iPhone 11 and last year's iPhone XR.\nThe 2020 iPad Pro introduced LiDAR as a differentiating, modern feature advancing Augmented Reality\nWhen iPhone 12 ships this fall, it will again offer things iPhone SE doesn't, including an expected jump to 5G support and other camera and imaging exclusives, likely including the LiDAR sensor that debuted on the latest iPad Pro. It will also jump to an even more advanced A14 SoC that further advances Apple's lead and justifies the price premium of its fanciest iPhones for buyers who are less concerned about price than features.",
        "sentiment": 0.04773502723098948
    },
    "article_4": {
        "title": "Apple wants an iPhone that doesn't just survive underwater, but is usable there",
        "body": "Apple wants an iPhone that doesn't just survive underwater, but is usable there\nThis isn't nearly as wet an environment as Apple thinks you may want to use your iPhone\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nFuture iPads and iPhones could adapt to actually being used underwater, and a new way to sense orientation using the Face ID camera could see display rotation guided by the angle of your face in relation to the device.\nIt may seem as if the iPhone, iPad, and even Mac, have not changed their user interface in years, but in truth Apple is continually revising its software. Apple is also increasingly good at hardware surviving underwater, plus it continues to look into actually making devices remain usable when submerged.\nThese issues are revisited in two new patents, one of which will concern anyone who's truly wanted to operate an iOS device underwater. And the other uses technology to solve a small but recurring annoyance.\n\"Underwater User Interface\" argues that if you're going to use your device underwater, then the controls need to be simplified while you're submerged.\nThat's definitely the thing to be focusing on, how simple it is to operate the iPhone or iPad when you would otherwise be concentrating on swimming to the surface.\n\"Current methods for displaying user interfaces while an electronic device is under water are outdated, time consuming, and inefficient,\" complains the patent. \"For example, some existing methods use complex and time-consuming user interfaces, which may include multiple key presses or keystrokes, and may include extraneous user interfaces.\"\nApple also reckons that when something is cumbersome, it's also time-consuming. \"In addition, these methods take longer than necessary, thereby wasting energy,\" it says. \"This latter consideration is particularly important in battery-operated devices.\"\nA future device might alter and simplify its display controls when underwater, and also take into account the difference water makes to touch detection\n\"There is a need for electronic devices that provide efficient methods and interfaces for accessing underwater user interfaces displayed on the electronic devices,\" continues the patent. \"Such techniques can reduce the cognitive burden on a user who accesses user interfaces while the electronic device is under water, thereby enhancing productivity. Further, such techniques can reduce processor and battery power otherwise wasted on redundant user inputs.\"\nIn other words, if you're swimming for your life, you don't want to have to an \"Are you sure?\" dialog. However Apple's patent is not just about how many buttons you have to press. It's also about how the device tells you that you've pressed on it.\n\"[The device] optionally also includes one or more tactile output generators,\" it says. \"In some embodiments, at least one tactile output generator is collocated with, or proximate to, a touch-sensitive surface (e.g., touch-sensitive display system) and, optionally, generates a tactile output by moving the touch-sensitive surface vertically (e.g., in/out of a surface of device) or laterally (e.g., back and forth in the same plane as a surface of device).\"\nSo the aim is that when you happen to be underwater with your device, the whole user interface will change. It can show you simpler controls, or remove steps, and it can then vibrate the device to show when you've used it.\nThere is much more detail — some 40,000 words of it — and the invention is credited to no less than 16 people. These include Richard J. Blanco, who is also listed on a related patent for \"Sealed electronic connectors for electronic devices.\" And also Xuefeng Wang, previously credited on a patent for a way that devices can detect when they're under sufficient strain that they may be damaged, and alerting the user about it.\nUsing your face to orient the device\nSeparately, an application for \"Using Face Detection to Update User Interface Orientation\" is about rotating a display to the right position.\nAll iPads have always automatically rotated their screen so that you can hold them in landscape or portrait, and such that you can hold them any way up. However, every iPad user has also had the experience of having to physically rotate the device in order to get it to check again after it's turned the wrong way.\n\"The orientation that the content is presented is often determined using accelerometers and/or other inertial sensors that determine the orientation of the device relative to gravity,\" says Apple's patent.\n\"There are, however, often situations in which these sensors cannot accurately or confidently determine the orientation of the device relative to gravity and the device will not change or update the orientation of the content to the proper orientation for the user or will update the orientation incorrectly,\" it continues.\nIt gets confused, really, and the most common cause of the confusion is when the iPad is not being held up by the user, but instead is on a table.\n\"[The] device may not be able to provide the content in a proper orientation to the user when the device is lying flat (e.g., face up on a flat surface),\" says the patent. \"When lying flat, even though the sensors may be accurately aware of the position of the device, the orientation relative to the user may be unknown.\"\nIt's hardly a gigantic problem, but it is annoying and Apple has clearly heard this a lot from people. \"In either of these situations, the user may become frustrated with the need to reorient the device and/or move the device to get content to display in the proper orientation,\" it says.\nThe solution is to no longer rely solely on these sensors, and instead supplement them with more information. Specifically, us. The iPad Pro has facial recognition now in the form of the Face ID that we use to unlock the device.\nThe same feature, or rather a small part of it, could be used to determine which way around our face is in relation to the device. So it wouldn't have to actually recognize us for authentication, it would simply see which way we must be looking at the device and alter what it shows to match.\n\"[Orientation] data obtained from a face detection process is used to determine or update the orientation of an application user interface (e.g., text and/or content) being displayed on a display of a device,\" says the patent.\nFuture devices could detect the orientation of a user's face and use that to determine the right rotation for its display\nThis could happen whenever the user picks up or wakes the device, and it could happen during the regular Face ID process. However, it could also be automatically triggered if the iPad has sufficient doubt about whether its other sensors are correct.\nAgain, this would not require a full Face ID recognition scan, but also again, it would be making more use of the existing technology. Apple's patent suggests that all of this could go further, with the device using Face ID not only to orient itself, but to change the information it displays.\nAlongside all of the technical detail about implementing such a system, Apple also stringently examines the privacy issues. An iPad might be unlocked, and then re-orient itself, according to the face it sees, but beyond that, the user must be able to decide what else happens.\n\"Use of such personal information data enables calculated control of access to devices,\" says the patent. \"[Entities providing or analyzing information] would be expected to implement and consistently apply privacy practices that are generally recognized as meeting or exceeding industry or governmental requirements for maintaining the privacy of users.",
        "sentiment": -0.07237582956897277
    },
    "article_5": {
        "title": "Apple iPhone SE (2020) has 3 GB RAM, 1821 mAh battery",
        "body": "Apple finally introduced the iPhone SE (2020) with an A13 Bionic chipset and an improved camera. The company kept its tradition not to reveal RAM and battery capacity of its devices, but thanks to a listing at China Telecom’s website, we got the details.\nAccording to the carrier, the new iPhone has 3GB RAM, which is an increase over the 2GB of the iPhone 8, but lower than the 4GB in the other A13 phones in the iPhone 11 family. However, the power cell remains 1,821 mAh - exactly the same as the iPhone 8.\nOther specs that the iPhone SE (2020) inherited from the 2017 flagship are the screen, the 2014-style bezels, and the Touch ID home button. It also has the same footprint and overall design.\nChina Telecom will offer the phone in its three colors (White, Black, Red) with all three storage options - 64 GB, 128 GB, or 256 GB. Prices begin from CNY3,299 ($465/€428) and go up to CNY4,599 ($650/€600).\nSource (in Chinese) | Via",
        "sentiment": 0.13221713108941913
    },
    "article_6": {
        "title": "Apple Paid Hacker $75,000 for Uncovering Zero-Day Camera Exploits in Safari",
        "body": "Apple paid out $75,000 to a hacker for identifying multiple zero-day vulnerabilities in its software, some of which could be used to hijack the camera on a MacBook or an iPhone, according to Forbes.\nA zero-day vulnerability refers to a security hole in software that is unknown to the software developer and the public, although it may already be known by attackers who are quietly exploiting it.\nSecurity researcher Ryan Pickren reportedly discovered the vulnerabilities in Safari after he decided to \"hammer the browser with obscure corner cases\" until it started showing weird behavior.\nThe bug hunter found seven exploits in all. The vulnerabilities involved the way that Safari parsed Uniform Resource Identifiers, managed web origins and initialized secure contexts, and three of them allowed him to get access to the camera by tricking the user to visit a malicious website.\n\"A bug like this shows why users should never feel totally confident that their camera is secure,\" Pickren said, \"regardless of operating system or manufacturer.\"\nPickren reported his research through Apple's Bug Bounty Program in December 2019. Apple validated all seven bugs immediately and shipped a fix for the camera kill chain a few weeks later. The camera exploit was patched in Safari 13.0.5, released January 28. The remaining zero-day vulnerabilities, which Apple judged to be less severe, were patched in Safari 13.1, released on March 24.\nApple opened its bug bounty program to all security researchers in December 2019. Prior to that, Apple's bug bounty program was invitation-based and non-iOS devices were not included. Apple also increased the maximum size of the bounty from $200,000 per exploit to $1 million depending on the nature of the security flaw.\nWhen submitting reports, researchers must include a detailed description of the issue, an explanation of the state of the system when the exploit works, and enough information for Apple to reliably reproduce the issue.\nThis year, Apple plans to provide vetted and trusted security researchers and hackers with \"dev\" iPhones, or special iPhones that provide deeper access to the underlying software and operating system that will make it easier for vulnerabilities to be discovered.\nThese iPhones are being provided as part of Apple's forthcoming iOS Security Research Device Program, which aims to encourage additional security researchers to disclose vulnerabilities, ultimately leading to more secure devices for consumers.",
        "sentiment": -0.18187339214936776
    },
    "article_7": {
        "title": "iOS 13.5 beta makes it easier to skip Face ID if you’re wearing a mask",
        "body": "Apple today released a new beta of iOS 13.5 to developers, bringing the first version of its COVID-19 exposure notification API to public health authorities. The update also includes a small tweak that makes it easier to skip Face ID and enter your passcode if you’re wearing a mask.\nWith this change, Face ID can detect if you’re wearing a mask and skip directly to the passcode screen if so. It’s impressive that Apple has developed it such that if you’re not wearing a mask, Face ID still works as normal, with the experience only being changed when you are wearing one.\nWhile there are some workarounds, Face ID is not nearly as reliable if you’re wearing a mask. Most of the time, it will fail to recognize you and eventually take you to the passcode option. This change significantly streamlines that process. When you swipe up to unlock, you’ll be taken directly to the passcode screen.\nThe other major change in iOS 13.5 is the first version of Apple and Google’s COVID-19 contact tracing API for exposure notification. You can read more about that in our full coverage here, but you’ll find a new option in the Settings app for enabling exposure notifications:\niPhone is using Bluetooth to securely share your random IDs with nearby devices and collect their IDs. This enables an app to notify you if you may have been exposed to COVID-19. Random IDs are deleted after 14 days. Apps you authorize can notify you if you’re exposed to COVID-19. You can also choose to anonymously share your COVID-19 diagnosis.\niOS 13.5 beta 3 is rolling out to developers today. Any revision of iOS that uses a new SDK must have its minor version number changed, hence the jump from iOS 13.4.5 to iOS 13.5. You can read more in our full coverage.\nSpot any major changes in the third developer beta of iOS 13.5? Let us know in the comments or on Twitter, @9to5Mac.\nAs pointed out by @Sonikku_a2, if you’re wearing a mask, iOS 13.5 goes straight to the passcode screen if you try to unlock with Face ID (keypad not shown because iOS hides it in screen recordings) pic.twitter.com/bQCzu5u20p — Guilherme Rambo (@_inside) April 29, 2020\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.23120861808243004
    },
    "article_8": {
        "title": "Facebook tried to buy controversial tool to spy on iPhone users, court filing reveals",
        "body": "Apr. 3rd 2020 9:30 am\nOver the last few years, Facebook has had a slew of privacy and security blunders and more details about one of them have come to light through a new court filing as the social media company is suing the spyware company NSO Group. It turns out Facebook tried to buy controversial government spyware to monitor iPhone and iPad users.\nReported by Motherboard, when Facebook was starting to build its spyware cloaked in a VPN product, Onavo Protect for iOS and Android, the social media company reached out to the controversial company NSO Group that creates spyware for government agencies.\nA declaration from NSO Group’s CEO, Shalev Hulio revealed that “two Facebook representatives approached NSO in October 2017 and asked to purchase the right to use certain capabilities of Pegasus.”\nFurther documentation in the lawsuit revealed that:\nit seems the Facebook representatives were not interested in buying parts of Pegasus as a hacking tool to remotely break into phones, but more as a way to more effectively monitor phones of users who had already installed Onavo.\nAnd in particular, Facebook thought Pegasus would give it an advantage in spying on iPhone and iPad users as Apple devices are more difficult to compromise than Android ones.\n“The Facebook representatives stated that Facebook was concerned that its method for gathering user data through Onavo Protect was less effective on Apple devices than on Android devices,” the court filing reads. “The Facebook representatives also stated that Facebook wanted to use purported capabilities of Pegasus to monitor users on Apple devices and were willing to pay for the ability to monitor Onavo Protect users.”\nNSO declined to sell Pegasus to Facebook, but it still built and launched Onavo without Pegasus as a spyware tool in early 2018 under the misleading pretense of being a VPN app.\nApple made Facebook remove Onavo Protect from the App Store in August of 2018.\nThen in 2019 Facebook repackaged it as a “Research app” and tried to pay teens to sideload it on their devices.\nThe Research app was shut down as well and Facebook finally shutdown Onavo completely in February 2019.i\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.4271353135506312
    },
    "article_9": {
        "title": "The iPad is the only tablet worth buying",
        "body": "Apple's newest iPad Pro is here. Complete with an LiDAR scanner and full trackpad support, it appears to be even more of a PC replacement than previous models. Even if you aren’t looking to replace your trusty laptop, the iPad is an incredible device. In fact, it’s the only tablet I’d recommend buying after years of covering consumer technology — and I’m not exactly what you’d call an Apple fanatic. I use Windows on my main computer and a Chromebook for portable work. I’ve also been a diehard Android phone user since the original Motorola Droid was released. In other words, this advice is not coming from a place of brand loyalty — it’s coming from years of using the iPad alongside other tablets on the market.\nSKIP AHEAD What iPad model should you get?\nShould you get an iPad?\nWhile price has historically been a barrier to Apple’s products, the current iPad lineup ranges from affordable to fairly expensive (and powerful). No matter which one you buy, it can probably handle most actions, including:\nYou may see the more demanding actions perform better on the higher-cost iPad models, but for the most part any model should work well for general use.\nWhat iPad model should you get?\nThe lowest-cost iPad — which is just named the “iPad” — is the seventh generation of Apple’s venerable tablet. It boasts a super-sharp 10.2-inch display, up to 128GB of storage and Apple’s A10 Fusion central processing unit (CPU). This is a slower CPU than more expensive models but you likely won't notice the difference. I’m still using an older iPad with a comparable CPU and it runs like butter — even when playing games. At $329, you couldn’t ask for a better bang for your buck.\nWhen I bought my current iPad — the 2016 9.7-inch iPad Pro — I planned on using it for comic books, games and computer magazines (yes, I’m a huge nerd). A big screen was a must for me, but if you’re just looking to read ebooks, browse Facebook and take your tablet anywhere, the smaller 7.9-inch iPad Mini could be an alternative.\nThe iPad Air, as its name implies, is slightly thinner than the regular iPad. But the real improvement comes in a faster A12 Bionic CPU, more available storage (up to 256GB) and extra features like a wide-color, anti-reflective, True Tone display for a more natural-looking image.\nAt 12.9 inches, the iPad Pro is closer to the size of a laptop and has a higher price tag (though there is a smaller and more affordable 11-inch model). This is the iPad for people looking to replace their computer and thanks to the most powerful processor in an iPad — the A12Z Bionic — and up to 1TB of storage, it will work well for all your digital creations.\nAndroid and Windows tablets can do similar things to an iPad, but the feel of using the device is why I chose an iPad. Android has struggled to get its tablet interface feeling as smooth and usable and many Android apps — from big names like Spotify to various magazines and lots of smaller third-party tools — are similar to phone apps blown up to fit the size of a tablet. Plus, a lot of apps come out on iOS before reaching other platforms, which can be frustrating if you have to wait for a new game to launch for your Android product.\nHow does the iPad compare to other tablets?\nI also prefer the iPad over Microsoft’s tablet. The app interface isn't comparable and I end up spending most of my time in a browser, which just seems silly for the price.\nWhen it comes to longevity, I find that iPads last a relatively long time. Now, Android tablets might not get future updates since Google stopped manufacturing their own Android tablets. In addition to the actual product, I find that there are far more iPad-focused accessories like fold-out keyboard cases, than there are for any given Android tablet. Android and Windows tablets do have their advantages, of course.\nTablets like the $64 Walmart Onn and $50 Amazon Fire (which runs a modified version of Android with fewer apps) are unbeatable on price — just don’t expect them to be very snappy or last very long.\nThe $150 Fire HD 10 is significantly better, but still can’t hold a candle to a refurbished 2017 iPad that costs $60 more.\nSamsung has good options on the high end but I think the iPad still offers a better all-around experience for the money.\nWindows-based 2-in-1s are nice if you want a hybrid laptop/tablet form factor. However, I find these clunkier than a tablet — I’d rather go with a cheaper non-touch laptop and put extra money toward an iPad. It’s almost always going to be a better experience.\nCatch up on Select's in-depth coverage of personal finance, tech and tools, wellness and more, and follow us on Facebook, Instagram and Twitter to stay up to date.",
        "sentiment": 0.14431304158642888
    },
    "article_10": {
        "title": "Apple commits to hiring over 1,000 summer interns, with online and in-person components",
        "body": "A new report from Axios today highlights how major tech companies are “scrambling to craft digital options” for summer internships this year due to the COVID-19 pandemic. For its part, Apple has committed to hiring over 1,000 people for internships this summer.\nMany companies have shifted their summer internships to be online, including Google, Twitter, IBM, Microsoft, Lyft, and Salesforce. Other companies, including Apple, say they plan to host interns on-site for at least part of the summer so long as it’s safe to do so.\nApple told Axios in a statement that it will hire more than 1,000 people for online and in-person internships. The company is also committed to offering interns the same protections against COVID-19 as it offers full-time employees:\nApple, which told Axios it plans to hire more than 1,000 people for a mix of online and in-person internships and pledged in a statement to “extend to our interns the same precautions and care that we’re extending to all our other personnel as a part of the ongoing COVID-19 response.”\nApple didn’t offer details on the size of its 2020 summer internship programs in comparison to previous years. Microsoft and Amazon, for instance, say that they expect their biggest class of interns ever this summer, while Salesforce and Twitter say their intern class may shrink this summer.\nAxios also points out that one key question remains for interns this year at all companies:\nA key question is how meaningful the online experience proves to be, both as a learning experience and a recruiting tool. Employers understand they need to try to find effective remote substitutes for in-person networking and social events, in addition to finding work tasks that can be done fully online.\nThe full report at Axios is well worth a read, especially if you or someone you know is curious about the state of big tech summer internships this year.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.05128471180796623
    },
    "article_11": {
        "title": "Apple Music Quietly Starts $50 Million COVID-19 Advance Fund for Indie Labels",
        "body": "Apple Music is the latest company to offer industry relief amid the coronavirus pandemic. It told independent record labels Tuesday that it is launching a $50 million advance royalty fund to make sure their artists get paid.\nAccording to a letter sent to the labels and obtained by Rolling Stone, independent labels that earn at least $10,000 in quarterly Apple Music earnings will qualify for the royalty advances. To qualify, the indie labels must have a direct Apple Music distribution deal.\n“These are difficult times for the music industry globally,” the letter says. “Livelihoods are at risk, with multiple sources of income that our industry relies on vanishing overnight. Apple has a deep, decades-long history with music, and we are proud to be in close partnership with the best labels and artists in the world. We want to help.”\nThe music industry at large has been hit hard by the ongoing pandemic. The live music industry has indefinitely been put on hold, and many concert tours — as well as major music festivals like Coachella and South by Southwest — have been postponed or canceled. Most musicians rely on live touring revenue, as do venue workers, tour managers and many other live crew members who are now out of work.\nThe recorded music business has been impacted as well. Access to recording studios while under lockdown can be challenging, and with much of the country at home because of physical distancing recommendations, music streaming is down and artists are pushing back release dates for upcoming albums.\nApple’s initiative is just the latest industry power player move to bolster the struggling business. The Recording Academy started a $2 million COVID-19 Relief Fund with its non-profit arm MusiCares, and it’s gotten several million dollars more in donations from high-profile music companies including Spotify, StubHub, Universal Music Group and Warner Music Group. Promotion giant Live Nation committed $10 million to its new relief fund Crew Nation to help live workers currently out of a job.\nEditor’s picks\nApple is also one of several media platforms set to air Global Citizen and the World Health Organization’s One World: Together at Home broadcast, which will feature performances from Elton John, Billie Joe Armstrong and Billie Eilish among several others.\nRead a full copy of the email below:\nThese are difficult times for the music industry globally. Livelihoods are at risk, with multiple sources of income that our industry relies on vanishing overnight. Apple has a deep, decades-long history with music, and we are proud to be in close partnership with the best labels and artists in the world. We want to help.\nToday Apple Music is announcing the creation of a $50 million-plus fund available as advances on future royalties to independent labels, to help them pay artists and maintain operations.\nRoyalty advances will be offered to independent labels with a direct Apple Music distribution deal who meet a minimum quarterly threshold of $10,000 in Apple Music earnings. Each advance will be based on the label’s past earnings, and will be recoupable against the label’s future earnings. This offer is in good faith that labels will channel funds to artists and label operations based on financial need.\nLabel agreements for the advances will be posted in iTunes Connect, in the Agreements, Tax, and Banking module, on April 10. To receive an advance you will need to accept the Royalty Advance agreement and be on the latest Apple Music distribution agreement before May 8, 2020, at 11:59 p.m. PDT.\nWe hope that together we can help provide stability for artists by sustaining an enduring and vibrant music sector. If you have additional questions, please contact us.\nThank you and stay safe,\nThe Apple Music Team",
        "sentiment": 0.06820884966773205
    },
    "article_12": {
        "title": "A buddy and I finally launched our Apple Watch app! Nomi is a creature for your wrist — kinda like a tamagotchi that you keep alive by feeding it, through walking and movement. Search for ‘Nomi' on your watch's App Store to hatch yours!",
        "body": "Penemuel ,\nQuick update: one thing I would love is if the hearts you earn saved up - right now, you have to remember to feed your Nomi when the heart ring is full, which can mean pausing in your workout. If you forget to do this, you could go through an entire workout and have burned enough calories for two or three hearts, but you still only get one.\nThis app is adorable, fun, and motivates me to stay active throughout the day. The Tamagotchi-like critter is so cute, and I hate seeing it sadface, so I want to stay active to be able to keep feeding it. When I first got the app the only way to get hearts to feed the critter was using steps, which was pretty difficult with the current ‘stay at home’ restrictions (even though I’ve been exercising daily, my step count is terrible). However, the developer was very understanding and responsive, and quickly released an update allowing you to use calories instead. I love the app and really the only thing I can think of to improve it at this point would be to make it actually possible to pet the critter. (If it’s happy, you can tap it and it does a little happy nudge type movement, but you can’t give it scritches.) I’m not sure how feasible this is for a cute little watch app (don’t know how hard it would be to make it that interactive or whether the watch can even support such a thing), but it would be cute. TL;DR, if you’re a sucker for cute critters to motivate you to exercise, GET THIS APP!",
        "sentiment": 0.20547227263450624
    },
    "article_13": {
        "title": "Pandora shows Spotify how to make a proper Apple Watch app",
        "body": "Pandora is out with an update today that brings Siri support to its Apple Watch app as well as improving Siri support on iOS. The underdog music service that is Pandora continues to show Spotify how third-party music services should work on the Apple Watch. Pandora now supports two key features that are must-haves on watchOS…\nSpotify has complained over the last year that Apple doesn’t play fair when it comes to working with third-parties. Meanwhile, Pandora has continued to roll out support for great features like streaming on Apple Watch and before that offline playback. Today, Pandora has debuted Siri support on Apple Watch along with upgrading its Siri capabilities with iOS.\nMy colleague Bradley Chambers argued almost a year ago when watchOS 6 launched with an API for third-party streaming on Apple Watch that it was time for Spotify to “ship or shut up,” and in 2020 we’re still watching Spotify integration lag way behind competitors like Pandora.\nSpotify did release Siri support for Apple Watch earlier this month, but two major features it’s lacking are offline playback and streaming support (Pandora has both for watchOS), leaving Spotify on Apple Watch as a remote control for iPhone.\nSpotify has heard feedback from lots of its users about bringing the Apple Watch up to snuff, but for some disappointing reason, it hasn’t been a priority. Some Spotify users have even mentioned leaving the service over the lack of Spotify’s follow-through.\nNotably, all the way back in 2017, a third-party app called Snowy (previously Spotty) included offline playback for Spotify. The company then started “working” with the developer on it but the app was later killed off.\nTime will tell if Spotify gets its Apple Watch act together in 2020. At any rate, Pandora keeps showing Spotify that what they want to do is certainly possible.\nAs for Pandora on Apple Watch, here are the latest improvements:\nNEW: Edit Shuffle Stations feature * Available for Premium listeners * Select which stations you want to play on shuffle _\n* Available for Premium listeners * Select which stations you want to play on shuffle _ NEW: Siri on Apple Watch * Ask Siri to play stations, songs, albums, and podcasts: “Hey Siri, play Thumbprint Radio on Pandora.” * Tell Siri you like or dislike the current song: “Hey Siri, I like this song.” _\n* Ask Siri to play stations, songs, albums, and podcasts: “Hey Siri, play Thumbprint Radio on Pandora.” * Tell Siri you like or dislike the current song: “Hey Siri, I like this song.” _ ADDED FEATURES/IMPROVEMENTS: Siri on iOS * Ask Siri to add music to your collection or for a specific playlist: “Hey Siri, add Hotel California to my collection on Pandora.” (Premium listeners only) * Tell Siri you like or dislike the current song. * Even more personalized discovery to help you find and listen to the music you love.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.0036907097409394655
    },
    "article_14": {
        "title": "Apple and Google pledge to shut down coronavirus tracker when pandemic ends",
        "body": "On Friday, Apple and Google revised their ambitious automatic contact-tracing proposal, just two weeks after the system was first announced. An Apple representative said the changes were the result of feedback both companies had received about the specifications and how they might be improved. The companies also released a “Frequently Asked Questions” page, which rehashes much of the information already made public.\nOn a call accompanying the announcement, representatives from each company pledged for the first time to disable the service after the outbreak had been sufficiently contained. Such a decision would have to be made on a region-by-region basis, and it’s unclear how public health authorities would reach such a determination. However, the engineers stated definitively that the APIs were not intended to be maintained indefinitely.\nThe key schedule for the new encryption specification, which now includes Bluetooth metadata\nSome of the changes seem designed to address privacy concerns that came up after the initial release. Under the new encryption specification, daily tracing keys will now be randomly generated rather than mathematically derived from a user’s private key. Crucially, the daily tracing key is shared with the central database if a user decides to report their positive diagnosis. Some encryption experts worried that under the old encryption protocol certain attacks might be able to link those keys with a particular user. Connecting a person to a diagnosis should be more difficult with the randomly generated keys. As part of the change, the daily key is now referred to as the “temporary tracing key,” and the long-term tracing key included in the original specification is no longer present.\nThe new encryption specification also establishes specific protections around the metadata associated with the system’s Bluetooth transmissions. Along with the random codes, devices will also broadcast their base power level (used in calculating proximity) and which version of the tool they are running. This information could potentially be used to fingerprint specific users, so the engineers laid out a new system for encrypting them such that they cannot be decoded in transit.\nThe companies are also changing the language they use to describe the project. The protocols were initially announced as a contact-tracing system, it is now referred to as an “exposure notification” system. While the proposed apps and protocols could stand in for some functions of traditional contact tracing, they can’t do the more sophisticated work of interviewing subjects and identifying clusters of infection, which can then inform future public health efforts. The companies say the name change reflects that the new system should be “in service of broader contact tracing efforts by public health authorities.”\nNone of Friday’s changes address the question of how health authorities will verify positive diagnoses to prevent trolls or other false positives, and it seems likely that question will be addressed by specific app developers. Given the wide variations in health systems internationally, engineers said they felt it was best for local authorities to develop their own verification system to align with their system for distribution tests.\nOne of the biggest lingering questions around the project is whether it will be adopted by public health agencies, and the companies gave no further details on specific partnerships. However, they said they had discussed the project with dozens of stakeholders, including public health agencies.",
        "sentiment": -0.49350019066554046
    },
    "article_15": {
        "title": "Apple's App Store is riddled with fleeceware, the latest trend in scams - Fleeceware is an app that takes advantage of a free trial, which can cost a fortune if you forget to cancel.",
        "body": "What you need to know\nA security report claims the 3.5 million people have downloaded fleeceware from the App Store.\nSophos reports that it has found more than 30 apps considered to be fleeceware.\nFleeceware is an app that uses a free trial to sucker people into downloading it, but which often has an expensive subscription if you forget to cancel.\nA report from Sophos claims that 3.5 million people have downloaded apps that are considered fleeceware from the App Store, and that it has found more than 30 such apps on iOS.\n'Fleeceware' is a new trending type of scam that's been around for a few months now. It involves you downloading an app that you think is free, usually, it comes with a free trial lasting anywhere from a week to as little as three days. At the end of the free trial, a massively inflated subscription price kicks in, and of course if you forget to cancel the free trial, or are unaware of the impending subscription cost, you could end up getting \"fleeced\" for a lot of money.\nFrom the report:\nIn this latest round of research, we found more than 30 apps we consider fleeceware in Apple's official App Store.Many of these apps charge subscription rates like $30 per month or $9 per week after a 3- or 7-day trial period. If someone kept paying that subscription for a year, it would cost $360 or $468, respectively. For an app.\n$468 a year to subscribe to an app. Worse than the price though, is the fact that fleeceware apps tend to be nonsense like horoscopes, fortune-telling, and palm readers, as well as QR code/barcode scanners and image editing apps that show you how you would look when you're 80 years old. The report continues:\nMany of the fleeceware apps we see are advertised within the App Store as \"free\" apps, which puts the apps at odds with section 2.3.2 of the App Store Review Guidelines, which require developers to make sure their \"app description, screenshots, and previews clearly indicate whether any featured items, levels, subscriptions, etc. require additional purchases.\"If you think one of these apps is free and install it, the app presents you with a \"free trial\" notification immediately upon launching the app for the first time. This notification prompts the user to provide payment card details. In some cases, most of the useful features of the app will only be usable if you sign up for the subscription. Some users may sign up to subscribe without reading the fine print, which includes the actual cost of the subscriptions.\nOne such listed app, Zodiac Master Plus, is the 11th highest-grossing app on iPhone, and the report estimates it has pulled roughly $500k in revenue. A full table of culprit apps estimates that these apps have been downloaded 3.5 million times (3.68 million to be precise), generating $4.5 million in revenue. Remember as well that in some cases, 30% of that is going to Apple. Users are often targeted by ads that encourage people to download these apps on Instagram, TikTok and more. Furthermore, many of the apps are littered with one-star reviews and complaints about high subscription prices.\nThe report questions whether these apps are flouting App Store guidelines by failing to advertise clearly that they require a paid subscription to use. Given the massive amount of money that is seemingly being generated, it would certainly appear that many people are falling for this unfortunate tactic.\nYou can manage and cancel subscriptions within the Settings app on iOS, tap on your name, then subscriptions to manage and cancel subscriptions you might have.\nYou can read Sophos' full report here.",
        "sentiment": -0.5459541847351296
    },
    "article_16": {
        "title": "On this day, a decade ago, the first generation iPad went on sale.",
        "body": "Over a thousand apps made just for iPad. With more coming every day.\nRight now you’ll find over a thousand apps on the App Store specifically designed for iPad. And iPad can run almost all the 150,000 apps for iPhone and iPod touch — even the apps you already have. Learn more",
        "sentiment": 0.23420062474906445
    },
    "article_17": {
        "title": "iPhone SE: A powerful new smartphone in a popular design",
        "body": "Cupertino, California — Apple today announced the second-generation iPhone SE , a powerful new iPhone featuring a 4.7-inch Retina HD display, paired with Touch ID for industry-leading security. iPhone SE comes in a compact design, reinvented from the inside out, and is the most affordable iPhone. The new iPhone SE is powered by the Apple-designed A13 Bionic, the fastest chip in a smartphone, to handle the most demanding tasks. iPhone SE also features the best single-camera system ever in an iPhone, which unlocks the benefits of computational photography including Portrait mode, and is designed to withstand the elements with dust and water resistance.\niPhone SE comes in three beautiful colors — black, white and (PRODUCT)RED — and will be available for pre-order beginning Friday, April 17, starting at just $399 (US).\n“The first iPhone SE was a hit with many customers who loved its unique combination of small size, high-end performance and affordable price; the new second-generation iPhone SE builds on that great idea and improves on it in every way — including our best-ever single-camera system for great photos and videos — while still being very affordable,” said Phil Schiller, Apple’s senior vice president of Worldwide Marketing. “iPhone SE features the industry-leading performance of A13 Bionic that enables great battery life, takes stunning Portrait mode and Smart HDR photos, shoots amazing videos with stereo audio, is great for games and super fast web surfing, and is built with the same industry-leading security features our customers expect. We can’t wait to get iPhone SE into customers’ hands.”",
        "sentiment": 0.6853132527321577
    },
    "article_18": {
        "title": "Apple iPhone SE review (2020): An amazing $399 value",
        "body": "The iPhone SE is an outstanding phone for less than $400, delivering fast performance and very good cameras in a compact design. The only thing missing is Night Mode.\nWhy you can trust Tom's Guide Our expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test .\niPhone SE Specs Price: $399/£419\nCPU: A13 Bionic\nStorage: 64GB, 128GB, 256GB\nDisplay: 4.7 inches (1334 x 750)\nRear camera: 12MP (f/1.8)\nFront camera: 7MP (f/2.2)\nVideo recording: 4K video up to 60 fps\nWater resistance: IP67\nBattery life: Up to 13 hours video playback\nWireless charging: Yes (Qi)\nFast charging: Yes via optional 18W adapter\nSize: 5.45 x 2.65 x 0.29 inches\nWeight: 5.22 ounces\nThe iPhone SE (2020) remains a great phone for the money even though it's just been replaced. The iPhone SE (2022) doesn't change much if all you're looking for is the iPhone experience for as cheap as possible.\nThe 2020 model's older chip is less powerful and less efficient, plus doesn't offer features like 5G compatibility or Photographic Styles. You also don't get the new tougher front and back glass on this version. However, it's still got what you need if you're not bothered about the latest features.\nYou may find it difficult to find this model in stock these days, and given it'll likely have a shorter life of software support ahead of it than the new SE, you may be better off avoiding it. But the iPhone SE 2020 remains a good phone even with its successor now here.\nI just wish Apple trimmed the bezels on this phone and added a night mode for the camera. If you're wiling to spend more, the $699 iPhone 13 mini is a good alternative with a larger 5.4-inch display and 5G.\nRegardless, you can't deny that the iPhone SE 2020 remains one of the best phones you can buy for the money.\nThe iPhone SE costs $399/£419 (opens in new tab), the same price it debuted at in April 2020. The $399 model features 64GB of storage for $399, but you can upgrade to the 128GB version for $449/£469 and to 256GB for $549/£569.\nTrade in your old device when you buy the iPhone SE, and you could get as much as $120 off your new phone, lowering the price to $279. You can also check out the best iPhone SE deals to see if there are additional savings available.\nThe iPhone SE is available through all of the major carriers, including AT&T (opens in new tab), Sprint (opens in new tab), T-Mobile (opens in new tab) and Verizon (opens in new tab), as well as other carriers including Xfinity Mobile and Visible (opens in new tab).\niPhone SE 2020 review: Design and colors\nI generally like the iPhone SE’s design — with one exception. On the plus side, it’s a very well made handset with the same sturdy glass-and-aluminum design of the iPhone 8. There are three color options for the iPhone SE: black, white and (Product)Red. I like how the aluminum band is color matched with the back of the device.\n(Image credit: Tom's Guide)\nI tried out the black model, which looks and feels sleek but did pick up smudges despite the oleophobic coating. You’ll probably want to opt for white if you want to hide fingerprints.\n(Image credit: Tom's Guide)\nAnother plus to the iPhone SE: The whole design is almost comically compact compared to the iPhone 11 Pro Max or the new iPhone 12 Pro Max. It’s the difference between barely noticing a phone is in your front pocket and having it bulge out. I also didn’t feel any discomfort when gaming for over 30 minutes at a time; I can’t say that about my iPhone 11 Pro Max.\n(Image credit: Tom's Guide)\nThe iPhone SE measures 5.45 x 2.65 x 0.29 inches and weighs 5.22 ounces, which is smaller and narrower than the Google Pixel 4a but about the same weight. The Pixel 3a has a much bigger 5.81-inch edge-to-edge display with a hole punch cutout. However, unlike Google's budget phone, the iPhone SE 2020 has IP67 water resistance. That means it can be submerged in 1 meter of weather for up to 30 minutes. You also shouldn’t have to worry about coffee or soda spills with this phone.\n(Image credit: Tom's Guide)\nUnfortunately, the bezels around the iPhone SE’s screen look big and dated for a 2020 smartphone. I kept trying to zoom in on videos to no avail. I would have liked Apple to fit a larger display in the same size chassis.\nAnother issue is that Haptic touch does not work on the lock screen of the iPhone SE for some reason. Unlike other iPhones, you can't long press on notifications to expand them on the lock screen.\niPhone SE 2020 review: Touch ID\nAlthough Apple has offered Face ID on all of its newer phones for the past couple of years, the new iPhone SE 2020 uses a Touch ID sensor underneath the display for unlocking the device. This same sensor can be used for authorizing App Store downloads, Apple Pay and entering passwords.\n(Image credit: Tom's Guide)\nJust like I remembered, the combo Touch ID/home button worked well, and you can choose the amount of haptic feedback you prefer when you press down. The Touch ID button has a very important — and unexpected — benefit right now as many are being ordered to wear face masks in public. You can still easily unlock your iPhone SE without having to take off your mask. Face ID won’t work with masks.\niPhone SE 2020 review: Display\nA 4.7-inch screen on a modern-day phone may seem antiquated, but those shopping for one of the best small phones won’t be disappointed in this panel.\nI enjoyed checking out the Wonder Woman 1984 trailer on YouTube on the iPhone SE 2020’s Retina Display. The superhero’s gleaming red, blue and gold suit popped as she deflected bullets with her silver bracelet. The iPhone SE’s screen also did a good job rendering finer details in a Tiger King scene: I could make out individual whiskers on the majestic animal’s face.\n(Image credit: Tom's Guide)\nJust don’t expect a full HD picture. The iPhone SE’s display resolution is just 1334 x 750 pixels. We would prefer to see a 1080p display but it’s not too bad of a trade-off.\nThe iPhone SE’s screen is bright, as it’s rated for 625 nits and scored an even higher 653 nits in our testing. It’s just a bit dimmer than the Pixel 4a’s 681 nits.\nI didn’t have any issues viewing the screen outdoors when surfing the web or taking photos. The panel also supports True Tone, which means it can automatically adjust the screen’s color temperature based on the ambient lighting conditions.\nBased on our tests, the iPhone SE’s display reproduces 111.2% of the sRGB color gamut, which just barely beats the 105.8% from the Pixel 4a’s OLED panel. The iPhone SE delivers accurate colors, too, achieving a Delta-E score of 0.2; a score of zero is perfect. The Pixel 4a’s screen scored 0.29.\niPhone SE 2020 review: Cameras\nThe iPhone SE 2020’s camera is so good that you’d be hard pressed to tell the difference between it and the iPhone 11 in many cases. The one exception is Night mode, which the iPhone SE simply does not have.\n(Image credit: Tom's Guide)\nLike the iPhone 8 before it, the iPhone SE features a single 12-megapixel rear camera and a 7MP front camera. You don’t get a ultra-wide angle lens like the iPhone 11 or a telephoto lens with optical zoom like the iPhone 12 Pro models. But the iPhone SE's A13 Bionic chip boosts its camera performance in several ways.\nFor instance, you can take portraits using both the back and front camera on the iPhone SE, complete with Portrait Lighting effects and the ability to control the depth of field. The iPhone SE also benefits from Smart HDR for bringing out the highlights in faces.\n(Image credit: Tom's Guide)\nI was pleasantly surprised by the level of detail in this iPhone SE photo of a man-made pond. You can make out the drops of water in the waterfall in the distance, and the greenery pops around the rock formations. The iPhone SE also did a great job capturing the black-and-white and orange-and-white fish in that pond, as well as the blue-green water.\nThe iPhone SE held its own against the Pixel 3a in this photo of light pink cherry blossom flowers. The iPhone SE’s shot is warmer and brighter, but the Pixel 3a’s image is a bit more detailed and has more contrast.\nI also give the nod to the iPhone SE here with this portrait. My skin tone looks more natural and the bokeh effect looks very convincing. The Pixel’s manages to take a chunk out of the right side of my head. There is one small drawback to the iPhone SE when taking portraits, though; you have to get considerably closer to your subject than you do with the iPhone 11 Pro because the iPhone SE doesn’t have a telephoto lens. (You will be within 6 feet, which is not social-distancing friendly.)\nThe iPhone SE pulled ahead in this photo of an Aperol Sprtiz cocktail. The overall image just looks brighter and more appetizing. I also like how the iPhone SE blurs out the background. The only strike against the iPhone here is that the tile looks more yellow than white; the Pixel 3a got that right.\nThe one camera weakness for the iPhone SE is the lack of a Night Mode. In this photo taken outside at night, the Pixel 3a is able to render the trees in the foreground, the car in the street and the house in the background. You can barely make out anything in the iPhone SE’s shot. I don’t know if the iPhone SE could pull off a Night mode with a software upgrade, but it would be great to see Apple add the feature.\nIf you're wondering how the iPhone SE's cameras measure up to a more recent device than the Pixel 3a, check out our Google Pixel 4a vs. iPhone SE face-off for a camera comparison to Google's current budget offering.\nOn the video front, the iPhone SE can record 4K video at up to 60 fps, and you can enjoy extended dynamic range if you drop down the frame rate to 30 fps. This brings out more details in the shadows along with better highlights.\niPhone SE 2020 review: Performance\nWhile Android phone makers outfit their budget phones with weaker processors, the iPhone SE packs the same A13 Bionic chip as the iPhone 11 and iPhone 11 Pro. This means you’ll enjoy the same fast and responsive performance.\n(Image credit: Tom's Guide)\nFor example, the iPhone SE delivered silky smooth gameplay while I sped along in Sayonara Wild Hearts and tried to stay on the track in Super Impossible Road. The graphics were not as crisp due to the iPhone SE’s lower-res display, but the overall action was just as swift and enjoyable. Loading apps and switching between apps was also lag-free.\nScrolling on the iPhone SE feels slower than on phones with a 90Hz or 120Hz refresh rate, but I don’t expect that perk on a sub-$400 phone.\nOn Geekbench 5, which measures overall performance, the iPhone SE scored 3,226 on the multi-core test and 1,337 on the single-core portion. Those numbers are comparable to what the iPhone 11 (3,251 and 1,331) turned in. They also beat the Galaxy S20 , which scored 3,147 and 867 and costs $600 more.\nThe iPhone SE performed very well on real-world performance tests, too. It took the phone just 43 seconds to transcode a 4K video to 1080p after applying a few edits in the Adobe Premiere Rush app. That result actually beats the pricier Samsung Galaxy S20, which took 1 minute and 15 seconds.\nSince our testing iPhone SE review, Apple has released the iPhone 12 family, with four models powered by the faster A14 Bionic chip. Those phones outperform the iPhone SE, but make no mistake — the A13 inside Apple's cheapest iPhone still delivers a punch that tops many other devices.\niPhone SE 2020 review: Battery life and charging\nThe iPhone SE is rated for less battery life than the the iPhone 11, so you shouldn't expect the longest endurance. For instance, Apple says that the iPhone SE delivers 13 hours of video playback, versus 17 hours for the iPhone 11.\nOn the Tom's Guide Battery Test, which involves continuous web surfing over 4G LTE, the iPhone SE 2020 averaged 9 hours and 18 minutes. That's well below the endurance of the iPhone 11 (11:16), iPhone 11 Pro (10:24) and iPhone 11 Pro Max (11:54). The iPhone SE did, however, best the Pixel 4a, which scored a mere 8:55.\n(Image credit: Tom's Guide)\nIn my anecdotal testing, I found that the iPhone SE does have less staying power than my iPhone 11 Pro Max, as it has a smaller battery. For example, after unplugging the iPhone SE at 7 am and using it for web surfing, playing games, taking photos and more throughout the day, I had 20% juice left at 8 pm. That's not bad, but my iPhone 11 Pro Max still had close to 40% power.\nUnfortunately, the iPhone SE comes with Apple’s standard 5-watt Lightning charger. (The bright side? Apple stopped including chargers with last fall's iPhone 12 releases.) And with that you can expect to get to just 29% power in 30 minutes, based on our testing. If you want to be able to juice this phone to 50% in 30 minutes, you’re going to have to pay extra for an 18W charger from Apple. It’s $29 for the power brick and another $19 for the USB C to Lightning cable.\nIf you want to go wireless, the iPhone SE supports 7.5W wireless charging and supports the Qi standard. Check out all the best wireless chargers to pair with this phone.\niPhone SE vs Google Pixel 4a\nReleased after the iPhone SE, the Google Pixel 4a is a very good alternative to Apple's phone. At $349, it costs $50 less than the iPhone SE. And for that price you get a bigger 5.8-inch OLED display, much slimmer bezels and a Night mode for the camera, which the iPhone SE lacks. The Pixel 4a also offers double the storage at 128GB vs 64GB for the iPhone.\nOn the other hand, the Snapdragon 730 processor inside the Pixel 4a is slower than Apple's A13 Bionic chip. Plus, the iPhone SE has a water resistant design, as well as wireless charging. So it really comes down to whether you prefer iOS or Android.\niPhone SE 2020 review: Verdict\n(Image credit: Tom's Guide)\nThe iPhone SE 2020 is the affordable iPhone to beat, and the one of the best cheap phones you can get. It’s the closest thing to future-proof you’ll find under $400, offering the fastest performance around, very good cameras, wireless charging and a premium design that outclasses cheap Android phones.\nYes, I wish the bezels were smaller and that Apple included Night mode for the camera — and you don’t get 5G connectivity — but overall it’s hard to complain too much at this price. A 5G-capable iPhone SE 3 could be on the horizon, but it likely won't arrive until 2022.\nThe iPhone XR is a tempting alternative to the iPhone SE as it now costs just $499. For that money you bet a bigger display and bigger battery but a slower CPU and less advanced cameras. If you prefer a smaller phone, however, this handset will not disappoint. Overall, the iPhone SE is the one of the best phones for those on a budget.\niPhone SE review cheat sheet: Reasons to buy and skip\nReasons to buy the iPhone SE 2020\nA13 Bionic processor: The A13 chip is the fastest in a phone and offers smooth performance, whether you're juggling multiple apps, playing games or using AR apps.\nThe A13 chip is the fastest in a phone and offers smooth performance, whether you're juggling multiple apps, playing games or using AR apps. Solid cameras: That A13 chip also boosts the photography powers of the iPhone SE, as you get Portrait mode for the front and rear shooters, Smart HDR for better highlights and extended dynamic range in 4K video.\nThat A13 chip also boosts the photography powers of the iPhone SE, as you get Portrait mode for the front and rear shooters, Smart HDR for better highlights and extended dynamic range in 4K video. Premium design: While a lot of premium phones have plastic designs, the iPhone SE is made of glass and metal and is also IP67 water resistant.\nWhile a lot of premium phones have plastic designs, the iPhone SE is made of glass and metal and is also IP67 water resistant. Bright and colorful display: It's not full HD, but the 4.7-inch Retina Display on the iPhone SE is easy to see outdoors and provides a vibrant picture.\nIt's not full HD, but the 4.7-inch Retina Display on the iPhone SE is easy to see outdoors and provides a vibrant picture. Easy to use with one hand: Fans of small phones will appreciate how compact the iPhone SE is. And the Touch ID button lets you easily unlock the device.\nReasons to skip the iPhone SE 2020",
        "sentiment": 0.07816074745939441
    },
    "article_19": {
        "title": "Bloomberg: iPhone 12 to feature smaller notch and share design cues with iPad Pro, half-size cheaper HomePod later this year",
        "body": "Bloomberg today reports that of the four new iPhone models in the iPhone 12 lineup, at least two will feature a redesigned chassis with flat stainless steel edges, with flat sides and more sharply rounded corners like the current iPad Pro design.\nThe size of the Face ID notch is also expected to get smaller this year. Echoing previous reports, Apple is also working on a cheaper HomePod that would be about half the size of the current product. Bloomberg says the iPhone 12 and HomePod are expected to launch later this year.\nMing-Chi Kuo was first to report that the 2020 iPhones would adopt flat sides in September 2019, referencing the iPhone 4 as inspiration. Kuo also said to expect four new models, with screen sizes as large as 6.7-inch, something that Bloomberg corroborates. Only the two more expensive models will feature the LiDAR scanner, first introduced in the 2020 iPad Pro.\nIt is interesting that today’s Bloomberg report though explicitly notes that the two high-end models would get the new design; it’s not clear if the cheaper phones in the lineup would also get the new chassis.\nFlagship iPhone models usually launch around September, with some models shipping in October (iPhone XR) and November (iPhone X) in recent memory. The supply chain disruption as a result of the coronavirus means that Apple’s original goal of launching all four iPhone 12 models simultaneously is unlikely.\nBloomberg says to expect some of the models to be released several weeks later than the usual September target.\nThe smaller notch design point is interesting in the wake of leaked iconography that also shows a notably less-wide notch area. Bloomberg says Apple is exploring ways to eliminate the notch entirely in future years.\nA cheaper HomePod is certainly welcomed. Apple’s smart speaker is a great sounding music player but is very expensive compared to the competition, which offer basic audio playback and smart assistant functionality for very low prices, with products like the Amazon Echo Dot becoming popular gift items. Apple currently sells the HomePod for $299. It’s not clear how much cheaper Apple is aiming with this new model. For comparison, Amazon’s higher-end Amazon Echo Plus retails for around $170, although is regularly discounted below that.\nBloomberg also shares some additional details about the Apple AirTags, the upcoming Tile tracker competitor. The report says Apple’s tag will come bundled with a leather sleeve and a keychain attachment. The tags themselves are described as thin, small and puck-shaped. 9to5Mac found a glyph of the device in iOS code last year. Bloomberg says the AirTag should launch sometime this year, but a more specific timeframe was not mentioned.\nThe Bloomberg reported roadmap also expects new MacBook Pro hardware, an updated Apple TV, a refresh to the entry-level iPad, and an iMac update.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.14404014412027139
    },
    "article_20": {
        "title": "Apple may bring 'real' home screen widgets to iOS 14",
        "body": "Widgets have been present in iOS for years, but they're usually on a dedicated screen rather than wherever you want them to be, as with Android. Soon, however, you might have that flexibility. As part of an ongoing string of code leaks, 9to5Mac has reportedly discovered that Apple is developing a 'real' widget system for iOS 14. Codenamed \"Avocado,\" the feature would let you place widgets anywhere on your home screen as if they were app icons. The 9to5 crew warned there was a chance Apple could cut the feature (say, due to development time).\nThe news may be supported by Twitter user Dongle's recent post hinting at a new approach to wallpaper in iOS 14. Supposedly leaked screenshots of the wallpaper settings include a \"home screen appearance\" category that would allow for smart dynamic wallpapers that can be blurred, dark or flat-colored on demand. In theory, that could help widgets stand out if your usual background is too busy.\nWe wouldn't count on absolute flexibility like on Android, where you have resizable widgets and the option to place app shortcuts virtually anywhere on the home screen. If this new widget approach reaches iOS 14, though, it could go some way toward courting users who feel that iOS' home screen interface has remained largely unchanged for years.",
        "sentiment": -0.2560004644095898
    },
    "article_21": {
        "title": "DigiTimes: New AirPods to Feature AirPods Pro Design Without Noise Cancellation",
        "body": "Apple plans to release new AirPods with the same design as the existing AirPods Pro but without active noise cancellation, allowing for a lower price point, according to supply chain sources cited by Taiwanese publication DigiTimes.\nThe paywalled report claims that Apple originally planned to unveil the new AirPods in May 2020, and while Apple has apparently not yet made any adjustments to that release schedule, the supply chain sources believe that Apple may have to postpone the launch to the second half of 2020 or even 2021 due to the global health crisis.\nAn excerpt from the report:\nApple may have to defer the launch of its new AirPods Pro to the second half of 2020 or even 2021, according to sources at related suppliers. Apple originally planned to unveil the new AirPods Pro in May 2020, but the schedule may be pushed back, as Apple has been unable to send staff to the production lines in Asia to inspect the status of the TWS earbuds due to the coronavirus outbreak, the sources noted. But Apple so far has not yet made any adjustments to the earbuds' release schedule, the sources said.\nThe report refers to the earphones as new AirPods Pro, but it is quite possible these could end up being regular third-generation AirPods.\nThe current lineup includes second-generation AirPods with a wired charging case for $159, second-generation AirPods with a wireless charging case for $199, and AirPods Pro with a wireless charging case for $249.\nOver the weekend, leaker Jon Prosser said new AirPods are \"ready to go\" and will \"probably\" launch next month.",
        "sentiment": 0.027863812632858753
    },
    "article_22": {
        "title": "Amusing part of Apple's marketing guidelines for apps that are also in the Google Play Store: \"Place the App Store badge first in the lineup of badges.\"",
        "body": "PLEASE READ THE FOLLOWING APP STORE MARKETING ARTWORK LICENSE AGREEMENT (“MARKETING AGREEMENT”) CAREFULLY BEFORE DOWNLOADING OR USING THE APPLE ARTWORK (AS DEFINED BELOW). THESE TERMS AND CONDITIONS CONSTITUTE A LEGAL AGREEMENT BETWEEN YOU AND APPLE.\nBY CHECKING THE APPROPRIATE BOX IN THE APP STORE MARKETING GUIDELINES, YOU REPRESENT THAT YOU ARE AN AUTHORIZED REPRESENTATIVE FOR YOUR DEVELOPER ACCOUNT AND THAT YOU HAVE READ AND AGREE TO THE TERMS OF THIS MARKETING AGREEMENT.\nApp Store Marketing Artwork License Agreement\nWhereas, Apple Inc. (“Apple”) and You (collectively, the “Parties”) have entered into the Apple Developer Program License Agreement (as amended from time to time, “Program Agreement”); and\nWhereas, You desire to use certain artwork in connection with marketing Your applications available on the App Store pursuant to the Program Agreement, the Parties agree to enter into this Marketing Agreement effective as of the date clicked through by You. Except as expressed in writing herein, nothing in this document shall be construed to modify the Program Agreement in any way.\n1. Subject to the terms of this Marketing Agreement, Apple grants You a limited, non-exclusive, non-transferable, royalty-free, worldwide license to use the App Store badge, the App Store icon, and certain product images provided to You by Apple under this Marketing Agreement for Apple-branded products running iOS, watchOS, tvOS, or macOS (or any successor thereto) (collectively, the “Artwork”) only in connection with Your applications that are available for download on the App Store (“Applications”) and only while You are a member of the Apple Developer Program.\n2. You agree that Your use of the Artwork will be in strict compliance with the App Store Marketing and Advertising Guidelines for Developers found at https://developer.apple.com/app-store/marketing/guidelines/, which may be amended from time to time and also with Apple’s Guidelines for Using Apple Trademarks and Copyrights, found at https://www.apple.com/legal/intellectual-property/guidelinesfor3rdparties.html, which may be amended from time to time.\n3. Apple may use Your name and the name of each of Your Applications in any index of products or developers that work with Apple-branded products running iOS, watchOS, tvOS, or macOS.\n4. Apple has no obligation to provide any type of support for the Applications.\n5. Upon Apple’s request, You shall supply Apple, at no cost and with no obligation to return, suitable specimens of Your use of the Artwork to verify Your compliance with this Marketing Agreement.\n6. Apple shall remain the exclusive owner of all rights in the Artwork. Your use of the Artwork shall exclusively inure to the benefit of Apple. You will not do anything to compromise Apple’s rights in and to the Artwork, such as filing any identical or confusingly similar trademark applications anywhere in the world.\n7. THE ARTWORK IS PROVIDED TO YOU ON AN “AS IS” BASIS AND YOU ARE SOLELY RESPONSIBLE FOR YOUR USE OF THE ARTWORK. APPLE DISCLAIMS ALL WARRANTIES REGARDING THE ARTWORK, INCLUDING WARRANTIES OF NON-INFRINGEMENT. APPLE SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES ARISING FROM OR RELATED TO YOUR USE OF THE ARTWORK, OR TERMINATION OF THIS MARKETING AGREEMENT.\n8. To the extent permitted by applicable law, You agree to indemnify and hold harmless, and upon Apple’s request, defend, Apple, its directors, officers, employees, independent contractors and agents (each an \"Apple Indemnified Party\") from any and all claims, losses, liabilities, damages, taxes, expenses and costs, including without limitation, attorneys’ fees and court costs, incurred by an Apple Indemnified Party and arising from or related to Your use of the Artwork in any manner except as expressly permitted by this Marketing Agreement, or for any personal injury, product liability or other claim arising from the production, promotion, distribution, sale and/or offer for sale, and/or the performance of the Applications.\n9. This Marketing Agreement is valid and coterminous with the Program Agreement, unless otherwise terminated per the provisions below.\n10. This Marketing Agreement shall terminate automatically upon Your breach of any of the terms of this Marketing Agreement. Apple may terminate this Marketing Agreement at will upon 10 days’ written notice. If Apple terminates this Marketing Agreement, You may, except in the event that the Artwork is subject of a claim of infringement, deplete existing inventory for a period of 30 days following the notice of termination, provided such inventory is in compliance with the terms of this Marketing Agreement.\n11. Any litigation or other dispute resolution between You and Apple arising out of or relating to this Marketing Agreement will take place in the Northern District of California, and You and Apple hereby consent to the personal jurisdiction of and exclusive venue in the state and federal courts within that District with respect any such litigation or dispute resolution. This Marketing Agreement will be governed by and construed in accordance with the laws of the United States and the State of California, except that body of California law concerning conflicts of law.\nNotwithstanding the foregoing, if You are an agency, instrumentality or department of the federal government of the United States, then this Marketing Agreement shall be governed in accordance with the laws of the United States of America, and in the absence of applicable federal law, the laws of the State of California will apply. Further, and notwithstanding anything to the contrary in this Marketing Agreement (including but not limited to Section 8), all claims, demands, complaints and disputes will be subject to the Contract Disputes Act (41 U.S.C. §§601-613), the Tucker Act (28 U.S.C. § 1346(a) and § 1491), or the Federal Tort Claims Act (28 U.S.C. §§ 1346(b), 2401-2402, 2671-2672, 2674-2680), as applicable, or other applicable governing authority.\nIf You (as an entity entering into this Marketing Agreement) are a U.S. public and accredited educational institution, then (a) this Marketing Agreement will be governed and construed in accordance with the laws of the state (within the U.S.) in which Your educational institution is domiciled, except that body of state law concerning conflicts of law; and (b) any litigation or other dispute resolution between You and Apple arising out of or relating to this Marketing Agreement will take place in federal court within the Northern District of California, and You and Apple hereby consent to the personal jurisdiction of and exclusive venue of such District unless such consent is expressly prohibited by the laws of the state in which Your educational institution is domiciled.\nThis Marketing Agreement shall not be governed by the United Nations Convention on Contracts for the International Sale of Goods, the application of which is expressly excluded. If a court of competent jurisdiction finds any clause of this Marketing Agreement to be unenforceable for any reason, that clause of this Marketing Agreement shall be enforced to the maximum extent permissible so as to effect the intent of the parties, and the remainder of this Marketing Agreement shall continue in full force and effect.\n12. You shall promptly notify Apple in writing of any change in Your physical or electronic address via the App Store Connect tool and/or the Apple Developer website.\n13. The terms of this Marketing Agreement are the entire and final understanding between You and Apple concerning the Artwork.\nEA0861\n08/15/17",
        "sentiment": 0.11629279268622074
    },
    "article_23": {
        "title": "'Parks and Recreation' reunion special shot on iPhone",
        "body": "The \"Parks and Recreation\" cast returns Thursday for a reunion special that was shot on iPhone. | Source: NBC\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nPopular NBC sitcom \"Parks and Recreation,\" which last aired in 2015, is set to broadcast a special reunion episode this week to raise funds in aid of coronavirus response efforts, with the half-hour show filmed entirely on iPhone.\nAs can be expected, coordinating the scripted event while much of the U.S. is under strict quarantine orders was \"very difficult,\" \"Parks and Recreation\" co-creator Mike Schur told Variety.\nFirst Schur contacted a handful of writers from the show, who wrote the script in less than three days, then the team sent a \"little rig with a tripod,\" iPhone, light and microphones to cast members. Directors and executive producers Morgan Sackett and Dean Holland, along with script supervisor Valeria Collins, helped develop the episode.\nSchur and the ad-hoc production group directed and helped actors with camera framing and adjustments over Zoom. \"The Good Place\" graphics and effects team was also enlisted \"to make it not look like everyone was just sitting alone in their houses staring at a computer,\" Schur said.\nThe episode was shot in four days.\nWhile iPhone helped make the reunion episode a reality, Schur does not believe the process represents a shift in how television is made.\n\"Is there anything about this that points the way forward for TV production? And the answer is a resounding no,\" Schur said. \"For me, this is not the way TV is be supposed to be made. It required an incredible amount of basically goodwill volunteer work, or guild minimum, union minimum volunteer work from from sound designers and editors and supervisors and all sorts of people really just doing it, because it's a fundraiser, because it was fun to get the cast back together. But, you know, TV is a team sport. From the very beginning to the very end, it's about groups of people functioning in holistic ways with each other, and collaborating and being in the same room at the same time. And, you know, I don't think there's any way that this is a sustainable method for making television.\"\nThe special stars many of the show's original cast including Amy Poehler , Rashida Jones, Aziz Ansari, Nick Offerman, Aubrey Plaza, Chris Pratt, Adam Scott, Rob Lowe, Jim O'Heir, and Retta. Guest stars will also make appearances.\nSchur said he \"didn't think that Parks and Rec' was ever going to reunite,\" but the ongoing coronavirus pandemic presented a \"compelling reason\" to bring the cast back together. Proceeds from the special will go toward Feeding America's COVID-19 Response Fund.\nNBC will air the \"Parks and Recreation\" special on Thursday.",
        "sentiment": 0.1670381500893696
    },
    "article_24": {
        "title": "Germany flips to Apple-Google approach on smartphone contact tracing",
        "body": "BERLIN (Reuters) - Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries.\nFILE PHOTO: A sign with distancing rules and the notice that masks must be worn, is seen at the entrance of a shop, as the spread of the coronavirus disease (COVID-19) continues in Erfurt, Germany, April 24, 2020. REUTERS/Karina Hessland\nCountries are rushing to develop apps to give a detailed picture of the risk of catching the coronavirus, as the chain of infection is proving hard to break because it can be spread by those showing no symptoms.\nChancellery Minister Helge Braun and Health Minister Jens Spahn said in a joint statement that Berlin would adopt a “decentralised” approach to digital contact tracing, thus abandoning a home-grown alternative that would have given health authorities central control over tracing data.\nIn Europe, most countries have chosen short-range Bluetooth “handshakes” between mobile devices as the best way of registering a potential contact, even though it does not provide location data.\nBut they have disagreed about whether to log such contacts on individual devices or on a central server - which would be more directly useful to existing contact tracing teams that work phones and knock on doors to warn those who may be at risk.\nUnder the decentralised approach, users could opt to share their phone number or details of their symptoms - making it easier for health authorities to get in touch and give advice on the best course of action in the event they are found to be at risk.\nThis consent would be given in the app, however, and not be part of the system’s central architecture.\nAPPLE REFUSED TO BUDGE\nGermany as recently as Friday backed a centralised standard called Pan-European Privacy-Preserving Proximity Tracing (PEPP-PT), which would have needed Apple in particular to change the settings on its iPhones.\nWhen Apple refused to budge there was no alternative but to change course, said a senior government source.\nIn their joint statement, Braun and Spahn said Germany would now adopt a “strongly decentralised” approach.\n“This app should be voluntary, meet data protection standards and guarantee a high level of IT security,” they said. “The main epidemiological goal is to recognise and break chains of infection as soon as possible.”\nBluetooth-based smartphone contact tracing operates by assessing the closeness and length of contact between people and, if a person tests positive for COVID-19, telling recent contacts to call a doctor, get tested or self-isolate.\nEarly results in countries such as Singapore are modest, however, especially when set against the technology’s potential to redefine the relationship between state and individual.\nAn open letter from hundreds of scientists published last Monday warned that, if the contact tracing data was centralised, it would allow “unprecedented surveillance of society at large”.\nThe tide was already running against PEPP-PT and its main backer, German tech entrepreneur Chris Boos, as collaborators pulled out, faulting its methodology and its slowness to open up its work to wider scrutiny.\n“GRAVE ERRORS”\nOne of the members of PEPP-PT, Germany’s Fraunhofer HHI research institute, was told on Saturday that it had been taken off the project, correspondence seen by Reuters showed.\n“A series of grave errors were made by PEPP-PT regarding communication that, at the end of the day, caused serious damage and led to this decision,” Fraunhofer HHI head Thomas Wiegand said in a message to colleagues.\nGermany’s reversal brings it into line with a proposal by Apple and Google, who said this month they would develop new tools to support decentralised contact tracing. In Europe, France and Britain still back centralisation.\nCentralised apps would not work properly on Apple’s iPhone because, for Bluetooth exchanges to happen, the device would need to be unlocked with the app running in the foreground - a drain on the battery and an inconvenience to the user.\nBut the iPhone will integrate with decentralised protocols such as DP-3T, which has been developed by a Swiss-led team and has been backed by Switzerland, Austria and Estonia.\nBackers of DP-3T, short for Decentralised Privacy-Preserving Proximity Tracing, say it is still possible for users voluntarily to opt in to sharing their phone number in order to pass epidemiologically useful data - although not location - to authorities to aid contact tracing. But this would be part of an app, not of the system architecture.\nDP-3T, in a statement, welcomed Germany’s change of heart. PEPP-PT did not respond to requests for comment.",
        "sentiment": -0.534578026720771
    }
}