{
    "article_0": {
        "title": "Apple has now terminated Epic's App Store account following legal dispute between the two companies",
        "body": "As previously warned by Apple, Epic’s App Store account has now been terminated due to the Fortnite developer knowingly violating App Store policy. Epic Games still had a few apps available for iOS aside from Fortnite, and they were all removed today.\nFortnite for iOS was updated earlier this month with a new option that allowed users to purchase in-game items directly through Epic’s payment system instead of using Apple’s In-App Purchases. Once Apple removed Fortnite from the App Store, Epic Games started a public campaign and a legal battle against Apple, which led the Cupertino-based company to announce that it would terminate Epic’s developer account.\nThat’s exactly what Apple did this Friday, August 28. As first noticed by John Voorhes from MacStories on Twitter, the App Store now shows an alert saying “this app is currently not available in your country or region” when you try to access Epic’s profile or any of their apps through a direct link, such as this one from Infinity Blade Stickers app.\nIt’s worth mentioning that Epic Games has an alternative Apple account to manage its Unreal Engine, which according to a judge cannot be blocked by Apple in retaliation for the Fortnite situation. The account that was blocked today was only used to offer Fortnite and some other apps from Epic, which consequently will now prevent the company from offering any updates to its game on Apple platforms.\nUpdate: Apple has now shared an official statement about terminating Epic’s App Store account.\nWe are disappointed that we have had to terminate the Epic Games account on the App Store. We have worked with the team at Epic Games for many years on their launches and releases. The court recommended that Epic comply with the App Store guidelines while their case moves forward, guidelines they’ve followed for the past decade until they created this situation. Epic has refused. Instead they repeatedly submit Fortnite updates designed to violate the guidelines of the App Store. This is not fair to all other developers on the App Store and is putting customers in the middle of their fight. We hope that we can work together again in the future, but unfortunately that is not possible today.\nApple will follow a judge’s decision not to ban the Epic Games SARL account, which is used by Epic to offer Unreal Engine to other games and apps. Epic Games was given 14 days to update the Fortnite app according to the App Store Review Guidelines, but Epic purposely refused to update the game.\nAs expected, Epic is completely banned from the App Store, which means that the game company cannot send new apps or updates to iOS users through its developer account. If you have already downloaded Fortnite on your iPhone or iPad, you can continue playing it in its latest version approved by Apple.\nAll in-game purchases of items through Apple’s In-App Purchases system will no longer work due to Epic’s account ban. Users can also no longer restore Fortnite or in-game purchased items if they delete the app from their iPhones and iPads.\nAfter Apple’s statement, Epic Games CEO Tim Sweeney said he disagrees that the company has “spammed” the App Store review process with new Fortnite builds for iOS.\nApple's statement isn't forthright. They chose to terminate Epic's account; they didn't *have* to. Apple suggests we spammed the App Store review process. That's not so. Epic submitted three Fortnite builds: two bug-fix updates, and the Season 4 update with this note. pic.twitter.com/VpWEERDp5L — Tim Sweeney (@TimSweeneyEpic) August 28, 2020\nYesterday, Epic Games sent an email to Fortnite players once again emphasizing that the iOS and Mac versions of the game are now officially blocked from receiving updates. That means Fortnite players on Apple platforms have also lost access to multi-platform game modes. Fortnite wasn’t offered through the App Store for Mac users, however the company needs its developer account to certify the game as a trusted app.\nWhile Epic Games is now officially banned from the App Store, Apple is tactfully promoting PUBG Mobile for iOS users, which is an alternative popular battle royale game that competes directly with Fortnite.\nThe first hearing of the case between Apple and Epic Games is expected to take place at the end of September.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.40203405395408887
    },
    "article_1": {
        "title": "Apple says Epic Games CEO wanted a side deal for Fortnite",
        "body": "watch now\nApple responded to Epic Games' lawsuit accusing it of anticompetitive behavior in how it controls the App Store, telling the court that the Fortnite maker violated Apple's rules and shouldn't be placed back into the store temporarily while the legal battle rages. In its filing, Apple alleges that Epic Games asked for an individual arrangement with Apple, producing three emails from Epic CEO Tim Sweeney that bolster its claim. This is Apple's first significant legal response to Epic Games after the dispute between the two companies spilled into the courts. It comes the week after Epic Games released a direct payment mechanism inside Fortnite designed to bypass the App Store's payment system, from which Apple takes a 30% cut. Apple subsequently removed Fortnite from its store for violating its policies. People who already have Fortnite installed on their iPhones can continue to play, but cannot update or download the app for the first time. Epic sued it Apple in an attempt to force it to change its business practices and launched a \"free Fortnite\" marketing campaign portraying Apple as the villain.\nSpecial deal?\nSweeney said earlier this month that Epic is not seeking a \"special deal\" with Apple that other iOS app makers don't get. Tweet But in Friday's filing, Apple disputed that point. \"On June 30, 2020, Epic's CEO Tim Sweeney wrote my colleagues and me an email asking for a 'side letter' from Apple that would create a special deal for only Epic that would fundamentally change the way in which Epic offers apps on Apple's iOS platform,\" former Apple Senior Vice President Phil Schiller wrote in a declaration. Schiller, whose title is now Fellow, runs Apple's App Store. Apple said Sweeney was asking permission for Epic to bypass in-app purchases and allow Fortnite players to pay it directly, as well as permission to launch a third-party app store for iPhones. Schiller said that Sweeney emailed him the morning that Fortnite changed its payment mechanism saying that it \"will no longer adhere to Apple's payment processing restrictions.\"",
        "sentiment": -0.3622470280887293
    },
    "article_2": {
        "title": "Facebook warns Apple's iOS 14 could shave more than 50% from Audience Network revenue",
        "body": "Facebook co-founder, Chairman and CEO Mark Zuckerberg testifies before the House Energy and Commerce Committee in the Rayburn House Office Building on Capitol Hill April 11, 2018 in Washington, DC. Yasin Ozturk | Anadolu Agency | Getty Images\nFacebook on Wednesday acknowledged that Apple's upcoming iOS 14 could lead to a more than 50% drop in its Audience Network advertising business. Facebook had previously warned that iOS 14 could impact its advertising business, but the company's blog post Wednesday outlined just how specific that impact could be. The Facebook Audience Network allows mobile software developers to provide in-app advertisements targeted to users based on Facebook's data. Today, advertisers can use a unique device ID number called the IDFA to better target ads and estimate their effectiveness. In iOS 14, each app that wants to use these identifiers will ask users to opt in to tracking when the app is first launched. Facebook said its apps will not collect IDFA information on iOS 14.\nwatch now\nFacebook says more than 1 billion people see at least one Audience Network ad every month, although many of those are probably using Android phones and will not be affected by the change. Facebook derives nearly all of its revenue from advertising, but it's not known what percentage is attributable to the Audience Network versus ads on Facebook and other properties.\nApple has not said when iOS 14 will launch, but it's expected to roll out this year. The social network published a blog outlining steps it will take to ensure its advertising business is in compliance with Apple's requirements. These steps will limit how effectively Facebook and its advertisers can target ads to iPhone and iPad users. \"We know this may severely impact publishers' ability to monetize through Audience Network on iOS 14, and, despite our best efforts, may render Audience Network so ineffective on iOS 14 that it may not make sense to offer it on iOS14 in the future,\" Facebook said in a blog post. \"While it's difficult to quantify the impact to publishers and developers at this point with so many unknowns, in testing we've seen more than a 50% drop in Audience Network publisher revenue when personalization was removed from mobile ad install campaigns,\" Facebook said. \"In reality, the impact to Audience Network on iOS 14 may be much more, so we are working on short-and long-term strategies to support publishers through these changes.\" Facebook shares closed up more than 8% Wednesday despite its announcement.",
        "sentiment": -0.46899450884666294
    },
    "article_3": {
        "title": "Microsoft fires back at Apple, accusing it of treating gaming apps 'differently'",
        "body": "Credit: Microsoft\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nHour after Apple explained why Microsoft's xCloud wouldn't be coming to iOS, Microsoft shot back and accused the company of \"consistently treating gaming apps differently.\"\nOn Wednesday, Microsoft ended its xCloud TestFlight program on iOS and said that the service would not be arriving on iPhone and iPad. In a statement on Thursday, Apple explained that it bars apps which rely on cloud streaming, per its App Store guidelines.\nMicrosoft shot back at the Cupertino tech giant later on Thursday, issuing a statement to CNET that accused Apple of treating gaming apps unfairly compared to other apps on its app marketplace.\n\"Apple stands alone as the only general purpose platform to deny customers from cloud gaming and game subscription services like Xbox Game Pass,\" a Microsoft spokesperson said. \"And, it consistently treats gaming apps differently, applying more lenient rules to non-gaming apps even when they include interactive content.\"\nMicrosoft admitted that it doesn't currently have a path to bring its gaming service to the App Store. However, it also said that \"we are committed to finding a path to bring cloud gaming with Xbox Game Pass Ultimate to the iOS platform.\"\n\"We believe that the customer should be at the heart of the gaming experience, and gamers tell us they want to play, connect, and share anywhere, no matter where they are,\" Microsoft added.\nThe specific rule in Apple's App Store guidelines that prohibits gaming apps from offering a catalog of games streamed from the cloud is guideline 3.1.2(a), which says that \"each game must be downloaded directly from the App Store.\"\nApple's own Apple Arcade is subject to the same rules. Instead of streaming the catalog from Apple servers, users must individually download each Apple Arcade game directly to their device before playing them.",
        "sentiment": -0.3535442797666682
    },
    "article_4": {
        "title": "Apple showing signs it may soon launch a search engine to compete against Google Search",
        "body": "Apple showing signs it may soon launch a search engine to compete against Google Search Changes in Spotlight Search on iOS and iPadOS 14 beta, a significant update to its Applebot support page, and an increase in crawling from AppleBot signify that Apple may be launching a search engine soon.\nFor several years, it’s been reported that Google pays billions of dollars to Apple to remain the default search engine on Safari for iOS, iPadOS, and macOS. The deal ensures that iPhone, iPad, and Mac users search with Google when they use Safari. That is unless they manually change the default search engine in Safari’s preferences.\nThe deal between Apple and Google may be coming to an end soon. In July 2020, Reuters reported that the U.K. Competition and Markets Authority was taking aim at the deal.\nGiven the impact of preinstallations and defaults on mobile devices and Apple’s significant market share, it is our view that Apple’s existing arrangements with Google create a significant barrier to entry and expansion for rivals affecting competition between search engines on mobiles. U.K. Competition and Markets Authority Report\nIf the U.K. regulators take action, there may be a ripple effect from the European Union, which has a history of going after Google for anti-competitive behavior. Regulators in Europe may force Apple to remove Google as the default search engine and have users choose which search engine they want to use when they first launch Safari.\nWhy Apple might be launching a search engine\nRegulatory pressure, a contentious relationship with Google, and the maturation of Apple’s Siri and iCloud are presenting an opportunity for Apple to create and launch a search engine. There are several signs right now that indicate Apple may be doing just that.\nApple doesn’t need Google’s money\nApple is now the world’s most valuable company. They may want the money Google gives them, but they don’t need it.\nApple is pouring resources and money into search\nApple is investing heavily in search, as shown in their job postings for search engineers. The job listings reveal they incorporate AI, ML, NLP, and more into all of their services and apps.\niOS and iPadOS 14 beta bypasses Google Search with Spotlight Search\nIt’s not clear if Apple uses Bing anymore, as results are labeled only as Siri Suggestions. It is clear that Apple has started to return search results within Spotlight Search and is completely bypassing Google altogether.\nIn July 2020, Apple published a significant update to its About Applebot support page. The additions are very similar to the details Google provides to webmasters and SEOs. Here are the changes they made to the Applebot support page.\nAdded how to verify traffic from Applebot\nExpanded details on the Applebot user agent, including differences between its desktop and mobile version\nExpanded robots.txt rules\nAdded a section stating that they don’t just crawl HTML, but also render pages similar to Google\nAdded a section on search rankings and the factors that affect how it ranks web search results\nApplebot has been busy crawling sites\nChecking my server logs on WP Engine revealed that Applebot had been regularly crawling my sites daily, something I haven’t noticed until now.\nServer log of Applebot crawling Coywolf News\nWhat Apple has to gain from launching a search engine\nA search engine from Apple will likely look and function slightly different from modern search engines like Google, Bing, and DuckDuckGo. That’s because Apple historically likes to do things differently, and their search engine will serve a different purpose than showing ads and data mining.\nBased on Apple’s numerous search engineer job descriptions, and the continued consolidation of web and app results in Spotlight Search, an Apple search engine will likely function as a highly personalized data hub. It will be similar to Google Assistant on Android, but different since it (initially) won’t have ads, will be completely private, and have significantly deeper integrations with the OS.\nOne can imagine getting easy buy-in from users if they benefit from privacy, coupled with the seamless integration and personalization of their iCloud data. Apple can leverage AI and ML to deliver search results based on their email, messages, maps, events, reminders, notes, photos, files, contacts, music, news, TV shows and movies, third-party apps, documents, and more. And they can do it without ads and with the promise of real data privacy.\nApple has a lot to gain from this model. Some of the main benefits include:\nThe promotion of apps in search results that will benefit Apple’s services and detract from Google’s push towards PWAs.\nA weakening of Google’s monopoly on search and a significant blow to its ad revenue and data mining.\nThe promotion of Apple products and services. Including struggling services like Apple News+ and Apple TV+.\nContinued control and lock down of the Apple ecosystem. Users will become dependent on personalized search results with deep service and product integrations that are only possible via their search engine.\nThe extension of their ad serving platform will allow app developers to promote their apps in search results.\nWhat will this mean for SEO?\nIf Apple can capture enough market share, it will force SEOs to adapt and optimize for their search engine. In some ways, at least based on their Applebot documentation, tactics will remain the same. But SEOs can also expect to test and discover new opportunities that aren’t possible with Google or other modern search engines.\nAt this point, everything is based on observation and conjecture. They may never release a search engine. It’s also possible that iOS, iPadOS, and macOS users will be using it and not even be aware of it. It could be so tightly integrated into the operating system and native apps that alerts and Spotlight Searches slowly steal away queries that would have otherwise been made on Google.\nCoywolf Newsletter If you like web technology and marketing news, along with the occasional random stuff, then this is the newsletter for you. No ads. No sponsors. No spam. Only interesting and timely stories. Unsubscribe anytime. Email * Let’s do this",
        "sentiment": -0.09618645373220537
    },
    "article_5": {
        "title": "Apple doubles down on iOS 14 tracking privacy as Facebook panics",
        "body": "One of the key privacy features in iOS 14 is a new option that allows users to disable tracking between different applications. During its quarterly earnings call last month, Facebook pointed out that the new tracking setting could impact its advertising revenue, and a new report from The Information today goes into more detail.\nThe report explains that Facebook representatives have been meeting with mobile game companies to discuss the iOS 14 privacy change. Gaming companies are a key advertising partner for Facebook, and it is using these meetings as a way to hear “concerns” from such advertisers.\nTo ease their concerns, Facebook representatives have been meeting with gaming companies, say two people familiar with the meetings. Besides reassuring this important group of customers, Facebook employees have been engaged in trying to get more information about the upcoming Apple shift, according to one gaming executive who has been meeting with them.\nThe likely outcome is that gaming companies spend less on “app-install advertisements.” This is an advertising category that directly asks people to download an app or game, but without the more detailed targeting data, they could prove to be less successful on iOS 14.\nInterestingly, the report from The Information does note that Apple itself could lose out if the iOS 14 privacy changes have an impact on the mobile gaming industry. Citing data from Sensor Tower, the report says that 68% of all revenue from the App Store came from games last year.\nNonetheless, Apple is doubling down on its commitment to user privacy in iOS 14. In a statement, the company said that targeted advertising is welcome, but that it is something users should have control over:\nAn Apple spokesperson said the company welcomes targeted advertising, but it wants to give users the ability to opt in to those types of ads. If someone doesn’t want to be tracked, Apple will tell the app’s developer, which needs to make sure the app is complying. Apple says it could ban any app that continues to track users against their wishes.\nThe iOS 14 feature in question allows users to disable tracking between different applications. In iOS 14, developers will be required to ask for permission before tracking a user across apps or websites:\nApple requires app developers to ask for permission before they track you or your device across apps or websites they don’t own in order to target advertising to you, measure your actions due to advertising, or to share your information with data brokers.\nThe new privacy controls are accessible in iOS 14 by opening the Settings app, then looking for the Privacy menu.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.14908285870363838
    },
    "article_6": {
        "title": "Apple asks UK retail landlords to cut rent by 50% and offer a ‘rent-free period’ due to COVID-19",
        "body": "Apple is reportedly asking its retail store landlords in the UK to slash its rent by as much as 50%, according to a new report from The Sunday Times. If landlords agree to cut the rent and offer a “rent-free period,” Apple is allegedly prepared to extend its leases by several years.\nThe report explains that Apple would like its rent to match what is being paid by other retailers amid the slowdown caused by the COVID-19 pandemic. In light of the COVID-19 shutdown and much lower foot traffic, many mall operators in the UK offered discounted rent to their tenants. Simply put, mall operators are looking to incentivize struggling tenants to stick to their lease despite the economic downturn.\nApple’s pitch, according to today’s report, is that if the landlords cut rent by as much as 50% and offer a “rent-free period,” Apple will extend its leases by several years. Landlords have a vested interest in keeping Apple has a tenant. Apple Stores regularly come in at the top in terms of retail profit-per-square-foot, and the foot traffic generated by Apple Stores is beneficial to the malls and other retailers.\nThe report explains:\nThe tech giant has told landlords of a portion of its 38-store estate in the UK that it wants rents slashed by up to 50% and a rent-free period. In return, it has offered to extend leases by a few years Apple is seeking to bring its rents into line with other retailers, many of which are benefiting from cut-price deals as landlords struggle to keep their shopping centres occupied. The company’s proposals are understood to relate to stores with several years left to run on their leases, meaning that landlords are not yet obliged to make a decision. Apple declined to comment.\nUltimately, the report points out that landlords don’t have to make a decision just yet, since Apple still has several years left on many of its existing leasing throughout the UK.\nFor context, the UK mall operator Intu, which owns 17 shopping centers in the UK and two in Spain, recently filed for bankruptcy. Apple operates retail stores in several malls that are owned by Intu. Meanwhile, Apple just reported record earnings for Q3 2020, including revenue of $59.7 billion and profit of $11.25 billion.\nApple operates 38 retail stores in the United Kingdom in total, and all 38 of them have reopened following shutdowns caused by the COVID-19 pandemic. You can keep track of the Apple Store reopening (and re-closing) process in our guide.\nFollow our retail guide for in-depth coverage of the latest Apple Store news.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.06482132045286042
    },
    "article_7": {
        "title": "Instagram could face up up to $500 billion in fines in class-action lawsuit alleging it illegally harvested biometric data",
        "body": "A new lawsuit accuses Instagram of collecting people's biometric data without their consent in violation of a state law.\naccuses of collecting people's data without their consent in violation of a state law. Last month, Facebook — which owns Instagram — offered $650 million to settle a similar lawsuit alleging that Facebook's photo-tagging collected biometric data without users' consent.\n— which owns Instagram — offered $650 million to settle a similar lawsuit alleging that Facebook's photo-tagging collected biometric data without users' consent. Under the law, Facebook could be faced to pay up to $5,000 per violation for as many as 100 million Instagram users, totalling half a trillion dollars at most.\nA Facebook spokesperson called the suit \"baseless\" and said Instagram does not use facial recognition .\nAdvertisement\nInstagram is accused of illegally harvesting people's biometric data without their knowledge or consent in a new class action lawsuit filed against Facebook, Instagram's parent company.\nThe lawsuit, Whalen v. Facebook, claims that Instagram has a face-tagging tool that uses facial recognition to identify people and create a \"face template\" that is stored in its database. While Instagram discloses this practice in its terms of service, the lawsuit alleges that the tool automatically scans the faces of people pictured in other users' posts, even if they don't use Instagram and didn't agree to the terms of service.\nThat practice violates an Illinois state law that bans companies from collecting people's biometric data — like a facial recognition scan — without their knowledge or consent, the lawsuit alleges.\nEvent Alert India's leading MSME Summit BI India is back with its 3rd edition Meet industry experts policymakers, business leaders from across sectors Register Now Our Speakers Rajnish Kumar Former SBI Chairman Ankur Warikoo Educator & Content Creator Bharat Sethi CEO & Founder Rage Coffee Ajay Thakur Head - BSE SME & Startups T Koshy CEO, ONDC\n\"Once Facebook captures its Instagram users' protected biometrics, it uses them to bolster its facial recognition abilities across all of its products, including the Facebook application, and shares this information among various entities. Facebook does all of this without providing any of the required notices or disclosures required by Illinois law,\" the plaintiffs wrote in their complaint.\nIn a statement to Business Insider, Facebook spokesperson Stephanie Otway said Instagram does not use facial recognition in the way the Facebook app does.\nAdvertisement\n\"This suit is baseless. Instagram doesn't use Face Recognition technology,\" Otway said.\nFacebook has already faced litigation stemming from the Illinois law. Last month, the company offered to pay $650 million to settle a lawsuit that claimed a similar face-tagging tool was being deployed on Facebook users without their consent.\nThe new class action Instagram lawsuit seeks damages for as many as 100 million Instagram users. Under the Illinois law, Facebook could be forced to pay $1,000 to $5,000 per violation, meaning the full damages could reach $500 billion if Facebook is found responsible.\nFacebook did not immediately respond to a request for comment.",
        "sentiment": -0.896952548623085
    },
    "article_8": {
        "title": "Wavēy — A set of vibrant wallpapers",
        "body": "Includes an additional 4 variants for all 4 wallpaper themes, plus a 'Dark Moon' exclusive\nIncludes an additional 2 variants for all 4 wallpaper themes, plus a 'Dark Moon' exclusive\nApple Shortcuts to bulk download to your devices and apply with two taps\nSave all the wallpapers to your devices instantly and switch between them with handy shortcuts",
        "sentiment": 0
    },
    "article_9": {
        "title": "New anti-encryption bill worse than EARN IT, would force a backdoor into any US device/software. Act now to stop both.",
        "body": "Outline of the Lawful Access to Encrypted Data Act\nSenators Graham, Blackburn, and Cotton call the Lawful Access to Encrypted Data Act (press release): \"a bill to bolster national security interests and better protect communities across the country by ending the use of “warrant-proof” encrypted technology by terrorists and other bad actors to conceal illicit behavior\".\nThey justify the proposed bill with the threat from terrorists and pedophiles: \"Tech companies’ increasing reliance on encryption has turned their platforms into a new, lawless playground of criminal activity. Criminals from child predators to terrorists are taking full advantage\", says Cotton. He wants to \"end the Wild West of crime on the Internet\".\nInstead, Cotton wants to open the Wild West for law enforcement and the authorities. Once surveillance laws such as an encryption backdoor for the \"good guys\" is available, it's just a matter of time until the \"good guys\" turn bad or abuse their power. History has taught us that often enough so we should be able to understand the threat of an Orwellian-like surveillance by the government. In Germany alone, we had two oppressive governments in the last one hundred years that taught us why government surveillance is very dangerous: the GDR and Nazi Germany.\nPublic opinion objects to an encryption backdoor\nBy stressing the fact that tech companies must decrypt sensitive information only after a court issues a warrant, the three Senators believe they can swing the public opinion in favor of this encryption backdoor law.\nHowever, the backbone of the internet relies on unbreakable encryption. We need it for banking, for storing sensitive documents, for having a private communication online. Of course, the Senators argue that the backdoor they are demanding would be only available to the 'good guys' only. However, cryptography experts have already explored in detail if and how an encryption backdoor could be realized.\nThe conclusion has always been the same: While implementing a backdoor is easy, limiting its access to the 'good guys' only is impossible.\nHow would such a backdoor work?\nTo comply with decryption orders such as demanded by the Lawful Access to Encrypted Data Act, online services would need to have central access to all encrypted data, possibly with a general decryption key. When being presented with a court order, they would have to decrypt the data of this particular user - leaving the data of all other users untouched.\nThis process is done by employees, by people. Consequently, one can imagine how hard - if not impossible - it would be to secure the general key from abuse and mistakes. Particularly when considering the high value that such a general key would have to malicious attackers, state actors (also from abroad), and others.\nWith the constantly rising number of breaches, shown by this data breach report, one can imagine that it would not take long before some malicious actor on the internet got access to this general key, rendering all encryption for all users futile.\nHow devastating this would be, becomes obvious when looking at one of the most severe data breaches of 2020: The so-called BlueLeaks breach exposed files from hundreds of US police departments, including personal information of suspects and convicted criminals alike.\nStop the Lawful Access to Encrypted Data Act\nJust like the EARN IT bill, we must stop the proposed Lawful Access to Encrypted Data Act. Please take action and stop this attack on encryption of US companies. Here is how.",
        "sentiment": -0.49328524112701416
    },
    "article_10": {
        "title": "Apple’s low-carbon aluminum is a climate game-changer - The lightweight metal is chemically the same as the mass-produced version used in products like foil, soda cans, bike frames, and car doors. But it’s made using a process that doesn’t result in the immediate release of greenhouse gases.",
        "body": "When Apple announced new climate goals last week, the tech giant revealed that some of its sleek, silvery laptops will include a novel material: “low-carbon” aluminum. The lightweight metal is chemically the same as the mass-produced version used in products like foil, soda cans, bike frames, and car doors. But it’s made using a different industrial process — one that doesn’t result in the direct release of greenhouse gases.\nApple is poised to become the first company to include some of this low-carbon aluminum in its products. For experts in the field, this amounts to a breakthrough after decades of development. But while the laptops prove this new approach is viable, researchers are still figuring out how to scale up the material’s production so it can be an option for the entire aluminum sector. If they succeed, the alternative process could eliminate a significant chunk of aluminum’s carbon footprint.\n“This is a pivotal moment,” Donald Sadoway, a professor of materials chemistry at the Massachusetts Institute of Technology, or MIT.\nThe news arrives as the global aluminum industry grapples with rising greenhouse gas emissions. Even as consumers diligently recycle cans and electronics, repurposed aluminum still only accounts for about one-third of the global market. All told, producing new aluminum results in about 1 percent of global annual emissions. But demand, production, and consumption have climbed in recent years — particularly in China, which still relies heavily on coal-fired power plants.\nTo support our nonprofit environmental journalism, please consider disabling your ad-blocker to allow ads on Grist. Here's How\nApple said aluminum represented 27 percent of its product manufacturing footprint in 2015. The tech firm now uses more recycled aluminum in its devices and prioritizes suppliers who run their facilities with hydropower, not coal. Such efforts have reduced Apple’s aluminum-related emissions by 63 percent, the company reported in March. To address the rest of its aluminum footprint, Apple is partnering with the firm Elysis to create a supply chain for low-carbon aluminum. In July, Apple announced the first batch of the material would be incorporated into its 16-inch Macbook Pros.\nReader support helps sustain our work. Donate today to keep our climate news free. One Time\nMonthly $120\n$180\nOther\nDonate $10\n$15\nOther\nDonate\nNeither company disclosed how much of the novel aluminum will be mixed into the Macbook Pros. But once laptops hit the shelves, they could potentially spur a larger shift toward cleaner materials in a highly carbon-intensive industry.\n“That will break open the floodgates for all sorts of other consumers to say, ‘We want green aluminum, too,’’’ Sadoway said.\nAluminum is the most abundant metal in the Earth’s crust, though it doesn’t naturally occur in an easy-to-scoop form. Mining companies must scrape topsoil to extract bauxite, a reddish clay rock that’s rich in alumina (also called aluminum oxide). Refineries next separate out alumina so it resembles a fine white table salt. Finally, the alumina is heated and melted — or smelted — to make aluminum. This last step contributes the most to climate change, as it results in the direct release of greenhouse gases, and it’s where researchers are searching for innovation.\nTo support our nonprofit environmental journalism, please consider disabling your ad-blocker to allow ads on Grist. Here's How\nSmelting involves dissolving alumina in a molten salt bath that’s heated to over 1,700 degrees Fahrenheit. Large carbon blocks (or “anodes”) are lowered down into the highly corrosive bath; electrical currents then run through the entire structure. Aluminum deposits at the bottom as oxygen combines with carbon in the blocks, creating carbon dioxide as a byproduct.\nOn average, the electrochemical process of smelting contributes about 14 percent of total emissions from global aluminum production. Another 70 percent comes from the electricity used to run the smelters, said Guðrún Arnbjörg Sævarsdóttir, an associate professor at Reykjavik University in Iceland. However, in places where smelters tap into clean power, there is virtually no emissions from electricity use. So the biggest carbon challenge is the smelting process itself, she said.\nApple’s low-carbon aluminum supplier uses an alternative electrochemical process that emits only oxygen.\nElysis, based in Montreal, is a joint venture of the global mining giants Alcoa and Rio Tinto and is supported by the Canadian government. In lieu of carbon blocks, Elysis uses materials that can separate aluminum without causing a chemical reaction. The company made its first commercial batch last year at the Alcoa Technical Center in Pittsburgh, and it sold the supply to Apple in December. The two-year-old firm is currently building a $37 million ($50 million CAD) research facility in Saguenay, Quebec.\nElysis hasn’t shared exactly which materials it uses in its system. But scientists around the world have studied a similar concept since the 1980s. The basic idea is to use chemically inactive, or “inert,” metallic alloys in the anodes, through which the electrical currents flow. MIT’s Sadoway previously researched carbon alternatives as a way of reducing electricity use in smelters. Today, programs in China, Norway, Russia, and Iceland are using inert anodes to make aluminum in lower-temperature conditions. Arctus Metal, a small firm in Reykjavik, recently produced its first batch — a one-pound ingot — from its lab.\n“This is like the Holy Grail of aluminum production,” Sævarsdóttir said of the efforts.\nSævarsdóttir is involved with Arctus Metal’s research on carbon-free smelting. The company is now scaling its demonstration unit, which uses a 500-amp electric current, to run on up to 10,000 amps, said CEO Jón Hjaltalín Magnússon. (A commercial-scale smelter will run on up to 200,000 amps.) If adopted by Iceland’s three aluminum smelters — which use geothermal and hydropower — the technology would eliminate about one-third of the country’s total emissions, he said.\nResearchers still need to resolve key technical issues before inert anodes can be used at industrial scale. Mainly, the materials require higher voltages of electricity to make aluminum, which drives up smelters’ electricity use and costs. Companies must design more energy-efficient systems so that low-carbon aluminum doesn’t become too expensive or unappealing for construction companies, beverage can makers, and other major buyers of aluminum.\nFor the wider aluminum industry, the most pressing concern remains reducing carbon pollution from power plants.\nSince 2000, smelters have actually grown more reliant on coal and natural gas for electricity, even as solar projects and wind farms proliferate around the world. Many facilities in the Americas and Europe shuttered in recent years, and a significant share of production shifted to China and countries in the Middle East. The result is a market awash in abundant, relatively cheap aluminum — with which low-carbon alternatives will have to contend.\n“The competition on the global scale is really hard,” said Sadoway, who also runs a startup, Boston Metal, that’s developing a carbon-free steelmaking process. Ventures like Elysis, he said, “have a very, very steep hill to climb.”\nExpanding low-carbon aluminum use will require companies and governments to take deliberate steps, Sævarsdóttir said. For instance, putting a carbon tax on consumer products would make it more expensive to buy conventionally made aluminum. Such a system could pressure manufacturers to adopt low-carbon technologies and encourage contractors to source more sustainable materials for construction projects. Or corporations could simply follow in Apple’s footsteps and commit to buying products with lower supply-chain emissions.\nIt’s still unclear how far Apple will go in adopting low-carbon aluminum across its other product lines, or whether producers like Elysis can ultimately scale their technologies beyond the lab (or a single company) and into other industrial facilities. Still, the initiative is an important sign that major companies are willing to invest in greener metals.\n“I really approve of what Apple is doing,” Sævarsdóttir said. “This is the way we must go.”",
        "sentiment": -0.03716211910427049
    },
    "article_11": {
        "title": "I have finally released my app that shows weather along your route. Thank you to almost 1000 redditors beta testers!",
        "body": "A Road Trip Weather App\nWeather on the Way is a new travel weather app that provides a detailed weather forecast for your driving route. Thanks to combining forecasting and navigation, you get weather conditions precisely at a time you will be driving through.\nPerfect for road trips Check the radar ahead For longer trips add waypoints and stops along the route. Set the stop duration and get the perfect forecast for the next day!\nPick a route, avoid a storm No more unexpected delays Check alternative routes to make sure you have picked one with the best weather\nFull of details Every step of the way Temperature, conditions, visibility, precipitation, wind speed, UV Index and more\nPlan in advance Up to 7 days before departure Swipe left and right to find the best time to leave.\nBe aware of severe conditions Stay safe on the road Weather alerts and radar along your driving route.\nCheck wind conditions Speed, direction and gusts Driving a large vechicle like an RV or towing a trailer?\nCheck for dangerous wind to avoid a risk of rollover.\n★★★★★ \"Literally saving my trip! [...] The app showed warnings where smoke and air quality were dangerous and I was able to pick a new route. So grateful!!\" – Rayellen ★★★★★ \"Why can’t google maps be like this. Finally, someone does it and they do it RIGHT. [...] Genius.\n– Happy user! ★★★★★ \"Awesome! This app is ESSENTIAL for any road trips lasting more than an hour.\"\n– talon09 ★★★★★ \"It’s always frustrating that my other major map programs don’t show time zone changes or weather. Score on both counts! Nice.\"\n– Ohiocoalman\nFEATURED ON",
        "sentiment": 0.5996215825989133
    },
    "article_12": {
        "title": "Tim Cook joins the billionaire club as Apple’s value climbs toward $2 trillion",
        "body": "Apple CEO Tim Cook has officially become a billionaire, according to a new report from Bloomberg today. The report cites an analysis of regulatory filings and acknowledges that Cook’s net worth “could be lower” if he’s made undisclosed charitable gifts.\nAccording to data compiled by the Bloomberg Billionaires Index, Cook’s net worth has crossed $1 billion recently, something that is rare for a CEO “who didn’t actually found” the company he runs. The $1 billion net worth estimate was made based on regulatory filings and estimations based on market performance:\nCook’s net worth estimate is based on an analysis of regulatory filings and applying the market performance of a typical wealthy investor to his proceeds from share sales. Cook, 59, said in 2015 that he plans to give most of his fortune away and has already gifted million of dollars worth of Apple shares. His wealth could be lower if he’s made other undisclosed charitable gifts.\nThe report explains that the vast majority of Cook’s wealth has come from “equity awards he’s received since joining Apple in 1998.” Cook was given an award of restricted shares on his first day as CEO, and he will likely receive his ninth payout from the award later this month.\nAs of right now, Cook owns 847,969 shares directly, or about 0.02% of Apple shares, worth around $375 million. Proceeds from previous share sales, dividends and other compensation add another $650 million to his net worth, taking the Apple CEO over the $1 billion net worth mark. The ninth payout later this month will add around another $100 million to Cook’s net worth, Bloomberg estimates.\nTim Cook’s new billionaire status comes as Apple stock has increased almost 5% in the past week, pushing it closer to a $2 trillion market valuation. Apple hit the $1 trillion market value milestone two years ago, but the number is already flirting with $2 trillion.\nBloomberg says that Apple declined to comment on the report of Tim Cook’s $1 billion net worth. In the past, Cook has said that he will be giving away the majority of his fortune through a systematic approach to philanthropy.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.09753462776322575
    },
    "article_13": {
        "title": "Mineswifter: I made a beautiful and modern Minesweeper app for iOS and macOS with no 50/50 guesses and unlimited hints, then made an evil version where the boards are impossible and the hint system makes fun of you. Currently free, no ads or in-app purchases.",
        "body": "Minesweeper – it's all fun and games until that 50/50 guess. So we decided to remove the guessing.\nMineswifter uses an advanced Minesweeper AI to make sure each board is solvable before giving it to you. This lets you skip the nonsense and SWIFTLY go to the boards you actually wanted to play.\nPERFECTLY NATURAL\nMineswifter is designed with a modern and beautiful user interface. Customize everything from the background colors to your play style to make the game work exactly the way you want.\nREAL HINTS\nEvery board is solvable, but not every board is easy. That's why we added a hint system that uses the power of the Minesweeper AI to show you exactly which part of the board is solvable next.\nUNDO YOUR MISTAKES\nAccidentally click on a mine? No problem! Since every board is solvable, there are no game overs – simply click the Undo popover and keep playing. Mistakes add 10 seconds to your time.\nSTAT TRACKING\nThe main statistic tracked in Mineswifter is the perfect game, which is a board completed without mistakes or hints. Try to beat your longest perfect streak or your average time!\nDAILY CHALLENGES\nMineswifter also offers daily challenges, which can generally be completed within a few minutes. Each one is carefully curated to make sure it's fun and rewarding for both new and experienced players. Check the stats to compare your performance to players from around the world!",
        "sentiment": 0.3988558229278116
    },
    "article_14": {
        "title": "iOS 14 lets users grant approximate location access for apps that don't require exact GPS tracking",
        "body": "An iOS 14 feature that has gone a bit under the radar is the Precise Location toggle for Location Services. This new toggle gives the user more control over which apps can access your current location, and to what granularity.\nBefore iOS 14, you could grant an app access to your location whilst using the app, or always. However, if location access was allowed, the app would always get an exact coordinate. A lot of apps don’t actually need such precise location information, and iOS 14 offers that flexibility, including asking the user upfront in the permissions dialog.\nWhilst navigation apps require exact location in order to function, many classes of applications do not need GPS-level positioning. For instance, a weather app only needs to know your current state or city to provide current location weather. This was a feature we asked for back in 2018.\nIn its WWDC session, Apple used the example of the TV app. Streaming services have different content rights for each region, so the app needs to know the user’s location in order to show content that the user is legally allowed to watch. However, it doesn’t need exact coordinates to do this. So, in iOS 14, the TV app only requests high-level regional location data.\niOS 14 includes APIs that allow apps to declare that they only need ‘reduced accuracy’ location, so diligent app developers can only collect the minimum amount of information they need. However, iOS 14 also lets the user decide for every app if full access is actually necessary.\nHow to choose approximate or exact location permission?\nThe new Location Services permissions prompt includes a ‘Precise’ toggle button in the map sheet. In most cases, this will default to being enabled. The map will show a precise tracking dot to reflect this. If you don’t want the current app to be able to get exact location information, simply tap the toggle to off. The map preview will show a wide circular region, representative of the approximate location information that will be available to the app.\nYou can also change this preference at any time in Settings -> Privacy -> Location Services. Select the app name and then change the Precise Location switch to on or off, as desired. For apps that you granted location permissions prior to iOS 14, they will get full access automatically. So if you want to rein something in, this is how to do it.\nHow does iOS provide approximate location to apps?\nReduced accuracy location information is designed to be useful, and privacy-preserving. A naive implementation would simply mask the user’s current location with some random noise. iOS 14 is much smarter than that.\nInstead, Location Services will expose circular regions that are a few miles in diameter. The region data will only be recomputed a few times per hour, so exact tracking is not possible. The user’s true location will be somewhere inside the circular region, but not necessarily in the center.\nThe system is intelligent enough to provide location results that make sense to humans. For instance, if you are driving near the border of two states, the approximate location region will be fully inside the current state you are in. This means a weather app will always be able to show relevant local forecasts, without ever knowing exactly where you are.\nSimilarly, the radius of the approximate location regions will vary based on context. If the user is driving through a dense area of multiple cities, the radius will shrink down to a couple of kilometers to ensure the app can provide relevant results. On the flip side, if iOS knows you are driving through a wide open space, the approximate location can be much larger.\nThe reduced accuracy setting applies to background location updates too. Apps running in the background with approximate location permissions will only get told about location notifications about four times per hour, and each update will have the same imprecise granularity; a region that typically spans a few miles across.\nWhat about apps that actually need full location?\nSome apps genuinely need true accurate location, but it will be the onus of the app developer to convince users to grant it. The app will be told if it is receiving full accuracy or reduced accuracy results. It can therefore present users the interface to inform them that it needs precise location to function (like a turn-by-turn navigation app) and direct them to Settings. Apps can also request temporary full access.\nThe ideal behavior is best shown through how the Maps app works in iOS 14. If the user grants restricted location, the Maps app will show the user’s current location marker as best as it can. It puts a banner at the top of the screen to explain this. However, when a user tries to navigate to another place, the Maps app will say that it needs precise location to do the routing. You can grant full access for that session or go to Settings to enable permanent precise location permissions.\niOS 14 approximate location balances user privacy and convenience\nThis feature is well thought out. It provides meaningful privacy improvements for Apple’s customers, without punishing classes of apps unnecessarily. Precise location permissions remain the default, causing limited disruption to the app ecosystem. Well-behaved apps can volunteer to only receive reduced accuracy permissions, as they know they don’t need anything more precise. If the user disables it, the app has the opportunity to explain why it needs full location and can direct the user directly to the appropriate page in Settings.\nThe summary is that there are now two axes of location permissions in iOS 14; whether the app can always access your location or just when the app is in the foreground, and whether the location retrieved is full accuracy or approximated.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.19942763469002225
    },
    "article_15": {
        "title": "iPhone 12 to Come in 'Dark Blue' Color Option",
        "body": "Apple will offer a new \"dark blue\" model in its upcoming iPhone 12 lineup, according to a new report today.\n‌iPhone 12‌ Pro in Navy Blue concept via EverythingApplePro/Max Weinbach\nIn addition to adding a dark blue model, for the first time, into the iPhone family products, Apple also brings a number of specification upgrades to new iPhones, including camera modules, displays and communications modules.\nHit-and-miss Taiwanese publication DigiTimes claims that a dark blue iPhone color will be available \"for the first time\" in addition to several new features and specification upgrades coming to Apple's smartphone lineup.\nThe claim adds another voice to early rumors regarding the ‌iPhone 12‌ lineup and new colors becoming available.\nXDA Developers writer and leaker Max Weinbach claimed in January that at least one of the ‌iPhone 12‌ models will come with a new navy blue finish. Weinbach believes that Navy Blue could replace the Midnight Green finish that Apple debuted for ‌iPhone‌ 11 Pro models last year. Weinbach has accurately revealed a new ‌iPhone‌ color in the past.\nAnother rumor suggests the ‌iPhone 12‌ models could come in light blue, violet, and light orange, among other colors.\nToday's color tidbit appears in a report concerning the projected global shipments of Apple's upcoming ‌iPhone 12‌ lineup, which are expected to reach 63-68 million in the second half of this year, according to DigiTimes Research.\nIf accurate, the figure would present a reduction of over 5 million units compared to the number of units Apple shipped a year earlier for the ‌iPhone‌ 11 lineup. The projection factors in an expected lag of four to six weeks for volume production and a later official launch of new ‌iPhone‌ models compared to years past.\nApple last month confirmed that its \"‌‌iPhone‌‌ 12\" launch will be delayed this year due to the ongoing global health crisis and restrictions on travel. Apple last year started selling iPhones in late September, but this year, Apple projects supply will be \"available a few weeks later,\" suggesting a release sometime in October.\nMultiple rumors indicated the new ‌‌iPhone‌‌ won't launch on time due to development and production delays, as well as reports on delays from Apple suppliers like Broadcom and Qualcomm. DigiTimes has previously claimed Apple could target a phased ‌iPhone‌ launch, citing supply chain sources.\nApple is expected to offer four iPhones in three different sizes this year: A 5.4-inch ‌‌iPhone‌‌, a 6.7-inch ‌‌iPhone‌‌, and two 6.1-inch iPhones. One 6.1-inch model and the 6.7-inch model will be higher-end iPhones, while the other 6.1-inch ‌‌iPhone‌‌ and the 5.4-inch ‌‌iPhone‌‌ will be lower-end models and successors to the ‌‌iPhone‌ 11‌.\nThe report otherwise reiterates rumors about Apple's top-end 6.7-inch model, including the addition of a time-of-flight 3D camera similar to the LiDAR scanner seen in the 2020 iPad Pro, and a rear camera featuring sensor-shift optical image stabilization technology in the ultra-wide lens. Sensor-shift technology allows the optical image stabilization to be applied to the camera sensor, rather than the individual lenses.",
        "sentiment": 0.09416223238957555
    },
    "article_16": {
        "title": "Apple becomes first public company to reach a $2 trillion market cap",
        "body": "Apple has become the first public company to hit the magic milestone of having a $2 trillion market capitalization, just two years after it crossed the $1 trillion mark.\nMarket cap is the value of a share multiplied by number of shares, thereby seen as the overall value of a publicly traded firm. Apple has seen its stock almost double this year off of COVID pandemic lows in March. Investor confidence rebounded as Apple delivered strong revenue growth in many business divisions last quarter, with its services division offering promising monetization opportunities over the next few years.\nDespite wider macroeconomic weakness, big tech companies have seen their stocks surge in the last few months.\nAAPL stock fell to lows of $230 in March amongst the height of the coronavirus lockdowns, which saw Apple close all of its retail stores worldwide. However, iPhone sales have been reasonably resilient and Apple’s other business segments — like iPad and Mac — have performed well as more customers transition to working from home.\nAAPL stock exceeded $2 trillion market cap today when it crossed the $467.77 level.\nLooking forward, investors are excited by the possibilities of Apple’s content subscription services to drive more ongoing revenue. Apple led the subscriptions charge with Apple Music and is looking to repeat its success with other media. Services like Apple TV+, Apple News+, and Apple Arcade have had slow starts out of the gate but many believe they will catch on as Apple invests even more in content production and new features.\nLater this year, Apple is expected to bundle all of these services into an Amazon Prime like bundle codenamed Apple One.\nThe financial community is also hoping for a strong cycle of iPhone sales with the iPhone 12 with support for fast 5G cellular excepted to encourage customers to upgrade. The new iPhone lineup is expected to launch in October.\nOf course, stock market value can go down as well as up. For instance, if iPhone 12 sales miss expectations, if Apple cannot entice people onto its forthcoming subscription bundles, if the coronavirus pandemic returns for a damaging ‘second wave’, or if governments crackdown on the App Store monopoly in a way that financially hurts, the stock could fall back down.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.19901563144392437
    },
    "article_17": {
        "title": "Apple goes to war with the gaming industry",
        "body": "Most gamers may not view Apple as a games company to the same degree that they see Sony with PlayStation or Microsoft with Xbox, but the iPhone-maker continues to uniformly drive the industry with decisions made in the Apple App Store.\nThe company made the news a couple times late this week for App Store approvals. Once for denying a gaming app, and the other for approving one.\nThe denial was Microsoft’s xCloud gaming app, something the Xbox folks weren’t too psyched about. Microsoft xCloud is one of the Xbox’s most substantial software platform plays in quite some time, allowing gamers to live-stream titles from the cloud and play console-quality games across a number of devices. It’s a huge effort that’s been in preview for a bit, but is likely going to officially launch next month. The app had been in a Testflight preview for iOS, but as Microsoft looked to push it to primetime, Apple said not so fast.\nThe app that was approved was the Facebook Gaming app which Facebook has been trying to shove through the App Store for months to no avail. It was at last approved Friday after the company stripped one of its two central features, a library of playable mobile games. In a curt statement to The New York Times, Facebook COO Sheryl Sandberg said, “Unfortunately, we had to remove gameplay functionality entirely in order to get Apple’s approval on the stand-alone Facebook Gaming app.”\nMicrosoft’s Xbox team also took the unusually aggressive step of calling out Apple in a statement that reads, in-part, “Apple stands alone as the only general purpose platform to deny consumers from cloud gaming and game subscription services like Xbox Game Pass. And it consistently treats gaming apps differently, applying more lenient rules to non-gaming apps even when they include interactive content.”\nMicrosoft is still a $1.61 trillion company so don’t think I’m busting out the violin for them, but iOS is the world’s largest gaming platform, something CEO Tim Cook proudly proclaimed when the company launched its own game subscription platform, Apple Arcade, last year. Apple likes to play at its own pace, and all of these game-streaming platforms popping up at the same time seem poised to overwhelm them.\nThere are a few things about cloud gaming apps that seem at odds with some of the App Store’s rules, yet these rules are, of course, just guidelines written by Apple. For Apple’s part, they basically said (full statement later) that the App Store had curators for a reason and that approving apps like these means they can’t individually review the apps which compromises the App Store experience.\nTo say that’s “the reason” seems disingenuous because the company has long approved platforms to operate on the App Store without stamping approval on the individual pieces of content that can be accessed. With “Games” representing the App Store’s most popular category, Apple likely cares much more about keeping their own money straight.\nAnalysis from CNBC pinned Apple’s 2019 App Store total revenue at $50 billion.\nWhen these cloud gaming platforms like xCloud scale with zero iOS support, millions of Apple customers, myself included, are actually going to be pissed that their iPhone can’t do something that their friend’s phone can. Playing console-class titles on the iPhone would be a substantial feature upgrade for consumers. There are about 90 million Xbox Live users out there, a substantial number of which are iPhone owners I would imagine. The games industry is steadily rallying around game subscription networks and cloud gaming as a move to encourage consumers to sample more titles and discover more indie hits.\nI’ve seen enough of these sagas to realize that sometimes parties will kick off these fights purely as a tactic to get their way in negotiations and avoid workarounds, but it’s a tactic that really only works when consumers have a reason to care. Most of the bigger App Store developer spats have played in the background and come to light later, but at this point the Xbox team undoubtedly sees that Apple isn’t positioned all that well to wage an App Store war in the midst of increased antitrust attention over a cause that seems wholly focused on maintaining their edge in monetizing the games consumers play on Apple screens.\nCEO Tim Cook spent an awful lot of time in his Congressional Zoom room answering question about perceived anticompetitiveness on the company’s application storefront.\nThe big point of tension I could see happening behind closed doors is that plenty of these titles offer in-game transactions and just because that in-app purchase framework is being live-streamed from a cloud computer doesn’t mean that a user isn’t still using experiencing that content on an Apple device. I’m not sure whether this is actually the point of contention, but it seems like it would be a major threat to Apple’s ecosystem-wide in-app purchase raking.\nThe App Store does not currently support cloud gaming on Nvidia’s GeForce platform or Google’s Stadia which are also both available on Android phones. Both of these platforms are more limited in scope than Microsoft’s offering which is expected to launch with wider support and pick up wider adoption.\nWhile I can understand Apple’s desire to not have gaming titles ship that might not function properly on an iPhone because of system constraints, that argument doesn’t apply so well to the cloud gaming world where apps are translating button presses to the cloud and the cloud is sending them back the next engine-rendered frames of their game. Apple is being forced to get pretty particular about what media types of apps fall under the “reader” designation. The inherent interactivity of a cloud gaming platform seems to be the differentiation Apple is pushing here — as well as the interfaces that allows gamers to directly launch titles with an interface that’s far more specialized than some generic remote desktop app.\nAll of these platforms arrive after the company already launched Apple Arcade, a non-cloud gaming product made in the image of what Apple would like to think are the values it fosters in the gaming world: family friendly indie titles with no intrusive ads, no bothersome micro-transactions and Apple’s watchful review.\nApple’s driver’s seat position in the gaming world has been far from a wholly positive influence for the industry. Apple has acted as a gatekeeper, but the fact is plenty of the “innovations” pushed through as a result of App Store policies have been great for Apple but questionable for the development of a gamer-friendly games industry.\nApple facilitated the advent of free-to-play games by pushing in-app purchases which have been abused recklessly over the years as studios have been irresistibly pushed to structure their titles around principles of addiction. Mobile gaming has been one of the more insane areas of Wild West startup growth over the past decade and Apple’s mechanics for fueling quick transactions inside these titles has moved fast and broken things.\nTake a look at the 200 top grossing games in the App Store (data via Sensor Tower) and you’ll see that all 199 of them rely solely on in-app micro-transaction to reach that status — Microsoft’s Minecraft, ranked 50th costs $6.99 to download, though it also offers in-app purchases.\nIn 2013, the company settled a class-action lawsuit that kicked off after parents sued Apple for making it too easy for kids to make in-app purchases. In 2014, Apple settled a case with the FTC over the same mechanism for $32 million. This year, a lawsuit filed against Apple questioned the legality of “loot box” in-app purchases which gave gamers randomized digital awards.\n“Through the games it sells and offers for free to consumers through its AppStore, Apple engages in predatory practices enticing consumers, including children to engage in gambling and similar addictive conduct in violation of this and other laws designed to protect consumers and to prohibit such practices,” read that most recent lawsuit filing.\nThis is, of course, not how Apple sees its role in the gaming industry. In a statement to Business Insider responding to the company’s denial of Microsoft’s xCloud, Apple laid out its messaging.\nThe App Store was created to be a safe and trusted place for customers to discover and download apps, and a great business opportunity for all developers. Before they go on our store, all apps are reviewed against the same set of guidelines that are intended to protect customers and provide a fair and level playing field to developers. Our customers enjoy great apps and games from millions of developers, and gaming services can absolutely launch on the App Store as long as they follow the same set of guidelines applicable to all developers, including submitting games individually for review, and appearing in charts and search. In addition to the App Store, developers can choose to reach all iPhone and iPad users over the web through Safari and other browsers on the App Store.\nThe impact has — quite obviously — not been uniformly negative, but Apple has played fast and loose with industry changes when they benefit the mothership. I won’t act like plenty of Sony and Microsoft’s actions over the years haven’t offered similar affronts to gamers, but Apple exercises the industry-wide sway it holds, operating the world’s largest gaming platform, too often and gamers should be cautious in trusting the App Store owner to make decisions that have their best interests at heart.\nIf you’re reading this on the TechCrunch site, you can get more of my weekly opinions and notes on the news by subscribing to Week in Review here, and following my tweets here.",
        "sentiment": -0.20086141450939557
    },
    "article_18": {
        "title": "New iMac - The all-in-one for all",
        "body": "M1 and Ventura. With great power comes great capability.\nM1 and macOS Ventura together take iMac to exceptional levels of performance, efficiency, and security. iMac wakes from sleep almost instantly, apps launch in a flash, and the whole system feels fluid, smooth, and snappy. With up to 85 percent faster CPU performance and up to two times faster graphics performance than standard 21.5‑inch iMac models, you can use apps like Xcode and Affinity Photo to compile code in a fraction of the time or edit photos in real time. And it runs cool and quiet even while tackling these intense workloads. That’s the power of hardware, software, and silicon — all designed together.",
        "sentiment": 0.5421084647199937
    },
    "article_19": {
        "title": "YouTube starts testing native picture-in-picture feature in its iOS app",
        "body": "Picture-in-picture (or PiP) has been available for iPad users since iOS 9 and Apple has enabled it on iPhone this year with iOS 14. However, YouTube has never supported this feature, which allows users to watch videos while using other apps. This might change now as YouTube has started testing the native picture-in-picture feature in its iOS app.\nAccording to some reports on Twitter, picture-in-picture is slowly being rolled out to some users with the latest version of the YouTube app for iOS. Other reports say that the feature is only working with a few videos, which may suggest that YouTube is still implementing PiP.\n9to5Mac was able to confirm that the feature is indeed being tested with a small group of users.\nOnce you have picture-in-picture enabled, it works just like in any other app that supports it. You can start playing a video and then close the app to continue watching it in a smaller window. The video floats over the iOS home screen or any other app you are using.\nHere you can see a video of the picture-in-picture feature working on an iPad:\nPicture in Picture working on iPadOS with the YouTube app. (But only worked with this live stream, there must be some codec trickery happening behind the scenes for certain playback scenarios). pic.twitter.com/75vG7Ai4ln — Daniel Yount (@dyountmusic) August 27, 2020\nUnfortunately, YouTube limits video playback in the background on iOS to YouTube Premium subscribers, which means that picture-in-picture is also restricted to users who pay for premium YouTube features. YouTube Premium costs $11.99 per month in the U.S., but if you subscribe through the YouTube app for iOS you will end up paying $15.99 due to the 30% App Store commission.\nIt’s worth mentioning that users with devices running iOS 14, iPadOS 14, and tvOS 14 can also watch 4K HDR videos in the YouTube app for the first time since Apple decided to add support for Google’s VP9 codec to their operating systems this year.\nGoogle didn’t say when the company will enable picture-in-picture in the YouTube app on iOS for all users. If you don’t yet have the picture-in-picture feature enabled in the YouTube app or if you’re not a YouTube Premium subscriber, check out our article demonstrating how you can watch YouTube videos in PiP through Safari.\nYouTube app is available for free on the App Store.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.04075647392310202
    },
    "article_20": {
        "title": "OWC undercuts Apple's $699 Mac Pro wheels with $199 conversion kit",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nOWC has begun accepting preorders for it's Rover Pro wheel kit that allows you to easily add wheels to your Mac Pro for less than a third of the cost of Apple's add-on wheel kit.\nIf you've ever wanted to swap between wheels-on and wheels-off mode on your Mac Pro, but don't want to shell out the money for Apple's add-on wheels, OWC has got you covered with a new solution. A handy wheel conversion kit allows you to make your Mac Pro more mobile for a fraction of the cost.\nThe Rover Pro wheels can be installed in under two minutes and require no special tools. Just screw them on to your Mac Pro's factory feet and tighten them by hand. When you're done moving your computer, removing the wheels can be done in a few minutes as well. If you plan on keeping the wheels on permanently and still want a bit of extra security, the Rover Pro Kit includes wheel stops. The wheel stops clip to the casters to prevent movement, perfect for tile, laminate, and hardwood floors.\nOWC's wheels feature 360-degree articulation, non-marking soft rubber tread and low friction bearings, and a highly polished stainless steel look to match the Mac Pro.",
        "sentiment": 0.3090078681707382
    },
    "article_21": {
        "title": "'iPhone 12' will use magnets to simplify charging positioning, leak claims",
        "body": "Purported images of the interior components of an \"iPhone 12\" showing a circle of magnets\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nPhotographs purporting to be of the inside of an \"iPhone 12,\" and Apple's official cases, show a circular arrangement of magnets, possibly related to charging.\nFollowing previous reports that the \"iPhone 12\" chassis may feature smaller batteries than the iPhone 11 range, a new leak claims that there will be a series of magnets which may be related to wireless charging. Photographs show a circular arrangement of batteries within the chassis, and a seemingly identical one in what's claimed to be Apple's official \"iPhone 12\" case.\nMagnets.. inside the iPhone 12's chassis pic.twitter.com/0eJ7HRZjpW — EverythingApplePro (@EveryApplePro) August 4, 2020\nThe images were reportedly first seen on Weibo, and then posted to Twitter by EverythingApplePro. This account has previously claimed details about the \"iPhone 12,\" and also broke an iPad Pro in order to prove it could be broken.\nWhile the original tweet only says that there are magnets inside the forthcoming iPhone's chassis, EverythingApplePro followed that with a second leak. This image is purportedly of an official Apple case for the new phone and shows the same circular arrangement of magnets.\nYup. Official iPhone 12 cases will also have this magnet system built in. Likely for perfect alignment with Apple's wireless chargers. pic.twitter.com/eDEQ474NIX — EverythingApplePro (@EveryApplePro) August 5, 2020\nIt's suggested that this circular magnet arrangement may be to do with wireless charging. The new \"iPhone 12,\" or its case, might support charging other devices, in which case these magnets may keep those in place.",
        "sentiment": -0.11136610422502546
    },
    "article_22": {
        "title": "Apple waiting for improved worker conditions before starting iPhone production in Vietnam",
        "body": "Vietnam is emerging as a major manufacturing/assembly hub for many large consumer technology companies. Samsung already manufactures half of its handsets in Vietnam today.\nWe have also seen numerous reports of Apple shifting some of its AirPods as well as the rumored AirPods Studio production lines to Vietnam.\nRelated reading\nApple is evaluating setting up an iPhone assembly line in Vietnam\nAccording to local reports filed this month, a team representing Apple’s group toured the existing facilities of Luxshare-ICT Vietnam Co.\nAccording to Mr. Tang Due Bang, Foreign Affairs Manager of Luxshare-ICT, a prominent leader of Apple Group repeatedly went to its factory in Van Trung Industrial Park (Viet Yen district) to check the conditions of manufacturing iPhone phones.\n“The Apple side continually surveyed the workshop of Luxshare -ICT Vietnam Company in Bac Giang on Iphone production conditions. Apple Corporation is impressed by the speed at which our fast (3-month) facility is built here.\nAt the same time, through practical research, Apple highly appreciates the potential in Bac Giang province and hard-working workers, ” said Mr Bang to reporter Tien Phong, during an interview this month on August 3rd’ 2020.\nThe factory in Van Trung Industrial Park (about 30 hectares) was built by the company at a fast pace; completed in 5 months due to Apple’s request.\nApple Group also required that the company build dormitories for workers near the workplace as per Mr. Bang.\nApple Group is constantly evaluating setting up an iPhone production line at Luxshare – ICT Company in Bac Giang Province.\nSo Why has Apple not yet launched the new production line for its iPhones in Vietnam?\n“The Apple side comes to carefully check the welfare and safety of workers and put this issue first, especially near the production site. If there is a dormitory for workers, the employees do not have to spend a lot of living expenses and are equipped with air conditioner, water heater, washing machine, all provided in the room by Luxshare Company – ICT Vietnam.”, said Mr. Bang.\nAccording to Mr. Bang, currently, Luxshare -ICT Vietnam Company in Bac Giang has not yet met Apple’s requirements on welfare, dormitories for workers, so when the company can meet these requirements, then Apple will launch iPhone production plans here.\nCurrently, the workshop of Luxshare -ICT Vietnam Company in Van Trung Industrial Park produces wireless headphones and also makes smartwatches for Apple according to the source.\nWe believe as per widely circulated reports that Apple is currently manufacturing the AirPods as well as the new AirPods Studio units here.\nRecently, Hong Hai Group (one of the major iPhone manufacturing partners for Apple) sent a petition to the Government Office, Ministry of Construction, Ministry of Planning and Investment on the construction of 3 housing projects for workers.\nApple has gradually formed a more complete acoustics supply chain in north Vietnam, where the Cupertino, Calif., tech giant has long sourced its traditional EarPods — the wired headphones that come with iPhones — from multiple suppliers’ factories there.\nAccording to Nikkei, Many Apple suppliers, such as the two major iPhone builders Foxconn and Pegatron, and iPad maker Compal Electronics, are all expanding production in north Vietnam even though they are not necessarily helping make Apple products there at the moment. Many are currently helping other tech companies, such as Google and Amazon diversify production.\nIt is clear that Apple is actively pursuing strategies to mitigate supply chain concentration risks by exploring Vietnam, India, and other destinations for assembling their products.\nWhat is more important is that Apple is careful to uphold its value system and is actually pushing for the improvement of Worker’s living standards and other elements before committing to any large CapEx outlays in Vietnam.\nDuring the COVID-19 crisis, when priorities and values tend to get mixed up, it’s heartening to see the Cupertino giant live up to its values!\nSource: Vietnam Industrial Park and Investment information Consulting Portal",
        "sentiment": 0.38981712065637114
    },
    "article_23": {
        "title": "Warren Buffett's Stake in Apple Tripled in Value to Over $100 Billion",
        "body": "Investor Warren Buffett's stake in Apple has tripled in value to be worth over $100 billion, reports BusinessInsider.\nThe Berkshire Hathaway CEO spent $35 billion to acquire 250 million Apple shares between 2016 and 2018, according to his 2019 shareholder letter. Buffett has since sold some of his Apple holdings, and at last count owned 245 million shares, worth more than $104 billion.\nApple's third-quarter earnings pushed its stock price up by 10 percent to an intraday all-time high of $425 on Friday, raising its market capitalization to more than $1.8 trillion, making it the world's most valuable company. Both revenue and earnings per share were also June quarter records.\nApple's stock price dropped as low as $224 in March as concerns rose over the global health crisis, but has experienced a strong recovery since then, rising by over 80 percent in the last four months. Many other large tech companies, such as Amazon, Microsoft, and Google parent company Alphabet, have experienced similar surges. Apple stock has increased by around 42% this year, growing Buffett's stake by $30 billion in the past seven months alone.\nApple is the largest investment held in Berkshire Hathaway's portfolio, and worth more than four times as much as its second-largest holding; a $25 billion stake in Bank of America. Berkshire Hathaway's market capitalization currently sits at about $476 billion, suggesting its 5.7% stake in Apple accounts for more than a fifth of its entire value.\nThe value of the firm's Apple stake relative to the rest of its portfolio highlights the extent to which investors are increasingly favoring tech companies and neglecting more traditional businesses such as banks and insurers.",
        "sentiment": 0.03189686414870349
    },
    "article_24": {
        "title": "Apple Marina Bay Sands, the first Apple store that sits on the water, will open soon to customers in the heart of Singapore",
        "body": "SINGAPORE - Apple is set to open its third store in Singapore, even as the retail and tourism sectors continue to be buffeted by the Covid-19 pandemic.\nIn a statement on Monday (Aug 24), the tech giant confirmed that its third store will open at Marina Bay Sands (MBS) \"soon\", although it did not specify an opening date.\nThe new store will be situated in the dome-like structure sitting on the water off MBS that was occupied by mega nightclub Avalon from 2011 to 2016.\n\"Apple Marina Bay Sands is coming soon to Singapore, celebrating the first Apple store in the world that sits on the water,\" an Apple spokesman said.\n\"As with every Apple store around the world, Apple Marina Bay Sands will bring the best of Apple to our customers, at an iconic location in Singapore. We can't wait to see you soon.\"\nThe announcement comes after The Straits Times reported last March that Apple would be opening two more stores here at Jewel Changi Airport and MBS.\nApple's Jewel store officially opened last July. The store at Knightsbridge mall in Orchard Road, the first Apple store in South-east Asia, was opened in 2017.\nApple chief executive officer Tim Cook appeared to all but confirm the third store in his visit to the Republic last December, when he said Singapore \"could use a third store\", as the Orchard Road one was \"pretty full\".\nBut few stores in Singapore remain full at the moment, with the retail and tourism sectors both hard hit by the fallout from the Covid-19 pandemic.\nRetail sales dropped 27.8 per cent in June from a year earlier, while only 2,200 tourists came to Singapore in June compared to nearly 1.6 million for the same period last year.\nDr Seshan Ramaswami, associate professor of marketing education at the Singapore Management University, noted that it is \"unusual\" to see major store openings during crises like the ongoing pandemic.\n\"For now, the new store will likely not generate excess demand,\" he said.",
        "sentiment": -0.1311255019557263
    }
}