{
    "article_0": {
        "title": "Apple unveils M1, its first system-on-a-chip for portable Mac computers",
        "body": "Apple is unveiling its first Apple Silicon Macs today at its event that marks the beginning of the end of Intel inside Apple notebooks and desktops. The first in a family of Apple Silicon chips based on ARM is called the Apple M1 chip.\nWhat to know about M1\nM1 is an 8-core, 5 nanometer processor with unified memory architecture\nThis affords faster performance on Mac computers using M1 versus separate CPU, GPU, RAM, and other components\nM1 also touts better power efficiency with higher performance during usage with 3x performance per watt\nApple’s SoC will also be able to run iPhone and iPad apps on the Mac for the first time, including HBO MAX and Among Us\nFrom the keynote\nFirst M1 Macs\nMacBook Air will be the first Apple notebook to switch from Intel to the new ARM-based Apple Silicon M1 chip. Learn more here: Apple unveils all-new MacBook Air powered by Apple Silicon M1 chip\nMac mini will be the first Apple desktop to switch from Intel to the new ARM-based Apple Silicon M1 chip. Learn more here: Apple announces new Mac mini featuring Apple M1 chip, cheaper $699 price\nMacBook Pro 13-inch will be the first pro notebook to switch from Intel to the new ARM-based Apple Silicon M1 chip. Learn more here: Apple announces 13-inch MacBook Pro with faster performance thanks to M1 chip\nApple unleashes M1 PRESS RELEASE November 10, 2020 With industry-leading performance, powerful features, and incredible efficiency, M1 is Apple’s first chip designed specifically for the Mac M1 is Apple’s first chip designed specifically for the Mac and the most powerful chip it has ever created. Cupertino, California — Apple today announced M1, the most powerful chip it has ever created and the first chip designed specifically for the Mac. M1 is optimized for Mac systems in which small size and power efficiency are critically important. As a system on a chip (SoC), M1 combines numerous powerful technologies into a single chip, and features a unified memory architecture for dramatically improved performance and efficiency. M1 is the first personal computer chip built using cutting-edge 5-nanometer process technology and is packed with an astounding 16 billion transistors, the most Apple has ever put into a chip. It features the world’s fastest CPU core in low-power silicon, the world’s best CPU performance per watt, the world’s fastest integrated graphics in a personal computer, and breakthrough machine learning performance with the Apple Neural Engine. As a result, M1 delivers up to 3.5x faster CPU performance, up to 6x faster GPU performance, and up to 15x faster machine learning, all while enabling battery life up to 2x longer than previous-generation Macs. With its profound increase in performance and efficiency, M1 delivers the biggest leap ever for the Mac.1 “There has never been a chip like M1, our breakthrough SoC for the Mac. It builds on more than a decade of designing industry-leading chips for iPhone, iPad, and Apple Watch, and ushers in a whole new era for the Mac,” said Johny Srouji, Apple’s senior vice president of Hardware Technologies. “When it comes to low-power silicon, M1 has the world’s fastest CPU core, the world’s fastest integrated graphics in a personal computer, and the amazing machine learning performance of the Apple Neural Engine. With its unique combination of remarkable performance, powerful features, and incredible efficiency, M1 is by far the best chip we’ve ever created.” M1 is the first personal computer chip built using cutting-edge 5-nanometer process technology and is packed with an astounding 16 billion transistors. First System on a Chip for the Mac Macs and PCs have traditionally used multiple chips for the CPU, I/O, security, and more. Now with M1, these technologies are combined into a single SoC, delivering a whole new level of integration for greater performance and power efficiency. M1 also features a unified memory architecture that brings together high-bandwidth, low-latency memory into a single pool within a custom package. This allows all of the technologies in the SoC to access the same data without copying it between multiple pools of memory, further improving performance and efficiency. The World’s Best CPU Performance per Watt M1 features an 8-core CPU consisting of four high-performance cores and four high-efficiency cores. Each of the high-performance cores provides industry-leading performance for single-threaded tasks, while running as efficiently as possible. They are the world’s fastest CPU cores in low-power silicon, allowing photographers to edit high-resolution photos with lightning speed and developers to build apps nearly 3x faster than before. And all four can be used together for a huge boost in multithreaded performance. The four high-efficiency cores deliver outstanding performance at a tenth of the power. By themselves, these four cores deliver similar performance as the current-generation, dual-core MacBook Air at much lower power. They are the most efficient way to run lightweight, everyday tasks like checking email or browsing the web, and preserve battery life like never before. And all eight cores can work together to provide incredible compute power for the most demanding tasks and deliver the world’s best CPU performance per watt. M1 includes an 8-core CPU delivering incredible compute power and the world’s best performance per watt. The World’s Fastest Integrated Graphics M1 includes Apple’s most advanced GPU. It benefits from years of analysis of Mac applications, including everyday apps and challenging pro workloads. With industry-leading performance and incredible efficiency, the GPU in M1 is in a class by itself. Featuring up to eight powerful cores capable of running nearly 25,000 threads simultaneously, the GPU can handle extremely demanding tasks with ease, from smooth playback of multiple 4K video streams to rendering complex 3D scenes. With 2.6 teraflops of throughput, M1 has the world’s fastest integrated graphics in a personal computer. The GPU in M1 is the most advanced Apple has ever created and the world’s fastest integrated graphics in a personal computer. Blazing-Fast, On-Device Machine Learning The M1 chip brings the Apple Neural Engine to the Mac, greatly accelerating machine learning (ML) tasks. Featuring Apple’s most advanced 16-core architecture capable of 11 trillion operations per second, the Neural Engine in M1 enables up to 15x faster machine learning performance. In fact, the entire M1 chip is designed to excel at machine learning, with ML accelerators in the CPU and a powerful GPU, so tasks like video analysis, voice recognition, and image processing will have a level of performance never seen before on the Mac. Developers leveraging machine learning can take full advantage of the blazing-fast performance of the Apple Neural Engine in M1. More Innovative Technologies Packed into M1 The M1 chip is packed with a number of powerful custom technologies, including: Apple’s latest image signal processor (ISP) for higher quality video with better noise reduction, greater dynamic range, and improved auto white balance. The latest Secure Enclave for best-in-class security. A high-performance storage controller with AES encryption hardware for faster and more secure SSD performance. Low-power, highly efficient media encode and decode engines for great performance and extended battery life. An Apple-designed Thunderbolt controller with support for USB 4, transfer speeds up to 40Gbps, and compatibility with more peripherals than ever. The Apple-designed ISP in M1 makes video calls on the Mac sharper and more vivid. macOS Big Sur Optimized for M1 macOS Big Sur is engineered, down to its core, to take full advantage of all the capability and power of M1, delivering a massive boost in performance, astonishing battery life, and even stronger security protections. With M1, things users do every day feel noticeably faster and smoother. Just like iPhone and iPad, the Mac now instantly wakes from sleep. Browsing with Safari — which is already the world’s fastest browser — is now up to 1.5x speedier at running JavaScript and nearly 2x more responsive.2 With Big Sur and M1, Mac users can run a greater range of apps than ever before. All of Apple’s Mac software is now Universal and runs natively on M1 systems. Existing Mac apps that have not been updated to Universal will run seamlessly with Apple’s Rosetta 2 technology. And iPhone and iPad apps can now run directly on the Mac. Additionally, the foundations of Big Sur are optimized to unlock the power of M1, including developer technologies from Metal for graphics to Core ML for machine learning. Mac users now have access to a greater range of apps than ever before. Start of a Two-Year Transition for the Mac M1 powers the new MacBook Air, 13-inch MacBook Pro, and Mac mini . They join the rest of the Mac product line to form the strongest Mac lineup ever. This is the beginning of a transition to a new family of chips designed specifically for the Mac. The transition to Apple silicon will take about two years to complete, and these three systems are an amazing first step. Share article Images of Apple M1 Chip Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it. “World’s fastest CPU core in low-power silicon”: Testing conducted by Apple in October 2020 using preproduction 13-inch MacBook Pro systems with Apple M1 chip and 16GB of RAM measuring peak single thread performance of workloads taken from select industry standard benchmarks, commercial applications, and open source applications. Comparison made against the highest-performing CPUs for notebooks, commercially available at the time of testing. Performance tests are conducted using specific computer systems and reflect the approximate performance of MacBook Pro. “World’s best CPU performance per watt”: Testing conducted by Apple in October 2020 using preproduction 13-inch MacBook Pro systems with Apple M1 chip and 16GB of RAM. Performance per watt refers to the ratio of peak CPU performance to average power consumed using select industry standard benchmarks. Comparison made against high-performing CPUs for notebooks and desktops, commercially available at the time of testing. Performance tests are conducted using specific computer systems and reflect the approximate performance of MacBook Pro. “World’s fastest integrated graphics in a personal computer”: Testing conducted by Apple in October 2020 using preproduction 13-inch MacBook Pro systems with Apple M1 chip and 16GB of RAM using select industry standard benchmarks. Comparison made against the highest-performing integrated GPUs for notebooks and desktops, commercially available at the time of testing. Integrated GPU is defined as a GPU located on a monolithic silicon die along with a CPU and memory controller, behind a unified memory subsystem. Performance tests are conducted using specific computer systems and reflect the approximate performance of MacBook Pro. “World’s fastest browser”: Testing conducted by Apple in August and October 2020 using JetStream 2, MotionMark 1.1, and Speedometer 2.0 performance benchmarks on browsers that completed the test. Tested with prerelease Safari 14 and latest stable versions of Chrome, Firefox, and (Windows) Microsoft Edge at the time of testing, on Intel Core i5-based 13-inch MacBook Pro systems with prerelease macOS Big Sur and Windows 10 Home running in Boot Camp; 12.9-inch iPad Pro (4th generation) units with prerelease iPadOS 14 and Intel Core i7-based Microsoft Surface Pro 7 systems with Windows 10 Pro; and iPhone 11 Pro Max with prerelease iOS 14 and Samsung Galaxy S20 Ultra with Android 10. Devices tested with a WPA2 Wi-Fi network connection. Performance will vary based on usage, system configuration, network connection, and other factors. “Up to 1.5x speedier at running JavaScript and nearly 2x more responsive”: Testing conducted by Apple in September and October 2020 using JetStream 2 and Speedometer 2.0 performance benchmarks. Tested on preproduction MacBook Air and Mac mini systems with Apple M1 chip and 8-core GPU, as well as production 1.2GHz quad-core Intel Core i7-based 13-inch MacBook Air systems and 3.6GHz quad-core Intel Core i3-based Mac mini systems, all configured with 16GB RAM, 2TB SSD, and prerelease macOS Big Sur. Tested with prerelease Safari 14.0.1 and WPA2 Wi-Fi network connection. Performance will vary based on system configuration, network configuration, network connection, and other factors.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.5356115903705359
    },
    "article_1": {
        "title": "Apple cuts App Store commission rate to 15% for many developers with new Small Business Program - 9to5Mac",
        "body": "Apple has announced a notable change to its App Store commission structure today. The company is launching the App Store Small Business Program, which will lower the App Store commission to 15% for developers who earned up to $1 million in proceeds during the previous calendar year.\nApple says that existing developers who earn up to $1 million in a calendar year are eligible for this new App Store Small Business Program. The $1 million number is based on post-commission basis. This means developers are eligible for the program until their proceeds, after Apple takes its cut, exceed $1 million.\nFor example, if a developer makes less than $1 million in post-commission earnings through the App Store in 2020, they are eligible for the program in 2021. Then, if their post-commission earnings exceed $1 million in July of 2021, they become ineligible for the program effective of that date, and the standard commission rate applies for the remainder of the year.\nFinally, if a developer’s business falls below the $1 million threshold in a future calendar year, they can requalify for the program the year after.\nThis also has implications for subscription applications. Currently, Apple charges a 30% commission on the first year of an in-app subscription. The commission is then reduced to 15% if the customer continues their subscription beyond that time.\nNow, for developers eligible for the App Store Small Business Program, Apple is cutting the commission rate for the first year of a subscription to 15%. All subsequent years remain at 15% as well.\nIn a statement, Apple CEO Tim Cook emphasizes that the App Store has led to millions of new jobs in support of the global economy:\n“Small businesses are the backbone of our global economy and the beating heart of innovation and opportunity in communities around the world. We’re launching this program to help small business owners write the next chapter of creativity and prosperity on the App Store, and to build the kind of quality apps our customers love,” said Tim Cook, Apple’s CEO. “The App Store has been an engine of economic growth like none other, creating millions of new jobs and a pathway to entrepreneurship accessible to anyone with a great idea. Our new program carries that progress forward — helping developers fund their small businesses, take risks on new ideas, expand their teams, and continue to make apps that enrich people’s lives.”\nToday’s announcement is a notable change to the App Store commission rate. Up until today, Apple had largely stood firm at its 30% cut of App Store purchases and in-app purchases, only dropping to 15% during the second year of a recurring subscription. The change comes as Apple faces growing antitrust scrutiny over the App Store business model.\nEarlier this year, Apple did announce that it was waiving its commission rate for applications offering paid online events through the end of this year due to the COVID-19 pandemic. It’s unclear if this waiver will continue into 2021, however.\nYou can read Apple’s full announcement on the Newsroom website. The company says it will provide more comprehensive details of the App Store Small Business Program in early December. The program itself will launch on January 1, 2021.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.004473483707341883
    },
    "article_2": {
        "title": "Amazon employees arrested for stealing $592,000 worth of iPhones",
        "body": "An Amazon fulfilment center.\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA group of five Amazon employees has been arrested for allegedly stealing iPhones from a logistics center in Madrid, Spain, in an operation that is believed to have involved the theft of 500,000 euro ($592,000) in goods.\nThe arrests were made following an internal investigation by Amazon itself, discovering there were issues with some packages sent to customers due to some having weights differing from what the actual order was expected to weigh. The detected differences prompted Amazon to install hidden cameras to find out what was happening.\nIt was determined a group of workers was slipping new iPhones like the iPhone 12 and iPhone 12 Pro into orders secretly, replacing the actually ordered contents of a package at the last moment. iPadizate reports it is believed the orders were placed by an accomplice.\nThree of the five people implicated in the theft ring were arrested on leaving work, a fourth was picked up while working, and a fifth turned himself in to police voluntarily. All five have been fired by Amazon and are awaiting trial.\nThe workers were found to have ten iPhones in their possession, intended to be dispatched out using the same method. They were also carrying a large number of stickers with IMEI numbers, seemingly torn from boxes to hamper the investigation.\nFurther arrests have not been ruled out, with investigations continuing to determine where the dispatched iPhones ended up. It is estimated half a million euros worth of devices were stolen by the group.",
        "sentiment": -0.3894664794206619
    },
    "article_3": {
        "title": "The MacBook Air is once again the benchmark by which other laptops will be measured",
        "body": "Last week I wrote that Apple seemed “astonishingly confident” in its new M1-based Macs. This week we know why: they are astonishingly good. I reviewed the MacBook Air, Nilay Patel reviewed the entry-level 13-inch MacBook Pro, and Chris Welch reviewed the new Mac mini.\nAll three are equally impressive, but it’s the Air in particular that stands out as offering incredible power at its price point. I’m also impressed with battery life. And the fact that Apple’s Rosetta 2 translation layer doesn’t cause slowdown or bugs for legacy apps.\nWins all around, then. Not very often that happens in consumer tech! The webcams are still terrible and there are lots of questions about what will happen with the truly pro Macs we will start seeing in the next couple of years. But rather than constantly look ahead to the next thing, just for a moment, enjoy: a tech company made a big promise that it could do a hard thing and then did that thing.\nYou are reading Processor, a newsletter about computers, software, and tech by Dieter Bohn. Dieter writes about consumer tech, software, and the most important tech news of the day from The Verge. You can read an archive of Processor newsletters here and subscribe to all of The Verge’s great videos here! Subscribe\nBy subscribing, you are agreeing to receive a daily newsletter from The Verge that highlights top stories of the day, as well as occasional messages from sponsors and / or partners of The Verge.\nOkay, moment’s over. Sorry. I want to pay a little more attention to one point Chaim Gartenberg made when writing about the importance of these computers:\nThe most exciting — or frightening, if you’re a traditional PC chip company — part of Apple’s new chips is that the M1 is just the starting point. It’s Apple’s first-generation processor, designed to replace the chips in Apple’s weakest, cheapest laptops and desktops. Imagine what Apple’s laptops might do if the company can replicate that success on its high-end laptops and desktops or after a few more years of maturation for the M-series lineup.\nIt’s not difficult to divine the future of Intel and even Qualcomm’s roadmap — they are consistent (and consistently dull) in their year-over-year improvements. Their customers are phone and laptop makers, so they need to be clear and transparent about what’s up. And I don’t see either pulling a step change like the M1 out of a hat.\nBy contrast, we really have no idea what Apple’s chip roadmap looks like. We can make educated guesses based on what we would expect from the current chip and Apple’s philosophy.\nWe do know, however, that Apple is remarkably stable in its Mac product lineup. It doesn’t introduce a ton of different models. Different people could count differently, but I think there are eight distinct Macs that Apple sells: the Air, the entry level 13-inch MacBook Pro, the 13-inch MacBook Pro, the 16-inch MacBook Pro, the Mac mini, the iMac (two sizes on this one), the iMac Pro, and the Mac Pro.\nI’m listing them all out to make a point: if you’re familiar with Macs, you have a sort of inherent idea of what those computers are, relative to each other. That’s the other way we can perhaps predict what’s next for Apple silicon. For example, we know how much more powerful an iMac is than an Air, on a rough basis. But now with the Air, the baseline for that rough basis has just been radically improved. So if the Apple silicon-based iMac continues to be as big a leap over the M1-based MacBook Air as it has been in the past, look out.\nBut even if that doesn’t happen, PC makers have a problem today. So let’s come back to right now. Apple has a thousand-dollar laptop that beats the pants off anything else in its price class, and so every Windows ultrabook is going to be compared to it for the foreseeable future — and may likely be found wanting.\nWe have a running joke at The Verge that our old colleague Joanna Stern (now at the WSJ) would end every Windows laptop review with “for a hundred dollars more, you could get a MacBook Air.” For the next year or two, we all might be ending reviews of thin and light Windows laptops with something like “for the same price, you can get a MacBook Air that’s faster, lasts longer on a battery, and doesn’t have a fan.”\nDo Intel, Qualcomm, AMD, Microsoft, Dell, HP, Asus, Razer, or anybody else in the PC ecosystem have something that will start chopping clauses from that sentence?\nA brief programming note — I’m taking the next week off and may allow myself to be a a little intermittent in sending newsletters in December. I appreciate you all reading and hope you are staying safe this Thanksgiving holiday — and always.\nApple news that isn’t so good\nThe settlement (PDF) hasn’t been fully approved by a judge yet, but there’s a chance states might see their money sooner than actual iPhone owners. If you applied for your $25 worth of the $500 million class-action settlement, you probably did so in July, but the process is still underway. There’s a fairness hearing on December 4th that’ll decide whether the settlement was handled properly.\n┏ Apple will reduce App Store cut to 15 percent for most developers starting January 1st. So this is a win for smaller developers, but I do think that a million dollars is kind of a low cap for a small business (costs add up fast!). One thing to note, though, is that this probably isn’t costing Apple much — the vast majority of its App Store revenue comes from bigger fish. Bottom line, though, is that it seems Apple is finally reacting to public pressure and the threat of regulation. Nick Statt:\nThe new App Store Small Business Program, as it’s called, will allow any developer who earns less than $1 million in annual sales per year from all of their apps to qualify for a reduced App Store cut of 15 percent, half of Apple’s standard 30 percent fee, on all paid app revenue and in-app purchases.\n┏ Apple’s biggest App Store critics are not impressed with its new fee cut for small developers. Tim Sweeney is not impressed.\nGaming news\n┏ Nvidia’s GeForce Now cloud gaming service launches on iOS as a web app. I am conflicted about this! On the one hand, I like the idea of more people realizing that the web is a viable app platform. On the other, I hate hate hate that it’s happening because of Apple’s ridiculous App Store policies. One thing Nick Statt notes: this technically means Fortnite is back on iOS, via this particular workaround.\n┏ Google Stadia is coming to iOS officially as a web app. Quite a day for web apps!\nGoogle says it has been building a progressive web app version of Stadia that will run in the mobile version of Apple’s Safari browser, similar to how Microsoft intends to deliver its competing xCloud service on iOS sometime next year. But Google intends to beat Microsoft to the punch with public testing of its version in the coming weeks. Nvidia also announced today that it a beta web app version of its GeForce Now cloud gaming service on iOS is available today.\n┏ AMD Radeon RX 6800 review: entry-level 4K. Sean Hollister makes a good case for the entry-level GPUs being better than you might expect.\n┏ Google Stadia survived a year, but its future depends on games like Cyberpunk 2077. Nick Statt on the state of Stadia:\nBut the key going forward will be moving beyond the “it’s good enough” strategy that has gotten Stadia to where it is now. That means convincing a prospective buyer of a game like Assassin’s Creed Valhalla to buy it on Stadia and not one of the half-dozen other platforms it’s available on. That scenario represents Google’s biggest and most pivotal challenge going forward. It’s made only harder by the launch of next-gen consoles from Microsoft and Sony, with the Xbox Series X / S and PlayStation 5 offering many of the same (and in some cases, better) load times and performance benefits Stadia touted last year without any of the compromises of using a streaming platform.\nGoogle news\n┏ Google Pay’s massive relaunch makes it an all-encompassing money app. Just describing the many things this app does is enough to widen the eyes and make you wonder if maybe Google should be reined in. And the methods by which Google collects the information it needs to enable all those features are all private and secure — but it’s very difficult to worry that they someday won’t be either.\nGoogle has announced that it’s finally beginning to enable a key privacy feature: end-to-end encryption. For Android users who use Android Messages, one-on-one chats will eventually be end-to-end encrypted by default, meaning neither carriers nor Google will be able to read the content of those messages. Even though encryption is only beginning to roll out to people who sign up for the public beta for Android Messages, turning on encryption for RCS is a very big deal.\nMore from The Verge\n┏ Intel’s new laptop is designed to help small companies take on HP and Dell. It’s a 15-inch productivity laptop, Dan Seifert writes. He says it looks nice in person. I’ll take his word for it, as it’s not so great in pictures. Will be curious to see which companies decide to pick this up and offer it.\nIntel is launching a new laptop. Yes, that’s right, Intel itself has a new laptop that it designed in-house and will be selling through various partners early in 2021. The NUC M15 is the latest computer in the company’s expanding Next Unit of Computing line, which is best known for making tiny desktop PCs.\n┏ Pixelmator Pro gets update for M1 Macs. I have been a huge Pixelmator (and Acorn) fan, so I am very excited to try this out. It’s just super refreshing to use a photo editing app that isn’t loaded down with all the conventions (and unnecessary features) of Photoshop. Pixelmator feels much more modern to me, even though it’s not quite as powerful.\n┏ Wonder Woman 1984 will be released on HBO Max the same day it’s in theaters for no extra cost. Good. I have to say I didn’t expect I’d miss big fun popcorn blockbusters movies as much as I do. Excited for them to come back and even more excited to make my own damn popcorn, at home. Julia Alexander:",
        "sentiment": 0.2193021431668765
    },
    "article_4": {
        "title": "Italy Fines Apple $12 Million for Misleading iPhone Water Resistance Claims",
        "body": "Apple has been slapped with a 10 million euro ($12 million) fine by Italy's antitrust watchdog for unfair commercial practices related to its iPhone marketing in the country.\nOne of the Apple ads cited in the Italian watchdog's proceedings (credit: setteBIT\nSpecifically, Apple is being charged for misleading claims in promotional messages about how deep and how long iPhones can be submerged in water without being damaged.\nIn marketing materials related to ‌iPhone‌ 8, ‌iPhone‌ 8 Plus, ‌iPhone‌ XR, ‌iPhone‌ XS, ‌iPhone‌ XS Max, ‌iPhone‌ 11, ‌iPhone‌ 11 Pro and iPhone 11 Pro Max, Apple said its iPhones were water resistant at a depth of between one and four meters for up to 30 minutes, depending on the model.\nHowever, according to the country's competition regulator, the messages did not clarify that the claims are only true under specific conditions, for example during controlled laboratory tests with the use of static and pure water, and not in the normal conditions of use by consumers.\nThe regulator also took issue with Apple's warranty terms, which do not cover damage caused by liquids. The authority considered it inappropriate to push an \"aggressive\" commercial practice highlighting water resistance as a feature, while at the same time refusing to provide post-sales warranty assistance if the ‌iPhone‌ models in question suffer water damage.\nThis isn't the first time Apple has fallen under the radar of Italy's antitrust watchdog and subsequently been punished. In 2018 Apple was fined 10 million euros (about $11.5 million USD) for \"planned obsolescence\" of its smartphones, following the regulator's investigation into reports of iPhone battery slowdowns.\n(Via setteBIT.)",
        "sentiment": -0.7099922520315481
    },
    "article_5": {
        "title": "Apple will require app privacy 'nutrition label' info next month",
        "body": "Apple debuted a collection of privacy features when it announced iOS 14, but the company’s privacy “nutrition label” concept did not arrive with the launch of the new operating system in September. Today, Apple announced that developers will be required to provide the information for those “labels” starting December 8th.\nLike a normal nutrition label that lists ingredients and caloric content, these privacy “labels” should give you a better idea of what’s going on inside an app before you download it from the iOS App Store or Mac App Store. The labels will list what information an app collects, and present that visually on the app page, much like looking at the backs of labels in a grocery store.\nA mockup of an iPhone displaying the App Store labels Image: Apple\nThe catch, of course, is that while developers are required to disclose this information to continue releasing and updating apps, all of the information developers provide will be self-reported, which could still leave some possibility for foul play.\nApple’s Developer site cautions that developers will be required to disclose all the information they and their third-party partners collect and keep their “labels” up to date. For example, if an app needs to know your precise location to work, you’ll know that before you even download it. If GPS functionality is ever removed from the app, a new label will have to reflect that. Apple does offer some exceptions when these label disclosures are optional, but the important thing to know that if an app intends to track you consistently, you’ll know about it before it’s on your phone.",
        "sentiment": -0.3106316968591677
    },
    "article_6": {
        "title": "Apple doubles down on upcoming iOS 14 privacy features, slams Facebook for collecting ‘as much data as possible’",
        "body": "Last month, a coalition of eight civil and human rights organizations penned an open letter to Apple CEO Tim Cook regarding the company’s decision to delay the release of the new App Tracking Transparency feature in iOS 14.\nApple has now responded to that letter, doubling down on its privacy practices and offering more color on the decision to delay the App Tracking Transparency feature in the first place.\nIn a letter sent to the Ranking Digital Rights organization, Apple’s Jane Horvath, senior director of global privacy, reiterated that the company believes that “privacy is a fundamental human right.” Horvath explains that Apple delayed the App Tracking Transparency (ATT) feature in an effort to give developers more time to prepare for the changes.\nThe letter also confirms that the App Tracking Transparency feature, which is designed to allow users to disable tracking between different applications, is still coming next year. Once in effect, developers will also be required to ask for permission before tracking a user across apps or websites.\n“We delayed the release of ATT to early next year to give developers the time they indicated they needed to properly update their systems and data practices, but we remain fully committed to ATT and to our expansive approach to privacy protections. We developed ATT for a single reason: because we share your concerns about users being tracked without their consent and the bundling and reselling of data by advertising networks and data brokers.”\nHorvath goes on to emphasize that App Tracking Transparency features don’t prevent advertising, but rather encourages advertising that respects privacy:\n“Advertising that respects privacy is not only possible, it was the standard until the growth of the Internet. Some companies that would prefer ATT is never implemented have said that this policy uniquely burdens small businesses by restricting advertising options, but in fact, the current data arms race primarily benefits big businesses with big data sets. Privacy-focused ad networks were the universal standard in advertising before the practice of unfettered data collection began over the last decade or so. Our hope is that increasing user demands for privacy and security, as well as changes like ATT, will make these privacy-forward advertising standards robust once more.”\nFurthermore, Horvath has sharp criticism for Facebook, saying that the social network has “made clear” that its intent is to “collect as much data as possible” on its users:\n“By contrast, Facebook and others have a very different approach to targeting. Not only do they allow the grouping of users into smaller segments, they use detailed data about online browsing activity to target ads. Facebook executives have made clear their intent is to collect as much data as possible across both first and third party products to develop and monetize detailed profiles of their users, and this disregard for user privacy continues to expand to include more of their products.”\nOn the flip side, Facebook has criticized the App Tracking Transparency feature and said it could cause ad revenue to drop as much as 40%. Facebook has reportedly met with advertising partners to discuss the impact the change will have on advertising when users have the ability to easily opt-out of cross-platform tracking.\nApple emphasizes again today that advertising that protects user privacy is possible. For example, Apple gives users the ability to disable ad personalization based on first-party data in the Settings app. For users with Personalized Ads enabled, Apple groups together users with similar characteristics, which ensures that a campaign can’t identify a given user.\nOnce available in 2021, the App Tracking Transparency feature will be accessible by opening the Settings app, then looking for the Privacy menu, and looking for the Tracking section. Apple also says that its new “nutrition labels” for app privacy will be required in the App Store starting on December 8.\nYou can read the full letter below.\n[scribd id=485006035 key=key-roaZkqa4BTpYan2KDb8n mode=scroll]\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.09509564526379108
    },
    "article_7": {
        "title": "Time to move on: Google Photos will end its free unlimited storage on June 1st, 2021",
        "body": "After five years of offering unlimited free photo backups at “high quality,” Google Photos will start charging for storage once more than 15 gigs on the account have been used. The change will happen on June 1st, 2021, and it comes with other Google Drive policy changes like counting Google Workspace documents and spreadsheets against the same cap. Google is also introducing a new policy of deleting data from inactive accounts that haven’t been logged in to for at least two years.\nAll photos and documents uploaded before June 1st will not count against that 15GB cap, so you have plenty of time to decide whether to continue using Google Photos or switching to another cloud storage provider for your photos. Only photos uploaded after June 1st will begin counting against the cap.\nGoogle already counts “original quality” photo uploads against a storage cap in Google Photos. However, taking away unlimited backup for “high quality” photos and video (which are automatically compressed for more efficient storage) also takes away one of the service’s biggest selling points. It was the photo service where you just didn’t have to worry about how much storage you had.\nEverything uploaded before June 1st won’t count against your cap\nAs a side note, Pixel owners will still be able to upload high-quality (not original) photos for free after June 1st without those images counting against their cap. It’s not as good as the Pixel’s original deal of getting unlimited original quality, but it’s a small bonus for the few people who buy Google’s devices.\nGoogle points out that it offers more free storage than others — you get 15GB instead of the paltry 5GB that Apple’s iCloud gives you — and it also claims that 80 percent of Google Photos users won’t hit that 15GB cap for at least three years.\nThe company will send alerts and warnings when you begin to approach that cap. Google is also putting new storage management tools into Google Photos, including a tool that makes it easier to find and delete photos you might not want anyway, like blurry images or screenshots.\nGoogle is also going to show a more useful “personalized estimate” of how much longer a storage tier will last in terms of time instead of gigabytes. It estimates each user’s average uploads over time to guess how much longer they’ll be able to use their current tier.\nWhy the change? One possibility is that it’s part of a larger push to get more people to sign up for Google One storage. The service now also includes a free VPN for Android at some of its higher tiers, and it seems as though many Google products are aligning with Google One. Google’s explanation in a brief interview is simpler: there is already a nearly unfathomable number of photos and videos uploaded to Google Photos, and the service needs to be sustainable. That’s the gist if you read between the lines of its blog post:\nToday, more than 4 trillion photos are stored in Google Photos, and every week 28 billion new photos and videos are uploaded. Since so many of you rely on Google Photos to store your memories, it’s important that it’s not just a great product, but also continues to meet your needs over the long haul. In order to welcome even more of your memories and build Google Photos for the future, we are changing our unlimited High quality storage policy.\nGoogle One pricing is not changing. It starts at $1.99 / month for 100GB and has tiers going through 200GB ($2.99 / month), 2TB ($9.99 / month), and all the way up to 30TB ($149.99 / month).\nAlongside photos, “Google Docs, Sheets, Slides, Drawings, Forms and Jamboard files” will also begin counting against storage caps. The reasoning is “to bring our policies more in line with industry standards,” Google says. (This puts an end to some very clever hacks like this one that turned files into Google Docs through a binary conversion tool.)\nAs for the inactive account policy, it seems fairly reasonable: if you haven’t touched your Google account for two years and don’t respond in any way to the multiple warning emails and notifications Google sends you, the company may delete data from your account. Here’s how Google explains it:\nIf you’re inactive in one or more of these services for two years (24 months), Google may delete the content in the product(s) in which you’re inactive. [...] Similarly, if you’re over your storage limit for two years, Google may delete your content across Gmail, Drive and Photos. We will notify you multiple times before we attempt to remove any content so you have ample opportunities to take action. The simplest way to keep your account active is to periodically visit Gmail, Drive or Photos on the web or mobile, while signed in and connected to the internet.",
        "sentiment": -0.3860659752972424
    },
    "article_8": {
        "title": "Apple Silicon M1 Chip in MacBook Air Outperforms High-End 16-Inch MacBook Pro",
        "body": "Apple introduced the first MacBook Air, MacBook Pro, and Mac mini with M1 Apple Silicon chips yesterday, and as of today, the first benchmark of the new chip appears to be showing up on the Geekbench site.\nThe ‌M1‌ chip, which belongs to a ‌MacBook Air‌ with 8GB RAM, features a single-core score of 1687 and a multi-core score of 7433. According to the benchmark, the ‌M1‌ has a 3.2GHz base frequency.\nWhen compared to existing devices, the ‌M1‌ chip in the ‌MacBook Air‌ outperforms all iOS devices. For comparison's sake, the iPhone 12 Pro earned a single-core score of 1584 and a multi-core score of 3898, while the highest ranked iOS device on Geekbench's charts, the A14 iPad Air, earned a single-core score of 1585 and a multi-core score of 4647.\nSingle Core benchmarks\nIn comparison to Macs, the single-core performance is better than any other available Mac, and the multi-core performance beats out all of the 2019 16-inch MacBook Pro models, including the 10th-generation high-end 2.4GHz Intel Core i9 model. That high-end 16-inch MacBook Pro earned a single-core score of 1096 and a multi-core score of 6870.\nThough the ‌M1‌ chip is outperforming the 16-inch MacBook Pro models when it comes to raw CPU benchmarks, the 16-inch MacBook Pro likely offers better performance in other areas such as the GPU as those models have high-power discrete GPUs.\nMulti Core benchmarks\nIt's worth noting that there are likely to be some performance differences between the MacBook Pro and the ‌MacBook Air‌ even though they're using the same ‌M1‌ chip because the ‌MacBook Air‌ has a fanless design and the MacBook Pro has an new Apple-designed cooling system. There's also a benchmark for the Mac mini, though, and it has about the same scores.\nThe ‌Mac mini‌ with ‌M1‌ chip that was benchmarked earned a single-core score of 1682 and a multi-core score of 7067.\nUpdate: There's also a benchmark for the 13-inch MacBook Pro with ‌M1‌ chip and 16GB RAM that has a single-core score of 1714 and a multi-core score of 6802. Like the ‌MacBook Air‌, it has a 3.2GHz base frequency. A few other ‌MacBook Air‌ benchmarks have surfaced too with similar scores, and the full list is available on Geekbench.",
        "sentiment": 0.04980630161506789
    },
    "article_9": {
        "title": "Jeff Benjamin: ''The iPhone 12 mini is, in my honest opinion, the best looking and best functioning smartphone that I’ve experienced in years.''",
        "body": "In my recent Top Features video walkthrough showcasing the iPhone 12, I didn’t yet have the iPhone 12 mini in hand, so I was only able to provide commentary on Apple’s large 6.1-inch baseline smartphone. Now that the iPhone 12 mini has arrived, I’ve been able to examine both smartphones in light of Apple’s entire flagship lineup. Watch our hands-on iPhone 12 & 12 mini review video for the details.\niPhones 12\nApple released four brand new iPhones this year:\niPhone 12\niPhone 12 mini\niPhone 12 Pro\niPhone 12 Pro Max\nThe majority of iPhone 12 features are common to every model in the lineup. Differences in size, camera, and battery life may help you decide which iPhone 12 is best for you, but all of them provide much of the same experience. After going hands-on with all models for the past week, I’ve concluded that most people will be happy with the regular iPhone 12, as it provides the best overall balance of camera, size, battery life, and price.\nAll four iPhone 12 models are powered by an industry-first 5-nanometer Apple A14 system on a chip, which brings forth modest performance gains in terms of CPU and GPU. However, the most impressive performance benefit is with the Neural Engine, which now hosts 16 cores and is up to 80% faster. With each new iPhone generation, machine learning gains more importance, as it lends greatly to the advances in computational photography, which gives the iPhone a distinct advantage over “dumb” traditional standalone cameras.\nVideo: iPhone 12 and 12 mini review\nSpecial thanks to our sponsor, iMazing: Get 30% off iMazing for a limited time\nSubscribe to 9to5mac on YouTube for more videos\nEveryone gets the good display\nIf you’re coming from an iPhone 11 or iPhone XR, one of the first things you’ll notice about the iPhone 12 is the display. The Super Retina XDR display is no longer a so-called Pro feature, so now everyone gets to enjoy the benefits of an OLED display with a 2,000,000:1 contrast ratio and perfect black levels.\nEven more important is that the Super Retina XDR display can get extremely bright, a feature critical to the HDR functionality. The iPhone 12 display features a typical 625 nits max brightness, but for HDR content, it can almost double that brightness up to 1200 nits. As we’ll discuss, the HDR capabilities of this phone, particularly on the video front, is what really differentiates Apple’s latest smartphone hardware compared to its predecessors.\nPhotos and video – the real star of the show\nAll iPhone 12 models feature fantastic cameras with noticeable improvements in low light capture. These improvements are partly owed to the faster f/1.6 aperture on the wide angle lens. Machine learning enhancements with Smart HDR 3 and Night mode, along with brand new features like the ability to capture, edit, and playback Dolby Vision 4K HDR video, add significant value to the iPhone 12. The front-facing TrueDepth camera system also receives upgrades, like support for Night mode and Deep Fusion, and even HDR video recording.\nDespite what Apple and Verizon may have led you to believe, the most outstanding feature about this year’s crop of iPhones isn’t the over-hyped inclusion of 5G cellular connectivity, but it’s the support for Dolby Vision 4K HDR. This is the feature that stands out to me the most because it’s instantly noticeable, and when you see it for the first time, it’s really like wow!\nBut what’s really incredible about this year’s crop of iPhone devices is the true end-to-end HDR workflow for 4K HDR video (30fps on the iPhone 12, 60fps on the iPhone 12 Pro). Not only can I capture videos in HDR, but I can edit them directly in the Photos app or iMovie. I can even fire up an advanced video editing solution like LumaFusion and edit 4K HDR videos there. In my opinion, this is the most impressive feature about the iPhone 12, and it’s not just restricted to the so-called Pro models, but it’s available on all four of Apple’s new smartphones.\nThe main thing separating the iPhone 12 Pro and, to a greater extent, the iPhone 12 Pro Max, are the breadth of camera options and improvements. Just like last year, the Pro-designated iPhone features a telephoto camera to go along with the standard wide and ultra wide cameras on the baseline model. While this is a nice feature, I think you’d have to be very much into capturing photos and video with your iPhone to justify the, at minimum, $200 price jump to the Pro.\nWith the iPhone 12 Pro you get the following camera enhancements:\n52mm telephoto lens\nLiDAR scanner\nNight mode portraits\nApple ProRAW capture\n4K HDR Dolby Vision up to 60 fps\nThe iPhone 12 Pro Max yields those features, plus:\nWide angle camera with 47% larger sensor and 1.7 μm pixels\nSensor-shift OIS on wide angle camera\n65mm telephoto focal length\n5x total optical zoom range\nThe iPhone 12 Pro and 12 Pro Max feature compelling camera upgrades, especially the addition of a third telephoto lens, native RAW photo capture (currently in beta), and 4K HDR video capture that goes from just 30fps on the iPhone 12 to up to 60 fps on iPhone 12 Pro. As nice as the 6.1-inch iPhone Pro is, if you care about photos and videos enough to warrant the upgrade, I believe you should look at the larger iPhone 12 Pro Max.\nApple’s largest smartphone to date features an enhanced primary camera with better stabilization for improved low light capture, and it has a 6.7-inch display, which makes it the most ideal for editing photos and videos. The iPhone 12 Pro Max also features the most battery life of any iPhone, which provides the needed stamina for long photo and video shoots. If you’re going to pony up the money for the iPhone 12 Pro, and you can handle the 6.7-inch form-factor, you might as well pay $100 more for the model that packs in the most “pro” features.\nAbout Apple ProRAW\nThe ability to shoot RAW photos natively in the Camera app is one of the key features that sets the Pro version of the iPhone 12 apart from the baseline edition. Apple ProRAW is still in beta, but I’ve had the opportunity to test it, and I came away impressed.\nApple ProRAW lets you capture photos with less in-camera image processing, which affords more flexibility to modify the images in post production. Apple ProRAW photos feature more dynamic range, which allows you to retain more highlight and shadow data, lending you more creativity in professional editing apps like Affinity Photo, Adobe Lightroom, and Photoshop.\nAfter testing out Apple ProRAW on my iPhone 12 Pro Max, I can definitely say that I’d prefer to always shoot photos in Apple ProRAW if I had the choice. Unfortunately, native RAW image capture is exclusive to the iPhone 12 Pro; it should be included in iOS 14.3 once the software updated is released later this year.\nDesign\nAll iPhone 12 models sport an iPhone 4-inspired design, sandwiching the body between two pieces of glass. Although I think the iPhone 6-era iPhones with rounded-off edges are more comfortable to hold in hand, the flat edges of the iPhone 12 lend the device a more distinct look that’s easier to identify among a lineup of metal and glass slabs.\nCompared to the iPhone 12 Pro, which incorporates a good-looking, but finger-print-magnet-of-a-stainless-steel-band, I prefer the baseline iPhone 12 design with its aluminum band. But I’m a sucker for screen real estate, so I naturally gravitated towards the iPhone 12 Pro Max’s 6.7-inch screen, much to the dismay of my arthritic fingers. If I was going to use one of the baseline iPhone 12 models full time, I’d probably go for the smaller iPhone 12 mini. It’s insane to think that you get this much power and capability in such a pint-sized body. Forgetting about the second-generation iPhone SE that launched earlier this year, the iPhone 12 mini feels like the true successor to the original iPhone SE, with a footprint that’s closer than I expected.\nOutside of its “affordable” $699 price point, the biggest advantage of the iPhone 12 mini is that it’s the most hand-friendly phone that Apple’s produced in years. Because of its edge-to-edge design that omits a Home button in favor of Face ID authentication, it’s able to pack a 5.4-inch display into a body size that’s smaller than the 2nd-generation iPhone SE. Remember that the iPhone SE comes with a considerably-smaller 4.7-inch display, so the iPhone 12 mini gives you a lot more screen real estate in a more compact design that even people with smaller hands will find easy to use.\nThe biggest downside with the smaller iPhone 12 mini is its small battery. Depending on how you use it, that may or may not be an issue. If you’re a prolific mobile photographer or videographer, it may be difficult to make it through a full day without a mid-day visit to the wall outlet.\nMagSafe\nAn iPhone 12 review would not be complete without a nod towards its MagSafe capability and the various MagSafe accessories now available. MagSafe for the iPhone, which owes its name to the now-defunct magnetic charging cable connection once found on MacBooks, allows you to wirelessly charge your iPhone faster than a regular Qi charger.\nHere’s a piece of advice. Don’t buy MagSafe for its ability to charge faster because faster in Apple terms is only a little bit faster, not to mention that it requires a separate 20W power adapter for full charging performance. Even with MagSafe, wireless charging still doesn’t come close to the type of speeds that you get with a wired charger, which means wireless charging remains more about convenience than anything else.\nThat being said, MagSafe is definitely more convenient than a typical Qi charger. Thanks to auto-aligning magnetic connectivity, you no longer have to worry about perfectly aligning your device with the charging coils in order to make sure that your device actually starts charging.\nYet, MagSafe is more than just about charging a — it’s a whole accessory system. MagSafe even includes third-party offerings, with companies like Belkin making MagSafe-compatible wireless charging stands and car mounts. Apple’s Silicone and Leather cases are all MagSafe-enabled as well, and they each showcase a special color-specific animation and sound when an iPhone 12 is placed inside. These cases also work with the MagSafe wireless charger and accessories like the currently hard-to-find iPhone Leather Wallet.\n5G connectivity is overhyped, for now\n5G connectivity is important, but it’s far from the game-changing feature that carriers like Verizon, AT&T, and T-Mobile like to paint it as, at least for the moment. While 5G does have lots of potential, its usage, especially when it comes to the insanely fast speeds that 5G marketing and hype is built upon, falls flat.\nWith the right carrier, in an ideal location, in the right city, it may be possible for you to experience the type of speeds only made possible by millimeter wave (mmWave) high-band connectivity, but most iPhone customers will never get to experience that kind of speed. In fact, Apple only sells iPhones that are capable of experiencing the fastest type of 5G in the US, and even then, access to that type of high-band 5G is relatively rare.\nThat’s not to say that benefits of 5G aren’t already being felt, because it is — just not with the shocking speeds found in most 5G marketing material. It’s far more likely that your experience with 5G will be that of the low band variety, which could yield speeds that are only moderately faster than the LTE connectivity we’ve been enjoying for the last several years, if at all. In certain areas, you may be fortunate enough to have access to significantly faster mid-band connectivity, but you’ll need to check with your carrier first to see if it’s available. In my particular area of the US, I only have low-band available with my carrier, and the speeds aren’t anything to write home about.\nWill 5G connectivity yield better speeds in more places in the future? Undoubtedly. But there are still major chunks of precious 5G spectrum being auctioned off that carriers like AT&T will need in order to flesh out their offerings. Give 5G a few more years, and it will be more worthy of the hype.\nConclusion\nThe iPhone 12 proves that you don’t need a “pro” iPhone to garner a great experience. Conceptually, the iPhone 12 mini is the best iPhone of all time in my eyes due to its design, size, and features. It’s like a modern-day iPhone SE, and many of you know how I feel about the SE. But as much as I like the idea of going back to a small phone, and as much as my fingers would appreciate that, I just can’t. I’ve been spoiled by large phones, and there’s never been a larger iPhone than the iPhone 12 Pro Max.\nYet, not everyone can justify carrying around a mammoth of a phone like the iPhone 12 Pro Max, let alone pay $1,099+ for the privilege. All the while, the regular 6.1-inch iPhone 12 Pro, for all its capability, feels like it’s in no man’s land in this lineup. It’s significantly more expensive than the iPhone 12, yet doesn’t come with all of the bells and whistles of its larger sibling. For that reason, I’m keener on recommending the regular-sized iPhone 12 for the majority of people or the iPhone 12 mini if you’re dead-set on owning a more reasonably-sized phone.\nThe iPhone 12 mini is, in my honest opinion, the best looking and best functioning smartphone that I’ve experienced in years. If you’re not addicted to having a large phone, it’s an amazing piece of hardware, but depending on how it’s used, it can struggle with battery life. The baseline iPhone 12 is probably the most reasonable iPhone out of any in the lineup. It features a large, but not overly-large 6.1-inch display, it costs $799, it features an amazing camera system with end-to-end HDR workflow, it comes with a slightly better exterior design and color options, and it’s bundled with 5G cellular capability and MagSafe support.\nWhat do you think is the best iPhone for 2020? Sound off in the comments section below with your thoughts on the matter.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.20226711972237943
    },
    "article_10": {
        "title": "France will begin labeling electronics with repairability ratings in January",
        "body": "On Wednesday, the European Parliament voted in favor of a new policy to “develop and introduce mandatory labeling, to provide clear, immediately visible and easy-to-understand information to consumers on the estimated lifetime and repairability of a product at the time of purchase.”\nThe vote, which passed with 395 votes in favor, 94 votes against, and 207 abstentions (declining to vote) supports the consumers’ Right to Repair.\nWe hope this will translate into swift action to bring a mandatory repairability score index for all electricals and electronic products sold across the EU, to help consumers to shop with confidence. – Ugo Vallauri – Restart Project Co-founder\nBeginning in January, France will begin rolling out repairability tags for smartphones, laptops, and other electronics. Austria will also reduce taxes on repair services and offer subsidies for consumer repairs. The label will have a repairability score out of 10, much like iFixIt has assigned to all the products it disassembles.\nThe hope is that this rating will help customers prioritize products that are easier to fix. In a survey conducted back in 2014 in a report titled Attitudes of Europeans towards Waste Management and Resource Efficiency , 77% of Europeans surveyed would rather repair devices than replace them. 79% of those surveyed agree that manufacturers should facilitate the repair of their devices and replacement of parts.\nVia • Source",
        "sentiment": 0.470929397477044
    },
    "article_11": {
        "title": "Blizzard has announced native Apple Silicon support to World of Warcraft on day 1",
        "body": "With this week’s patch 9.0.2, we’re adding native Apple Silicon support to World of Warcraft. This means that the WoW 9.0.2 client will run natively on ARM64 architecture, rather than under emulation via Rosetta.\nWe’re pleased to have native day one support for Apple Silicon.\nWhile our testing has been successful, we’re highly aware of the nature of day one support with updates like this. Please let us know if you run into any issues that may be related to Apple Silicon in our Mac Technical Support forum.\nThank you very much.",
        "sentiment": 0.31098686857149005
    },
    "article_12": {
        "title": "Apple Asks Foxconn to Move Some MacBook and iPad Production From China to Vietnam",
        "body": "Apple has asked Foxconn to move some of its iPad and MacBook assembly from China to Vietnam in an effort to minimize the impact of ongoing trade tensions between the U.S. and China, according to sources cited by Reuters.\nFoxconn is building assembly lines for Apple's iPad tablet and MacBook laptop at its plant in Vietnam's northeastern Bac Giang province, to come online in the first half of 2021, the person said, declining to be identified as the plan was private. The lines will also take some production from China, the person said, without elaborating how much production would shift. \"The move was requested by Apple,\" the person said. \"It wants to diversify production following the trade war.\"\nApple has been seeking to add geographic diversity to its supply chain for some time now, and Apple suppliers already assemble the company's AirPods and AirPods Pro in Vietnam.\nApple is also reportedly seeking to expand iPhone production in Vietnam, although a report in August suggested the company was holding off until workers' conditions improve at supplier Luxshare-ICT's facilities.\nMajor Apple manufacturing contractors Foxconn, Pegatron, and Compal Electronics are all said to be expanding production in Vietnam as companies seek to reduce reliance on China and diversify supply chains to prevent concentration risks.\nVietnam is emerging as a major manufacturing and assembly hub for large technology companies, and Samsung manufactures as many as half of its smartphones there already.",
        "sentiment": 0.05581734422594309
    },
    "article_13": {
        "title": "Amazon launches $194 AirPods Pro sale ahead of Black Friday",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA $55 discount, Amazon's $194 AirPods Pro promotion sits alongside its $99 AirPods with Charging Case deal, delivering the best prices leading up to Black Friday.\nBest AirPods Pro deal\nAmazon's latest price drop was picked up by the AppleInsider AirPods Price Guide, beating other retailers by at least $15.\nAlongside today's $194 deal, we covered another record low price at Amazon earlier this week, which is still going strong: $99 AirPods with Charging Case. That promo hits the all-time record low price seen across the entire AirPods line.\nFor even more Apple deals, be sure to visit the AppleInsider Apple Price Guide for the best sales on Macs, iPads, Apple Watches and accessories this holiday season.\nCurrent AirPods deals\nAdditional Apple deals",
        "sentiment": 0.24820376001298428
    },
    "article_14": {
        "title": "Apple Releases iOS 14.2 and iPadOS 14.2 With New Emoji, Control Center Music Recognition, Intercom, Wallpapers and More",
        "body": "Apple today released iOS 14.2 and iPadOS 14.2, the second major updates to the iOS and iPadOS 14 operating system updates that were released in September. iOS 14.2 and iPadOS 14.2 come two weeks after the launch of iOS 14.1.\nThe iOS 14.2 update can be downloaded for free and it is available on all eligible devices over-the-air in the Settings app. To access the new software, go to Settings > General > Software Update. Apple has also released iOS 12.4.9 for older devices.\nAlong with emoji,iOS 14.2 includes support for a number of new features. For a detailed list of all the new iOS 14.2 features, visit our iOS 14.2 Features Guide\nApple has also addressed a number of bugs, with full release notes for the iOS 14.2 update below:\niOS 14.2 includes the following improvements for your iPhone:\n- Over 100 new emoji, including animals, food, faces, household objects, musical instruments, gender-inclusive emoji, and more\n- Eight new wallpapers in both light and dark mode versions\n- Magnifier can detect people nearby, and report their distance using the LiDAR sensor included in iPhone 12 Pro and iPhone 12 Pro Max\n- Support for iPhone 12 Leather Sleeve with MagSafe\n- Optimized battery charging for AirPods to slow the rate of battery aging by reducing the time your AirPods spends fully charged\n- Headphone audio level notifications to alert you when audio level could impact your hearing\n- New AirPlay controls to stream entertainment throughout your home\n- Intercom support with HomePod and HomePod mini using iPhone, iPad, Apple Watch, AirPods, and CarPlay\n- Ability to connect HomePod to Apple TV 4K for stereo, surround sound, and Dolby Atmos audio\n- Option to provide statistics about Exposure Notifications, without identifying you, to participating Public Health Authorities This release also fixes the following issues:\n- Apps could be out of order on the Home Screen dock\n- Camera viewfinder may appear black when launched\n- The keyboard on the Lock Screen could miss touches when trying to enter the passcode\n- Reminders could default to times in the past\n- Photos widget may not display content\n- Weather widget could display the high temperature in Celsius when set to Fahrenheit\n- Next-hour precipitation chart description in Weather could incorrectly indicate when precipitation stops\n- Voice Memos recordings are interrupted by incoming calls\n- The screen could be black during Netflix video playback\n- Apple Cash could fail to send or receive money when asked via Siri\n- Apple Watch app may unexpectedly close when opened\n- Workout GPS routes or Health data are prevented from syncing between Apple Watch and iPhone for some users\n- Audio is incorrectly labeled as “Not Playing” in the CarPlay Dashboard\n- Devices could be prevented from charging wirelessly\n- Exposure Notifications is disabled when restoring iPhone from iCloud Backup or transferring data to a new iPhone using iPhone Migration\nApple also has separate notes for the iPadOS 14 update:",
        "sentiment": -0.13155040397707904
    },
    "article_15": {
        "title": "'AirTags' appear to include privacy features to stop unwanted tracking",
        "body": "Credit: Jon Prosser/cconceptcreator\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple looks to be including safety and privacy features in its \"AirTags\" accessory that could address concerns about unwanted tracking or stalking via the Find My app.\nThose features were revealed by code strings buried in the first developer beta of iOS 14.3, which was briefly released and then pulled on Thursday.\nDeveloper and MacRumors contributor Steve Moser, discovered the new \"AirTags\" features.\nIt looks like Apple is addressing safety/privacy concertns if you think someone placed an AirTag in your stuff with this line: \"If you feel your safety is at risk due to this item, contact your local law enforcement. You may need the serial number of this item.\" https://t.co/SiZPNhAG28 — Steve Moser (@SteveMoser) November 13, 2020\nOne of the code strings reads \"If you feel your safety is at risk due to this item, contact your local law enforcement. You may need the serial number of this item.\"\nAnother piece of evidence indicates that Apple could alert users with an \"unknown accessory detected\" prompt if they are carrying a tracking device that doesn't belong to them. \"This item has been moving with you for a while. The owner can see its location,\" an alert reads.\nApple may also provide instructions on how to disassemble an unfamiliar \"AirTags\" tracking device so that users can stop sharing their location.\nThe security and safety features should help address concerns about unwanted tracking and stalking, such as if a bad actor surreptitiously places an AirTag device in someone's bag.",
        "sentiment": -0.0961273420335991
    },
    "article_16": {
        "title": "Linus Torvalds wants Apple’s new M1-powered Macs to run Linux",
        "body": "Ivan covers Big Tech, India, policy, AI, security, platforms, and apps for TNW. That's one heck of a mixed bag. He likes to say \"Bleh.\" Ivan covers Big Tech, India, policy, AI, security, platforms, and apps for TNW. That's one heck of a mixed bag. He likes to say \"Bleh.\"\nEarlier this month, Apple revealed its own ARM-based M1 processor, along with new MacBooks and a desktop Mac Mini powered by this chip. Reviewers across the globe have been praising Apple’s first attempt, giving it high marks for performance and battery life.\nAll this positive coverage has tempted many to take the plunge and buy one of the new machines — even if some apps are not running natively at the moment. Even Linus Torvalds, the principal developer of the Linux kernel, wants one. However, he wants it to run Linux:\nI’d absolutely love to have one, if it just ran Linux.. I have fairly fond memories of the 11″ Macbook Air (I think 4,1) that I used about a decade ago (but moved away from because it took Apple too long to fix the screen – and by the time they did, I’d moved on to better laptops, and Apple had moved on to make Linux less convenient).\n[Read: Here’s how to make your website more accessible]\nAnswering to question in the Real World Tech forum, Torvalds said that while Apple runs its servers and cloud services on Linux, its computers don’t run it natively. He said that he’s been wanting an ARM-based Linux laptop for a while, but he doesn’t want to have to mess with Apple’s new laptop for it to run Linux:\nI’ve been waiting for an ARM laptop that can run Linux for alongtime. The new Air would be almost perfect, except for the OS. And I don’t have the time to tinker with it, or the inclination to fight companies that don’t want to help.\nLinux support on MacBooks would’ve made it a more attractive bet for programmers. However, I don’t think any engineers at the Cupertino campus plan to make that happen anytime soon. Sorry, Linus.",
        "sentiment": -0.129223408177495
    },
    "article_17": {
        "title": "iPhone 12 and 12 Pro Users Complain of Missing SMS Text Messages and Message Notifications",
        "body": "Since the release of the new iPhone 12 models, many new iPhone owners have been running into problems with the Messages app. There are complaints from users who aren't seeing SMS messages from friends, are missing text messages in group chats, and who aren't getting notifications when text messages are incoming.\nIt's not clear if this is a problem that's related specifically to the ‌iPhone 12‌ models or if it's a wider issue with iOS 14.1 and iOS 14.2, but the majority of complaints appear to be from ‌iPhone 12‌ owners.\nThose who are experiencing missed SMS messages are simply not seeing some text messages that are sent from Android devices, as MacRumors reader FraXis describes:\nBut I just upgraded to an iPhone 12 (coming from an iPhone 11 Max Pro), and I am in a group message with my kids. One of my kids is an Android user. Last night he came up to me and asked me why I didn't reply to his two text messages he sent to the group. I checked my iPhone, and I didn't receive any text messages from him in the group chat. He then showed me his phone, and sure enough, he had sent them to the group.\nMost of the people who are missing SMS messages are not seeing them in group chats, but there are reports of some standalone messages not getting delivered. From MacRumors reader TheElmnt:\nI'm having the exact same problem. It seems I'm having issues in group threads only when it has android users. I've been so confused in our messages the last few days. None of our conversations make sense. My friends and I just tested with iMessage and it doesn't seem to have any problems with just Apple users. I reported the bug to Apple. I just noticed this after upgrading to an iPhone 12 Pro from iPhone XS. Running iOS 14.1 on Verizon. I deleted every single text message on my phone and rebooted, turned iMessage off and back on. Hoping this helps.\nThere are also separate complaints of Messages being received, but no notification showing up. This is a problem that even pre-dates the ‌iPhone 12‌ and iOS 14, as we've had earlier issues with it too. From MacRumors reader bmac4:\nI am having the issue with just a single person and it's not SMS. Mine is iMessage. I was texting with my mom last night, and she updated to 14.2 on her XR in the process. Soon after, she stopped replying to my text. I sent her another one, and she said she never saw the text. Then I stopped receiving any alerts at all. I had to open the message app and check to see if a message was there. Sure enough the phone never alerted, and there was no badge, but there was a message. iOS 14 is a total mess.\nSome Verizon users have been able to solve their SMS messages by downloading the Verizon Message+ app, but it's not a complete fix for everyone and it doesn't work for all non-Verizon users. One reader also had success resetting network settings (Settings > General > Reset > Reset Network Settings), but that has not worked for others. Toggling off 5G also does not seem to be a solution.\nThis is likely a problem that carriers need to address with updated firmware or that Apple needs to fix in an upcoming software update. It appears to be a problem in both iOS 14.1 and iOS 14.2, and it's too soon yet to tell if iOS 14.3 is affected.\nAre you having issues receiving some messages on ‌iPhone 12‌ and 12 Pro models? Let us know in the comments.",
        "sentiment": -0.49176862757854367
    },
    "article_18": {
        "title": "Apple’s M1 MacBook Air has that Apple Silicon magic",
        "body": "The new M1-powered MacBook Air is hilariously fast, and the battery lasts a long-ass time.\nIf you stop reading this review immediately after this, then know that unless Windows virtualization is a requirement of your workflow, you should probably just go ahead and sell your old MacBook Air immediately and get this thing instead.\nAssuming you've got a grand or so lying around that you weren't going to spend on something else. But hey, if you do, then I can confidently tell you that in spite of what a legion of Doubting Thomases (including me!) might have said about Apple's freshman effort at its own PC silicon, it is now my studied opinion that there are far, far stupider ways to part with your cash.\nA quick caveat on this “review”\nApple provided Ars with a couple of M1 Mac Minis for review. One of those went to Samuel for him to write up, and the other went to Jim for him to do his silicon analysis. Apple declined our request for any model of M1-powered laptop.\nThe MacBook Air being reviewed here is my personal device, which I bought shortly after the unveiling event. I've written this as quickly as possible after receiving it, but I had to wait for the device, which is why you all had to wait for the review. (This is also why it's in kind of an intermediate configuration, rather than stock or maxed out like most review devices—I bumped the RAM up to 16GB and the internal storage up to 1TB, because that's what I wanted.)\nBecause this is my device, I'm coming into this review from a slightly different perspective than some of the other publications doing MBA reviews. I'm not going to tell you why you should buy a MacBook Air, or how it might work for you. But I am going to talk about what it has been like to own it for a few days and how the device fits into my life. I do most of my power-user stuff on the desktop rather than on a portable, but I do occasionally need to leave the office and hit the road—and the M1 MBA is going to be a great traveling companion. You know, once we can hit the road again without worrying about plagues and stuff.\nSpecs at a glance: 2020 MacBook Air (M1) Screen 2560×1600 at 13.3 inches OS macOS Big Sur 11.0.1 CPU Apple M1 RAM 16GB GPU Apple M1 (8 core) HDD 1TB SSD Networking 802.11ax Wi-Fi 6; IEEE 802.11a/b/g/n/ac; Bluetooth 5.0 Ports 2x Thunderbolt 3/USB 3.1 Gen 2/DisplayPort, 3.5mm headphone Size 0.16–0.63×11.97×8.36-inch (0.41–1.61×30.41×21.24cm) Weight 2.8 lbs (1.29kg) Warranty 1 year, or 3 years with AppleCare+ Price as reviewed $1,649 Other perks 720p FaceTime HD camera, stereo speakers\nUnboxinating\nApproaching a device like this as a reviewer is different from approaching a device as a consumer. When the UPS guy drops it off, you can't just rip the box open and jump in—there's stuff you have to do first.\nTripods. Lights. Gotta iron the big white sweep cloth so I've got a background for pix. Gotta try to remember where the DSLR battery is.\nIt's the oddest part about working for Ars, even after going on eight years. Your technology buying experiences are not always your own—sometimes the Ars readership comes along for the ride.\nSo after unboxing, I logged on and ran some benchmarks. That's the first thing you have to do when you're reviewing—you either do the benchmarks first, or you do them dead last, and I wanted to get them out of the way because this was, you know, my laptop, and I'd actually like to use it for stuff rather than having it be tied up running battery tests for 20 hours at a time.\nLee Hutchinson\nLee Hutchinson\nLee Hutchinson\nLee Hutchinson\nLee Hutchinson\nLee Hutchinson\nOnly a few days earlier, I had used my living room HTPC—a base-config 2018 Mac mini—to do the entire set of Mac comparison benchmarks for Samuel's Mac mini review. I had a pretty good feel for how quickly the Intel mini's hex-core i5 banged through each of the tests, since I'd just seen the numbers, and from talking to Samuel and Jim I was anticipating the new MBA's M1 would beat the Intel-powered mini.\nI just didn't realize how hard a beatdown it would be.\nAdvertisement\nGetting the benchmarky bits out of the way\nSo here's how fast it is in a bunch of charts and graphs.\nAccording to Apple, the MacBook Air's M1 is voltage-limited in order to function within the fanless design's thermal envelope. iFixit's teardown shows in detail that the Air's M1 cooling setup is an entirely passive affair, with just a heat transfer plate in between the M1 CPU and the aluminum body. I was expecting performance similar to but perhaps a bit lower than the M1-powered Mac mini, and that's more or less what I got. However, the Air's M1 is good for at least a few solid minutes of full-bore Firestorm core performance before it throttles back.\nIn benchmarking, I noticed that subsequent runs of the Final Cut Pro export would slow down dramatically—the first export would complete in about 1 minute and 19 seconds, but if I immediately repeated the export it would take a bit under 2.5 minutes—and the Air would be quite warm to the touch. After closing the lid to hibernate until the Air was cool and then repeating the export, the time was once again in the 1:20-ish range.\nTo create some more sustained load, I cloned the source video three times and then repeated the export process. Starting from a cold startup with the MBA's chassis at ambient temperature gave a result of 4 minutes, 21 seconds. This time, I opened Activity Monitor's CPU graph to spy on the core utilization. All eight cores were engaged until about 2:56, at which time half of the cores—presumably the high-performance Firestorm cores—dropped to less than 50-percent usage and stayed there until the run completed.\nA second run immediately after that took 7:37—not quite twice as long, but heading in that direction. Activity Monitor's CPU usage graph showed half of the cores (presumably the high-performance Firestorm cores) at half utilization for the entire run.\nFurther testing—including several runs after letting the MBA sit powered off for about an hour to make absolutely sure it was cooled to ambient—failed to produce anything resembling a precise, repeatable time interval for when throttling starts. The best I can do is to say that it seems that when you throw a heavy workload at the MBA, it runs at full-bore until the Firestorm cores become too toasty, which seems to take anywhere from 3-ish to 6-ish minutes. Then it backs the Firestorm cores off until they show about 50-percent utilization, and the amount of heat generated at that level seems to be within the sustained thermal capacity of the design.\n(These are subjective measurements, taken in whatever indoor ambient conditions happened to be happening in my house as I was doing the testing. Your results may vary.)\nI hate USB-C charging, give me back MagSafe\nThe other major thing for a portable like the MBA is battery life, and we're going to talk about that. But first, very briefly, the loss of MagSafe sucks.\nYes, I know I'm late to the discussion. I know MagSafe was deleted a few hardware revisions ago, but I'm going from a MacBook Air with it to a MacBook Air without it, and plugging in a USB-C cable feels like going back to the freaking dark ages. I've been happy with MagSafe plugs on my laptops for almost an entire decade—that quick one-handed snick into place, that easy no-fuss pull to disengage, and that friendly LED to tell you when you're all charged up.\nHaving to shove a connector into a high-friction plug—often requiring two hands, depending on how you're holding stuff—is stupid. It's just stupid. This is a customer-hostile regression in functionality. I'm sure there are excellent reasons for it and that it saves Apple money on the MBA's bill of materials and on warranty support, but I hate it and it's terrible. This is not the premium Apple experience I feel like I'm paying for.\nBattery life\nI used the M1 MacBook Air for work all day one day, filling up about 11 hours of on-the-clock time with Slack, emailing, Zoom conferencing, Messages, and Web browsing, and the Air still had 40 percent remaining on the battery meter when the day was done. This is considerably longer than my old 2015 MBA, which throws in the towel around hour five. (Unlike with the official battery test, my unofficial workday usage test was done with adaptive brightness and Night Shift enabled, and there was a fair amount of idling.)\nIn the official Ars battery test, with the screen locked at our reference brightness of 200 nits, the M1 MBA lasted for 877 minutes—a bit over 14.5 hours. Charge time back from almost dead to full took a bit over two hours with the included 30W adapter, with the device powered off during the charge.\nBut I don't usually spend the day working on my laptop—instead, the place where my old MBA most often lets me down is on long flights. Living in Houston means I usually fly United, and United is particularly miserly with power plugs—if you don't get certain specific seats, you're out of luck. In my experience, my Intel MBA is good for three, maybe four hours of movie watching before it's dead as a doornail—so if I'm flying to California or pretty much anywhere that's more than a couple of hours away and I don't get a power outlet seat, I know I probably need to bring a book.\nThe M1 Air laughs at my old MBA. It laughs at it, gives it noogies, and flushes its head down the toilet in the locker room.\nI left the M1 MBA playing 4K Westworld episodes from the UHD BluRay box set, full screen and at max brightness, with the sound blaring at max volume. I finally gave up and shut the laptop off after ten hours, at which point it still said it had 13-percent battery remaining. That's not only long enough to last out any domestic flight—that's enough to last you an international flight from the US to Europe.\nA quick note on resuming from sleep: during the Air's reveal, Apple showed off how quickly the Air resumes from standby by having Senior VP Craig Federighi lift the lid of a sleeping MacBook Air and peek in, all set to the mellow sounds of Barry White. While I can't say that Barry White plays when I open up my laptop, I can say that the M1 Air wakes from sleep very quickly. It's not that it's faster than my Intel-powered Air, since the 2015 model will sometimes wake up instantly, too—but the 2015 Air also sometimes takes a second or two to blink on when I lift the lid. The M1 Air is much more consistent—I've only had the thing for a few days, but every wake-from-sleep has been lightning quick.",
        "sentiment": -0.2833871327340603
    },
    "article_19": {
        "title": "Apple security chief maintains innocence after bribery charges",
        "body": "A grand jury in California's Santa Clara County has indicted Thomas Moyer, Apple's head of global security, for bribery. Moyer is accused of offering 200 iPads to the Santa County Sheriff's office in exchange for concealed carry permits for four Apple employees.\nMoyer's attorney says that he did nothing wrong, and notably Apple is standing behind its executive.\n“We expect all of our employees to conduct themselves with integrity,\" an Apple spokesperson said in a statement. \"After learning of the allegations, we conducted a thorough internal investigation and found no wrongdoing.\"\nAlso indicted were two officials in the office of Santa Clara County Sheriff Laurie Smith. These officials are accused of soliciting the alleged bribe.\nCalifornia law gives sheriffs broad discretion to decide who gets permits to carry concealed weapons in the state. Smith has previously faced accusations that her office deliberately withheld permits to carry concealed weapons until applicants did favors for Smith. A June investigation by NBC Bay Area found that donors to Smith's re-election campaign were 14 times more likely to get concealed carry permits than those who didn't donate.\nA press release from Smith's office described the indictments as \"a difficult time for our organization.\"\nJeff Rosen, the Santa Clara district attorney responsible for the indictments, said that the donation of 200 iPads was scuttled at the last minute after Rosen obtained a search warrant in the case.\nAdvertisement\nAccording to LinkedIn, Moyer is responsible for \"strategic management of Apple's corporate and retail security, crisis management, executive protection, investigations and new product secrecy.\"\nWhile two individuals in Sheriff Smith's office were indicted, no charges have been filed against Smith herself. Rosen says the investigation is ongoing. A common prosecutorial strategy is to focus on lower-ranking employees first in order to pressure them to provide evidence against their boss.\nOthers also face bribery charges\nThe same day he indicted Moyer, Rosen also indicted an insurance broker, Harpreet Chadha, who also sought a concealed carry permit from the Santa Clara Sheriff's office. Chadha is accused of furnishing Smith with tickets worth $6,000 to a luxury box suite at a San Jose Sharks game.\n\"Sheriff Laurie Smith’s family members and some of her biggest supporters held a celebration of her reelection as sheriff in Chadha’s suite,\" Rosen said.\nChadha's attorney described the indictment as a \"grave miscarriage of justice.\"\nIn August, Rosen charged four people in another bribery scheme involving the Santa Clara County Sheriff's office. The alleged scheme involved a trade of campaign donations for concealed carry permits. One of the defendants, James Jensen, was a sheriff's captain who was also charged in last week's indictment of Apple's Moyer.\nThe August indictment focused on an effort to obtain concealed carry permits for a company that was providing security to Facebook executives.\n\"I need you to meet my buddy that runs the Facebook Executive protection team,” one of the defendants wrote to an attorney charged in the case. “It’s a potential $50K.”\nThe conspirators then allegedly met at a San Jose Jamba Juice and allegedly reached a deal where the sheriff's office would supply 10 to 12 concealed carry permits in exchange for campaign contributions worth $90,000.\nAll of the defendants could serve prison time if they are convicted.",
        "sentiment": -0.3671991195130561
    },
    "article_20": {
        "title": "Nikkei: Apple Aiming to Produce 2.5m Apple Silicon MacBooks by February 2021",
        "body": "Apple is intending to produce 2.5 million MacBooks with Apple Silicon processors by February 2021, according to a new report by Nikkei Asian Review.\nThe initial production orders for the first MacBooks with ‌Apple Silicon‌ are reportedly equivalent to almost 20 percent of all 12.6 million MacBook shipments in 2019.\nNikkei Asia's sources stated that the ‌Apple Silicon‌ chips within the new MacBooks will be manufactured by TSMC using a five-nanometer fabrication process. This appears to corroborate other rumors that ‌Apple Silicon‌ chips for the Mac will be variants of the A14 chip from the iPad Air and iPhone 12, which is the only Apple chip made using a five-nanometer process so far.\nThe report claims that Apple will introduce further Mac devices with ‌Apple Silicon‌ in the second quarter of 2021, as Apple gradually replaces the Intel chips across its entire Mac lineup.\nThe first Macs with ‌Apple Silicon‌ are expected to be unveiled on Tuesday, November 10, at the \"One More Thing...\" Apple event.",
        "sentiment": -0.12896327612300715
    },
    "article_21": {
        "title": "Will Apple silicon change the PC industry to ARM?",
        "body": "Apple Silicon Macs will forge ahead without dependence on Intel, instead leveraging economies of scale from iOS\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nBefore this year ends and the decade of the 2020s gets underway, Apple is poised to unveil a dramatic new architecture for its venerable Macintosh computing platform. Here's why new Apple Silicon hardware is an important step in the future of the Mac.\nWhy Apple is moving to new silicon\nAcross the last four decades, Apple has uniquely made a series of radical moves to shift its Mac hardware to entirely new and materially different chip architectures.\nNo other computing platform has successfully performed such a complex undertaking on a similar scale even once, let alone attempting the three major platform shifts Apple has made on the Mac, from Motorola's 68000 in the 1980s to PowerPC in the 90s and then to Intel x86 in the 2000s.\nEach migration involved massive efforts to not only deliver new hardware, but also transform vast software platforms and create new development tools to minimize the transition pain of users and developers. When Apple migrated to PowerPC in the early 90s, other platforms of the day were supposed to complete parallel transitions of their own, including Microsoft's Windows NT, IBM's OS/2, the Commodore Amiga, and many others.\nApple's unique ability to successfully complete the shift to PowerPC was complicated by other firms' failing to do the same, resulting in Apple eventually ending up the only major PowerPC user. The difficulty of that transition and its unexpected result might suggest that in hindsight, it was ultimately a mistake to have attempted such a complex and risky task.\nOn the other hand, Apple's migration to Intel Macs about a decade later was hailed as a masterful strategic move, enabling Apple to enter new markets and eventually expand its Mac platform dramatically. Yet Apple's move to Intel's chips starting in 2006 was largely enabled by the company's previous PowerPC experience in learning how to execute such a transition.\nAn Apple Silicon transition that's been underway for a decade\nIt's useful to examine what benefit there is for Apple to again shift to an all-new chip architecture this year, this time using a custom silicon architecture of its own design rather than buying off-the-shelf chips available to any PC maker.\nIn a variety of ways, the Mac-maker's move to new \"Apple Silicon\" isn't entirely new. The company has been developing customized \"System on a Chip\" silicon since 2008, an effort which resulted in the A4 chip that powered iPhone 4, the original iPad, and the first iOS-based Apple TV.\nStarting in 2016, Apple began shipping Macs equipped with T1, a custom SoC designed to handle Touch ID security and to provide the System Management Controller features that differentiated Apple's Intel Macs from commodity Intel PCs. Even before the T1, Apple's custom SMC microcontroller managed Macs' power management, battery charging, sleep and hibernation, video display modes, and other features that customized and enhanced the Mac experience.\nApple's T2 SoC\nSince 2017, new Macs have included an even more advanced T2 SoC. This 64-bit chip handles everything from disk encryption to image processing, and enabled features ranging from iPad Sidecar to Hey Siri. The last few years of T2 Macs have effectively been Apple Silicon Macs with an Intel processor providing native x86 software compatibility!\nHow Macs got hooked on Intel chips\nApple's Intel Macs currently use the same Intel x86 architecture as industry-standard PCs running Windows or Linux. In fact, the Intel chips in today's Macs are inherently what made it so easy for Macs to run Windows software or run an instance of a Linux server.\nThat commonality and compatibility were originally touted as a major reason for Apple moving to Intel chips back in 2006.\nBefore that shift, Apple's Macs used PowerPC chips that could boast a number of technical advantages over x86 chips. However, PowerPC increasingly struggled to keep up with the pace of Intel's competitive x86 developments simply due to economic factors.\nBy 2004, Apple was the only significant vendor left using PowerPC chips. The rest of the desktop computing world had largely converged on x86 chips from Intel, creating vast economies of scale that supported Intel's continued investment in future generations of its x86 chips.\nWith sales of Macs only growing incrementally and no remaining prospects for expanding the demand for PowerPC chips, the manufacturing partners behind the PowerPC architecture lacked any similarly secure financial backing needed to maintain parity with Intel's relentless pace of ongoing silicon development.\nDeveloping new generations of chips is vastly expensive work that simply couldn't be competitively financed by a single PC maker shipping only around 3.3 million Macs per year. In 2004, Windows PCs were outselling Macs by a factor of 56. PC makers collectively sold 182.5 million units that year, creating a massive gulf between the PowerPC Mac platform and the Intel PC platform.\nApple's jump from PowerPC to Intel erased that chasm and brought Intel's economies of scale to the Mac, making it dramatically easier for Apple to not only keep up with its hardware rivals, but to innovate in other ways that contributed to Macs being more valuable than a bog-standard PC. Apple's macOS itself was a major example of that, adding unique value to Apple's platform in usability, security, and attractiveness.\nIn 2012, Horace Dediu described for Asymco how Apple turned around Microsoft's dominant position in PCs, detailing how its differentiated Intel Macs rapidly shifted the ratio of Macs to PCs sold.\nWindows units sold as a multiple of Apple devices. Source: Horace Dediu\nApple built a new non-Intel platform larger than the Mac\nAnother very significant shift began to occur immediately after Steve Jobs first debuted Apple's initial Intel Macs back in 2006. The next year, Apple launched the iPhone, followed by its iOS-based iPad tablet in 2010.\nOver the next decade, Apple's new iOS mobile software platform (based on macOS) becomes at least as large and arguably an even more influential software and development platform than Windows, Linux, ChromeOS, or anything else— certainly within the emerging explosion of the mobile market.\nImportantly, that new Apple platform didn't need Intel chips. Rapidly expanding iPad sales drove Apple into the role of the world's leading personal computing maker, even as an army of industry marketing groups desperately tried to portray iPad as nothing more than a \"media consumption device.\"\nThe reality was that iPads and iPhones were commonly replacing the historical roles of PCs while creating new markets for mobile computing that Intel-based PCs couldn't match. It was a case of classic disruption: an innovative new product that could effectively compete against an existing, more complex, and expensive alternative that was \"over-serving\" the market.\nDespite Microsoft's various efforts to make its own \"mobile Windows;\" Intel's various attempts to drive sales of its mobile x86 chips by Linux and Android makers; and Google's efforts to copy Apple's iPad using Android and also counter it with its own web-based \"Chrome\" PCs or netbooks, no other company has been able to develop a mobile computing apps platform capable of commercially rivaling Apple's iOS and iPad OS on a similar scale, and with similar commercial results.\nRival mobile platforms supported the economies of scale that benefitted iOS\nIn fact, no one else has been able to achieve Apple's success because nobody actually copied what Apple was doing. ChromeOS came closest: like Intel Macs, it launched a unique OS on relatively standard hardware.\nGoogle just failed to gain any adoption for ChromeOS outside of U.S. schools looking for very cheap hardware.\nAndroid licensees have collectively shipped lots of smartphones, but the value of the Android platform has splintered between app stores and hardware platforms. Rather than driving economies of scale that Apple couldn't match, the commonality of Android licensees has largely just supported a more important industry-standard: ARM architecture hardware.\nBecause Apple was also using ARM chips in its iOS devices, it benefitted tremendously from the industry's common use of the ARM architecture, including all the collective efforts poured into ARM silicon development and ARM architecture software tools, compilers, and other efforts.\nSo while Macs were leveraging Intel's PC commonality to advance the unique value in macOS over Windows or Linux, Apple's mobile device sales were leveraging the ARM architecture to support iOS and iPadOS as superior alternatives to Android.\nBut there was also a difference: while Intel's desktop x86 represented a proprietary processor platform, the mobile ARM architecture was a technology Apple could license and independently develop on its own, adding unique value on the silicon level in the same way it had been doing in software with macOS, iOS and iPadOS.\nApple's A4 leveraged ARM's economies of scale while adding additional custom value\nEmbrace, extend, extinguish\nBy moving future generations of its Macs to its own uniquely enhanced silicon, Apple is again able to benefit from both common economies of scale and proprietary advancements that add unique value. It's noteworthy that other competitors in the PC and mobile space have tried but failed to similarly do this.\nBoth Samsung and LG have attempted to acquire and develop their own unique software development platforms with Tizen and webOS. Yet outside of the smaller markets for smart TVs and watches, Android has effectively blocked their ability to drive volume sales of differentiated software on standard hardware, whether in phones or tablets or notebooks.\nHuawei has similarly claimed that it is close to introducing its own internal OS platform out of necessity after the U.S. blocked it from using Google's Android. But this has been merely disruptive to Huawei's sales, because existing Android buyers don't want a non-standard, non-compatible Android alternative.\nAndroid was supposed to unite the industry against Apple. Instead, it has locked its licensees into a dependence upon Google and its policies, while effectively preventing those licensees from freely innovating on their own with their own software platforms.\nIn the other direction, Microsoft has made multiple attempts to shift Windows PCs and mobile devices from Intel to ARM, leveraging the mobile advantages of the ARM architecture. But Microsoft lacks Apple's ability to decisively shift its entire platform to a new chip architecture because the majority of Microsoft's Windows platform is delivered by PC licensees.\nThe minority of Windows-on-ARM devices that Microsoft and its partners ship simply splinters the Windows platform without offering significant added value. Unlike Apple, Microsoft also has no silicon expertise of its own, simply leaving it newly dependent on Qualcomm rather than Intel, and straddling both chip architectures the same way that Google's support for both ARM and Intel in Android was a splintering liability rather than a real advantage.\nApple Silicon gives Macs a new platform advantage\nIn shifting from Intel x86 chips to its own Apple Silicon SoCs, Macs will lose some of the hardware compatibility they gained back in 2006. However, two things have changed since then.\nFirst, the need to run Windows has fallen dramatically for many people for whom it was once very important. Secondly, Microsoft itself has developed the native ability to run Windows on ARM.\nIn parallel, Apple Silicon Macs will gain the ability to natively run ARM software developed for iOS. That not only means it will be a bit easier to develop for iOS on Macs and to migrate iOS apps to run on Macs, but also that it will be easier for both Apple and third-party developers to develop software tools and specialized code that uses not just ARM Architecture CPUs, but also the other silicon engines Apple has developed, including its custom Apple GPU, the Neural Engine, and features like its AMX machine learning accelerators.\nFor most users, these new advantages from Apple Silicon will be far more valuable than running the x86 version of Windows natively.\nNote also that all of these custom silicon processor engines, each tuned to specific types of operations, are only a few years old. Driven by continued sales of iPhones, iPad, and Apple Silicon Macs, future development of Apple Silicon SoCs can adapt to handle specialized new functions that evolve in the near future.\nBy using its own silicon designs everywhere, Apple can not only enhance the Mac but also more rapidly bring advanced new technologies to other new products ranging from new types of wearables to home devices.\nRather than being stuck with the basic Intel x86 architecture that is optimized to deliver a classic PC experience, Apple can enhance its Apple Silicon Macs to deliver notebook and desktop machines that share more of its own vision for devices that don't just calculate but blur the line between hardware and software in the model of Apple Watch, and seamlessly integrate with other devices in the model of Continuity.\nT2 Apple Silicon\nApple has already pursued these goals by integrating large parts of its existing A-series chips into recent Macs by way of the T2, which brought Apple's custom codecs, storage controllers, and security features such as the Secure Enclave to Macs.\nIn going one step further to replace Intel's CPU, its integrated GPU, and other features currently handled by an x86 chip and the supporting hardware developed around Intel's x86 architecture, Apple can radically take future Macs in a new direction that will leave behind standard PCs the same way that iPad has left simpler Android tablets in the dust, or the way iPhone silicon has rapidly advanced beyond what is even available in an Android phone.\nCustom T2 Apple Silicon has already brought differentiating features to Intel Macs, including Touch ID, SideCar, Touch Bar and Hey Siri\nOver the past ten years, Macs have increasingly been held back by Intel's x86 architecture more than they have benefitted from its economies of scale. It's now the perfect time to shift mobile Macs to the much more power-efficient, graphically powerful, and broadly sophisticated imaging and machine learning silicon that shares economies of scale with Apple's own iOS hardware.\nAdditionally, Apple will gain another major benefit: leveraging the advanced 5nm silicon manufacturing technology of TSMC that is far ahead of Intel's current 10nm chip manufacturing capacity in its tenth generation Ice Lake x86 chips.\nThis is also a big loss for Intel, as Apple represents one of its most valuable and technologically demanding clients. With Microsoft and other PC makers also shifting some of their production to various alternative chip makers, the Intel x86 platform will suffer a major weakening of its economies of scale, something that will also detriment every PC maker relying on Intel to help them keep parity with Apple.\nRecall that it was Intel that drove industry-wide efforts to get PC makers to deliver ultralight notebooks that could compete with Apple's MacBook Air.\nWith Intel increasing unable to help PC competitors copy Apple's work, we're likely to see Macs peel ahead of commodity PCs at a pace closer to iPads advancing beyond other tablets, or Apple Watch leaving behind other smartwatches, or iPhones advancing while Android phones scale back their ambitions to instead reach lower price points.\nThat will be an important development because PCs under the control of Intel have not previously advanced as fast as mobile devices have. It's also a development that could spur other companies to try new approaches rather than just cranking out more generic PC boxes wrapped around an Intel platform and running a Microsoft OS.\nIf they are unable to compete, we're likely to see a major new bloom in Mac sales that brings more advanced, connected, and broadly powerful computing to creative users, to businesses, to education, and elsewhere, driving similar advancements in desktop computing as we've already seen in phones and tablets.",
        "sentiment": 0.20634709686479147
    },
    "article_22": {
        "title": "Does Apple really log every app you run? A technical look",
        "body": "Does Apple really log every app you run? A technical look\nApple’s launch of macOS Big Sur was almost immediately followed by server issues which prevented users from running third-party apps on their computers. While a workaround was soon found by people on Twitter, others raised some privacy concerns related to that issue.\nHey Apple users:\nIf you're now experiencing hangs launching apps on the Mac, I figured out the problem using Little Snitch.\nIt's trustd connecting to https://t.co/FzIGwbGRan\nDenying that connection fixes it, because OCSP is a soft failure.\n(Disconnect internet also fixes.) pic.twitter.com/w9YciFltrb — Jeff Johnson (@lapcatsoftware) November 12, 2020\nWhat is OCSP?\nOCSP stands for Online Certificate Status Protocol. As the name implies, it is used to verify the validity of a certificate without having to download and scan large certificate revocation lists. macOS uses OCSP to make sure that the developer certificate hasn’t been revoked before an app is launched.\nAs Jeff Johnson explains in his tweet above, if macOS cannot reach Apple’s OCSP responder it skips the check and launches the app anyway - it is basically a fail-open behaviour. The problem is that Apple’s responder didn’t go down; it was reachable but became extremely slow, and this prevented the soft failure from triggering and giving up the check.\nIt is clear that this mechanism requires macOS to contact Apple before an app is launched. The sudden public awareness of this fact, brought about by Apple’s issues, raised some privacy concerns and a post from security researcher Jeffrey Paul became very popular on Twitter. He claims that\nIn the current version of the macOS, the OS sends to Apple a hash (unique identifier) of each and every program you run, when you run it.\nThat would be creepy indeed.\nTo make things worse, it is common for OCSP to use HTTP - I’m talking about good old plaintext HTTP on port 80, none of that HTTPS rubbish. There is usually a good reason for this, that becomes especially clear when the OCSP service is used for web browsers: preventing loops. If you used HTTPS for checking a certificate with OCSP then you would need to also check the certificate for the HTTPS connection using OCSP. That would imply opening another HTTPS connection and so on.\nOf course while OCSP does not mandate encryption, it does require that responses are signed by the server. This still doesn’t solve the initial concern that anyone with a traffic analyzer on your network could eavesdrop every app you open and when you open it.\nDiving deeper\nKnowing some OCSP basics, more questions arise. OCSP is about checking certificates; why should this have anything to do with sending out hashes of apps you run? Does macOS really compute the hash of each executable at each launch? What about very large ones? That would take a significant amount of time; is it possible that nobody noticed? Maybe the hash is computed only once (e.g. the first time you run the app) and it is stored somewhere. But I’m not convinced and I think these claims needs more research.\nCapturing a OCSP request is as easy as setting up an HTTP proxy or starting Wireshark. No HTTPS means no encryption, no certificate pinning, no problems whatsoever. I captured the following request while opening Firefox.\nGET /ocsp-devid01/ME4wTKADAgEAMEUwQzBBMAkGBSsOAwIaBQAEFDOB0e%2FbaLCFIU0u76%2BMSmlkPCpsBBRXF%2B2iz9x8mKEQ4Py%2Bhy0s8uMXVAIIBseUIWx6qTA%3D HTTP / 1.1 Host : ocsp.apple.com Accept : */* User-Agent : com.apple.trustd/2.0 Accept-Language : it-it Accept-Encoding : gzip, deflate Connection : keep-alive\nI should also add that after closing Firefox and opening it again, no requests were made. This is reasonable, and indicates that certificate checking isn’t performed at each launch but only after it hasn’t been performed for a certain period of time.\nThe request is a very simple GET that contains the payload as a base64-encoded string. The actual binary data can be easily dumped to a file:\necho 'ME4wTKADAgEAMEUwQzBBMAkGBSsOAwIaBQAEFDOB0e/baLCFIU0u76+MSmlkPCpsBBRXF+2iz9x8mKEQ4Py+hy0s8uMXVAIIBseUIWx6qTA=' | base64 --decode > output.bin\nWe obtain an 80-byte-long payload that looks nothing like a hash. Sure enough, it isn’t. We can use OpenSSL to extract readable information from the binary file.\nopenssl ocsp -text -reqin output.bin\nOCSP Request Data: Version: 1 (0x0) Requestor List: Certificate ID: Hash Algorithm: sha1 Issuer Name Hash: 3381D1EFDB68B085214D2EEFAF8C4A69643C2A6C Issuer Key Hash: 5717EDA2CFDC7C98A110E0FCBE872D2CF2E31754 Serial Number: 06C794216C7AA930\nWhile the payload itself is not a hash, we can see that it does contain two hashes: Issuer Name Hash and Issuer Key Hash . I’ll take care of them later, but meanwhile you can easily verify by yourself that those are static values that never change between applications.\nIt is clear that the trustd service on macOS doesn’t send out a hash of the apps you launch. Instead, it just sends information about some certificate - as we would certainly expect after understanding what OCSP is in the first place.\nWell, this does not solve the problem, does it? If each app has a unique certificate, then it would still be possible to create a table that associates each serial number to the corresponding app, and thus this would still be a privacy concern. Let’s check if this is the case.\nDeveloper certificates…\nFirst of all I would like to determine from which certificate this information comes from. I used Apple’s codesign utility to extract certificates from the Firefox app in order to look for matching data.\ncodesign -d --extract-certificates /Applications/Firefox.app\nThis command results in several files being created with names codesign0 , codesign1 , etc. The first one is the leaf certificate, while others belong to the certificate chain up until the root. codesign0 should be what we are looking for, and once again we can use OpenSSL to extract some info about it.\nopenssl x509 -inform der -in codesign0 -text\nCertificate: Data: Version: 3 (0x2) Serial Number: 488521955867797808 (0x6c794216c7aa930) Signature Algorithm: sha256WithRSAEncryption Issuer: CN=Developer ID Certification Authority, OU=Apple Certification Authority, O=Apple Inc., C=US Validity Not Before: May 8 19:08:58 2017 GMT Not After : May 9 19:08:58 2022 GMT Subject: UID=43AQ936H96, CN=Developer ID Application: Mozilla Corporation (43AQ936H96), OU=43AQ936H96, O=Mozilla Corporation, C=US ...\nCheck the serial number we got ( 0x6c794216c7aa930 ) and compare it with the payload of the OCSP request. We have a match! This proves that OCSP requests actually send out information about the app developer certificate.\nAt this point we can easily understand the meaning of Issuer Name Hash and Issuer Key Hash in the OCSP request payload and why they never change. The keyword here is “Issuer”. Who issues developer certificates? Apple, of course. And in fact those are, respectively, a hash of Apple’s certificate name and of Apple’s certificate key.\n…and their generality\n“So what?” you might ask. Well, developer certificates aren’t unique for each app. Once again, don’t take my word for it. We can quickly verify this by checking the certificate of a different app from Mozilla, say Thunderbird.\ncodesign -d --extract-certificates /Applications/Thunderbird.app openssl x509 -inform der -in codesign0 -text\nCertificate: Data: Version: 3 (0x2) Serial Number: 488521955867797808 (0x6c794216c7aa930) Signature Algorithm: sha256WithRSAEncryption Issuer: CN=Developer ID Certification Authority, OU=Apple Certification Authority, O=Apple Inc., C=US Validity Not Before: May 8 19:08:58 2017 GMT Not After : May 9 19:08:58 2022 GMT Subject: UID=43AQ936H96, CN=Developer ID Application: Mozilla Corporation (43AQ936H96), OU=43AQ936H96, O=Mozilla Corporation, C=US ...\nThat’s exactly the same certificate used for Firefox (of course it is!). So Jeffrey Paul’s analysis isn’t quite accurate - at least for what concerns these parts (emphasis mine).\nThe OS sends to Apple a hash (unique identifier) of each and every program you run, when you run it.\n[An IP address] allows for a table that has the following headings: Date, Time, Computer, ISP, City, State, Application Hash\n[This means that Apple knows] what apps you open there, and how often. They know when you open Premiere over at a friend’s house on their Wi-Fi, and they know when you open Tor Browser in a hotel on a trip to another city.\nmacOS does actually send out some opaque information about the developer certificate of those apps, and that’s quite an important difference on a privacy perspective.\nA word about notarization\nI would like to clarify something that is probably at the root of this misunderstanding. In fact, there exists a situation where macOS can actually send Apple the hash of an executable, and that is when Gatekeeper checks if a notarization ticket exists on Apple’s servers upon first launch, in case the ticket isn’t stapled to the app.\nThis has nothing to do with OCSP. It happens under specific circumstances and the check is performed via a secure (HTTPS) endpoint located at api.apple-cloudkit.com . During this process, a pop-up with a progress bar is shown to the user.\nAbout blocking OCSP\nAs you probably have already learned during Apple’s OCSP responder outage, you can block OCSP requests in several ways, the most popular ones being Little Snitch and editing your /etc/hosts file. Personally, I wouldn’t suggest doing that as it prevents an important security feature from working.\nNow that you know the actual facts, if you think your privacy is put at risk by this feature more than having potential undetected malware running on your system, go ahead. Otherwise, don’t bother.\nIf you use macOS Big Sur, blocking OCSP might not be as trivial. Before crying conspiracy, however, keep in mind that common users are generally not able to fully understand and evaluate the impact of disabling such a complex and delicate security feature on their computer.\nTL;DR",
        "sentiment": -0.31016722861882096
    },
    "article_23": {
        "title": "iOS 14.2 brings JIT compilation support, which enables emulation apps at full performance",
        "body": "You may know some unofficial iOS apps that offer some kind of emulation. These apps run based on hacks and exploits, which reduces performance considerably — but that’s about to change. Apple has silently introduced support for Just-In-Time (JIT) compilation on iOS 14.2, which will allow emulation apps to run at full speed on the iPhone and iPad.\nRiley Testut, the developer behind AltStore, shared with 9to5Mac more details about how this change will impact these unofficial apps that offer console and virtual machine emulation. But first, let me briefly explain what JIT is and how it works on iOS.\nJIT, or Just-In-Time compilation, is a way to run software that will be compiled during its execution, while a traditional software is fully compiled before it is executed. With JIT, the source code is translated into the machine’s native code in real time.\nApple has never offered official support for JIT compilation on iOS, but some developers have found ways to run it with hacks, which came with the cost of having several bugs and low performance. These exploits, however, have been completely removed on iOS 14. At least until now.\nAs described by Testut, Apple has added support for JIT compilation in iOS 14.2 beta 2 — but this has never been publicly mentioned by the company. The support was maintained throughout the betas and was kept in the final release. The developer believes this is an official implementation rather than a mistake by Apple, but there’s no way to confirm this for now.\nWith JIT compilation support on iOS 14.2, emulation apps can now run at full speed without hacks, jailbreak, and other compromises.\nFor example, with JIT Delta could in theory emulate more powerful systems such as PS2, GameCube, and Wii; without JIT, we’d need to wait several more years before the hardware was capable of that. At first I was skeptical, but am now leaning more towards thinking this was an intentional change.\nHowever, that doesn’t mean you’ll see emulation apps in the App Store, or even any other app using JIT. Testut told us that the current implementation works only for sideloaded apps, which are usually installed through Xcode and other developer tools instead of the App Store. In other words, this is a feature intended for developers with debugging purposes.\nI doubt limiting JIT to just sideloaded apps was the intention behind this (and more likely is tied to the need for apps to run unsigned code when debugging with Xcode), but I’d be curious to see if this restriction remains long-term.\nBut if you have AltStore, you’ll soon be able to enjoy apps like UTM, which offers virtual machines on iOS, and DolphiniOS, which is basically a GameCube and Wii emulator for iPhone and iPad, running at maximum performance.\nIn the video below, you can see how smooth DolphiniOS runs on iOS 14.2 without jailbreak using the native JIT implementation:\nThanks to this change in iOS 14.2 — and combined with the new “Extended Virtual Addressing” entitlement — it’s now possible to emulate GameCube and Wii games at 100% speed WITHOUT jailbreaking or using private entitlements 😱 https://t.co/gOIBcxCZ0K pic.twitter.com/AF548pvKPl — Riles 🦄 (@rileytestut) November 5, 2020\nThere’s a new version of AltStore compatible with JIT apps that’s currently in beta, but it will be available to all AltStore users soon. If you want to learn more about how to install and use AltStore, check out our special article about it.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.13733130638246183
    },
    "article_24": {
        "title": "Craig Federighi: Native Windows on M1 Macs is 'Really up to Microsoft'",
        "body": "Following the release of the M1 Macs Apple executives have been doing interviews with a range of publications, and today, Ars Technica published another interview with software engineering chief Craig Federighi, hardware technologies lead Johny Srouji, and marketing VP Greg Joswiak.\nMuch of the interview focuses on topics that the three have already covered in prior discussions, but there is an interesting tidbit from Federighi on Microsoft and Windows on the ‌M1‌ Macs. Right now, the ‌M1‌ Macs do not support Windows and there is no Boot Camp feature as there is on Intel Macs, but Windows support is a feature that many would like to see.\nFederighi says Windows on ‌M1‌ Macs is \"up to Microsoft.\" The core technologies exist and the Macs are capable of it, but Microsoft has to decide whether to license its Arm-based version of Windows to Mac users.\nAs for Windows running natively on the machine, \"that's really up to Microsoft,\" he said. \"We have the core technologies for them to do that, to run their ARM version of Windows, which in turn of course supports x86 user mode applications. But that's a decision Microsoft has to make, to bring to license that technology for users to run on these Macs. But the Macs are certainly very capable of it.\"\nFederighi also suggested that Windows in the cloud could be a possible solution in the future, and he highlighted CrossOver, which is able to run x86 Windows apps on ‌M1‌ Macs using Rosetta 2.\nFederighi, Joswiak, and Srouji also discussed developing the Apple Silicon chips, designing the ‌M1‌, the ‌M1‌'s performance, unified memory architecture, running iOS apps, and more. The full interview can be read over at Ars Technica.",
        "sentiment": -0.024631422633926075
    }
}