{
    "article_0": {
        "title": "Apple will release iOS 14 and iPadOS 14 on September 16th",
        "body": "Apple’s next major software upgrades for the iPhone, iPad, Apple Watch, and Apple TV are almost ready. At today’s “Time Flies” event, the company announced that iOS 14 and iPadOS 14, along with the latest watchOS and tvOS updates, will start rolling out on Wednesday, September 16th. As of today’s event, app developers hadn’t yet received the completed golden master (GM) builds of these updates, so Apple’s software release schedule seems oddly rushed. But hey, new features are coming.\niOS 14 brings widgets to the iPhone home screen for the first time, gathers all of your apps into a new App Library, and adds picture-in-picture mode (which had already been available on iPads). There’s also a new Translation app. iPadOS 14 won’t let you put widgets anywhere you want on the home screen, but it does build upon what you can do with the Apple Pencil. The new Scribble feature of iPadOS 14 lets you “write by hand in any text field across iPadOS, and your words automatically convert to text.” Additionally, more of Apple’s native apps are adding sidebars and expanded menus to take advantage of the iPad’s bigger screen.",
        "sentiment": 0.3606088271157609
    },
    "article_1": {
        "title": "Epic’s decision to bypass Apple’s App Store policies were dishonest, says US judge",
        "body": "A US judge hearing arguments in Epic’s antitrust lawsuit against Apple has criticized the game developer’s decision to breach its contract with the iPhone maker by pushing a version of Fortnite with a custom payment system onto the App Store. The decision resulted in Apple removing Fortnite from the App Store.\nDuring a hearing on Monday with both companies, Judge Yvonne Gonzalez Rogers of the United States District Court for the Northern District of California expressed skepticism about Epic’s arguments, particularly its claim that it did not pose a security threat to Apple because it is a well-established company and partner.\nApple vs. Epic: the battle so far August 13th: Epic introduces a new direct-payment system in Fortnite to circumvent Apple’s 30 percent fee. Apple kicks Fortnite off the App Store for breaking its rules. Epic responds with a civil lawsuit against Apple.\nEpic introduces a new direct-payment system in Fortnite to circumvent Apple’s 30 percent fee. Apple kicks Fortnite off the App Store for breaking its rules. Epic responds with a civil lawsuit against Apple. August 17th: Epic reveals that Apple has threatened to terminate its developer account. This would stop Epic from developing any future games for iOS or Mac.\nEpic reveals that Apple has threatened to terminate its developer account. This would stop Epic from developing any future games for iOS or Mac. August 24th : Epic wins a temporary restraining order against Apple. Judge Yvonne Gonzalez Rogers rules that Apple can’t terminate Epic’s developer account, but that the iPhone maker does not have to restore Fortnite to the App Store.\n: Epic wins a temporary restraining order against Apple. Judge Yvonne Gonzalez Rogers rules that Apple can’t terminate Epic’s developer account, but that the iPhone maker does not have to restore Fortnite to the App Store. September 8th : Apple countersues Epic, seeking damages for the company’s breach of contract. In a court filing Apple says Epic has started this legal battle to draw attention to the flagging Fortnite franchise.\n: Apple countersues Epic, seeking damages for the company’s breach of contract. In a court filing Apple says Epic has started this legal battle to draw attention to the flagging Fortnite franchise. September 28th: Judge Rogers hears arguments from both Epic and Apple, and recommends a jury trial to settle the case in July.\n“You did something, you lied about it by omission, by not being forthcoming. That’s the security issue. That’s the security issue!” Rogers told Epic, according to a report from CNN. “There are a lot of people in the public who consider you guys heroes for what you guys did, but it’s still not honest.”\nThe three-hour hearing, which took place over Zoom, did not settle any of the open questions in Epic’s ongoing antitrust lawsuit against Apple, including whether or not Fortnite will be allowed to return temporarily to the App Store. A decision on that issue is expected “in the coming days,” according to The New York Times.\nJudge Gonzalez Rogers did recommend, though, that the case be taken to a jury trial in July next year to settle these issues permanently. “It is important enough to understand what real people think,” said Rogers. “Do these security issues concern people or not?”\nAccording to CNN, Judge Rogers said she was “not particularly persuaded” by Epic’s argument that Apple has bundled its App Store and in-app payment system together in violation of antitrust law. The judge also said she did not necessarily agree with Epic that Apple has harmed its ability to distribute Fortnite through its control of the App Store.\n“Walled gardens have existed for decades,” said the judge. “Nintendo has had a walled garden. Sony has had a walled garden. Microsoft has had a walled garden. What Apple’s doing is not much different... It’s hard to ignore the economics of the industry, which is what you’re asking me to do.”",
        "sentiment": -0.29643869525752964
    },
    "article_2": {
        "title": "YouTube restricts iOS 14 picture-in-picture feature to Premium subscribers, 4K not available on tvOS 14",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nGoogle's YouTube unit appears to be restricting picture-in-picture video viewing on Apple's iOS 14 to subscribers of its Premium subscription service, while promised 4K resolution in tvOS 14 is a no-show.\nApple's iOS 14 delivers PiP video viewing to iPhone for the first time. The handy feature allows users to simultaneously watch video content, conduct FaceTime calls and more while completing tasks in other apps.\nVideo viewing is a main use case for PiP, and YouTube is arguably the most highly trafficked destination for online content. Unfortunately, it appears that Google is gatekeeping access to the function.\nWhile the feature remains free to use on iPad (at least through Safari), the iPhone version of YouTube's app does not support PiP. Shortly after iOS 14 launched, users discovered a workaround that enabled PiP compatibility when accessing content through YouTube's website in Safari. That hole has now been closed.\nIt's not clear if the recent change was made intentionally or is the result of a bug. As noted by MacRumors, however, PiP still works for YouTube Premium subscribers and with videos that are embedded in third-party websites, suggesting YouTube actively updated its code to block the functionality.\nYouTube is also dragging its feet on delivering a promised update that would allow tvOS 14 users to watch content at 4K resolutions. While 4K playback was supported in pre-release beta versions of tvOS 14, the feature is currently missing.\nWhen asked about the issue on Twitter, YouTube said, \"Sorry about the back and forth — jumping in to clarify that Apple TV 4K will support 4K playback soon. Stay tuned for an update here.\"",
        "sentiment": -0.25640727691352366
    },
    "article_3": {
        "title": "Apple Disabling 'Sign in with Apple' for Epic Games on September 11",
        "body": "Now that Epic Games' developer account has been terminated, Apple is also ending access to other services, such as Sign in with Apple. According to ‌Epic Games‌, Apple will no longer let users sign in to ‌Epic Games‌ using Sign in with Apple as of September 11, which is in two days.\nEpic says that customers who use Sign in with Apple to access their ‌Epic Games‌ accounts should make sure their email and password are up to date, and the company is offering an FAQ on how to update an account email address and password so ‌Epic Games‌ users don't lose access to their accounts.\nApple will no longer allow users to sign into Epic Games accounts using “Sign In with Apple” as soon as September 11, 2020. If you used “Sign In with Apple”, please make sure your email and password are up to date. https://t.co/4XZX5g0eaf — Epic Games Store (@EpicGames) September 9, 2020\nCustomers who do not update to a standard email address and password will not be able to log in to their accounts, but after September 11, those who did not transition from Sign in with Apple may be able to contact ‌Epic Games‌ to have their accounts recovered manually.\nSign in with Apple is a feature that allows Apple device users to sign in to accounts and services using their Apple ID, with that info obscured from the website or service for privacy purposes. It's similar to Google and Facebook account sign in options, but with Apple promising greater privacy through options like Hide My Email.\nThe feature was introduced as part of iOS 13 and apps and services have been adopting it since then. Apple requires any app that uses Google and Facebook login options to also offer Sign in with Apple.\nUpdate: According to ‌Epic Games‌, Apple is providing an \"indefinite extension\" and will not be ending access to Sign in With Apple.",
        "sentiment": -0.5050240675918758
    },
    "article_4": {
        "title": "The new iPad Air reminds us just how bad most Android tablets really are",
        "body": "Samsung can make a damn nice tablet. I don't much care for tablets, but even I was really impressed with the Galaxy Tab S6 while I had it here for a review, and I'll be the first to say that a Samsung tablet is a well-built piece of machinery that looks and feels like it justifies its price. But that's not the problem — it's the apps.\nThe most expensive Windows laptop is hundreds of times faster than a new iPad or Chromebook or crappy Windows laptop.\nForget all the PR mumbo jumbo Apple's slick new iPad Air presentation about how much more powerful it is than practically every Chromebook and Android tablet out there. That's all hogwash — an expensive product from one company was compared to the best-selling budget models from others. The new Galaxy Tab S7 with Qualcomm's latest processor is plenty powerful enough to do everything the new iPad can do. The iPad is overbuilt so Apple has fewer components to manage and that saves money in the long run.\nNo, what's frustrating about Android tablets isn't the hardware. It's not even the platform. It's the apps.\nThe only great apps on a brand new Galaxy Tab S are the ones Samsung wrote for it. You can use the S Pen with oodles of pressure sensitivity, you can transfer handwriting to text, you can even draw a crummy circle and an app can make it look geometrically accurate instead of like the blob you drew. But when you open the Play Store it all comes crashing to a halt.\nI feel like I keep writing this over and over, but Google just doesn't seem to care about tablet apps the same way Apple does. That's a shame because something like a Galaxy Tab deserves great apps like Pixelmator or any of the other \"must-have\" apps for the iPad. It just doesn't get them.\nSource: Joe Maring / Android Central (Image credit: Source: Joe Maring / Android Central)\nThere isn't much Samsung can do about it other than pay thousands of developers to write those apps and games. Samsung probably could afford to do it, but it's not going to when it can spend that money developing its own first-party apps that are pretty awesome on the Galaxy Tab. No, this problem is something only Google can solve.\nIt's.👏The.👏Apps.👏\nThat's not an easy task, either. Google basically has two choices: it could go the Apple route and if an app isn't tablet-optimized it's not listed on the device's Play Store at all. That means close to 90% of the apps — including ones you want to use — would be gone when you hit up the Play Store with a new Android tablet. Or it could pay cold hard cash to get developers to do it. Google is going to do neither, so it just gave up.\nIt's all about the mighty dollar. You've heard it before but developers don't make much money from Android apps when compared to apps for iOS. That goes double (at least) for tablet apps. I don't know if that's because Android users have been trained not to pay for things after years of getting most apps and services for free, or whether because of Android's open nature piracy is just rampant. But I do know it's true because I've seen the same studies and reports you have. Apps written for iOS make a lot more money than ones written for Android even though there are twice as many people using Android.\nSource: Apple (Image credit: Source: Apple)\nWhen there's no money to be made, nobody cares. I can't fault a developer who wants to feed their family by sticking with iOS. That's a smart move and exactly what I would do if I were in their shoes. I'm actually impressed that some third-party apps, like Sketchbook (opens in new tab) (a must-have app for any Galaxy Tab or Galaxy Note, in my opinion) are so great on a tablet because I know they aren't making much money.\nI want to recommend a new Galaxy Tab to someone looking for a great tablet, but I can't because iOS has apps that are so much better.\nThere is no easy answer. Most Android apps work on an Android tablet or a Chromebook but they look like crap or don't work correctly. Google keeps making it easier to design and lay out apps for bigger screens — because it hasn't given up on great Chromebooks like it has for tablets — but it's not making a difference. Google Play is a desert for good tablet apps. You'll find an oasis once in a while, but there is a lot of empty sand not worth paying attention to in between.\nIf someone were to ask me which tablet I recommend I'd either steer them to a Fire tablet if they were all-in with Amazon Prime — or an iPad. And I hate that because Android is just better than iOS. You can simplify Android down so it \"just works\" but you can't upscale iOS so it does more than just work. I want to be able to recommend Samsung's great line of premium tablets, but until Google gets the app gap sorted, I can't.\nSamsung Galaxy Tab S7\nBottom line: The Galaxy Tab S7 is an easy choice if you're looking for a powerful Android tablet. Assuming you can overlook the awkwardness of Android on the big screen, you're treated to top-notch specs, loads of features, and a powerful S Pen that's included for free.",
        "sentiment": -0.3299598877131939
    },
    "article_5": {
        "title": "Feds seize almost $400K of ‘counterfeit Apple AirPods’ that are actually OnePlus Buds - The Verge",
        "body": "It can be hard to tell a difference between AirPods and the many earbuds that resemble them, but checking the box is always a good start. US Customs and Border Protection tonight tweeted that its officers had “recently seized 2,000 counterfeit Apple AirPods from Hong Kong, valued at $398K had they been genuine.” There’s also this press release on the situation, which praises CBP officers for “protecting the American public from various dangers on a daily basis” and says that “the interception of these counterfeit earbuds is a direct reflection of the vigilance and commitment to mission success by our CBP officers daily.”\nThe only problem is, based on the agency’s own photos, the seized products appear to be legitimate OnePlus Buds — transported in a box that plainly says as much. But CBP proudly tweeted “THAT’S NOT AN APPLE,” as if its people had astutely detected a forged piece of 18th-century art. It’s not clear if all of the 2,000 blocked units were OnePlus Buds, though the CBP images are unmistakable.\nA screenshot of the US Customs and Border Protection press release.\nThe units originated from Hong Kong and were seized at JFK on August 31st; they were headed to Nevada, according to the press release. If they were all OnePlus Buds, CBP’s math on the shipment value is way off: at $79 each, 2,000 of them would be worth $158,000. (The original estimate is based on the price of AirPods.)\nOnePlus has since replied to the CBP tweet and is also having fun with the situation on social media.\nIn a statement on Monday afternoon, CBP offered more details on why it seized the OnePlus Buds, claiming that they violate Apple’s “configuration trademark” for AirPods. Yes, the form factor that Apple created is now shared by many models of true wireless earbuds on the market. There are some truly shameless knockoffs out there, but you don’t see all of them getting headed off at the airport. Nowhere in the original press release is OnePlus even mentioned, and there’s no clarity as to whether officers knew what they were looking at. A lot of people would confuse the white OnePlus Buds with AirPods!\nPhoto by Chris Welch / The Verge\nBut again, the boxes in these photos say OnePlus Buds. It’s not a knockoff AirPods box that uses the wrong font or something. There’s seemingly no trickery at play, at least with the seized product, but in its statement on Monday, CBP said that the seizure “is unrelated to the images or language on the box.”\nOnePlus declined comment when reached by The Verge. Was this an embarrassing gaffe by border officers, or a wake-up call that earbud makers need to be a little more original? Maybe both. You’ve gotta figure the blue OnePlus Buds probably would’ve had a better chance getting through.",
        "sentiment": -0.5691832871702702
    },
    "article_6": {
        "title": "[Self Promo Saturday] I just updated my Reddit app Apollo with a bunch of iOS 14 Widgets, the first Reddit app on iOS to do so. It also includes Picture in Picture video support, support for the new privacy-focused iOS 14 photo picker, and more. Would love to know what you think! 🎉",
        "body": "Saved item categories, plus new Pixel Pals, including Oliver the festive Christmas raccoon!\n\"Simply remarkable, […] you’re nuts if you don’t try Apollo.\" - John Gruber, Daring Fireball\n\"The best Reddit app for iOS\" - The Sweet Setup\n\"Apollo is the best Reddit client I have ever used. Period.\" - iMore\n\"Apollo makes the wild world of Reddit more accessible than ever before, and it may just be the best designed social feed app I've ever used.\" - MacStories\n\"Apollo is the only Reddit app you need.\" - TechCrunch\n\"Beautiful, modern, and fast.\" - MacRumors\nApollo is a beautiful Reddit app built for fast navigation with an incredibly powerful set of features. Thanks to features like the Jump Bar, fully customizable gestures, and a super-charged Media Viewer, browsing Reddit has never been this amazing.\nIt's created specifically with iOS design guidelines in mind, so it fits right at home on your device, and with input from thousands of Redditors helping sculpt and perfect it over several years before launching:\n- Jump Bar, for super-fast hopping between subreddits\n- Super-charged Media Viewer for an amazing experience viewing images, GIFs, videos, albums , and more from a variety of sources.\n- Tabbed interface for easy navigating\n- Incredibly powerful Markdown composer for writing comments and posts\n- Full inline Imgur uploading, both images and albums\n- Large or compact posts depending on your preference\n- Dark mode (can be automatic)\n- Fully customizable gestures\n- Safari View Controller for browsing articles and links\n- Inline previews of media in comments\n- 3D Touch support\n- Beautifully organized Inbox\n- Filtering and blocking\n- Face ID / Touch ID / Passcode lock\n- Moderator features\n- Tons of settings to tweak\n- GIF scrubbing to go backward and forward in time\n- Multiple accounts\n- Powerful search\n- Full Markdown rendering\n- Unobtrusive Volume Indicator\nAs well as much, much more and it's constantly evolving. If you have anything you'd specifically like to see, come to the ApolloApp subreddit and we'd love to hear it!\nThis app offers subscriptions for \"Apollo Ultra\". They're available (in United States pricing) for $0.99 monthly or $9.99 yearly. Subscriptions will automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period (and charged to your iTunes account). You can turn off auto-renew/manage subscriptions in your iTunes Account Settings after purchase. Terms of Use can be found at https://apolloapp.io/terms and Privacy Policy can be found at https://apolloapp.io/privacy\nApollo is an unofficial app, and side effects may include an incredible browsing experience.",
        "sentiment": 0.476793204269865
    },
    "article_7": {
        "title": "Apple just released iOS14 which just introduced widgets for your iPhone. Please go vote for Spotify to make a widget! It’s already been acknowledged and is “Under Consideration” but the more votes the better!",
        "body": "If you couldn't find any answers in the previous step then we need to post your question in the community and wait for someone to respond. You'll be notified when that happens.\nSimply add some detail to your question and refine the title if needed, choose the relevant category, then post.\nQuestion:\nMore detail:\nCategory:",
        "sentiment": -0.2873898347218831
    },
    "article_8": {
        "title": "Apple announces new iPad Air that looks more like an iPad Pro",
        "body": "Apple is unveiling a new iPad Air today that looks very similar to the company’s iPad Pro. It’s a significant design change from the current Air, which was brought back to life last year to sit in between the iPad and iPad Pro. Last year’s Air has thick top and bottom bezels and a button for Touch ID, but this new iPad Air has much thinner bezels all around the display.\nApple’s new iPad Air looks like a refresh of the iPad Pro design, and it will be available next month priced from $599.\nApple is using a bigger 10.9-inch Liquid Retina display (2360 x 1640) on this new iPad Air that’s fully laminated with True Tone support and anti-reflective coating. In order to squeeze this display in, Apple has moved the Touch ID fingerprint sensor to the power button at the top. This makes it the first iPad with biometrics built into the power button.\nSome of Apple’s new iPad Air colors.\nInside the new iPad Air, Apple is making some big changes to the chips powering this tablet. It will be powered by Apple’s A14 Bionic, a 5nm chip with a six-core CPU (two high, four low), and 11.8 billion transistors. Apple is promising a 40 percent performance improvement over the last iPad Air and improved graphics support, thanks to a new four-core GPU.\nApple says it’s the “most advanced chip” it has ever made, and it even includes specific machine learning accelerators that apps will be able to use. Apple demonstrated a variety of apps during its press event today, promising that app developers will be able to take advantage of the power of this new chip for their apps.\nNew Touch ID on the power button.\nApple is also switching to USB-C on the iPad Air, much like the iPad Pro, and it’ll support 20W charging and 5Gbps data transfers. Wi-Fi 6 is also included, and optional LTE models will be available, with Apple promising 60 percent faster LTE connectivity.\nOver on the camera side, Apple is even borrowing the 12-megapixel rear camera from the iPad Pro and upgrading it with improved video stabilization on the Air. A front-facing 7-megapixel FaceTime HD camera is included on the Air, with smart HDR and support for 1080p 60fps video capture.\nThis new iPad Air supports Apple’s Magic Keyboard.\nThis latest iPad Air will also support the (new) $129 Apple Pencil, which magnetically attaches to the tablet. Apple’s $299 Magic Keyboard accessory will also attach to this iPad Air, making this even more similar to Apple’s iPad Pro. The new iPad Air will also support Apple’s $179 Smart Keyboard Folio and new $79 Smart Folio covers.\nApple has clearly refreshed the iPad Air to bring most of the iPad Pro features to a more affordable price point. The iPad Air still lacks the high refresh 120Hz display found on the iPad Pro, Face ID support, and its new lidar camera. If these are all things you can live without, then the iPad Air look like a solid alternative.",
        "sentiment": 0.5453760318458081
    },
    "article_9": {
        "title": "Apple’s move to make advertising harder on iOS 14 is part of a trend - Facebook is only the latest developer to feel the squeeze",
        "body": "Apple and Facebook are fighting again, and how you feel about it says something about who you trust to represent your interests in the strange tech landscape of 2020.\nStart with a rather academic question that may make your eyes glaze over in spite of yourself: When does pro-privacy regulation overstep its bounds to become anticompetitive? It’s a question I found myself asking last year, when Apple canceled Facebook’s enterprise certificate temporarily following revelations that the company had been using those certificates to conduct market research. And it’s a question I’m thinking about today, as Apple intervenes to unilaterally reshape a market — in ways that once again put Facebook on the defensive.\nThe issue at stake is a technical one, but it’s worth learning a little bit about — if only for the fact that, assuming you use an iPhone, it’s going to result in a lot of pop-ups on your phone once you upgrade your device in a month or so. The advertising industry assigns a unique code to each device called an Identification for Advertisers, or IDFA. Knowing your IDFA can help advertisers tell whether their ads are effective, particularly when they’ve shown you the same ad in multiple places. Facebook uses the IDFA as part of Audience Network, its ad network for developers.\nStarting with iOS 14, which will ship this fall, Apple will begin requiring that developers show you a warning that they are collecting your IDFA, and you’ll have to opt in to sharing it. Some large percentage of users can be expected to say “no thanks.”\nOn Wednesday, Facebook said it would stop collecting IDFA altogether. Here’s Kurt Wagner at Bloomberg:\nFacebook on Wednesday said it won’t collect IDFA through its own apps on iOS 14 devices, a decision that will “severely impact” Audience Network. Thousands of developers use the Facebook platform to fill the ad inventory within their mobile apps, and without IDFA information to help target those marketing messages, Audience Network revenue could drop as much as 50%, the company said. Facebook is considering eliminating the service altogether for iOS 14 users. “This is not a change we want to make, but unfortunately Apple’s updates to iOS 14 have forced this decision,” Facebook wrote in a blog post. “We know this may severely impact publishers’ ability to monetize through Audience Network on iOS 14, and, despite our best efforts, may render Audience Network so ineffective on iOS 14 that it may not make sense to offer it on iOS 14 in the future.”\nFacebook’s own ad business will be mostly fine, since your profile and activity on its apps contain data way more useful than a simple device ID. But the company says that a lot of its advertising clients will suffer.\nA common reaction to all this on Twitter today was: boo-hoo. “Aww, poor baby, Facebook,” says my pal Joanna Stern, in a representative tweet. “Now it has to ask permission to track everything you do on your phone.” Said the pseudonymous Internet of Shit: “I like how Facebook is spinning this as a bad thing.”\nTo be clear, Apple’s move here legitimately promotes privacy, if only at the margins. And it does so in the same way that Facebook often congratulates itself for doing: by putting the user in control. My friend Walt Mossberg picked up on this point: “In the forthcoming version of iOS, Apple is simply switching from an obscure opt-out system for apps that want to track users across the web to an explicit opt-in system,” he wrote. “At last! In my view, we should have a law requiring explicit opt-ins for the collection of personal data.”\nBut do you feel at all differently knowing that Apple targets its own advertising at you using a wide variety of data it collects from your phone? Because it does! Here are Patience Haggin and Jeff Horwitz in the Wall Street Journal:\nApple isn’t a big player in online advertising, but it does have its own small business that personalizes ads shown in the App Store and on Apple News based on where users go and what users do in Apple’s apps. The company is applying separate rules for its own ad-personalization; to opt out, users must find an option in the iPhone’s settings.\nApple says it’s applying one standard everywhere. The IDFA restrictions apply only for developers who want to move data between companies; all developers can get access to the data generated from within their own apps. But this neatly sets aside the fact that Apple doesn’t have to move data between companies to run its ad business — because it owns the device, the operating system, the App Store, the data, and the advertising network.\nOK, but who really suffers here? We know Facebook can take the hit, and surely the big game publishers will find other ways to advertise their games. But Recode reports that big publishers are considering abandoning iOS altogether because the value of advertising is expected to decline so much:\n“It makes it much harder for us to monetize our Apple app users, who are an incredibly loyal readership. And quite frankly, it puts at risk our ability to provide an Apple app,” says Martin Clarke, publisher of DMG Media, which owns the UK’s Daily Mail and other publications; the company says its MailOnline iOS app attracts 1.2 million users per day. “There’s no point in providing an app for a platform that monetizes less well than other platforms.”\nSuch a steep decline has happened before. When Apple implemented similar anti-tracking features on its Safari web browser, the cost of reaching customers there declined by 60 percent, The Information reported last year. If you believe that free, ad-supported news is beneficial to a healthy democracy, it’s worth noting that all these pro-privacy changes come at a cost.\nI’m not in love with ads, I swear. I pay extra each month to turn them off on YouTube, Hulu, and even The Verge. But it’s also true that ads subsidize a lot of important services. The less money you have, the more you rely on free services from companies like Facebook to live your daily life.\nThere should absolutely be hard limits on the kinds of data advertisers can collect, what they can do with it, and how they can store it. There should arguably be more limits on all of those things than there are today.\nBut just as I tense up when I see Apple dictating the revenue model of an email startup, or threatening to withhold bug fixes from WordPress blog owners if its parent company doesn’t implement in-app purchasing, I worry when I see the extent to which one business can change the terms of a whole economy. Particularly when no one affected has any meaningful way to appeal.\nFew will cry any tears for Facebook over IFDA. I understand the impulse many have to view this particular dispute through the lens of the good team beating up the bad one. But the events of this summer have folks I know in Silicon Valley asking the same question over and over: who will Apple put the squeeze on next?\nThe Ratio\nToday in news that could affect public perception of the big tech platforms.\n🔽 Trending down: Google employees knew the company’s location privacy settings were confusing and potentially misleading, according to newly unsealed documents from a consumer fraud lawsuit that the state of Arizona filed against the tech giant. The lawsuit came after the Associated Press published an article about how Google tracks users — even those that had turned tracking off. (Kate Cox / Ars Technica)\nGoverning\n⭐ Two protesters in Kenosha, Wisconsin were killed Tuesday night. The violence may be tied to a Facebook event posted by a self-described militia, which referred to the event as a “call to arms.” Facebook has taken down the event, as well as the group’s Facebook Page. Here’s Russell Brandom at The Verge:\nFor three days, Kenosha has been racked with protests over the shooting of Jacob Blake, a 29-year-old father of six who was shot in the back by police. The protests have incurred significant property damage, destroying a local Department of Corrections facility on Monday night. In a post Tuesday afternoon, the Kenosha Guard Facebook group encouraged an armed response to the ongoing unrest. “Any patriots willing to take up arms and defend our city tonight from the evil thugs?” the post reads. “No doubt they are currently planning on the next part of the city to burn tonight.” At 11:45PM Tuesday night, two people were killed after a confrontation between protestors and men armed with long rifles, with a third sustaining injuries. Video of the shooting appears to show an armed militia member firing at protestors. The local sheriff’s office is still investigating the shooting, and the perpetrator has yet to be identified.\nAt least two separate Facebook users reported the Kenosha Guard account for inciting violence prior to the shooting. In each case, Facebook moderators examined the group and found that it didn’t violate the platform’s policies. The company took down the Kenosha Guard Facebook page after the shootings. (Russell Brandom / The Verge)\nThe young man charged with killing two protestors in Kenosha, Wisconsin was identified on social media as Twitter and YouTube users attempted to reconstruct the shootings. Kyle Rittenhouse was identified as a “fugitive from justice” and will be charged with first-degree intentional homicide. (Adi Robertson / The Verge)\nTwitter suspended a number of accounts for sharing a viral message claiming to be a Black Lives Matter protester who previously voted Democrat but is now switching to Republican. The message was first shared by a seemingly inauthentic account, then copied and pasted by others. (Marianna Spring / BBC)\nThe disinformation tactic used in the fake Black Lives Matter protestor campaign mirror Russia’s attempt to exacerbate racial divisions in the United States and suppress Black voter turnout in 2016. (Craig Timberg and Isaac Stanley-Becker / The Washington Post)\nQAnon conspiracy theorists are targeting evangelicals on Facebook. Their message that Donald Trump is fighting a secret Satanic pedophile ring run by liberal elites mirrors the “Satanic panic” of the 1980s and 1990s. (Abby Ohlheiser / MIT Technology Review)\nMore than 2,400 police departments have signed contracts with Clearview AI, a controversial facial recognition firm. In a video interview with Jason Calacanis, the CEO of the company said “It’s an honor to be at the center of the debate now and talk about privacy.” An honor! (Elizabeth Lopatto / The Verge)\nThe UK government will likely pass restrictions on TikTok, but will not block the company from setting up its international headquarters in London. But the rules will stop TikTok from moving user data out of the country. (Kitty Donaldson, Katharine Gemmell and Nate Lanxon / Bloomberg)\nA group of more than 2,000 online sellers filed an antitrust lawsuit against Amazon in India. The suit alleges Amazon favors some vendors who sell goods at a discount and drive out independent retailers. (Aditya Kalra / Reuters)\nIndustry\n⭐ The main administrator of Scottish Wikipedia is an American who doesn’t know any Scots, and instead writes articles in strangely misspelled English. The situation highlights a major problem for the site — many language editions of Wikipedia only have a few editors, and those people have an outsized control over what ends up on the site. Edward Ongweso Jr. at Vice describes the problem:\nFor example, it was found a few years ago that an admin of Croatian Wikipedia was a Holocaust denier, and was inserting those views into Croatian Wikipedia articles. There was little anyone could do to stop them. Because Wikipedia ranks so highly on Google and has become seen as a trusted, neutral source of information, it is often used by machine learning researchers as a corpus to train languages on, and by ordinary people as a first entry point into a topic. The Reddit post goes on to argue that the damage done by Amaryllis may be more severe than anyone anticipates. Before all of this had even started, there was apparently a poor conception of the Scots language that stemmed directly from the state of its Wikipedia. As a result, “this person has possibly done more damage to the Scots language than anyone else in history.” Because of their “cultural vandalism,” it’s possible that many people think Scots is a “horribly mangled rendering of English” rather than a language of its own.\nMicrosoft planned to take a small stake in TikTok and become one of the app’s minority investors. Then President Trump got involved, and the quiet deal became an international soap opera. This story charts how it happened. (Mike Isaac and Andrew Ross Sorkin / The New York Times)\nSoftBank is considering getting involved in a possible TikTok acquisition. It’s unclear whether SoftBank wants to team up with another entity on an existing bid or create a new effort. But because SoftBank is a Japanese firm, it seems unlikely the Trump Administration would go for it. (Jessica E. Lessin / The Information)\nYouTube creators are calling out TikTok stars for continuing to party during the pandemic. TikTok doesn’t have the same type of commentary culture as platforms like Instagram and YouTube, where the name-and-shame game continues to thrive. (Julia Alexander / The Verge)\nFacebook is accelerating the launch of the News tab outside the US. The company is working out deals to pay publishers in several countries to include their content in the tab. (Sara Fischer / Axios)\nFacebook updated Messenger Rooms to make the feature easier to discover and allow people to further personalize their Rooms experience. The change comes after Messenger dipped slightly from the top of the App Store last week. (Sarah Perez / TechCrunch)\nGoogle promoted Halimah DeLaine Prado to be the company’s new general counsel. The news comes in a moment of intense antitrust scrutiny for the tech giant. (Kyle Daly / Axios)\nWe should probably be more careful about how much data access we give the apps on our phone. Some, like Google Maps, need location data to be helpful. But if you’re only using TikTok to scroll through other peoples’ videos, you don’t need to give the app access to your camera and microphone. (Brian X. Chen / The New York Times)\nAnd finally...\nTalk to us",
        "sentiment": -0.49234063597396016
    },
    "article_10": {
        "title": "New Apple Events - Apple Special Events",
        "body": "Apple Fitness+\nNow all you need is iPhone to subscribe and access the largest collection of 4K Ultra HD fitness and wellness content in the world. Stay motivated with onscreen coaching, timers, and trainer callouts as you work out. Available later this fall for all iPhone users.",
        "sentiment": 0.5367748290300369
    },
    "article_11": {
        "title": "Apple refining Siri to cut down on mistaken activations, and to draw less power",
        "body": "Apple refining Siri to cut down on mistaken activations, and to draw less power\nSiri could become better at only responding when you want it to\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple is researching ways where Siri can be better at assessing whether you really meant to call it, and also when you're done speaking to it.\nYou've done this. You've had to hurriedly slap your palm over your Apple Watch because Siri has begun talking. And you've had that perplexing moment of trying to fathom out what you could possibly have just said that sounded anything like \"Hey, Siri.\" Apple wants to change that.\nThere is also the separate issue of when Siri doesn't respond, or when you turn your Watch and the iPhone in your pocket replies instead, but that's a problem for another day. For now, Apple is focusing on how Siri can decide whether to respond based on how interested you seem.\nApple has previously applied for a patent where the iPhone's Face ID camera interprets your emotions when you ask Siri to do something. But a new patent application starts with whether you're even looking at your device when you speak.\n\"Attention Aware Virtual Assistant Dismissal,\" is a newly revealed patent application which both lists criteria for assessing whether you want Siri, and then what the device should do next.\n\"[The] process includes determining, based on data obtained using one or more sensors of the electronic device, whether one or more criteria representing expressed user disinterest are satisfied,\" says the application.\nThere are a lot of factors involved in determining this \"disinterest,\" and effectively in when Siri should take you seriously or not. For instance, a key way of determining whether you're interested is by having the device's cameras look to detect your gaze.\nIf you're looking directly at the device when you've activated Siri, the iPhone can be pretty certain that you meant to call for it and that you're going to say a command next. However, you might well say \"Hey, Siri,\" and then be momentarily distracted by someone or something around you.\nSo the patent application discusses the length of time that might or might not be reasonable in working out your attention. Apple refers to this as the \"characteristic intensity\" of a contact, or in other words, of your saying \"Hey, Siri.\"\n\"[This] characteristic intensity is, optionally, based on a predefined number of intensity samples,\" says Apple, \"or a set of intensity samples collected during a predetermined time period... relative to a predefined event (e.g., after detecting the contact).\"\nThe patent application avoids specifying actual durations for this delay, preferring instead to say that it varies depending on the situation. The application spends less time on how long a device should wait, and much more on how it can assess intention or disinterest.\nAs well as whether you're looking at the device, for instance, the criteria for concluding that you're disinterested includes using many different sensors. The device's accelerometer can tell whether you're lowering the device, or picking it up, for instance.\nDetail from the patent application showing the start of determining whether a user wanted to activate Siri or not\nThe system can also determine whether you've placed the device face-down on a surface. Similarly, if you have the display covered by your hand, perhaps as you carry it, then the front-facing light sensor can tell that.\nThat same sensor can also contribute to the device recognizing whether it is in an enclosed space. If you have your iPhone in a pocket or a bag, for instance, you're less likely to be calling for Siri.\nThis isn't just about cutting down on the number of times a phrase similar to \"Hey, Siri,\" is followed by your saying something a little more fruity. Apple is also looking to how it can maximize the performance of its devices.\n\"Operating a digital assistant requires electric power, which is a limited resource on handheld or portable devices that rely on batteries and on which digital assistants often run,\" it says. \"Accordingly, it can be desirable to operate a digital assistant in an energy efficient manner.\"\nSo if your iPhone can tell very quickly that you weren't calling for Siri, it doesn't have to activate it pointlessly.\nThis patent application is credited to three inventors, including Rohit Dasari whose previous work includes related patents such as one about how apps can integrate with a digital assistant.",
        "sentiment": -0.23769773751723045
    },
    "article_12": {
        "title": "Apple TV is coming to Xbox consoles",
        "body": "What you need to know\nMicrosoft and Apple are working to bring an official Apple TV app to Xbox consoles.\nThe app will provide access to the movies and shows through the Apple platform, including Apple TV+ content like Apple Originals.\nApple TV is Apple's growing media service, allowing you to subscribe to a range of original productions, and pick up digital copies of movies and shows outright from across Apple's hardware ecosystem. Apple has been gradually rolling out apps (opens in new tab) for smart TVs and other platforms to expand its reach, and now it looks like Xbox consoles are soon to be in the running.\nApple TV appears to be available to a limited pool of testers on Xbox consoles according to a tweet from @Tzunami_Sapp and other users that have messaged us to verify. It appears likely that Apple TV for Xbox will be identical in features and functionality to the TV apps available on LG and Samsung TVs, but designed to work with an Xbox controller instead of your remote. The app includes access to Apple TV services, including its Apple TV+ subscription service launched in late 2019. The testing program has briefly appeared for some users, although with availability still locked down at this point in time.\nIt's somewhat interesting that Apple and Microsoft are working on this, given the fact Apple effectively blocked cloud gaming via Xbox Game Pass recently with a requirement for Microsoft to submit each game in the library separately. Apple TV, obviously, won't submit every movie and TV show in its service separately, which contrasts policies seen over on iOS.\nIn any case, it looks like Apple TV fans will soon be able to grab the service directly from their Xbox without having to pick up an Apple TV box or a supported television set. While we're unsure of the timing of this app going live, it could launch to coincide with the Xbox Series X and Xbox Series S release date on November 10.\nXbox Series X/S\nMain",
        "sentiment": 0.17668166973938546
    },
    "article_13": {
        "title": "Apple releasing iOS 14.0.1 today with bug fixes for widgets, default app settings, more",
        "body": "Following last week’s release of iOS 14 to the general public, Apple released a bug fix update today in the form of iOS 14.0.1. Today’s update brings fixes for iOS 14 home screen widgets, default app settings, and more.\nApple has also released iPadOS 14.0.1, watchOS 7.0.1, macOS Catalina 10.15.7, and tvOS 14.0.1.\nLast week, 9to5Mac highlighted an apparent bug in iOS 14 that caused your default browser or mail app setting to reset to Mail or Safari when your iPhone or iPad rebooted. Today’s update to iOS 14.0.1 resolves that issue, ensuring that you only have to set your default app preferences once.\nApple also says that today’s release of iOS 14.0.1 includes a fix for the Apple News widget that caused images from appearing, as well as bug fixes related to WiFi connectivity and email sending with some mail providers. For iPhone 7 and iPhone 7 Plus users, there’s a fix for an issue that could have affected camera previews.\nHere are the full release notes for today’s iOS 14.0.1 update:\nFixes an issue that could cause default browser and mail settings to reset after restarting your iPhone\nAddresses an issue that could prevent camera previews from displaying on iPhone 7 and iPhone 7 Plus\nFixes an issue that could prevent your iPhone from connecting to Wi-Fi networks\nResolves an issue that could prevent sending email with some mail providers\nAddresses an issue that could prevent images from appearing in the News widget\nApple says that watchOS 7.0.1 “fixes an issue where some payment cards in Wallet were disabled for some users.”\niOS 14.0.1 is rolling out today to all iPhone users, and you’ll be able to update by heading to the Settings app and choosing “Software Update.” Note that if you don’t see the update immediately, keep checking as it may take a few minutes to hit your device.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.1213866179986369
    },
    "article_14": {
        "title": "9th Circuit Rules Apple Owes Retail Workers for Time Spent in Security Screenings",
        "body": "The 9th U.S. Circuit Court of Appeals on Wednesday said Apple must pay over 12,000 retail workers in California for the time spent waiting for compulsory bag searches at the end of their shifts (via Reuters).\nA unanimous three-judge panel reversed a judge who had tossed the case and ordered him to enter summary judgment for the plaintiffs, after the California Supreme Court in response to certified questions in the case said in February that time spent undergoing security checks is compensable under state law.\nThe unanimous court decision, which dates back to a class action lawsuit filed against Apple in 2013, lines up with a previous California Supreme Court ruling that determined that staff time spent in security screenings was compensable.\nEmployees alleged that Apple subjected them to mandatory bag checks that were conducted off the clock, leaving them uncompensated for their time. At the trial level, Apple actually won the lawsuit when the court ruled that Apple employees chose to bring personal bags to work and dismissed the case, but the decision was appealed and brought to a higher court.\nThe Ninth Circuit panel said on Wednesday that the U.S. District Court that handled the original lawsuit had mistaken in its judgement when it sided with Apple over the case.\nApple requires all personal packages, bags, and Apple devices that belong to retail employees to be checked by a manager or security before an employee is allowed to leave the store for any reason, including breaks, lunch, and the end of shifts.\nEmployees are also required to clock out before submitting to an exit search, and have estimated that the time spent waiting and undergoing searches ranges from five to 20 minutes. On busy days, some employees have waited for up to 45 minutes waiting for a bag check.\nPrior evaluation of the case, which reached class action lawsuit status in 2015, suggested that Apple could have to pay as much as $60 million should it be required to offer employees back compensation for the time spent undergoing bag checks.",
        "sentiment": -0.6780658931005746
    },
    "article_15": {
        "title": "Microsoft’s new Xbox app will let you stream Xbox One games to your iPhone",
        "body": "Microsoft is about to release a big Xbox app update for iOS that includes the ability to stream Xbox One games to an iPhone. A new Xbox app will arrive in the App Store soon that includes a remote play feature, which lets Xbox One console owners stream their games to an iPhone.\nRemote play is different to Microsoft’s xCloud service, which streams games directly from servers instead of your own Xbox One console. This Xbox remote play feature will only connect to your own Xbox console, not to xCloud. It’s similar to Sony’s own PS4 Remote Play feature that’s also available on Android and iOS.\nYou will be able to access an Xbox console over Wi-Fi, or even an LTE or 5G connection, too. As this app takes control of your home Xbox, you can remotely start your console outside of your home. The Xbox will start up without a sound or the Xbox light at the front, and when you disconnect, it goes back into standby after a brief period of inactivity.\nA new Xbox app arrived on Android recently, and this updated iPhone version includes the same new design and new features. You can quickly download or share game clips and screenshots captured on an Xbox One or Xbox Series X / S console, and you can even manage console space and delete games.\nThis new Xbox app is also a lot faster than the previous iOS version, and it has been totally overhauled to match similar design changes being made across Xbox. It’s all in preparation for the launch of the Xbox Series X / S consoles in November, and Microsoft is also updating its Xbox dashboard with some design changes.\nMicrosoft’s updated Xbox app doesn’t change the xCloud situation, though. Apple extended an olive branch to allow services like Stadia and xCloud recently, but it included a big catch that would mean Microsoft would have to individually submit hundreds of games as separate apps using its streaming tech. Microsoft wasn’t amused by Apple’s new rules.",
        "sentiment": -0.0282248226304849
    },
    "article_16": {
        "title": "There was no NASA Astronomy Picture of the Day app with iOS 14 widgets, so I made one.",
        "body": "Astronomy Picture of the Day, including iOS 14 Widgets! It's APOD on your Home Screen! NASA's Astronomy Picture of the Day (APOD), now in widget form! 100% free with no ads. Just pure APOD delight. * Today Widget: See today's APOD, * Random Widget: Keep it fresh with a random APOD! * Favorites Widget: See your favorite APODs! * APOD Viewer App: View the current Astronomy Picture of the Day (APOD), view an APOD from the past, share your favorites. * Browse a delightful feed of random APODs. * Browse a delightful feed of your favorite APODs.\nJust a small under the hood stability update here. Happy holidays!\nThis is one of my favorite apps and I could recommend it to anyone - even very young children. I use it every day and I am very grateful that I can have it on my phone and my iPad. Thank you to the developer.\nThe app offers 9 different widget options which I haven’t seen in any other app. NASA also offers to show pictures as a widget but only the small or large. It’s nice you can do a medium widget with this app. You can also chose specific pictures to slide through. Love it!\nThe JWT has finally refined what the Hubble started, bringing the natural world into our computers and phones for all of us to see. I can rest knowing that we have finally been given a tool that is as much about art as it is about science. By refining our window on the cosmos, NASA has given humanity a view beyond compare.\nApp Privacy\nThe developer, Mark Hambly, indicated that the app’s privacy practices may include handling of data as described below. For more information, see the developer’s privacy policy.\nData Not Collected The developer does not collect any data from this app.\nPrivacy practices may vary, for example, based on the features you use or your age. Learn More",
        "sentiment": 0.4161805034511619
    },
    "article_17": {
        "title": "Microsoft criticizes Apple’s new App Store rules for streaming game services as a ‘bad experience for customers’ - 9to5Mac",
        "body": "Following the complaints of several developers over the last months, Apple today announced some changes to the App Store Review Guidelines regarding streaming game platforms. However, it doesn’t seem that other companies have approved these changes, at least this is what Microsoft says.\nPrior to today’s App Store Review Guidelines changes, Apple rejected any streaming game app on the grounds that the company must review and approve each game individually. The new guidelines allow game streaming apps to be released on the App Store, but the rules are the same as before.\nStreaming games are permitted so long as they adhere to all guidelines — for example, each game update must be submitted for review, developers must provide appropriate metadata for search, games must use in-app purchase to unlock features or functionality, etc. Of course, there is always the open Internet and web browser apps to reach all users outside of the App Store.\nIn response to the new App Store Review Guidelines, Microsoft told The Verge this maintains “a bad experience for customers” as Apple is still trying to enforce strict rules for this category of apps, which makes it impractical to launch them in the App Store. The company was testing its xCloud gaming platform on iOS, but it was discontinued last month for not complying with App Store policies.\nApple wants each streaming game to be released as a standalone app rather than a single app that works as an alternative to the App Store. In other words, if Microsoft wants xCloud on iOS, it will have to release all 100+ games on the App Store as individual apps and each one will have to go through Apple’s review process.\nStreaming games must also be adapted to offer any additional item purchases through Apple’s in-app purchases system. According to Microsoft, the main purpose of xCloud is to make the gaming experience as easy and intuitive as any movie or music streaming service, and Apple’s rules would prevent just that:\nGamers want to jump directly into a game from their curated catalog within one app just like they do with movies or songs, and not be forced to download over 100 apps to play individual games from the cloud. We’re committed to putting gamers at the center of everything we do, and providing a great experience is core to that mission.\nMicrosoft will officially launch the xCloud platform on Android devices next week, but the company hasn’t mentioned if it has plans to launch xCloud games on the iOS App Store in line with the App Store guidelines — which seems very unlikely.\nYou can find the full updated App Store Review Guidelines on Apple’s developer website.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.05209003082093071
    },
    "article_18": {
        "title": "Apple has for the first time published a Human Rights Policy that commits to respecting “freedom of information and expression”, following years of criticism that it bows to demands from Beijing and carries out censorship in China and beyond.",
        "body": "What is included in my trial?\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\nStandard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here.\nChange the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section.\nWhat happens at the end of my trial?\nIf you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for CA$95 per month.\nFor cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial.\nYou may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here.\nAny changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel.",
        "sentiment": 0.23233864857600287
    },
    "article_19": {
        "title": "PSA: No, iOS 14 widgets can’t secretly steal private info with your keyboard",
        "body": "A conspiracy theory being spread on Facebook and other social media platforms this week claims that iOS 14 widgets are actually serving as key loggers, tracking everything you type on your iPhone. This is unequivocally not true, and there are technical limitations and protections in place that prevent widgets from accessing your data.\nThe viral post on Facebook has been screenshotted and shared to other social media platforms. On Twitter, a tweet with a screenshot of the original Facebook post has over 7,000 retweets and 8,000 likes. Screenshots have also gone viral on Instagram.\nThe Facebook post comes from an iPhone user who claims to have noticed that their “keyboard would lag and wouldn’t show the characters” as they were being typed, as well as other issues like app crashes and generally laggy performance.\nThe Facebook post also cites the security code autofill feature of iOS as evidence the app is tracking what they type.\nAnother piece of misinformation gaining social media traction is that iOS 14 and/or home screen widgets are responsible for compromised passwords. The misconception here is that a lot of iOS 14 users are receiving a push notification upon updating informing them that their passwords may have been involved in a data breach.\nThe passwords were likely compromised in a data breach that occurred before you even installed iOS 14. Apple added data breach notifications to the built-in iOS password manager as a way to make users more informed about the security of their various online accounts.\nThe Facebook user and other social posts all jump to the conclusion that these pieces of evidence are “all signs of a key logger.” This is not true, as it is technically impossible for widgets to access your keyboard data or virtually any other data about you.\nHow iOS 14 widgets work\niOS 14 home screen widgets have a variety of limitations and protections in place for things like privacy and battery life. These protections are also why you might notice widgets don’t continuously update but rather at predefined intervals.\nWidgets in iOS 14 are not full-blown applications; in fact, Apple has went as far as to say they aren’t even “mini-apps.” Instead, the WidgetKit developer framework provides a limited set of tools that developers can tap into when designing and developing their home screen widgets.\nEssentially, widgets run in the background very briefly to update the display content at a pre-defined interval. Once the content has been updated, the background process is killed entirely, ensuring that there is no way a widget can gather any data continuously.\nWidgets are not mini-apps, so think through a glanceable experience for your user and use timelines, the concept of reloads, and intelligence to create the perfect experience on iOS, iPadOS, and macOS. Widgets use SwiftUI views to display their content. WidgetKit renders the views on your behalf in a separate process. As a result, your widget extension is not continually active, even if the widget is onscreen.\nIf widgets were allowed to run continuously without restrictions, there would not only be privacy implications but also a dramatic impact on battery life and performance. All of these reasons are why Apple put these limitations in place with WidgetKit.\nIn fact, generally speaking, sandboxing protection within iOS also prevents any sort of key logger application, regardless of whether or not widgets are used.\nFurther reading:\nWidgetsmith\nThe viral Facebook post particularly mentions Widgetsmith as the cause of these issues, but again, there are absolutely no facts behind these accusations.\nWidgetsmith developer David Smith has addressed the claims head-on, saying that he can “categorically and absolutely” state such rumors are not true. The full Widgetsmith privacy policy can be found here, and it explains that Widgetsmith was designed “from the ground up to ensure that your data stays completely private.”\nI’ve seen a number of references to an article being circulated on Facebook that apps like Widgetsmith must include key loggers because of keyboard issues experienced after installing iOS 14. For Widgetsmith I can state categorically and absolutely that this is not true. Leaving for a moment that I don’t think that is technically possible for a widget to read the keyboard. Widgetsmith was built from the ground up with complete privacy in mind and collects essentially no data about its users.\nIf you are experiencing laggier performance after installing iOS 14, there are several possible explanations. One of the most common causes of slow iPhone performance is a low amount of available storage, and you can learn more about how to manage your iPhone’s storage in our guide right here.\nIt’s also important to remember that iOS 14 is a brand new release, and there are likely to be bugs and performance issues. Apple released iOS 14.0.1 with bug fixes last week, so make sure that you’ve updated to that for the best possible experience.\nFinally, laggy keyboard performance has been one of the most common iOS 14 complaints since beta testing started in June. The keyboard isn’t laggy because of so-called key logger apps; it’s glitchy because of system-level bugs.\nTrust the privacy protections that Apple has put in place and customize your home screen to your heart’s content.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.39906855417025644
    },
    "article_20": {
        "title": "Microsoft prepares to go all in on Apple's iOS 14 for Microsoft 365",
        "body": "If Apple announced the public release of iOS 14 earlier this week, Microsoft is keen to provide details about its suite of Office apps that are fully prepared for the new software update. Here’s a look at everything you need to know about all the changes introduced in the latest update.\nFirst off, Microsoft Outlook and Edge can now be configured as the default apps on iOS 14. This means that users will be able to choose Outlook to replace the default mail app, while Microsoft Edge can take the place of Safari on their devices. However, users first need to update their Microsoft Outlook and Edge apps to get the ability to switch defaults on iOS 14 from the settings menu. To change your default apps, head over to Settings, and scroll down to the respective app (Microsoft Edge or Outlook). On the next screen, tap Default Browser/Email App to set your preferred one as default.\nAnother important update for Microsoft’s apps is the new support for widgets in iOS14. The company has finally updated Microsoft Outlook and OneDrive with the ability to add widgets to the iOS and iPad home screen for easier access. More specifically, the OneDrive widget will allow users to see their photo memories from the On This Day feature, and the Outlook Calendar widget will provide a quick glimpse of the day.\n“With the flexibility to pick your widget size and location, you can stay on top of what matters at a glance with an Outlook Calendar widget to see what’s next in your day with your work, school, and personal account. When using OneDrive with your personal account, you can see your photo memories from the On This Day feature, highlighting photos taken on this day across previous years. If you don’t have any On This Day photos for today, you’ll see the most recent photos that you’ve saved to the cloud,” the company explained.\nMore about upcoming updates\nLast but not least, the company has promised to deliver offline editing support for Office files in Fall 2020. With this change, iOS users will be able to download their Word, Excel, or PowerPoint files on iPhone or iPad devices for offline editing.\nMicrosoft also plans to introduce the new Home experience for OneDrive users later this month. It will let them access their most recently used files, shared libraries, and offline files together regardless of what device they last used.\nMoreover, the company is also bringing new capabilities to Big Sur and OneDrive on macOS. The future OneDrive update will add automatic renaming support for those files and folders that contain invalid characters or errors.\nIf you’re looking to learn more about the new updates coming to Outlook for Mac and more, be sure to register for Microsoft Inspire 2020, which will be held on September 23rd.",
        "sentiment": 0.17924110256135464
    },
    "article_21": {
        "title": "Report: New 5.4-inch iPhone to be called ‘iPhone 12 mini’",
        "body": "The anonymous Twitter leaker l0vetodream today tweeted the names of the upcoming iPhone 12 phones. He says that the new iPhone lineup will be called iPhone 12 mini, iPhone 12, iPhone 12 Pro and iPhone 12 Pro Max. The iPhone 12 is expected to be officially announced by Apple in October.\nThese brand names have been circling around the rumor mill for a while, but l0vetodream has built up a good track record of accuracy this year, making this leak particularly notable.\nThe four names correspond to the expected lineup of four screen sizes. The iPhone 12 mini would represent the new smaller 5.4-inch model. Ming-Chi Kuo recently said that the 5.4-inch screen would also come with a smaller notch. The current smallest flagship iPhone is the 5.8-inch iPhone 11 Pro, and the upcoming 5.4-inch model will be significantly smaller than that in the hand.\nThe middle-of-the-road model will be called iPhone 12 and feature a 6.1-inch display, just like the iPhone 11. However, this year, all of the iPhone 12 devices are believed to feature OLED displays.\nThe iPhone 12 Pro and 12 Pro Max follow the precedent set by Apple in the last two generations. The iPhone 12 Pro will feature a 6.1-inch display, and the Pro Max will feature the largest screen on an iPhone to date, measuring 6.7-inches diagonally.\n12mini\n12\n12 Pro\n12 Pro Max — 有没有搞措 (@L0vetodream) September 21, 2020\nAll models are believed to be powered by the Apple A14 chip and support 5G cellular networking. However, none of the iPhone 12 lineup will ship with bundled earbuds or charger for the first time. Apple foreshadowed this move by announcing that the Apple Watch Series 6 will no longer come with a power adapter, citing environmental reasons.\nThe iPhone 12 lineup would have launched in September as normal, if the pandemic had not causes supply disruption. Instead, Apple is on track to ship at least one model in October. The community is expecting Apple to hold a second media event in the first or second week of next month.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.038946677441708745
    },
    "article_22": {
        "title": "You can now use a Nikon mirrorless or DSLR cameras as a webcam on Mac",
        "body": "You can now use a Nikon mirrorless or DSLR camera as a webcam on Mac\nYou can now use your Nikon Z5 and other Nikon cameras as a webcam on your Mac\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nNikon has just launched an initial beta of its Webcam Utility software for macOS users, bringing the field of view and clarity of their DSLR and mirrorless cameras to your FaceTime and Zoom calls.\nThe new Webcam Utility for Mac follows the similar beta launched for Windows users in August. It supports Nikon's DSLR cameras as well as its Z line of mirrorless cameras. That includes the just-launched — and reviewed — Nikon Z5.\nDuring the work-from-home boom, users have been flocking to video conferencing software such as Zoom but were limited on the quality of their video meetings, in part, by their Mac's integrated cameras. By utilizing the larger sensors and glass of a dedicated camera, users are able to get a much sharper image, a higher resolution image, and an increased depth of field.\nNikon isn't the only one releasing a webcam utility for Mac users. Canon, Olympus, and GoPro have also released similar applications.\nSystem requirements for the new Nikon Webcam Utility\nmacOS Catalina, Mojave, High Sierra\nIntel Core or Xeon series, 1 GHz or better\n2GB of RAM or more\nNikon cameras compatible with the Nikon Webcam Utility\nNikon Z7\nNikon Z6\nNikon Z5\nNikon Z50\nNikon D6\nNikon D850\nNikon D780\nNikon D500\nNikon D7500\nNikon D5600",
        "sentiment": 0.25838303710851407
    },
    "article_23": {
        "title": "Intel Announces 11th-Generation Tiger Lake Chips as Apple Plans Transition to Arm-Based Apple Silicon",
        "body": "Intel today announced the launch of its new 11th-generation Tiger Lake chips that are designed for use in laptops. The new chips included integrated Xe graphics, Thunderbolt 4, USB 4, PCIe Gen 4, and WiFi 6 support.\nIntel is calling the Tiger Lake chips, which are built on a 10-nanometer \"SuperFin\" process, the world's best processor for thin and light laptops. Tiger Lake chips offer significant performance and efficiency gains over the prior-generation Ice Lake chips.\nThe new chips offer 20 percent better CPU performance than Ice Lake chips, according to Intel. The integrated Iris Xe graphics are better than 90 percent of all discrete notebook GPUs sold last year and offer up to twice the graphics performance along with 5x better artificial intelligence performance.\nThere are nine new SKUs across Core i3, Core i5, and Core i7 with clock speeds up to 4.8GHz.\nIntel says that the new Tiger Lake CPUs will be in more than 50 laptops coming this fall and named a number of partners such as Acer, Dell, HP, Lenovo, and Samsung, but Apple was not among them. Since the Tiger Lake chips are for lower power laptops and max out at 28W, it is unlikely Apple will ever use them.\nApple is transitioning to Arm-based Apple Silicon chips beginning this year, and rumors have indicated that the 13-inch MacBook Pro and the MacBook Air will be some of the first machines to get Apple Silicon chips.\nIf the next-generation ‌MacBook Air‌ adopts ‌Apple Silicon‌, there will be no need for Apple to adopt Tiger Lake chips.",
        "sentiment": 0.34333663366057654
    },
    "article_24": {
        "title": "AirPods Studio will sport Apple's U1 chip, will be used to detect left and right positioning, suggests new leak",
        "body": "There have been a ton of leaks pertaining to Apple’s upcoming AirPods Studio headphones recently. We know how they will look, how they will work, and what customization options they will ship with. However, the latest addition to the AirPods Studio pool of leaks is the suggestion that the Apple-branded over-the-ear headphones will feature Apple’s proprietary U1 chip.\nLeaker with the Twitter handle @l0vetodream has taken to Twitter to reveal that the upcoming AirPods Studio headphones will have Apple’s U1 chip. In a translated tweet, he says the new Apple-branded headphones will use the U1 chip to automatically recognize the left and the right positioning of the headset.\nu1 for studio — 有没有搞措 (@L0vetodream) September 20, 2020\nPrevious leaks have suggested that the headphones won’t have a predefined orientation. Users will be able to switch sides and the headphones will automatically recognize the ear. This, then, can be used to provide spatial audio, which is a feature that is currently existent in the current AirPods Pro.\nIt had been previously speculated that Apple would include the U1 chip with the AirPods Studio headphones. However, we are now a step closer to confirmation with today’s leak. The final confirmation will be when Apple officially announces the headphones.\nThe U1 chip was introduced first within the iPhone 11 lineup. It stands for “ultra-wideband” which is a short-range radio technology that is essentially used for data transmission. It has the ability to communicate with other U1 chips and locate them precisely, unlike GPS. Apple has yet to work on expanding its functionalities, but we’ve also heard rumors that Apple’s item-tracking AirTags will use the ultra-wideband functionality to help users accurately locate stuff.\nRecently, a tweet from another leaker revealed images of the AirPods Studio headphones in black. Similarly, yet another leak contained a video showing the purported white AirPods Studio headphones being packed into a case of some sort.\nAs far as features are concerned, the AirPods Studio headphones are supposed to have all the features the AirPods Pro currently have. Additionally, Bloomberg’s Mark Gurman also reported that the headphones will come with interchangeable ear and head pads, just like how the Apple Watch is customizable.",
        "sentiment": 0.045903318708664494
    }
}