{
    "article_0": {
        "title": "Facebook and its advertisers are 'panicking' as the majority of iPhone users opt out of tracking",
        "body": "With iOS 14.5 released to the public earlier this year, iPhone and iPad users now have the ability to easily opt out of cross-site and cross-app tracking and targeting. New data from analytics firm Branch indicates that just 25% of users are opting in to tracking, which is causing panic in the advertising industry.\nAs detailed in a new report from Bloomberg, the impact is being felt in particular by Facebook advertisers. Facebook is reportedly no longer able to provide certain metrics to advertisers to help them know whether their ads are working:\nFacebook advertisers, in particular, have noticed an impact in the last month. Media buyers who run Facebook ad campaigns on behalf of clients said Facebook is no longer able to reliably see how many sales its clients are making, so it’s harder to figure out which Facebook ads are working. Losing this data also impacts Facebook’s ability to show a business’s products to potential new customers. It also makes it more difficult to “re-target” people with ads that show users items they have looked at online, but may not have purchased.\nWhile Facebook declined to respond to Bloomberg’s report, data from Branch shows that roughly 75% of iPhone users are now running iOS 14.5 or later with App Tracking transparency and that just 25% of those users have tapped on “Allow” when they see the prompt.\nFacebook says that it is working on new features to help make up for the data lost due to App Tracking Transparency, including “new advertising features that require less data to measure an ad’s success.” The company is also reportedly exploring ways to deliver ads based on data stored on the user’s device.\n“Apple’s policy is hurting the ability of businesses to use their advertising budgets efficiently and effectively, and the limitations being created are driven by Apple’s restrictions for their own benefit,” the spokesman added, noting that Facebook has tried to prep advertisers with notices, blogs and webinars. “We believe that personalized ads and user privacy can coexist.”\nThe full report at Bloomberg is well worth a read and provides more details from some of the advertisers affected by the changes.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.45694350947936374
    },
    "article_1": {
        "title": "Apple AirPod batteries are almost impossible to replace, showing the need for right-to-repair reform",
        "body": "In this article AAPL Follow your favorite stocks CREATE FREE ACCOUNT\nSecond-generation Apple AirPods with wireless charging indicator Todd Haselton | CNBC\nWhen AirPods were first released in 2016, they were a marvel of miniaturization. To ditch cords and go wireless, Apple packed several chips, microphones and speakers into each headphone, which weigh about 4 grams. Without a cord, the earbud gets its power from a tiny cylindrical battery that has about 1% of the capacity of an iPhone's battery. But lithium-ion batteries, like those used by the AirPods, wear out the more they are used. Some owners have noticed that, after a few years, used AirPods eventually will last only an hour or so before needing to be recharged -- a big decay from the four-to-five-hour battery life they have when new. Because each AirPod is so small and so tightly packed into its housing, it's almost impossible to swap out the old battery for a new one. Most people give up and just buy a new pair. The limited lifespan of AirPods is exactly the kind of problem that the \"right-to-repair\" movement wants to fix. Repair shops and lobbyists that support repair reform want lawmakers to implement a variety of rules, including increased access to manuals and official parts and consumer protections around warranties. But one of their most important requests is for companies to design products with repair in mind, instead of packing gadgets with unlabeled parts and sticking them together with glue, forcing users to use a knife to take them apart. This desire puts repair advocates at odds with hardware companies like Apple, whose business models depend on customers upgrading to the latest model every few years. When Apple offered cheap iPhone battery repairs a few years ago, it hurt sales as consumers were able to hang on to their old phones for longer instead of upgrading. Apple also charges customers for repairs and extended warranties. \"We design our products for durability in order to minimize the need for repair,\" Apple wrote in an environmental report earlier this year. \"But in the instance a repair is needed, we believe our customers should have convenient access to safe and reliable repair services, to get their product back up and running as quickly as possible.\"\nThe right-to-repair movement gains steam\nPolicymakers have started to engage more closely with right-to-repair advocates in recent years. State-level bills have been introduced in a majority of states, but electronics companies have lobbied against them and none have passed. In May, the Federal Trade Commission released a 56-page report on repair restrictions, concluding that repair restrictions have \"steered consumers into manufacturers' repair networks or to replace products before the end of their useful lives\" — exactly the problem users are running into with their AirPods. The Biden administration on Friday ordered the FTC to write new regulations targeted at limiting manufacturers' ability to hamper independent or do-it-yourself repairs as part of a sweeping executive order. New repair rules have not yet been drafted. \"Tech and other companies impose restrictions on self and third-party repairs, making repairs more costly and time-consuming, such as by restricting the distribution of parts, diagnostics, and repair tools,\" the White House wrote in a fact sheet about the order on Friday, linking to a story about fixing Apple products. Apple declined to comment on the White House executive order. The FTC has not said what it plans to do, but repair advocates want a few key policy changes, as detailed in its May report. They want companies to be required to make official replacement parts available. They want access to tools that could make repairs easier without reverse-engineering the tools or parts themselves. And ultimately, they want products to be designed with longer lifespans. Apple is not the only company that would be affected by these policies. Much of the recent pressure is on medical device companies and tractor manufacturers. But given Apple's ubiquity, it has become a poster child for repair, especially because it promotes its environmental efforts as a corporate value. Apple has launched a program it calls the \"Independent Repair Program\" which gives repair shops the option to enter into a certification process and contract with Apple in order to get access to authentic Apple parts, tools and manuals. Apple has also reduced the price of its battery replacement for iPhones, and recent models have been designed to make it easier to replace a battery or cracked screen, according to iFixit. Plus, compared to other consumer electronics companies, Apple has a large existing network of stores and authorized repair shops. Still, many Apple products remain challenging to repair at home or as a business with no contact with Apple.\nThe only AirPods battery replacement company\niFixit, a company that provides disassembly instructions and sells replacement parts for gadgets, gives AirPods models a score of zero out of 10 for repairability. According to iFixit, repairing these earbuds involves soldering, hot air guns and slicing through glue — that is, if replacement battery parts are even available. In the end, a would-be home repairer would have to put the four-gram computer back together again. Apple provides \"battery service\" for AirPods, at the cost of $49 per earbud. But functionally, Apple simply gives you a replacement pair, and the old earbuds are recycled. It's not a repair, it's a replacement. And it's expensive. AirPods originally cost $159, so opting for battery service costs more than half of the price of a new pair. Apple sold about 72.8 million AirPods units in 2020, according to a CounterPoint research estimate, so tens of millions of consumers will face the same lack of choice in the coming years.\nReplacement AirPods from PodSwap CNBC\nPodSwap is a Miami company founded by Emma Stritzinger and Emily Alpert which aims to keep AirPods \"out of the landfill.\" They're not associated with Apple. They believe they're the only company performing AirPod battery replacements, although other companies \"refurbish\" old AirPods, the founders told CNBC. The company was formed after the founders experienced dying AirPods themselves and thought that upgrading or replacing them would be wasteful and impractical. I recently replaced a pair of AirPods that were only holding a charge for 45 minutes -- too short to complete a phone call. I paid $59 on PodSwap's Shopify site and a few days later received a replacement pair of AirPods with new batteries. They weren't my old AirPods, they were another set that had their batteries replaced. Along with those new pods, PodSwap includes a box and a return label. It wants your old AirPods back. It then cleans and sanitizes the old pair, puts in new batteries and sends them out to the next person who wants to change the battery in their old AirPods. But PodSwap faces many challenges that show why repair advocates want new rules. Alpert said the design of the AirPod makes it challenging for repair shops or companies like theirs to do a lot of battery replacements. PodSwap's process uses both robotics and manual labor, the founders said. \"The process was developed through trial and error and a large number of units were 'sacrificed' and ultimately recycled. One major challenge we faced was overcoming the uniqueness of this product. Each AirPod is assembled with slight differences, which creates complexity in the disassembly,\" Alpert said.\nPodSwap includes a box to send old AirPods back. CNBC",
        "sentiment": -0.12616977649661948
    },
    "article_2": {
        "title": "Apple employees say they will leave the company as it denies remote work requests",
        "body": "As the COVID-19 vaccination is progressing around the world, Apple is encouraging its employees to return to work in person. However, not everyone seems willing to return to the office, and now some employees are saying they will leave the company as it is denying requests for remote work.\nIn a new report from The Verge, it was revealed that Apple has been denying even more requests from employees who want to continue working from home instead of the new hybrid model. In a Slack channel with 6,000 members, employees argue that they will leave Apple if the company doesn’t change its decision.\nWhile Apple historically discouraged employees from working from home, there were one-off exceptions to the rule, and some teams were more lenient than others. Now, employees say that even those exceptions are being denied. In a company Slack channel where employees advocate for remote work, roughly 10 people said they were resigning due to the hybrid work policy or knew others who’d been forced to quit.\nSome employees who are “currently on an Americans with Disabilities Act accommodation” can work from home. However, if Apple decides to return to the office permanently, the accommodation will be denied. The company gives employees 30 days to find a new job if it denies medical accommodation.\nThe Verge was told that the company has been asking for medical records to decide if employees will be approved to work from home which, according to them, “made some people uncomfortable.”\nLast month, an internal survey organized by Apple employees showed that at least 90% of employees want flexibility when it comes to working remotely, but the company argues that working in person is essential and expects everyone to be back in the office soon. Employees even sent a letter to Apple CEO Tim Cook asking for changes, but these requests were all denied.\nApple declined to comment on the report.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2067706245870795
    },
    "article_3": {
        "title": "After Apple Tightens Tracking Rules, Advertisers Shift Spending Toward Android Devices",
        "body": "Advertisers have begun shifting their spending patterns in the months since Apple Inc. began requiring apps to gain iPhone and iPad users’ permission to track them.\nAfter the tracking change took effect in April, many users of Apple’s iOS operating system have received a high volume of prompts from apps asking permission to track them—requests that most have declined. Less than 33% of iOS users opt in to tracking, according to ad-measurement firm Branch Metrics Inc.",
        "sentiment": 0.02494606375694275
    },
    "article_4": {
        "title": "Apple founder Steve Wozniak backs right-to-repair movement",
        "body": "And he spoke of the \"motivation and joy\" of young people learning to write software and develop hardware \"to prove to themselves they've got a little special skill in the world\", adding it was \"very motivating for creative minds, believe me - that's how I grew up\".",
        "sentiment": 0.9782498478889465
    },
    "article_5": {
        "title": "Apple's M1 battery life is so good marketing thought it was a bug",
        "body": "What you need to know\nApple's stunning M1 chip has been awarded Tom's Guide's Hero Breakthrough award for 2021.\nThey caught up with Apple executives about the development and launch of the M1 chip.\nApple's head of marketing revealed that battery life on the M1 was so good they thought the battery indicator was broken the first time they saw it.\nApple's VP of worldwide product marketing Bob Borchers has revealed that the first time his team saw Apple's new M1 chip in action they thought the battery indicator was broken because its performance was so good.\nThe revelation came in an exclusive interview with our friends at Tom's Guide, who have just awarded Apple's M1 chip with their Breakthrough Award for its 2021 Hero Awards. First, TG spoke to Tim Millet, VP of platform architecture at Apple who said the priority with Apple silicon was to make the best chip on the market:\n\"If somebody else could build a chip that was actually going to deliver better performance inside that enclosure, what's the point? Why would we switch?,\" said Tim Millet, Vice President of platform architecture at Apple.\" \"And so for my chip architects, that was the target.\"\nMillet noted how Apple started work on Rosetta years before Apple silicon to make sure that the transition to Apple silicon would be seamless, and that \"everything worked out the box as expected\", he also spoke of the pride of Apple's graphics folks:\n\"Of course, you can imagine the pride of some of the GPU folks and imagining, 'Hey, wouldn't it be great if it hits a broader set of those really intense gamers,'\" said Millet. \"It's a natural place for us to be looking, to be working closely with our Metal team and our Developer team. We love the challenge.\"\nBut the really fantastic revelation from the piece came from Apple's VP of worldwide product marketing, Bob Borchers, who told TG that the first time his team saw the Apple's M1 chip in action, they assumed the battery indicator was broken due to a bug because it performed so well:\n\"When we saw that first system and then you sat there and played with it for a few hours and the battery didn't move, we thought 'Oh man, that's a bug, the battery indicator is broken,'\" said Bob Borchers, VP of worldwide product marketing for Apple.\nMillet was present and laughed them off stating \"nope, that's the way it's supposed to be\", Borchers said it was \"pretty phenomenal.\"\nApple's MacBook Air with M1 and 13-inch MacBook Pro with M1 deliver best-in-class battery life and performance thanks to the energy efficiency of the M1 chip, as well as pretty staggering power and performance.\nThe company is expected to debut a new M1X chip with 10-cores including 8 high-performance cores in a new set of MacBook Pro models later this year.",
        "sentiment": 0.11268352007027715
    },
    "article_6": {
        "title": "\"Your iPhone left behind\" feature coming to the Apple Watch",
        "body": "A feature has been uncovered in watchOS 8 Beta for those amongst us that are forgetful. Your Apple Watch has gained the ability to nag you if you leave your iPhone or iPad behind.\nIf you’ve ever forgotten your smartphone at home, you know how annoying this can be. Even worse is forgetting your phone in a public place such as a restaurant. A new feature coming to the Apple Watch wants to make this a thing of the past.\nThe watchOS 8 Beta is currently circulating around. Announced in June it comes with useful new features such as respiratory info, new mindfulness tools, some additional workout types, along with a handful of other smaller upgrades.\nAnd while all of these features were talked about at the Apple’s Developer Conference, there is one new one that wasn’t mentioned. It’s a very useful one.\n“Notify When Left Behind”\nThe Apple Watch on your wrist can detect if your iPhone is no longer detected near you. The feature has been around in Beta for Apple AirTags for a few versions, but now it works between iOS devices!\nThe Apple Watch telling you – “Hey, you forgot your phone!” will be a godsend to some of us. Even if you’ve never left your phone behind, there’s always the chance you will.\nThe feature can be found in the Find My app. This needs to be run initially for the functionality to kick in.\nYou can locate the app via the Digital Crown on your Apple Watch. Run it and then simply choose the device, iPhone, iPad, etc. You’ll notice an option “Notify When Left Behind”. This can be switched on or off. You may also need to switch on Location Services in the Settings section on your iPhone in order for everything to work properly.\nPresumably adding this type of functionality wasn’t too much of a challenge. After all, the Apple Watch has always been aware if it is not close to your phone – as it needs this info to know when to switch from WiFi to cellular.\nAs mentioned AirTags functionality is part of the Beta, as well. For example, if you attach an AirTag to your car keys, the watch will ping you with a reminder if you’ve left them behind.\nWhich means you get the best of both worlds. Both AirTags functionality ported over to the Apple Watch, plus the ability for reminders to work between individual iOS devices.\nEssential reading: Top fitness trackers and health gadgets\nThis is definitely useful functionality and we hope it makes it to the official release in September. Early reports are that it works well. If you want to try out the feature right now you will need to install watchOS 8 Beta.\nIt also works the other way around\nThe Apple Watch “Notify When Left Behind” feature is part of a wider rollout that works on the whole Apple ecosystem. The aim of this is to get devices communicating with each other seamlessly.\nThis means you can pick and choose from various combinations consisting of devices that can run iOS15, iPadOS 15 watchOS 8 and MacOS Monterey. Basically, this allows you to keep tabs on all devices connected to your Apple ID.\nSo for example, you can set it up to notify you on your iPhone if you’ve left your Apple Watch behind. Or if you’ve forgotten your iPad. If you want to track non-Apple devices you will need to attach an AirTag to the item to get these types of alerts.\nSetting up the “Notify When Left Behind” feature on the iPhone and iPad is similar to the procedure for the iPhone. Basically you need to:\nOpen the Find my app on the device, Then tap on the Devices tab along the bottom You’ll get a list of all the devices connected to your Apple ID Choose one of them and scroll down in the menu until you see the “Notify When Left Behind” feature under “Notifications”. Toggle it ON.\nThe setup options are richer on iOS 15 and iPad OS 15 then on watchOS 8. On these platforms you can also choose to omit some locations. So for example, you can choose your home address as a place where you don’t want to receive these types of alerts.\nWhats more, you can also set a range, something similar to GeoFencing. The options are Small, Medium and Large for the range – choose this and select Done to save the changes. This is essentially how far you need to be away from the item in order to get the Left Behind alert.\nHow to upgrade to watchOS 8 Beta\nApple has made the pre-release software available to the public. But installing Beta versions comes with risks. The software is work in progress so likely to feature some bugs. Plus, once you’ve installed watchOS 8 Beta it is very difficult to revert back to the previous version.\nIf you’d still like to upgrade, we’ve written a handy guide on how to install watchOS 8 Beta, even if you’re not a developer. Remember, your iPhone also has to be in Beta to run the new Apple Watch software.\nLike this article? Subscribe to our monthly newsletter and never miss out!",
        "sentiment": 0.08743981861819823
    },
    "article_7": {
        "title": "New MagSafe Battery Pack for iPhone 12, iPhone 12 Pro now available for $99",
        "body": "Overview\nAttaching the MagSafe Battery Pack is a snap. Its compact, intuitive design makes on-the-go charging easy. The perfectly aligned magnets keep it attached to your iPhone 12 and iPhone 12 Pro, iPhone 13 and iPhone 13 Pro, or iPhone 14 and 14 Pro — providing safe and reliable wireless charging. And it automatically charges, so there’s no need to turn it on or off. There’s no interference with your credit cards or key fobs either.\nAt your desk and need a charge? Just plug a Lightning cable into the MagSafe Battery Pack for up to 15W of wireless charging. Short on time? With a higher than 20W power adapter, you can charge both the MagSafe Battery Pack and your iPhone even faster. And you can track the status of your charge on the Lock Screen.",
        "sentiment": 0.32579303681850436
    },
    "article_8": {
        "title": "U.S. President Joe Biden to Direct FTC to Draft Right to Repair Rules",
        "body": "United States President Joe Biden plans to direct the U.S. Federal Trade Commission to create new right to repair rules that would affect tech companies like Apple, reports Bloomberg.\nThe rules would prevent manufacturers from limiting consumers' options for repairing products at independent repair shops or on their own, and the presidential directive is expected to mention mobile phone developers as an area for possible regulation. The FTC will be able to decide on the size and the scope of the order, so it is not yet clear how Apple might be impacted.\nMultiple states have proposed right to repair legislation, which Apple has continually lobbied against. Apple claims that allowing independent repair shops to work on Apple devices without oversight would lead to security, safety, and quality issues. Many of the right to repair bills that have circulated call on tech companies to provide repair manuals and easy access to device components for repair purposes.\nApple does its own repairs in house at Apple retail stores and repair centers around the world, but it also works with Apple Authorized Service Providers to provide repair options. AASPs are managed by Apple and must meet Apple requirements, with some repairs and components limited.\nWhen Right to Repair bills began surfacing, Apple also launched a worldwide Independent Repair Program that is designed to provide repair shops that are not AASPs with genuine parts, tools, repair manuals, and diagnostics for performing out-of-warranty repairs on Apple devices.\nRepair shops have complained that Apple's program is too limited as it requires an Apple-certified technician to perform the repairs (available under a free program), and some parts are not provided to independent repair shops.\nBiden's executive order is expected to be released in the coming days, and White House economic adviser Brian Deese on Friday said that it is meant to spur \"greater competition in the economy\" as well as lower prices for American families.\nBack in November, the European Parliament also voted to develop new Right to Repair rules that will require companies to provide explicit information about the repairability and lifespan of products on consumer packaging. Under the terms of this order, manufacturers will need to provide a repair score, something that France has already enacted.",
        "sentiment": 0.0036710575222969055
    },
    "article_9": {
        "title": "Apple Now Allows Marijuana Businesses On Its App Store, While Google Maintains Ban",
        "body": "Apple will no longer prohibit marijuana delivery services from being hosted on its App Store—one of the latest pro-cannabis developments to come out of the tech industry.\nThe policy was updated last month to remove the ban, with some restrictions. A marijuana app must be geo-restricted to jurisdictions where cannabis is legal, and the program must be “submitted by a legal entity that provides the services, and not by an individual developer.”\nHere’s what the previous policy said:\n“Apps that encourage consumption of tobacco and vape products, illegal drugs, or excessive amounts of alcohol are not permitted on the App Store. Apps that encourage minors to consume any of these substances will be rejected. Facilitating the sale of controlled substances (except for licensed pharmacies), marijuana, or tobacco is not allowed.\nThe new policy, which was updated on June 7, reads:\n“Apps that encourage consumption of tobacco and vape products, illegal drugs, or excessive amounts of alcohol are not permitted on the App Store. Apps that encourage minors to consume any of these substances will be rejected. Facilitating the sale of controlled substances (except for licensed pharmacies and licensed or otherwise legal cannabis dispensaries), or tobacco is not allowed.”\n…\n“Apps that provide services in highly-regulated fields (such as banking and financial services, healthcare, gambling, legal cannabis use, and air travel) or that require sensitive user information should be submitted by a legal entity that provides the services, and not by an individual developer. Apps that facilitate the legal sale of cannabis must be geo-restricted to the corresponding legal jurisdiction.”\nTechCrunch first reported on the new guidelines, and WeedWeek later flagged the marijuana-specific guidance.\nIn contrast, Google’s Android app hub updated its policy in 2019 to explicitly prohibit programs that connect users with cannabis, no matter whether it is legal in the jurisdiction where the user lives.\n“We don’t allow apps that facilitate the sale of marijuana or marijuana products, regardless of legality,” it says, adding that some examples of violations would be “allowing users to order marijuana through an in-app shopping cart feature” or “assisting users in arranging delivery or pick up of marijuana.”\nIt also says that “facilitating the sale of products containing THC(Tetrahydrocannabinol), including products such as CBD oils containing THC” is against its policies.\nChris Vaughn, CEO of the California delivery service Emjay, told WeedWeek that he believes Apple’s decision was informed by the continuing legalization movement in states like New York, as well as Amazon’s recent announcement that it will no longer be drug testing workers for cannabis in addition to lobbying for a federal legalization bill. He added that he thinks Google will “follow quickly” to update its own policies.\nThe tech industry has had a strained relationship with the marijuana industry, even as a growing number of states have decided to legalize and regulate the sale of cannabis.\nFacebook, which in 2019 showed off its artificial intelligence technology that’s capable of identifying images of marijuana, continues to prohibit the commercial advertising of cannabis products, regardless of the legality of the business under state law.\nNoncommercial cannabis news sites such as Marijuana Moment and state regulatory bodies like the Massachusetts Cannabis Control Commission have also been caught up in the anti-marijuana policy despite the fact that they do not promote or sell cannabis products. In some cases, it appears these organizations have been hidden from appearing in search results—a practice known as “shadowbanning.”\nDespite marijuana firms being banned from Google’s app market, some of the company’s top officials seem pretty bullish about loosening cannabis laws. Google co-founder Sergey Brin joked about supplying employees with joints at a post-election meeting in 2016.\n“I was asking if we could serve joints outside on the patio, but apparently these things take a little while to take effect,” Brin said, referring to the implementation of California’s cannabis legalization measure. “It was a huge, huge disappointment. I’ve been bemoaning that all week, I’ll be honest with you.”\nPhoto courtesy of Mike Latimer.",
        "sentiment": -0.69610370585212
    },
    "article_10": {
        "title": "Apple is now Google's largest corporate customer for cloud storage",
        "body": "Credit: Google\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple has dramatically increased the amount of data that it stores on Google's cloud services, suggesting that its storage needs have grown faster than it can handle with its own servers.\nAs of May 2021, Apple was on track to spend about $300 million on Google cloud storage services in 2021, about a 50% increase year-over-year, a source told The Information.\nBack in November 2020 alone, Apple increased the amount of user data it stored on Google services by about 470 petabytes, bringing the total amount of data it had on Google's cloud to more than 8 exabytes. For reference, a single exabyte is enough to record a video call that's more than 237,000 years long.\nApple now ranks as the largest corporate client of Google's cloud services. Within Google, Apple even has a name indicative at its size: Bigfoot. Back in 2018, Apple confirmed that it used Google for user data storage needs.\nThe data needs of Apple also far eclipse any other Google customer. Apple's 470-petabyte increase in November was about the same as the total amount of storage used by Google's second largest customer, TikTok maker ByteDance.\nApple also appears to be getting a great deal for Google cloud storage. According to cost calculators on Google's website, storing 8 exabytes of data costs about $218 million per month. Apple, again, pays Google about $300 million per year storing the same amount.\nIt isn't clear why Apple's storage on Google cloud services has increased so dramatically. However, the purchase suggests that either it is more cost-effective for Apple to buy storage than it is to build out new capacity, or Apple has grown so big so quickly that it couldn't source, build, and maintain the first-party servers in a timely fashion that is needed to store the data.\nAfter Apple and ByteDance, Spotify was Google's third largest customer with about 460 petabytes of data, Twitter came in fourth with 315 petabytes, and Snapchat ranked third with about 275 petabytes.\nApple stores user iCloud data on both Amazon Web Services and Google's cloud. That data is encrypted by Apple, meaning that neither Amazon nor Google can obtain the the customer's iCloud information.\nAlthough AWS still accounts for a lion's share of the total cloud storage market, Google has carved out a niche for itself. Apple, for example, uses a form of Google cloud storage known as object storage, which is designed to handle data needs like audio and video files, as well as documents.",
        "sentiment": 0.11683551454916596
    },
    "article_11": {
        "title": "Comment: It’s 2021, and Apple Podcasts still can't stay in sync across devices",
        "body": "Apple has long been the dominant player in the podcast market. However, while Apple Podcasts has evolved quite a bit since the “tape player” 1.0 version, it’s not perfect. Today, I want to look at the good, the bad, and the ugly of Apple Podcasts with a particular focus on how the app still struggles to sync across multiple devices.\nI’ve been listening to podcasts since 2004, so I consider myself somewhat of a veteran of the industry. I’ve used every major podcast app on the market. I remember sideloading MP3 files into iTunes using iPodderX. I remember when Apple wouldn’t approve third-party podcast apps because they “duplicated functionality”. As a result, I am pretty opinionated on how podcasts app should work and firmly believe that it’s not a podcast unless you can subscribe in the app of your choice (don’t try to convince me otherwise).\nThe Good\nApple Podcasts is a good app, but it’s not great. It makes it easy to find new shows, follow them, and find the most recent episodes. It works great for shows where you need to listen in a particular order. In addition, it makes it easy to share a show over iMessage to friends. With iOS 15, it’s even easy to see what shows have been shared with you. I really like the interface as it follows the same overall style as Apple Music. It’s tightly integrated into the OS, so it’s easy to use.\nI love the end-user experience of paying for premium content for specific shows. I subscribe to several premium podcasts directly with the creator, but the process of subscribing isn’t as seamless as it is when you do it now in Apple Podcasts. I know Apple’s payments aren’t as easy on creators as Patreon or Memberful, but it’s easy for the user.\nOverall, the app provides a great interface for sharing and finding new shows.\nThe Bad\nApple Podcasts isn’t for power users, and that’s okay. Apps like Overcast, Castro, and Pocket Cast can fill out the features that power users want. Apple does need to keep striving towards making it a great experience, though.\nAs I’ve added more shows to my following list, the app has gotten slower and slower. I’ve noticed this on iOS 14 and iOS 15. Apple Podcasts feels much heavier than Overcast in day-to-day usage. When you mark an episode as played, it can often take 4-5 seconds to actually reflect that status in the interface. With Overcast and Castro, marking as played is automatic and the UI immediately updates. I am not sure if this problem is a symptom of how many shows I subscribe to, but it makes the app almost unusable/\nThe Ugly\nThe syncing of followed shows on Apple Podcasts seems to work well. What doesn’t seem to sync well is the Listen Now and Latest Episodes section of the app. I primarily listen to podcasts on my iPhone but occasionally like to listen to my Mac or iPad. Whenever I launch the apps, it’s a hot mess as it tries to sync everything and never ends up getting the Listen Now and Latest Episodes in sync with what’s on my iPhone. Then, if I do finally get them in sync manually, the iPhone somehow gets out of sync.\nWhat tends to happen is an episode that’s marked as played on one device will show as played on another, but it will still be in the Listen Now. So why would it be in Listen Now if it’s marked as played?\nThe image above shows what happened when I turned on syncing on Apple Podcasts on my Mac. It completely screwed up my library on my iPhone and brought back episodes previously marked as played into Up Next despite the fact they’ve already been marked as played.\nTechnically, I am sure this is not easy to implement at Apple’s scale. On the other hand, Overcast and Pocket Casts have figured out how to keep everything in sync across all of your devices so why can’t Apple?\nIn 2021, seamless syncing to other devices is table stakes for a podcast app, and Apple has yet to figure out how to keep the apps in sync. Do you know how slow iMessage feels on your Mac if it’s been closed for a week while you’re on vacation and it’s trying to catch up on processing messages? Apple Podcasts syncing behaves that way daily.\nWrap up\nApple focuses on the content side of podcasts, but I want them to spend equally as much effort on making the app faster and figure out what is keeping the apps from staying exactly in sync while adding new features. I want to love Apple Podcasts, but I’ve found that the only way I can use the app is to only use it on my iPhone. Otherwise, it’s hot garbage. I find myself wanting to use it every few weeks and quickly realize why it never sticks for me. The app is slow and struggles to sync across all of my devices.\nDo you use Apple Podcasts, or are you using a third-party alternative? Leave a comment below with which app and why.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.04320633651688695
    },
    "article_12": {
        "title": "Apple closing down internal Slack channels where employees debate remote work",
        "body": "Apple is closing down internal Slack channels to stop employees discussing remote working options, reports Zoe Schiffer from The Verge.\nMany Cupertino employees are currently engaged in a Cold War of sorts with their employer over the remote working arrangement coming out of the coronavirus pandemic. As the arguments flare up among staff, Apple has taken the step of shuttering the Slack channels where these are taking place.\n“Apple … recently began cracking down on Slack channels that aren’t directly related to work,” Schiffer wrote on Twitter. “The company bans channels ‘for activities and hobbies’ that aren’t directly related to projects or part of official employee groups — but this wasn’t always enforced, employees say.”\nThe battle over remote working\nIn June, Apple CEO Tim Cook said that employees should get ready to return by early September. This is after more than one year working remotely due to the COVID-19 pandemic. Apple proposed a hybrid model in which employees would work at least three days a week in the office. The rest of the week would be spent working from home. It recently pushed these plans for an office return back until at least October. This was due to more coronavirus case flare-ups around the world.\nBut many Apple employees are none too happy about it. Two public letters from Apple employees have requested more flexible working conditions. A recent petition this month was shared on Apple’s internal Slack channel, with more than 6,000 members discussing remote work. It noted that:\n“We continue to be concerned that this one-size-fits-all solution is causing many of our colleagues to question their future at Apple. With COVID-19 numbers rising again around the world, vaccines proving less effective against the delta variant, and the long-term effects of infection not well understood, it is too early to force those with concerns to come back to the office.”\nAccording to Schiffer, “internally, [many] people feel like [Apple] isn’t listening to their demands.” She continues that: “Since Friday, three Apple employees have resigned specifically because of the remote work policies. One had been at the company for nearly 13 years. I’ve seen a bunch of these resignation notes and they’re pretty heart wrenching.”\nWhere things go from here\nIt remains to be seen what happens next: whether Apple softens its hybrid working model or some of the more vocal employee-critics back down (or quit.) However, removing Slack channels discussing the subject could be viewed as simply fanning the flames. If employees feel like Apple’s ignoring their requests, then deleting the platforms in which they discuss these matters isn’t going to be met with favorable responses.\nWhat do you think the solution to this stand-off is? Has your own place of work had to rethink the way work is carried out as a result of the pandemic, particularly when it comes to the return to the office? Let us know your thoughts in the comments below.",
        "sentiment": -0.4069492405889413
    },
    "article_13": {
        "title": "M2 Chip Rumored to Arrive in 2022 With Redesigned MacBook Air",
        "body": "Apple is planning to launch the \"M2\" chip with redesigned MacBook Air models in the first half of 2022, according to the leaker known as \"Dylandkt.\"\nOn Twitter, Dylandkt claimed that a new ‌MacBook Air‌ model is \"on track\" to launch in the first half of 2022, featuring an ‌M2‌ chip and a more colorful design. They also claimed that the \"M1X\" chip is being reserved for high-end \"Pro\" Macs, which could include the MacBook Pro and a larger, more powerful iMac model.\nJust wanted to share some details on when to expect the next generation M2 (not the M1X which is reserved for the Pro Mac devices). This processor is on track to release in the first half of 2022 alongside the upcoming colorful Macbook (Air). — Dylan (@dylandkt) July 5, 2021\n‌Dylandkt‌'s claim is not entirely new, given that Jon Prosser has previously said that the next-generation ‌MacBook Air‌ will feature a complete redesign, a range of iMac-like color options, and an ‌M2‌ chip.\n‌Dylandkt‌ has been resolute in previous comments about the \"M1X\" being destined for the next-generation MacBook Pro, while the \"‌M2‌\" will apparently be a lower-end chip for the ‌MacBook Air‌, but it is worth noting that this does not seem to fit very well with the specific thoughts of reliable Bloomberg journalist Mark Gurman about Apple's upcoming custom silicon chips for the Mac.\nNevertheless, ‌Dylandkt‌ has correctly predicted details about a number of Apple's recent product launches. As early as November 2020, Dylandkt claimed that the next-generation iPad Pro would feature an M1 chip. This was five months before the device emerged. Before the launch of the 24-inch ‌iMac‌ earlier this year, ‌Dylandkt‌ correctly predicted that the new, redesigned ‌iMac‌ would replace the smaller entry-level ‌iMac‌ only and feature an ‌M1‌ chip rather than an M1X. ‌Dylandkt‌'s claim about the ‌MacBook Air‌ with the ‌M2‌ chip may therefore be more believable.",
        "sentiment": -0.01935367565602064
    },
    "article_14": {
        "title": "Today in Apple history: Apple acquires the company behind Touch ID",
        "body": "July 28, 2012: Apple buys biometrics company AuthenTec, acquiring the technology that will power future authentication and secure payments initiatives.\nWith a price tag of $356 million, the deal gives Apple the right to use AuthenTec hardware, software and patents. In the short term, Apple engineers start working to build Touch ID sensors into the iPhone 5s. Longer-term, AuthenTec’s mobile wallet tech paves the way for Apple Pay.\niPhone fingerprint sensor: A long time in the making\nAlthough the dream of using fingerprint sensors on smartphones had been around for a while, AuthenTec’s technology didn’t work quite as planned at first.\nSpeaking in 2013, company co-founder F. Scott Moody recalled how an early demo for IBM went wrong in the worst possible way: It mistook IBM’s chief technology officer for the other AuthenTec co-founder.\nHowever, once changes were made and a final product was exhibited, it didn’t take long for companies including Motorola, Fujitsu and Apple to make overtures regarding a potential buyout. Apple ultimately won.\nNonetheless, Motorola actually beat Apple to the marketplace by two years when its Mobility Atrix 4G shipped with a fingerprint sensor in 2011. But while Motorola’s technology worked reasonably well, it proved less than intuitive. The fingerprint scanner resided on the phone’s back. And users needed to swipe it rather than simply touch it for authentication.\nAuthenTec tech makes Touch ID better\nApple’s Touch ID solution, on the other hand, wasn’t just secure. It proved very speedy as well — considerably quicker and easier than tapping in even a short, four-digit PIN.\n“The biggest thing Apple gets out of this is probably a strong play for using biometrics for identity in general — for online and brick-and-mortar purchases, for logging into websites and even for digital signatures,” Cult of Mac wrote at the time of the AuthenTec acquisition.\nTouch ID arrived on the iPhone 5s in 2013, used initially only to unlock the handset. A year later, for the launch of the iPhone 6 and 6 Plus, Apple expanded Touch ID’s usefulness. Suddenly the fingerprint sensor worked to authenticate iTunes and App Store purchases via Apple Pay.\nTouch ID, Face ID and the future of Apple biometrics\nWith the launch of Face ID, the facial-recognition feature Apple rolled out in 2017 with the iPhone X, it appeared the days of Touch ID were largely at an end. However, Apple still incorporates the technology into its entry-level products.\nThe third-generation iPhone SE, released in early 2022, and the ninth-gen iPad, released in 2021, both utilize Touch ID in their old-school Home buttons.\nWhat did you think of Touch ID the first time you saw or used it? Are you happy that it’s been replaced on newer iPhones? Leave your comments and recollections below.",
        "sentiment": 0.006246012868359685
    },
    "article_15": {
        "title": "Apple continues to dominate tablet industry as iPad sales boom, report says",
        "body": "A new report by IDC about Chromebook and tablet growth in the second quarter of 2021 showed that Apple continues to be the leader of the tablet segment and is shipping more iPads than the competition is shipping — even combined.\nAccording to the report, Apple shipped 12.9 million iPads in Q2 with a market share of 31.9%, while Samsung rests in second place with 8 million tablets shipped and 19.6% of market share, and Amazon is in fourth place with 4.3 million tablets shipped and 10.7% of market share.\nFor Apple, it was a YoY growth of 3.5% as it shipped around 12.5 million iPads in Q2 of 2020. Even though the company shipped more iPads than last time, its market share was smaller as Samsung, Lenovo, and Amazon saw their market share growing.\nIDC says that although the tablet market had positive results during the quarter, the category is experiencing a slowdown from the boom in the preceding quarters.\n“Opportunities in the education market are still ample (..). Online learning has gained rapid traction and has pushed forward the digital revolution in the learning space,” said Anuroopa Nataraj, senior research analyst with IDC’s Mobility and Consumer Device Trackers.\nFor Q3 2021, Apple recently reported overall records as the iPad line grew 12% YoY with $7.37 billion of revenue.\nApple CEO Tim Cook had the following to say about Apple’s Q3 2021 performance:\n“This quarter, our teams built on a period of unmatched innovation by sharing powerful new products with our users, at a time when using technology to connect people everywhere has never been more important,” said Tim Cook, Apple’s CEO. “We’re continuing to press forward in our work to infuse everything we make with the values that define us — by inspiring a new generation of developers to learn to code, moving closer to our 2030 environment goal, and engaging in the urgent work of building a more equitable future.”\nAlthough Apple no longer reports unit sales for any of its products, the refresh of the base-model iPad 8 and iPad Air 4 by the end of 2020 combined with M1 iPad Pros appeared to be well-received.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.4409624292825659
    },
    "article_16": {
        "title": "Apple expects high demand for 'iPhone 13,' orders over 100 million A15 processors",
        "body": "TSMC\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nSources in the supply chain claim that Apple has increased its order with TSMC to make in excess of 100 million A15 processors for the forthcoming \"iPhone 13.\"\nFollowing previous reports that processor manufacturer TSMC has begun production of Apple's A15, a new claim says that the company has now increased its order. Reportedly, Apple had planned for up to 95 million A15 processors, but has now ordered in excess of 100 million.\nAccording to cnBeta, sources in the supply chain say that this is partly because Apple expects high demand for the next iPhone. However, it's also said to be because the company needs to secure processors as the global chip shortage continues.\nConsequently, Chinese technology blog cnBeta says (in translation) that Apple is making \"every effort to prepare for production capacity.\" In other words, Apple doesn't want the number of produced \"iPhone 13\" devices to be limited by the shortage.\nSeparately, TSMC has already be said to be priotizing Apple and the car industry as the shortage continues. TSMC has also begun construction on a 5nm chip plant in Arizona.",
        "sentiment": 0.19968826025724412
    },
    "article_17": {
        "title": "Beatles producer says Spatial Audio album doesn't sound right, plans new mix",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nLegendary Beatles producer Giles Martin in an interview this week discussed the advent of Dolby Atmos, the technology on which Apple's Spatial Audio format is built, revealing that he intends to create a new mix of \"Sgt. Pepper's Lonely Hearts Club Band\" because the current version \"doesn't sound quite right.\"\nSpeaking with Rolling Stone, Martin explained that \"Sgt. Pepper's Lonely Hearts Club Band\" was among the first albums — perhaps the first — to receive a Dolby Atmos mix. While the result sounds \"good,\" it doesn't sound \"right\" in part because the mix was meant to be a theatrical presentation.\n\"Sgt. Pepper's,' how it's being presented right now, I'm actually going to change it. It doesn't sound quite right to me. It's out in Apple Music right now. But I'm gonna replace it. It's good. But it's not right,\" Martin said. \"Sgt. Pepper's was, I think, the first album ever mixed in Dolby Atmos. And we did that as a theatrical presentation. I liked the idea of the Beatles being the first to do something. It's cool that they can still be the first to do something. So Sgt. Pepper's is a theatrical mix that's then being converted into a smaller medium. Therefore, it's not quite right.\"\nThe mix lacks bass and \"a little bit of weight,\" he added, noting that the Dolby Atmos version of \"Abbey Road\" is \"much better-functioning\" because it is sonically closer to the stereo version.\n\"It's a bit like someone you love for years having a slightly different haircut. And you realize you still love them,\" Martin said of the new mixes.\nMartin also shared insight on Dolby Atmos for headphones, a technology that is incredibly difficult to get right. There has been \"exponential growth\" in the sector over the past two years, he said, but the technology is still in its infancy. While products like Apple's Spatial Audio is a good experience, it will get better as companies learn how to tweak their products to suit user needs.\n\"You can hear the difference with spatial audio. It may not always be better, but there's a difference,\" Martin said. \"I think we're learning the tools to provide that difference for people. What's great is that it creates more of a lean-in listening environment where you're paying attention to it, as opposed to just having audio being played into your head to stop you from thinking.\"\nInterestingly, Martin believes that advanced biometric tech like facial recognition, body measurements and in-ear pressure testing will one day be used to customize the listening experience. Perception of Dolby Atmos mixes in headphones is dependent on multiple variables, from head size to bone structure, and new technologies are needed to present recorded music as intended, he explains.\nApple introduced a form of hardware adaptation with the AirPods Pro ear tip fit test, which analyzes an earbud's seal by capturing speaker output with onboard microphones. AirPods Max goes a step further with Dynamic EQ, a system that measures sound signals within the headphone's ear cushions and adjusts sound output in real time.",
        "sentiment": 0.1221604840031692
    },
    "article_18": {
        "title": "Apple Expecting High Demand for Upcoming MacBook Pros, Enlists Extra Mini-LED Display Supplier",
        "body": "Apple is seemingly preparing for high demand for its upcoming redesigned 14-inch and 16-inch MacBook Pros, and, as a result, has reportedly enlisted a second supplier for its mini-LED displays ahead of their launch.\nAccording to DigiTimes, Apple has added Luxshare Precision Industry as the second supplier for surface mounting technology (SMT) for mini-LED displays. Apple had previously only contracted SMT, or Taiwan Surface Mounting Technology as its supplier for SMT processes in the mini-LED 12.9-inch iPad Pro and the upcoming MacBook Pros.\nApple first introduced a mini-LED display in its high-end 12.9-inch ‌iPad Pro‌ this past April. While the new iPad was announced in April, shipments of the device did not begin until later in May due to high demand and difficult production yield rates. Fueled by a global chip shortage and the continued global health crisis, Apple and its suppliers have faced challenges the past year in maintaining production of new devices.\nThe upcoming MacBook Pros are expected to be in high demand thanks to several long-awaited features and changes. Alongside a more powerful Apple silicon chip, the new MacBook Pros are rumored to include the first major redesign to the MacBook Pro since 2016, including flat-edges, removing the Touch Bar, and additional ports.\nDigiTimes says the new MacBook Pros are expected to launch in the fourth quarter of the year, which runs from October through December. The publication previously cited sources claiming an end-of-third-quarter launch for the new models, but early fourth quarter is more in line with industry expectations. Apple last year announced its M1 Apple silicon processor and an updated Mac mini, MacBook Air, and MacBook Pro at a digital event in November.",
        "sentiment": 0.41984277878972615
    },
    "article_19": {
        "title": "United flight evacuated after teen AirDrop pics of airsoft gun to passengers",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nIn what appears to be an ill-conceived prank, a teenager on a United Airlines flight out of San Francisco used Apple's AirDrop to send \"inappropriate pictures\" to fellow passengers, causing personnel to evacuate the plane.\nAs recounted by Christopher J. Beale, who claims his mother was on board the flight Thursday, an unnamed teen sent images of an airsoft gun to nearby iPhones via AirDrop, reports NBC's Bay Area affiliate.\nBound for Orlando, United Airlines Flight 2167 was preparing to leave the gate when passengers reported the incident, said airport spokesperson Doug Yakel. Everyone aboard was forced to disembark and go through a second screening process \"out of an abundance of caution,\" Yakel said.\nThe teen also made threats, according to Beale's account, as relayed by Gizmodo.\nIt was determined the photos were taken at an earlier date and not at the airport, and the teen did not have the gun on his person. Passengers reboarded after officials carried out a security inspection of the plane, and the teen was banned from the flight. It is unclear if he is facing further legal ramifications for his actions.\nHow the teen was identified is unclear. As Gizmodo notes, iOS users can anonymously send pictures, video and other media through AirDrop simply by changing their device name in system settings. It is theorized that the culprit forgot this crucial step or simply had no concerns about being caught.\nRecipients of AirDropped media are shown a preview of the image or video, which they can either accept or decline. This mechanic has caused problems in the past, as pranksters or unsavory characters can use the feature to present inappropriate content to victims.\nUsers can secure AirDrop and prevent receipt of unwanted photos by limiting AirDrop discoverability to known contacts. First, open Control Center by swiping down from the top right corner of the screen (iPhone X and newer) or up from the bottom of the screen (iPhone 8 and older), then press and hold the Bluetooth icon and tap on the AirDrop icon. Select Contacts Only or Receiving Off.\nThe same AirDrop settings can be found under General > AirDrop in the Settings app.",
        "sentiment": -0.5969027879958352
    },
    "article_20": {
        "title": "Apple just suddenly updated the MagSafe support page for MacBook, which hadn’t been updated since 2016.",
        "body": "If your Mac uses MagSafe 3, you can charge your Mac with a USB-C to MagSafe 3 Cable and a USB-C power adapter.\nIf your Mac uses MagSafe 2, you can charge your Mac with a MagSafe 2 power adapter or a MagSafe power adapter connected with the MagSafe to MagSafe 2 converter.\nIf your Mac uses MagSafe, you can charge your Mac with a T style or L style MagSafe power adapter.\nThe MagSafe connector and MagSafe port on your Mac laptop contain a magnet that can possibly erase data on a credit card or other magnetic devices. Keep magnetic media away from the end of the MagSafe adapter and away from the MagSafe port.\nMagSafe 2 and MagSafe power adapters aren't compatible with MagSafe 3.",
        "sentiment": 0.10170963779091835
    },
    "article_21": {
        "title": "Gurman: MacBook Pro with miniLED display coming between September-November",
        "body": "In today’s Power On newsletter, Bloomberg Mark Gurman discusses the availability of the new MacBook Pro with miniLED display, expected to be announced from September to November. Head below for the full details.\nReiterating what reliable Apple analyst Ming-Chi Kuo said a couple of weeks ago, the new MacBook Pro is expected to go into production in the third quarter, which means an announcement is expected around September to November, according to Gurman as well.\nIn his newsletter, Mark Gurman says “these new MacBooks were supposed to launch earlier, but complications around the new miniLED display have held up production.”\nThe miniLED display, which Apple calls Liquid Retina XDR, is already available on the new 12.9-inch M1 iPad Pro. This panel uses 10,000 mini-LEDs, which provide much greater control of localized backlighting, allowing higher brightness and deeper blacks. The combination boosts the contrast ratio, as well as using less power.\nAccording to the company, the Liquid Retina XDR display delivers “true-to-life” detail with a 1,000,000:1 contrast ratio. It also features 1000 nits of full-screen brightness and 1600 nits of peak brightness.\nAlthough the new MacBook Pro is expected to feature the M1X chip and more slots, Gurman doesn’t talk about that in today’s newsletter. Instead, he gives a tip about choosing between the MacBook Pro and MacBook Air.\nMacBook Pro for those who necessitate more speed and RAM with app development, Photoshop, and heavy video editing, while the Air is ideal for web browsing, email, and light photo editing.\nRecently, Bloomberg published that the new MacBook Pro would be configurable with up to 64GB of RAM. Last week,YouTuber Luke Miani reported that new Macs could be limited to 32GB of RAM.\nIf you want to know everything expected from the new MacBook Pro with a miniLED display, check out our guide here.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.18328068317735896
    },
    "article_22": {
        "title": "Revealed: leak uncovers global abuse of cyber-surveillance weapon",
        "body": "Human rights activists, journalists and lawyers across the world have been targeted by authoritarian governments using hacking software sold by the Israeli surveillance company NSO Group, according to an investigation into a massive data leak.\nThe investigation by the Guardian and 16 other media organisations suggests widespread and continuing abuse of NSO’s hacking spyware, Pegasus, which the company insists is only intended for use against criminals and terrorists.\nPegasus is a malware that infects iPhones and Android devices to enable operators of the tool to extract messages, photos and emails, record calls and secretly activate microphones.\nThe leak contains a list of more than 50,000 phone numbers that, it is believed, have been identified as those of people of interest by clients of NSO since 2016.\nForbidden Stories, a Paris-based nonprofit media organisation, and Amnesty International initially had access to the leaked list and shared access with media partners as part of the Pegasus project, a reporting consortium.\nThe presence of a phone number in the data does not reveal whether a device was infected with Pegasus or subject to an attempted hack. However, the consortium believes the data is indicative of the potential targets NSO’s government clients identified in advance of possible surveillance attempts.\nQuick Guide What is in the Pegasus project data? Show What is in the data leak? The data leak is a list of more than 50,000 phone numbers that, since 2016, are believed to have been selected as those of people of interest by government clients of NSO Group, which sells surveillance software. The data also contains the time and date that numbers were selected, or entered on to a system. Forbidden Stories, a Paris-based nonprofit journalism organisation, and Amnesty International initially had access to the list and shared access with 16 media organisations including the Guardian. More than 80 journalists have worked together over several months as part of the Pegasus project. Amnesty’s Security Lab, a technical partner on the project, did the forensic analyses. What does the leak indicate? The consortium believes the data indicates the potential targets NSO’s government clients identified in advance of possible surveillance. While the data is an indication of intent, the presence of a number in the data does not reveal whether there was an attempt to infect the phone with spyware such as Pegasus, the company’s signature surveillance tool, or whether any attempt succeeded. The presence in the data of a very small number of landlines and US numbers, which NSO says are “technically impossible” to access with its tools, reveals some targets were selected by NSO clients even though they could not be infected with Pegasus. However, forensic examinations of a small sample of mobile phones with numbers on the list found tight correlations between the time and date of a number in the data and the start of Pegasus activity – in some cases as little as a few seconds. What did forensic analysis reveal? Amnesty examined 67 smartphones where attacks were suspected. Of those, 23 were successfully infected and 14 showed signs of attempted penetration. For the remaining 30, the tests were inconclusive, in several cases because the handsets had been replaced. Fifteen of the phones were Android devices, none of which showed evidence of successful infection. However, unlike iPhones, phones that use Android do not log the kinds of information required for Amnesty’s detective work. Three Android phones showed signs of targeting, such as Pegasus-linked SMS messages. Amnesty shared “backup copies” of four iPhones with Citizen Lab, a research group at the University of Toronto that specialises in studying Pegasus, which confirmed that they showed signs of Pegasus infection. Citizen Lab also conducted a peer review of Amnesty’s forensic methods, and found them to be sound. Which NSO clients were selecting numbers? While the data is organised into clusters, indicative of individual NSO clients, it does not say which NSO client was responsible for selecting any given number. NSO claims to sell its tools to 60 clients in 40 countries, but refuses to identify them. By closely examining the pattern of targeting by individual clients in the leaked data, media partners were able to identify 10 governments believed to be responsible for selecting the targets: Azerbaijan, Bahrain, Kazakhstan, Mexico, Morocco, Rwanda, Saudi Arabia, Hungary, India, and the United Arab Emirates. Citizen Lab has also found evidence of all 10 being clients of NSO. What does NSO Group say? You can read NSO Group’s full statement here. The company has always said it does not have access to the data of its customers’ targets. Through its lawyers, NSO said the consortium had made “incorrect assumptions” about which clients use the company’s technology. It said the 50,000 number was “exaggerated” and that the list could not be a list of numbers “targeted by governments using Pegasus”. The lawyers said NSO had reason to believe the list accessed by the consortium “is not a list of numbers targeted by governments using Pegasus, but instead, may be part of a larger list of numbers that might have been used by NSO Group customers for other purposes”. They said it was a list of numbers that anyone could search on an open source system. After further questions, the lawyers said the consortium was basing its findings “on misleading interpretation of leaked data from accessible and overt basic information, such as HLR Lookup services, which have no bearing on the list of the customers' targets of Pegasus or any other NSO products ... we still do not see any correlation of these lists to anything related to use of NSO Group technologies”. Following publication, they explained that they considered a \"target\" to be a phone that was the subject of a successful or attempted (but failed) infection by Pegasus, and reiterated that the list of 50,000 phones was too large for it to represent \"targets\" of Pegasus. They said that the fact that a number appeared on the list was in no way indicative of whether it had been selected for surveillance using Pegasus. What is HLR lookup data? The term HLR, or home location register, refers to a database that is essential to operating mobile phone networks. Such registers keep records on the networks of phone users and their general locations, along with other identifying information that is used routinely in routing calls and texts. Telecoms and surveillance experts say HLR data can sometimes be used in the early phase of a surveillance attempt, when identifying whether it is possible to connect to a phone. The consortium understands NSO clients have the capability through an interface on the Pegasus system to conduct HLR lookup inquiries. It is unclear whether Pegasus operators are required to conduct HRL lookup inquiries via its interface to use its software; an NSO source stressed its clients may have different reasons – unrelated to Pegasus – for conducting HLR lookups via an NSO system. Was this helpful? Thank you for your feedback.\nForensics analysis of a small number of phones whose numbers appeared on the leaked list also showed more than half had traces of the Pegasus spyware.\nThe Guardian and its media partners will be revealing the identities of people whose number appeared on the list in the coming days. They include hundreds of business executives, religious figures, academics, NGO employees, union officials and government officials, including cabinet ministers, presidents and prime ministers.\nThe list also contains the numbers of close family members of one country’s ruler, suggesting the ruler may have instructed their intelligence agencies to explore the possibility of monitoring their own relatives.\nThe disclosures begin on Sunday, with the revelation that the numbers of more than 180 journalists are listed in the data, including reporters, editors and executives at the Financial Times, CNN, the New York Times, France 24, the Economist, Associated Press and Reuters.\nThe phone number of a freelance Mexican reporter, Cecilio Pineda Birto, was found in the list, apparently of interest to a Mexican client in the weeks leading up to his murder, when his killers were able to locate him at a carwash. His phone has never been found so no forensic analysis has been possible to establish whether it was infected.\nNSO said that even if Pineda’s phone had been targeted, it did not mean data collected from his phone contributed in any way to his death, stressing governments could have discovered his location by other means. He was among at least 25 Mexican journalists apparently selected as candidates for surveillance over a two-year period.\nWithout forensic examination of mobile devices, it is impossible to say whether phones were subjected to an attempted or successful hack using Pegasus.\nNSO has always maintained it “does not operate the systems that it sells to vetted government customers, and does not have access to the data of its customers’ targets”.\nIn statements issued through its lawyers, NSO denied “false claims” made about the activities of its clients, but said it would “continue to investigate all credible claims of misuse and take appropriate action”. It said the list could not be a list of numbers “targeted by governments using Pegasus”, and described the 50,000 figure as “exaggerated”.\nThe company sells only to military, law enforcement and intelligence agencies in 40 unnamed countries, and says it rigorously vets its customers’ human rights records before allowing them to use its spy tools.\nThe Israeli minister of defence closely regulates NSO, granting individual export licences before its surveillance technology can be sold to a new country.\nLast month, NSO released a transparency report in which it claimed to have an industry-leading approach to human rights and published excerpts from contracts with customers stipulating they must only use its products for criminal and national security investigations.\nThere is nothing to suggest NSO’s customers did not also use Pegasus in terrorism and crime investigations, and the consortium also found numbers in the data belonging to suspected criminals.\nHowever, the broad array of numbers in the list belonging to people who seemingly have no connection to criminality suggests some NSO clients are breaching their contracts with the company, spying on pro-democracy activists and journalists investigating corruption, as well as political opponents and government critics.\nThat thesis is supported by forensic analysis on the phones of a small sample of journalists, human rights activists and lawyers whose numbers appeared on the leaked list. The research, conducted by Amnesty’s Security Lab, a technical partner on the Pegasus project, found traces of Pegasus activity on 37 out of the 67 phones examined.\nQ&A What is the Pegasus project? Show The Pegasus project is a collaborative journalistic investigation into the NSO Group and its clients. The company sells surveillance technology to governments worldwide. Its flagship product is Pegasus, spying software – or spyware – that targets iPhones and Android devices. Once a phone is infected, a Pegasus operator can secretly extract chats, photos, emails and location data, or activate microphones and cameras without a user knowing. Forbidden Stories, a Paris-based nonprofit journalism organisation, and Amnesty International had access to a leak of more than 50,000 phone numbers selected as targets by clients of NSO since 2016. Access to the data was then shared with the Guardian and 16 other news organisations, including the Washington Post, Le Monde, Die Zeit and Süddeutsche Zeitung. More than 80 journalists have worked collaboratively over several months on the investigation, which was coordinated by Forbidden Stories. Was this helpful? Thank you for your feedback.\nThe analysis also uncovered some sequential correlations between the time and date a number was entered into the list and the onset of Pegasus activity on the device, which in some cases occurred just a few seconds later.\nAmnesty shared its forensic work on four iPhones with Citizen Lab, a research group at the University of Toronto that specialises in studying Pegasus, which confirmed they showed signs of Pegasus infection. Citizen Lab also conducted a peer-review of Amnesty’s forensic methods, and found them to be sound.\nThe presence of a number in the data does not mean there was an attempt to infect the phone. NSO says there were other possible purposes for numbers being recorded on the list.\nRwanda, Morocco, India and Hungary denied having used Pegasus to hack the phones of the individuals named in the list. The governments of Azerbaijan, Bahrain, Kazakhstan, Saudi Arabia, Mexico, the UAE and Dubai did not respond to invitations to comment.\nThe Pegasus project is likely to spur debates over government surveillance in several countries suspected of using the technology. The investigation suggests the Hungarian government of Viktor Orbán appears to have deployed NSO’s technology as part of his so-called war on the media, targeting investigative journalists in the country as well as the close circle of one of Hungary’s few independent media executives.\nThe leaked data and forensic analyses also suggest NSO’s spy tool was used by Saudi Arabia and its close ally, the UAE, to target the phones of close associates of the murdered Washington Post journalist Jamal Khashoggi in the months after his death. The Turkish prosecutor investigating his death was also a candidate for targeting, the data leak suggests.\nClaudio Guarnieri, who runs Amnesty International’s Security Lab, said once a phone was infected with Pegasus, a client of NSO could in effect take control of a phone, enabling them to extract a person’s messages, calls, photos and emails, secretly activate cameras or microphones, and read the contents of encrypted messaging apps such as WhatsApp, Telegram and Signal.\nBy accessing GPS and hardware sensors in the phone, he added, NSO’s clients could also secure a log of a person’s past movements and track their location in real time with pinpoint accuracy, for example by establishing the direction and speed a car was travelling in.\nThe latest advances in NSO’s technology enable it to penetrate phones with “zero-click” attacks, meaning a user does not even need to click on a malicious link for their phone to be infected.\nGuarnieri has identified evidence NSO has been exploiting vulnerabilities associated with iMessage, which comes installed on all iPhones, and has been able to penetrate even the most up-to-date iPhone running the latest version of iOS. His team’s forensic analysis discovered successful and attempted Pegasus infections of phones as recently as this month.\nApple said: “Security researchers agree iPhone is the safest, most secure consumer mobile device on the market.”\nNSO declined to give specific details about its customers and the people they target.\nHowever, a source familiar with the matter said the average number of annual targets per customer was 112. The source said the company had 45 customers for its Pegasus spyware.",
        "sentiment": -0.5550292176701644
    },
    "article_23": {
        "title": "Gurman: Face ID on the Mac Coming Within a 'Couple of Years'",
        "body": "Apple plans to bring Face ID to the Mac within the next \"couple of years,\" respected Bloomberg journalist Mark Gurman said today in the latest edition of his Power On newsletter.\nIn the newsletter, Gurman says that he believes Apple's ultimate goal is to shift all of its products to ‌Face ID‌, including the lower-end iPhones such as the iPhone SE and the iPad Air, which feature Touch ID. Gurman says ‌Touch ID‌ remains an important part of Apple's product lineup, especially for lower-end models, thanks to it being a \"cheaper alternative\" to ‌Face ID‌ while continuing to provide security to users.\nBut I expect that to eventually change. It won’t happen this year, but I’d bet Face ID on the Mac is coming within a couple of years. I expect all iPhones and iPads to transition to Face ID within that timeframe, too. Eventually, a camera embedded in the screen would help differentiate Apple’s pricier devices by eliminating the notch at the top. The facial recognition sensor gives Apple two central features: security and augmented reality. Touch ID, more convenient or not, only provides the former.\nGurman had previously reported that as Apple was planning its recently launched redesigned 24-inch iMac, it had initially planned to include ‌Face ID‌, but that ‌Face ID‌ implementation has been delayed to an upcoming ‌iMac‌ redesign instead. Unlike iPhones and iPads, Mac laptop screens are significantly thinner, making it harder to fit the necessary depth sensors for ‌Face ID‌, Gurman notes.\nFurther down the line, Gurman says Apple will eventually embed ‌Face ID‌ into the screens themselves, abandoning the need for a notch on the iPhone. Apple analyst Ming-Chi Kuo believes such an ‌iPhone‌ may debut as early as 2023. As for the Mac desktop, Apple is continuing to develop a replacement for the 27-inch iMac which may feature a larger screen and a more powerful \"M2X\" chip. Apple earlier this year paused work on the larger ‌iMac‌ to focus on the 24-inch ‌iMac‌, which was released this past April.",
        "sentiment": 0.32754676571736735
    },
    "article_24": {
        "title": "Anti-vax app ejected from App Store over user content issues",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple has ejected a social app aimed at unvaccinated people from the App Store, in a bid to halt the spread of COVID-19 misinformation.\nUnjected, an app that launched in May and was originally intended for dating and introductions in a community that supports \"medical autonomy and free speech,\" was updated to introduce more social elements. A social feed gave users the opportunity to contribute content, which has since become a headache for the app's developers.\nAn app review for the Android version conducted by Google Play deemed it to have insufficiently policed the user-generated content for misinformation, reports Bloomberg. Emails sent to the developer by Google cited posts about the COVID-19 vaccines were at issue, including claims they were \"experimental mRNA gene modifiers,\" as well as mentions of 5G and microchip narratives.\nAfter Google advised the app to remove the posts in two weeks or face being pulled, the developers removed the social feed element. According to co-founder Shelby Thompson, there are plans to bring the social feed back, along with flagged posts, and intends to \"stay under the radar\" of Google's review teams.\nOther elements of the app remained untouched, including chat rooms, a directory of \"unvaxxed-friendly\" businesses, and a database of user blood types.\nAfter being contacted for the report, Apple has since pulled the app from the App Store. In its email to the developers, Apple says the app \"inappropriately refers to the COVID-19 pandemic in its concept or theme.\"\nUnjected is far from the first app to be pulled from the App Store for the views of app users.",
        "sentiment": -0.7297559982398525
    }
}