{
    "article_0": {
        "title": "Apple brand loyalty hits all-time high as Samsung loyalty dives",
        "body": "Apple brand loyalty among smartphone owners has hit an all-time high, according to a survey by SellCell. It shows that 91.9% of iPhone owners plan to buy another iPhone when they next upgrade, up 1.4% from 2019.\nSamsung, in contrast, has seen its own brand loyalty plunge …\nSellCell says that only 74% of Samsung smartphone owners plan to buy another Samsung model, down from 85.7% in 2019.\niPhone owners gave four reasons for sticking with Apple:\nLike iPhone best or never had an issue with it: 65%\nLocked into the ecosystem: 21%\nSwitching from iOS to Android is too much hassle: 10%\nPrefer to stick to what they know: 8%\nThe ecosystem is clearly a big advantage for Apple. While almost as many Samsung owners were happy with the brand as Apple owners (64% versus 65%), just 5% said they were too invested in the Samsung world.\niPhone owners who plan to switch to Android gave three main reasons:\nOther brand has better technology (e.g., screen, camera, battery, etc.): 38%\nPrefer the design of other brand: 26.4%\nLatest model from the other brand has more features than the latest model of my current brand: 12.9%\nAlmost half would switch to Samsung, and a third to a Google Pixel.\nConversely, the majority of Samsung owners would switch to iPhone, almost a third of them saying that Apple offers better privacy protection, and a quarter saying they consider Apple offers better value for money.\nSellCell also asked respondents to pick their favorite smartphone, with the iPhone 12 and and 12 Pro Max heading the list.\nApple iPhone 12 — 17% Apple iPhone 12 Pro Max — 12.7% Samsung Galaxy S21 — 11.4% Apple iPhone 12 Pro — 10.6% Samsung Galaxy S21 Ultra — 10% Samsung Galaxy S21+ — 9% Google Pixel 5 — 8.1% Apple iPhone 12 Mini — 6.3% Other — 5% Samsung Galaxy Z Fold2 5G — 3.1%\nThe survey sample is 5,000 US smartphone owners – 2,000 each of iPhone and Samsung, and the rest split across other brands roughly in line with market share.\nPhoto by Onur Binay on Unsplash\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.16395730695997676
    },
    "article_1": {
        "title": "'Secret' Apple retail policy reportedly rewards polite customers with free fixes, replacements",
        "body": "Credit: Apple\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nIn a viral TikTok video, a former Apple Store employee revealed an alleged special program which retail employees could use to \"surprise and delight\" customers with additional perks.\nTikTok user @Tanicornerstone explained the supposed program in a response to a video asking for the \"secrets that only the employees know.\"\n\"I used to work for Apple. So the first thing; rude customers, like we got some psychos in that store, but if you're rude to the geniuses or the concierge people, you will get your problem fixed most likely - however you are going to pay for it,\" the former retail staffer explained.\nHowever, she adds that each staff member apparently has a specific number of \"surprise and delight\" instances that they could use to go above and beyond normal service for \"really amazing\" customers.\n\"I used to see a lot, people would come in with like water damaged phones and you're not allowed to replace those without a fee. However, the geniuses used a 'surprise and delight' to be able to give somebody a free replacement,\" she said.\nCommenters to the TikTok video corroborated the claim, including both customers who received exceptional service or other former Apple Retail staffers. Some, however, have refuted claims that Apple had any such policy, while others say the video mistakenly equates \"surprise and delight\" with programs that have since been discontinued.\nHer clip now has more than 114,000 likes and generated 866 comments.\nIt isn't clear if the \"surprise and delight\" program is still in effect, or whether it was actually a retail policy at all. However, there does appear to be plenty of anecdotal evidence suggesting that customers who are nice to retail staff may be able to get better service.\n\"I was a BROKE college student with an older MacBook whose battery needed to be replaced. The genius didn't charge me,\" one commenter said.",
        "sentiment": -0.39503491229067245
    },
    "article_2": {
        "title": "Apple discontinues original HomePod, will focus on mini",
        "body": "Apple has discontinued its original HomePod after four years. It says that it will continue to produce and focus on the HomePod mini, introduced last year. The larger HomePod offered a beefier sound space but the mini has been very well received and clearly accomplishes many of the duties that the larger version was tasked with. The sound is super solid (especially for the size) and it offers access to Siri, Apple’s assistant feature.\nThe original HomePod was a feat of audio engineering that Apple spent over five years developing. In order to accomplish its development, the team at Apple built out a full development center near its headquarters in Cupertino, with a world-class development environment with a dozen anechoic chambers, including one of the bigger anechoic chambers outside of academic use in the US. I visited the center before its release, noting that Apple took it the extra mile to get the incredibly complex series of tweeters and woofer that built its soundspace:\nBut slathered on top of that is a bunch of typically Apple extra-mile jelly. Apple says that its largest test chamber is one of the biggest in the US, on a pad, suspended from the outside world with nothing to pollute its tests of audio purity. Beyond testing for the acoustic qualities of the speaker, these chambers allowed Apple to burrow down to account for and mitigate the issues that typically arise from having a high excursion subwoofer in such a small cabinet. Going even further, there are smaller chambers that allow them to isolate the hum from electronic components (there is a computer on board after all) and make attempts to insulate and control that noise so it doesn’t show up in the final output.\nI found it to be one of the best speakers ever made for the home when I reviewed it in 2018. From the booming base and well-shaped nature of the tweeter assembly inside; the cloth cover that was specially shaped to avoid interfering with sound quality in any way; the way that it sensed the way that audio was being shaped by walls and other obstructions and adjusted its output to compensate. It was the definition of ‘no effort spared’ in the speaker department.\nThe major gripe for the speaker at the time was the $349 price, which was at the top end of the home speaker market, especially those with embedded home assistants. A price drop to $299 mitigated that somewhat, but still put it at the top of the pricing umbrella for the class. Apple’s HomePod mini, launched last year, has been well received. Our Brian Heater said that it had ‘remarkably big sound’ for the $99 price.\nApple gave TechCrunch a statement about the discontinuation:\nHomePod mini has been a hit since its debut last fall, offering customers amazing sound, an intelligent assistant, and smart home control all for just $99. We are focusing our efforts on HomePod mini. We are discontinuing the original HomePod, it will continue to be available while supplies last through the Apple Online Store, Apple Retail Stores, and Apple Authorized Resellers. Apple will provide HomePod customers with software updates and service and support through Apple Care.\nExisting HomePods will continue to be sold but Apple’s website is already out of Space Gray. It will continue to provide support for existing HomePods. Apple seems to be betting on the mini going forward, which could point to their desire to fill every room with ‘good enough’ sound rather than to focus on the living room with ‘truly unbelievable’ sound. The HomePod itself never quite got to the level where it could act as a full home theater replacement, though paired in their multi-speaker configurations.\nThe HomePod research and production efforts will live on in some ways through Apple’s advanced audio rendering systems that led to things like Spatial Audio in AirPods. I quite enjoy the ones in my home and have yet to add any minis to the mix. Maybe a last minute hunt is in order.\nEarly Stage is the premier ‘how-to’ event for startup entrepreneurs and investors. You’ll hear first-hand how some of the most successful founders and VCs build their businesses, raise money and manage their portfolios. We’ll cover every aspect of company-building: Fundraising, recruiting, sales, product market fit, PR, marketing and brand building. Each session also has audience participation built-in – there’s ample time included for audience questions and discussion. Use code “TCARTICLE at checkout to get 20 percent off tickets right here.",
        "sentiment": 0.46020825478163635
    },
    "article_3": {
        "title": "Adobe officially releases Photoshop for Apple M1, says it’s 50% faster",
        "body": "Napier Lopez is a writer based in New York City. He's interested in all things tech, science, and photography related, and likes to yo-yo in (show all) Napier Lopez is a writer based in New York City. He's interested in all things tech, science, and photography related, and likes to yo-yo in his free time. Follow him on Twitter .\nAdobe today officially unveiled Photoshop for Apple’s M1 chip. According to the company, the ARM-compatible version should deliver “significant performance gains” for users on Apple’s custom silicon.\nWhile Adobe has had a beta version of Photoshop for M1 available since November, this is the first time it’s been available widely. Previously Apple users could run the Intel version through Apple’s Rosetta technology, which didn’t fully take advantage of the new chip’s power.\nThe M1 version of the app, Adobe claims, provides a 50% performance boost compared to analogous Intel Macs:\nOur internal tests show a wide range of features running an average of 1.5X the speed of similarly configured previous generation systems. Our tests covered a broad scope of activities, including opening and saving files, running filters, and compute-heavy operations like Content-Aware Fill and Select Subject, which all feel noticeably faster. Our early benchmarking also shows that some operations are substantially faster with the new chip.\nBe warned that there are a couple of recent features missing on the M1 version of the app, most notably inviting others to edit cloud documents and preset syncing.\nIt’s not clear how much faster the M1 version would be compared to current Intel chips, but it’s clear Adobe sees the benefit from moving to ARM architecture. “Don’t blink. You might miss the splash screen launching,” says Adobe\nFor more on these improvements, as well as new features for Photoshop on iPad, check out Adobe’s blog post here.",
        "sentiment": 0.23068028936783472
    },
    "article_4": {
        "title": "All 270 US Apple Stores are open for the first time since March 2020",
        "body": "Every Apple Store in the United States is open for the first time in nearly a year. It was 353 days ago — March 13, 2020 — that Apple closed all of its retail stores outside of Greater China.\nWhile some Apple Stores offer in-store shopping appointments and others can accept Express pickup of online orders only, all 270 US locations are now open in some capacity as of March 1, 2021. Apple Stores in Texas around Houston, Dallas, and San Antonio were the last to reopen today.\nOver the past 12 months, Apple Stores have weathered a rambling calendar of horrors that began when the pandemic hit. After starting to reopen from May 11, 2020, evolving health guidance and COVID-19 infection spikes forced some stores to reclose and reopen a second, third, or even fourth time.\nIf adapting and responding to new health and safety guidelines overnight wasn’t enough, Apple Stores were then confronted with looting and vandalism, an intense heatwave and wildfire smoke throughout California in the midst of curbside operations, Election Day and Inauguration Day security precautions, and severe winter storms in Texas that pushed back store reopenings in Austin by nearly a week.\nUS Apple Stores have reopened and closed again many times over the past year due to COVID-19.\nTo top it all off, rapidly evolving shopping trends and physical distancing have drained the life from many of the shopping centers and public squares Apple calls home. These are just a few of the most visible and intense challenges of the past 12 months. The miserable cocktail of unfortunate events has tested the spirits of Apple’s Retail teams and kept all US stores from reopening at any point before today.\nIn addition to reopening every store, Apple is also starting to offer in-store shopping at more US locations again after months of operation as Express storefronts. Around two dozen stores in California, Kentucky, New Jersey, New York, and Utah reintroduced shopping sessions today. That’s on top of almost 50 locations last week, more than 40 the week before, and dozens in early February.\nSpecial thank you to Míc Sun for graphing my Apple Store reopening data. Tap on the image to open fullscreen.\nToday’s milestone doesn’t mean we’re out of the woods yet. All Apple Stores still enforce health and safety guidelines that include reduced occupancy and a mask requirement. Apple continuously evaluates local COVID-19 conditions, and it’s highly possible that some stores could temporarily close or return to Express operations in the future.\nOutside of the US, just over a dozen Apple Stores remain closed in France and Brazil. Apple Stores in Mexico reopen March 2.\nFollow along on Twitter for daily Apple Store news, and swipe through these tips to make your Apple Store visit safe and successful:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.020318475025503532
    },
    "article_5": {
        "title": "Apple adopting the word ‘follow’ for podcasts as users associate ‘subscribe’ with paid content",
        "body": "With iOS 14.5, Apple introduced some interesting changes to the interface of the Podcasts app, which had already been improved with the release of iOS 14 last year. However, one small change that users may not have noticed is that Apple is now replacing the word “subscribe” with “follow” for podcasts.\nAs reported by Podnews, Apple will no longer associate the word “subscribe” with Podcasts. According to a research from Edison Research, about 47% of users associate “subscribe” with paid content. This results in fewer people using the Podcasts app because they don’t understand that the content is free.\nTom Webster from Edison Research says 47% of people who don’t currently listen to podcasts think that ‘subscribing’ to a podcast will cost money, describing it as a stone in the shoe of podcasting’s growth run. He tells Podnews: “Today, Apple, Spotify, and YouTube are the three most widely used services to play podcasts, and now the word Subscribe means ‘automatically download for free’ in exactly none of them.\nThis move also comes at an interesting time as rumors suggest that Apple is working on a new paid podcast platform. Although details are uncertain, not using the word “subscribe” for every podcast may also be related to this upcoming subscription podcast service.\nIn addition to the design improvements, Apple has been investing more and more in its Podcast app. Earlier this week, the company announced a partnership with Common Sense Media to highlight curated podcast suggestions for kids. Apple also introduced its first original podcast associated with an Apple TV+ show, For All Mankind.\nRead also:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.103628996626607
    },
    "article_6": {
        "title": "WWDC 2021 officially announced, iOS 15 expected",
        "body": "Apple has officially announced WWDC 2021 with the tagline “Glow and Behold.” This year, the conference will take place completely virtually starting June 7 through June 11. At WWDC 2021, Apple is likely to unveil the future of its software platforms, including iOS 15, macOS 12, watchOS 8, and more.\nThis marks the second year in a row that Apple will hold a virtual Worldwide Developers Conference due to the COVID-19 pandemic. The event will be free to all developers.\nWWDC 2021 details\nLast year, the all-virtual WWDC was widely praised for helping make the conference more inclusive for everyone, especially given the cost that is normally associated with traveling to San Jose, California, for the conference. Tim Cook touted that WWDC 2020 drew 22 million viewers across all of Apple’s streams. Apple was able to put together 72 hours of video content for developers and hold 4,500 person-to-person labs.\nHere’s what Apple says we can look forward to at WWDC 2021:\nThe Apple Worldwide Developers Conference is coming to a screen near you, June 7 to 11. Join the worldwide developer community for an all-online program with exciting announcements, sessions, and labs at no cost. You’ll get a first look at the latest Apple platforms, tools, and technologies — so you can create your most innovative apps and games yet.\nApple says that WWDC 2021 “will offer unique insight into the future of iOS, iPadOS, macOS, watchOS, and tvOS.”\nSusan Prescott, Apple’s vice president of developer relations, added the following in a press release:\n“We love bringing our developers together each year at WWDC to learn about our latest technologies and to connect them with Apple engineers. We are working to make WWDC21 our biggest and best yet, and are excited to offer Apple developers new tools to support them as they create apps that change the way we live, work, and play.”\nApple says that WWDC 2021 will include keynote and State of the Union events, online sessions, 1:1 labs for developers, and new ways for developers to interact with Apple engineers and designers.\nApple also says that, even though WWDC will take place virtually this year, it is committing $1 million to SJ Aspires, an education and equity initiative launched by the City of San Jose.\nWhat to expect at WWDC this year\nAs usual, we expect Apple to focus heavily on its software platforms at WWDC this year. This will likely include the announcement of iOS 15, iPadOS 15, watchOS 8, macOS 12, and tvOS 15. The company will also likely release developer betas of these new operating systems then as well.\nThis year, it’s also possible that WWDC includes new hardware announcements targeted at developers. Most notably, the company is in the process of transitioning the Mac lineup to Apple Silicon processors, and rumors suggest that new iMacs, MacBook Pros, and more are on the way.\nApple is also rumored to be developing a mixed-reality headset that could come as soon as 2022, and it’s possible that Apple teases this product at WWDC this year given that it will need developers to create apps and games for the headset. Apple will share additional program information in advance of WWDC21 through the Apple Developer app, on the Apple Developer website, and via email.\nWhat are you most excited to see at WWDC 2021 in June? Let us know down in the comments!\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.31310526457511717
    },
    "article_7": {
        "title": "Microsoft releases M1-native Visual Studio Code for developing apps",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nMicrosoft's app development software Visual Studio Code has been updated to run natively on Apple Silicon M1.\nMicrosoft's long-standing app development software, Visual Studio Code, has now been released a native M1 version that no longer requires Apple's Rosetta 2 to run.\n\"We are happy to announce our first release of stable Apple Silicon builds [with] this iteration,\" says Microsoft in a blog post about Visual Studio Code 1.54.1. \"Users on Macs with M1 chips can now use VS Code without emulation with Rosetta, and will notice better performance and longer battery life when running VS Code.\"\nMicrosoft thanks \"the community for self-hosting with the Insiders [test] build\" and for how they were \"reporting issues early in the iteration.\"\nBy default, downloading the macOS edition of Visual Studio Code gets a Universal version which contains both Intel and Apple Silicon code. However, Microsoft has also made available \"architecture-specific builds for Intel or Apple Silicon, which are smaller downloads compared to the Universal package.\"",
        "sentiment": 0.26755072735249996
    },
    "article_8": {
        "title": "Apple confirms iMac Pro will be discontinued when supplies run out.",
        "body": "Apple on late Friday evening added a \"while supplies last\" notice to its iMac Pro product page worldwide, and removed all upgrade options for the computer, leaving only the standard configuration available to order for now.\nWe've since confirmed with Apple that when supplies run out, the iMac Pro will no longer be available whatsoever. Apple says the latest 27-inch iMac introduced in August is the preferred choice for the vast majority of pro iMac users, and said customers who need even more performance and expandability can choose the Mac Pro.\nThe latest 27-inch iMac features a 5K display with True Tone and a nano-texture glass option, up to a 10-core 10th-generation Intel Core i9 processor, up to 128GB of RAM, up to 8TB of storage, up to AMD Radeon Pro 5700 XT graphics, a 10 Gigabit Ethernet option, a higher-resolution 1080p camera, improved speakers and microphones, and more.\nWhile the Intel-based 27-inch iMac is Apple's recommendation right now, rumors suggest that a redesigned iMac with a next-generation Apple silicon chip and a design inspired by Apple's high-end Pro Display XDR will be released later this year, so many customers may want to exercise patience. It's unclear if an Apple silicon version of the iMac Pro will ever be released, but it appears unlikely at this point.\nReleased in December 2017, the iMac Pro received no substantial hardware refreshes over its lifetime.",
        "sentiment": -0.09137035919619459
    },
    "article_9": {
        "title": "Former 'I'm a Mac' Actor Justin Long Throws Shade at M1 Apple Silicon in New Intel Ad Campaign",
        "body": "Intel has called on the services of former \"I'm a Mac\" actor Justin Long in a series of new ads in which Apple's latest custom-made M1 processors are cast as inferior to newer laptops powered by Intel processors.\nWell known for his role in Apple's popular \"Get a Mac\" TV ad campaign from the 2000s, Long stars in a series of ads called \"Justin Gets Real\" on Intel's YouTube channel, beginning each video by introducing himself as \"... a Justin – just a real person doing a real comparison between Mac and PC.\"\nIn one ad, Long promotes the flexibility of Windows laptops, specifically the Lenovo Yoga 9i versus a MacBook Pro. In another video, Long meets a PC user gaming on the MSI Gaming Stealth 15M laptop, powered by a Intel Core i7. Long then asks for a Mac, before swiftly agreeing with the PC user that \"no one games on a Mac.\"\nOther ads include Long throwing shade on Intel's behalf towards Apple's lack of touchscreen Macs, the inability to plug more than one external display into ‌M1‌ Macs, and the variety of different options available for laptops powered by Intel.\nIntel undertook a similar marketing campaign in February with a series of tweets highlighting the \"shortcomings\" of Apple's ‌M1‌ powered-Macs compared to Intel-powered computers. In November, Apple released its first Apple Silicon and is expected to fully transition its entire lineup away from Intel over the next couple of years.\nThis isn't the first time Long has featured in ad campaigns for Apple rivals. In 2017, the actor starred in a series of Huawei commercials promoting the company's Mate 9 smartphone.",
        "sentiment": -0.32237960123457016
    },
    "article_10": {
        "title": "Apple confirms it does not hold your Apple ID hostage due to missed Apple Card payment",
        "body": "Yesterday, we covered a story regarding Dustin Curtis’s experience with his Apple ID getting disabled when a payment to his Apple Card failed. Apple has today shared a statement with 9to5Mac clarifying the situation. The company says that Apple Card and Apple ID are not linked in the way that the blog post alleged, and the company does not disable Apple ID services because of missed Apple Card payments.\nThe situation arose because the trade-in process was left unresolved, and Apple was following its standard procedures in matters of money owed; this is not anything specific to the Apple Card. When an account is marked as in bad standing, use of Apple ID services is restricted; things like Apple Music or App Store purchases. iCloud is wholly separate and is not disabled at all. You can read Apple’s full statement on the matter after the break.\nWhen a customer makes a purchase using instant trade-in, the customer has around 14 days to send off the item to Apple. In most cases, the item is received and the sale completes.\nHowever, if the item is not received, Apple communicates with the customer over email and phone. If the trade-in is still not completed, Apple charges the trade-in value back to the customer’s payment method on file, on the account that was used to buy the product from the store originally. However, if that charge fails, the account is marked as being in bad standing. Customers are prompted on multiple occasions to fix the billing issue or supply an alternative payment method instead.\nIf the issue persists, Apple disables all paid services for that Apple ID until the money is recovered — as the account is essentially in debt. This means things like Apple Music, the iTunes Store, and the App Store. (iCloud services are not disabled, so customers can still access their personal data like photos.)\nIn Curtis’s case, the payment method used was his Apple Card. However, Apple’s statement affirms that the above steps are not related to the Apple Card at all; it’s just following its standard retail store policies when customers do not pay outstanding invoices in a timely fashion. There is no change in procedure because an Apple Card was used, it would be the same for all payment methods.\nHere’s Apple’s full statement:\nWe apologize for any confusion or inconvenience we may have caused for this customer. The issue in question involved a restriction on the customer’s Apple ID that disabled App Store and iTunes purchases and subscription services, excluding iCloud. Apple provided an instant credit for the purchase of a new MacBook Pro, and as part of that agreement, the customer was to return their current unit to us. No matter what payment method was used, the ability to transact on the associated Apple ID was disabled because Apple could not collect funds. This is entirely unrelated to Apple Card.\nObviously, Curtis was just trying to trade in his old laptop when buying an M1 Mac. For whatever reason, the trade-in process did not go through and was left unresolved. But, the consequences of that are unrelated to the fact he used an Apple Card to pay.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.39686063677072525
    },
    "article_11": {
        "title": "iPhone Sticking With Lightning Port Over USB-C for 'Foreseeable Future'",
        "body": "Apple will retain the Lightning connector on the iPhone for the \"foreseeable future,\" with no intention of switching to USB-C, according to reliable analyst Ming-Chi Kuo.\nIn spite of much of the industry moving toward USB-C, Apple will not be using it to replace the Lightning connector on the iPhone 13, or indeed on any ‌iPhone‌ model for the time being. In a note seen by MacRumors yesterday, Kuo explained that Apple is reluctant to move to USB-C since it is a free, open standard, as well as less waterproof than Lightning.\nWe believe that USB-C is detrimental to the MFi business's profitability, and its waterproof specification is lower than Lightning and MagSafe.\nCurrently, Apple is able to strictly regulate the quality of Lightning cables and accessories through its Made for ‌iPhone‌ (MFi) program. MFi also generates a significant amount of income for the company since third-party manufacturers have to pay Apple a considerable commission to make Lightning cables or accessories.\nApple has used the Lightning connector on every ‌iPhone‌ since the ‌iPhone‌ 5 in 2012, but it has transitioned several of its devices to USB-C, including the iPad Pro, MacBook Pro, MacBook Air, and most recently, the iPad Air. With the need to connect to external drives being less pressing and some USB-C features such as external display connectivity outright impossible on an ‌iPhone‌, Apple is understandably less motivated to switch to USB-C on its most profitable product for MFi.\nTransitioning the ‌iPhone‌ to USB-C this year would also leave a significant number of devices such as the entry-level iPad, iPad mini, AirPods, and a plethora of accessories such as the Magic Trackpad and MagSafe Duo charger, stuck with a connector that would no longer be widely used on any flagship products. Switching the ‌iPhone‌ to USB-C may, therefore, tip the scales against Lightning across Apple's product lineup, potentially forcing the company to phase out the connector entirely across a large number of products sooner than it wants to.\nAmid rumors of a portless iPhone, Kuo clarified that Apple is more likely to switch directly to a portless model rather than first change to USB-C:\nIf the iPhone abandons Lightning in the future, it may directly adopt the portless design with MagSafe support instead of using a USB-C port.\nIn spite of this, Kuo stated that ‌MagSafe‌ wireless charging technology is not yet ready to displace a wired port, having only debuted as recently as October 2020 on the iPhone 12 lineup. ‌MagSafe‌ is currently unable to transfer data, complete a device recovery, or take diagnostics, which would seemingly be essential features on a future ‌iPhone‌ with no ports.\nAt present, the MagSafe ecosystem is not mature enough, so the iPhone will continue to use the Lightning port in the foreseeable future.\nOverall, this means that Apple is intending to stick with the Lightning connector for the upcoming iPhone 13 at minimum, but could well extend to models beyond that, too.\nKuo's recent spate of reports about the future of the ‌iPhone‌ included the speculation that in 2022, at least some ‌iPhone‌ models will abandon the notch and switch to a \"punch-hole display design\" instead, and in 2023, Apple may unveil a 7.5–8 inch foldable iPhone.",
        "sentiment": -0.009522722568362951
    },
    "article_12": {
        "title": "Android sends 20x more data to Google than iOS sends to Apple, study says",
        "body": "This post has been updated to report objections researcher Doug Leith had to Google's critique of his research.\nWhether you have an iPhone or an Android device, it’s continuously sending data including your location, phone number, and local network details to Apple or Google. Now, a researcher has provided a side-by-side comparison that suggests that, while both iOS and Android collect handset data around the clock—even when devices are idle, just out of the box, or after users have opted out—the Google mobile OS collects about 20 times as much data as its Apple competitor.\nBoth iOS and Android, researcher Douglas Leith from Trinity College in Ireland said, transmit telemetry data to their motherships even when a user hasn’t logged in or has explicitly configured privacy settings to opt out of such collection. Both OSes also send data to Apple and Google when a user does simple things such as inserting a SIM card or browsing the handset settings screen. Even when idle, each device connects to its back-end server on average every 4.5 minutes.\nApps and more\nIt wasn’t just the OSes that sent data to Apple or Google. Pre-installed apps or services also made network connections, even when they hadn’t been opened or used. Whereas iOS automatically sent Apple data from Siri, Safari, and iCloud, Android collected data from Chrome, YouTube, Google Docs, Safetyhub, Google Messenger, the device clock, and the Google search bar.\nThe table below shows a summary of handset data sent to Apple or Google when the user isn’t logged in:\nWhere Android stands out, Leith said, is in the amount of data it collects. At startup, an Android device sends Google about 1MB of data, compared with iOS sending Apple around 42KB. When idle, Android sends roughly 1MB of data to Google every 12 hours, compared with iOS sending Apple about 52KB over the same period. In the US alone, Android collectively gathers about 1.3TB of data every 12 hours. During the same period, iOS collects about 5.8GB.\nAdvertisement\nGoogle disagrees\nGoogle has contested the findings, saying that they’re based on faulty methods for measuring the data that’s collected by each OS. The company also contended that data collection is a core function of any Internet-connected device.\nIn a statement, a spokesperson wrote:\nWe identified flaws in the researcher's methodology for measuring data volume and disagree with the paper’s claims that an Android device shares 20 times more data than an iPhone. According to our research, these findings are off by an order of magnitude, and we shared our methodology concerns with the researcher before publication. This research largely outlines how smartphones work. Modern cars regularly send basic data about vehicle components, their safety status and service schedules to car manufacturers, and mobile phones work in very similar ways. This report details those communications, which help ensure that iOS or Android software is up to date, services are working as intended, and that the phone is secure and running efficiently.\nOn background (meaning Ars isn’t permitted to name or quote the spokesperson), the representative said that it’s inaccurate to say that a user can opt out of all telemetry data collection by the Google OS. The Android Usage and Diagnostics checkbox doesn’t cover telemetry data that Google considers essential for the device to operate normally. Telemetry information collected by the Device Configuration service, for instance, is required for updating and patching the OS.\nThe spokesperson also challenged the methods the researcher used to measure the amount of data collected by iOS. The experimental setup they used didn’t capture certain types of data, such as UDP/QUIC traffic, which is commonly transmitted by smartphones.\nIn an email sent after this post went live, Leith said the response \"does not accurately characterise the interactions that I’ve had with Google\" and in his view was \"positively misleading.\" He said he contacted Google to ask for a correction. On Friday, the Google spokesperson said the company had no plans to retract the statement. The spokesperson added that the company thinks the majority of Leith's research is accurate.\nAdvertisement\nAn Apple spokesperson also spoke on the condition it be background. The spokesperson said that Apple provides transparency and control for personal information it collects, that the report gets things wrong, that Apple offers privacy protections that prevent Apple from tracking user locations, and that Apple informs users about the collection of location-related data.\nRound-the-clock collection\nLeith performed his measurements using a Google Pixel 2 running Android 10 and an iPhone 8 running iOS 13.6.1. The iPhone was jailbroken using the Checm8 exploit. The Pixel had Google Play services enabled.\nIn all, the study, available here, measured the amount of data the devices collected:\non first startup following a factory reset\nwhen a SIM was inserted or removed\nwhen a handset was idle\nwhen the settings screen was viewed\nwhen location was enabled or disabled\nwhen the user logged in to the pre-installed app store\nLeith said the data collection by both OSes is concerning because it’s readily linked to a user’s name, email address, payment card data, and possibly to other devices the user has. What’s more, the constant connections to back-end servers necessarily reveals the IP address of the device and, by extension, the general geographic location of the user.\n“Currently there are few, if any, realistic options for preventing this data sharing,” Leith wrote.\nPost updated to add comment from Apple and later to add follow-up reaction from the researcher and Google.",
        "sentiment": -0.22255597376497463
    },
    "article_13": {
        "title": "Apple CEO Tim Cook 'can't wait' for employees to return to Apple Park",
        "body": "Credit: Apple\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple CEO Tim Cook says he \"can't wait\" for employees to return to in-person work as the company charts a course to make that happen.\nIn an interview with People covering topics ranging from his personal routine to a post-pandemic return to the office, Cook touted the benefits of in-person interaction for Apple staffers\n\"My gut says that, for us, it's still very important to physically be in touch with one another because collaboration isn't always a planned activity. Innovation isn't always a planned activity,\" Cook said. \"It's bumping into each other over the course of the day and advancing an idea that you just had. And you really need to be together to do that.\"\nThe Apple chief executive said that he expects the company to implement a \"hybrid environment\" within the coming months. He admitted, however, that the company is figuring out how to maintain social distancing with the open office floor plan at Apple Park.\nWhen the coronavirus pandemic first hit in 2020, Apple and other technology companies were among the first to move to remote work. Cook was quick to point out how much Apple accomplished, even while maintaining social distancing.\n\"You look back, and the shutdown occurred in mid-March. Post that, we had this enormous, prolific product period, [introducing] the first 5G iPhone. We introduced the M1 chip in the Mac. These are major, major accomplishments,\" Cook said.\nOther endeavors that Apple embarked on during the pandemic include a $100 million racial justice initiative and a pledge to become carbon-neutral by 2030.\n\"We did all of that while reinventing the way we were working. We're very much an in-person team because we believe that's best for collaboration. But we knew that was no longer possible, or not possible for this period of time. And so we had to reinvent ourselves. And I really give the team credit for really rising to the occasion,\" Cook said.\nEven after the pandemic is over, Cook says that the company has \"realized and learned that are some things that are perfectly great to do virtually across Zoom or WebEx, whatever, or FaceTime, whatever you might have.\"",
        "sentiment": 0.37400654286500956
    },
    "article_14": {
        "title": "Apple Maps could soon be able to tell you how busy a business is based on anonymous location data",
        "body": "We’ve already detailed a handful of new features coming to Apple Maps in iOS 14.5, including Waze-style reporting and hazard features. Now, it also appears that Apple is working on a new feature to show users how busy a particular point of interest is before they visit.\nAs first spotted by a user on Reddit, Apple has updated its Privacy menu in the Location Services part of the Settings app to describe a new feature that would use location data to aggregate details about how busy a point of interest is.\nApple explains that this privacy-preserving feature would use anonymous location data to “let users know” if a point if interest is open and busy. The data would be collected when you “open an app near a point of interest.” This makes it somewhat unclear whether the feature would be based around Apple Maps data or third-party apps.\nThe full explanation from Apple is as follows:\nRouting and Traffic: While you are in transit (for example, walking or driving), your iPhone will periodically send GPS data, travel speed, and barometric pressure information in an anonymous and encrypted form to Apple, to be used for augmenting crowd-sourced road traffic and atmospheric correction databases. Additionally, when you open an app near a point of interest (for example, a business or park) your iPhone will send location data in an anonymous and encrypted form to Apple which Apple may aggregate and let users know if that point of interest is open and how busy it is.\nIf this feature sounds familiar, it’s because Google already offers a similar feature via Google Search and Google Maps, referred to as “live visit data.” You’ve probably seen this feature before in the form of a bar graph that shows estimated popular times and live data. It’s unclear how Apple would implement the feature.\nIt’s unclear when Apple plans to roll out this new real-time crowd data feature to Apple Maps, but it’s not available in the current beta of iOS 14.5. It’s possible that a future beta adds it, or that Apple is saving it for a later release altogether.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.0913347934683164
    },
    "article_15": {
        "title": "iPhone 13 Pro Lineup Rumored to Include Matte Black Option, New Anti-Fingerprint Coating for Stainless Steel Edges",
        "body": "Despite being months away from launch, we've already seen several rumors regarding the 2021 iPhone. Now, as we inch closer to release nonetheless, new rumors point towards some design changes, new colors, and new features to expect.\nAccording to leaker Max Weinbach (via YouTube channel EverythingApplePro), the iPhone 13 will come with a matte black option for the Pro and Pro Max models, a new stainless steel coating that reduces smudges and fingerprints, a new rear-camera design, and improved noise cancelation with beamforming for phone calls.\nLast month, Weinbach reported that Apple plans to include an always-on display for this year's new ‌iPhone‌ as part of its design. He's now building on that rumor, saying that on top of an always-on 120Hz display, Apple is likely to include a matte black option for the iPhone 13 Pro and ‌iPhone 13 Pro‌ Max.\nWeinbach says the color is a \"redesigned graphite\" but is \"borderline black.\" According to Weinbach, Apple is also experimenting with an orange, almost bronze-like color for the new iPhones, but he says it's unlikely to launch.\nThe iPhone 12 lineup brought back the beloved flat-edged design, as well as stainless steel edges for the 12 Pro and 12 Pro Max. Since the models were launched, users have complained about the ability of the edges to attract smudges and fingerprints, especially for lighter-colored options like Gold. Apple's looking to address the issue with the ‌iPhone 13‌ by adopting a new anti-smudge and fingerprint coating, according to Weinbach.\nMoving to the rear, Weinbach says the new camera module will not be completely flat but that each lens will protrude less from the main body. Additionally, the immediate run-up to the camera module will be smaller, reducing the camera system's thickness entirely.\nAlongside a suite of previously rumored features, the ‌iPhone 13 Pro‌ and 13 Pro Max camera system will include a new process for taking portrait photos. Weinbach reports that portrait mode on the new Pro iPhones will rely significantly on LiDAR. LiDAR, currently on the ‌iPhone 12‌ Pro, Pro Max, and iPad Pro, is used for improved low-light image photography. However, Weinbach says Apple will take it a step further with portrait mode this year.\nPortrait mode on the new iPhones will be overhauled greatly. It will now rely heavily on a new process that combines both data from the lenses as well as LiDAR. LiDAR is specifically going to be used for much better edge detection. Things like smaller gaps in street signs are now supposed to be detected by the new process. This goes with portrait video as portrait mode overhaul that Apple is working on for the 2021 iPhones.\nWeinbach says that within iOS itself, Apple will also include a new iOS \"image stabilization correction\" mode that will automatically detect and keep a subject in focus during a video. Given this is software-based, it's unknown if special hardware within the 2021 iPhones enables this mode or whether it could silently debut in older ‌iPhone‌ models.\nAs for the lineup itself, Weinbach says Apple plans to keep the 5.4-inch iPhone 13 mini form factor in its lineup, despite widespread reporting of the iPhone 12 mini's lackluster sales performance. With the ‌iPhone 13‌ mini, Apple is looking to improve battery life, a significant point of concern for customers who enjoy the smaller form factor. Weinbach says the battery itself will be larger and that longer battery life will further be improved thanks to the efficiency of the A15 chip.\nWeinbach previously stated that the new iPhones would include stronger MagSafe, astrophotography capabilities, and the ability to take portrait mode videos.\nEarlier this week, images sent to MacRumors show alleged photos of the front glass panels for the ‌iPhone 13‌ models, which show the earpieces relocated to the top bezel. If true, it would be the most significant change to the notch's design since its debut in the ‌iPhone‌ X. Apple analyst Ming-Chi Kuo says Apple plans to switch to a hole-punch design for some iPhone models starting in 2022.",
        "sentiment": -0.004610240780587854
    },
    "article_16": {
        "title": "iMac Pro Officially Discontinued, Removed From Apple's Site and No Longer Available for Purchase",
        "body": "The iMac Pro has been officially discontinued as of this afternoon, with the machine no longer available for purchase from the online Apple Store.\nThe ‌iMac‌ Pro went out of stock in the United States and other countries earlier today, and now, the ‌iMac‌ Pro page has been removed entirely from Apple's website.\nWith the ‌iMac‌ Pro page eliminated, there is no longer an option to buy an ‌iMac‌ Pro in the United States or in any other country, and the machine is no longer listed in the ‌Apple Store‌ app, nor does a search bring up ‌iMac‌ Pro listings.\nApple has also changed the Mac compatibility filter for the ‌iMac‌ Pro to say \"2017\" instead of \"2017 and later,\" making it clear that there will be no more ‌iMac‌ Pro models in the future.\nApple first announced plans to discontinue the ‌iMac‌ Pro in early March, and said at the time that the ‌iMac‌ Pro would be available for purchase \"while supplies last,\" but supplies have apparently dried up.\nThough Apple has removed the ‌iMac‌ Pro from its website following its discontinuation, there are still a variety of ‌iMac‌ Pro models available from Apple's refurbished store.\nApple recommends that users who are looking for a high-end Mac choose the 27-inch ‌iMac‌, which was last refreshed in August 2020. The current 27-inch ‌iMac‌ configured with a 10-core Core i9 processor is faster and more affordable than the standard ‌iMac‌ Pro with a 10-core Xeon W processor was.\nApple is also working on a redesigned iMac that will feature slimmer bezels, a Pro Display XDR-style design, and Apple silicon chips, so those who are seeking a powerful desktop machine may want to wait until the new ‌iMac‌ models come out later this year before making a purchase.",
        "sentiment": -0.0690333019528124
    },
    "article_17": {
        "title": "Apple says app tracking transparency policies will be applied globally, following reports that Chinese ad networks are trying to skirt the rules",
        "body": "In a statement, Apple said that its upcoming App Tracking Transparency rules will be applied to all developers equally, worldwide.\nThis follows reports that the state-backed Chinese Advertising Association had developed workarounds and was encouraging adoption of ‘CAID’ identifiers as an alternative, if the user opts out of allowing IDFA collection.\nApp Tracking Transparency (ATT) is multi-faceted. At a technical level, it requires an app to show a permissions dialog and get explicit consent from the user to collect what is called an IDFA identifier.\nThe IDFA allows ad networks to identify the same user device across apps from different developers, as the reported IDFA does not change.\nHowever, Apple’s policy for ATT is not just limited to IDFA collection. Apple’s rules say that an app cannot do cross-app tracking of any kind without getting explicit permission first. At a technical level, the operating system can only guarantee that IDFAs cannot be collected without permission, but the App Store rules apply even more widely.\nThis second part will be enforced by App Review process. If Apple finds apps that are tracking users without consent when ATT comes into effect, they risk their app being removed from the App Store altogether.\nIt remains to be seen how consistently and rigorously this will happen in practice, although Apple’s latest statement suggests they will take any violations seriously.\nA firm date for when App Tracking Transparency comes into effect has not yet been announced by Apple, but it is expected to arrive alongside the release of iOS 14.5 in the next few weeks. ATT remains controversial as advertising-dependent businesses worry they won’t be able to make as much money if they are no longer able to do effective personalized ad tracking. Apple says they are putting user privacy first.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.24047617154428735
    },
    "article_18": {
        "title": "Apple Now Able to Repair an iPhone 12 Pro's Cracked Rear Glass Without Replacing the Entire Device",
        "body": "Last month, MacRumors reported that Apple was introducing a new same-unit repair method for iPhone 12 mini and iPhone 12 models exhibiting certain issues that would typically require a whole-unit replacement. Now, we've learned that Apple has extended these same-unit repairs to the iPhone 12 Pro and iPhone 12 Pro Max.\nApple Stores and Apple Authorized Service Providers have access to a new \"iPhone Rear System\" part that is essentially an iPhone enclosure that includes all components except the display and rear camera. As of this week, this part is available for all four iPhone 12 models, according to an Apple memo obtained by MacRumors.\nIf a customer has an iPhone 12 Pro with cracked rear glass, for example, an Apple Store or Apple Authorized Service Provider is able to replace the entire rear portion of the device with the iPhone Rear System part, while retaining the customer's original display and rear camera. For this reason, the iPhone's display and rear camera must be free of damage or issues in order for the device to qualify for a same-unit repair.\niPhone 12 models may be eligible for a same-unit repair if they are unable to be powered on, or are experiencing issues with the logic board, Face ID system, or the enclosure of the device, such as cracked rear glass, according to Apple. The new repair method is said to be available in all countries and regions where iPhone 12 models are sold.\nIn its memo, Apple reiterated that this move supports the company's ongoing commitment to reducing the carbon footprint of every product it sells.",
        "sentiment": 0.012305523165398173
    },
    "article_19": {
        "title": "Apple adds two brand new Siri voices and will no longer default to a female voice in latest iOS",
        "body": "Apple adds two brand new Siri voices and will no longer default to a female or male voice in iOS\nApple is adding two new voices to Siri’s English offerings, and eliminating the default “female voice” selection in the latest beta version of iOS. This means that every person setting up Siri will choose a voice for themselves and it will no longer default to the voice assistant being female, a topic that has come up quite a bit with regards to bias in voice interfaces over the past few years.\nThe beta version should be live now and available to program participants.\nI believe that this is the first of these assistants to make the choice completely agnostic with no default selection made. This is a positive step forward as it allows people to choose the voice that they prefer without the defaults bias coming into play. The two new voices also bring some much needed variety to the voices of Siri, offering more diversity in speech sound and pattern to a user picking a voice that speaks to them.\nIn some countries and languages Siri already defaults to a male voice. But this change makes the choice the users’ for the first time.\n“We’re excited to introduce two new Siri voices for English speakers and the option for Siri users to select the voice they want when they set up their device,” a statement from Apple reads. “This is a continuation of Apple’s long-standing commitment to diversity and inclusion, and products and services that are designed to better reflect the diversity of the world we live in.”\nThe two new voices use source talent recordings that are then run through Apple’s Neural text to speech engine, making the voices flow more organically through phrases that are actually being generated on the fly.\nI’ve heard the new voices and they sound pretty fantastic, with natural inflection and smooth transitions. They’ll be a welcome addition of choice to iOS users. Here are some samples of the voices in action:\nHere’s a recording of Siri’s new lineup of American voices in iOS 14.5. Voices 1 and 4 are the existing ones, voices 2 and 3 are the new ones. pic.twitter.com/6emei4B3Z9 — John Gruber (@gruber) April 1, 2021\nThis latest beta also upgrades the Siri voices in Ireland, Russia and Italy to Neural TTS, bringing the total voices using the new tech to 38. Siri now handles 25 billion requests per month on over 500 million devices and supports 21 languages in 36 countries.\nThe new voices are available to English-speaking users around the world and Siri users can select a personal preference of voice in 16 languages.\nIt seems very likely that these two new voices are just the first expansion in Siri’s voice selections. More diversity in voice, tone and regional dialect can only be a positive development for how inclusive smart devices feel. Over the past few years we have finally begun to see some movement from Amazon, Google and Apple to aggressively correct situations where the assistants have revealed bias in their responses to queries that use negative or abusive language. Improvements there, as well as in queries on social justice topics and overall accessibility improvements, are incredibly key as we continue to see an explosion of voice-first or voice-native interfaces. These kinds of choices matter, especially at a scale of hundreds of millions of people.\nArticle updated to note that in some countries and languages Siri currently defaults to a male voice.",
        "sentiment": 0.3862040629610419
    },
    "article_20": {
        "title": "Apple’s new Find My feature could let you know if you’re the one being tracked",
        "body": "Apple’s Find My app might get a new safety feature to help prevent someone from using the kinds of devices tracked in the app to stalk you instead. “Item Safety Alerts”, spotted in the iOS 14.5 beta, will notify you if an unknown device being tracked on Find My is “moving with you” so you can remove it or disable it, 9to5Mac reports.\nThe feature seems designed to counteract a scenario where a Find My-compatible device is hidden in a pocket or bag and then used to track someone’s movements. The Item Safety Alerts setting was found in early versions of iOS 14.3, according to AppleInsider, but was removed until its reappearance in iOS 14.5. The setting is enabled by default in the beta and Apple seems to want it to stay on. If you turn off the setting off, the system will warn you that unknown devices can see your location without you being notified, Apple blogger Benjamin Mayo shared on Twitter.\nAddressing the risk of stalking in Find My is newly important because of Apple’s plans to open up the app to third-party accessories. Hiding an iPhone, iPad, or MacBook in someone’s bag to track them is difficult, but a small keychain-sized device like Samsung’s Galaxy SmartTag or Tile’s upcoming ultra wideband (UWB) tracker could be a lot easier. Apple’s rumored AirTags could also be a candidate for misuse, and reintroducing this feature into iOS might mean they’re on their way to release.\nFind My settings screen with ‘Item Safety Alerts’ turned on. Image: 9to5Mac\nWhat is UWB? Ultra-wideband just means high-frequency radio communications above 500MHz, but it now refers to two specific ideas: UWB is a standard where devices broadcast short, low-power pulses to reveal and securely verify their location. It’s useful for item trackers, digital car keys, and to keep robots from bumping into each other. 5G UWB is a marketing term for short-range, high-speed cellular internet connections that operate at millimeter-wave frequencies.\nWhile it’s not necessarily as powerful as a GPS beacon with a cellular radio, Apple’s Find My network may have more reach than you’d think. If an Apple device comes near one of these supported trackers, it can update its location, even if the tracker doesn’t have its own connection to the internet. Tile’s “Community Find” feature works similarly. AirTags could theoretically expand the reach and precision even more, with an added UWB signal in the tag that can make items easier to find behind walls and in other rooms.",
        "sentiment": 0.1216635149386194
    },
    "article_21": {
        "title": "Apple Watch ECG Feature Gets Approved in Australia",
        "body": "The Australian government has approved ECG functionality on the Apple Watch, giving Apple the all-clear to launch the feature for Apple Watch users in the country, according to a regulatory document first spotted by The 8-Bit.\nEarlier last month, the Apple Watch's irregular heart rhythm notification received approval in Australia, although ECG did not. Irregular heart rhythm is a feature that periodically reads your heart rhythm in the background and alerts you if it detects signs of atrial fibrillation (AFib). Both parts work in tandem as users who receive an irregular heart rhythm notification are advised to take an ECG for a more accurate and comprehensive understanding of their heart condition.\nWith regulator hurdles now out of the way, it's unclear when Apple will roll the feature out for users in Australia. Apple is currently testing watchOS 7.5, and although there's been no indication thus far, the update could include support for ECG in Australia. watchOS 7.4 is expected to debut in the early spring alongside iOS 14.5, which will introduce the ability to unlock an iPhone with an Apple Watch, amongst other features.",
        "sentiment": 0.2407344537121909
    },
    "article_22": {
        "title": "iPhone 13 Front Glass Reveals Smaller Notch With Earpiece Relocated to Top Bezel",
        "body": "iPhone 13 models are widely expected to feature a smaller notch, and we are able to share a first look at the potential design.\nGreek repair provider iRepair has provided MacRumors with an alleged photo of front glass panels for iPhone 13 models, with the same three 5.4-inch, 6.1-inch, and 6.7-inch display sizes as the iPhone 12 lineup. The notch on each iPhone is visibly smaller as a result of the earpiece speaker being moved up into the top bezel, a design choice that was first rumored for iPhone 12 models last year but failed to materialize.\nApple analyst Ming-Chi Kuo and a few other sources previously claimed that a few Face ID components will be consolidated in iPhone 13 models, resulting in a smaller notch, but they did not mention the earpiece being repositioned.\nThe notch's design has gone unchanged since it debuted on the iPhone X in 2017. After shrinking the notch this year, Kuo said that Apple plans to switch to a hole-punch display design for at least some 2022 iPhone models, similar to Samsung's Galaxy S21 and other recent smartphones, followed by an iPhone with a true all-screen design without a notch or holes and an under-display fingerprint scanner as early as 2023.\nBeyond the notch, iPhone 13 models are expected to have a virtually identical design as iPhone 12 models, with key new features rumored to include a 120Hz display on Pro models, larger batteries, a faster A15 chip, and camera improvements. Apple is expected to unveil the iPhone 13 lineup in September, marking a return to its usual launch timeframe.",
        "sentiment": -0.18462271441239864
    },
    "article_23": {
        "title": "Jason Sudeikis Wins Best Comedy Actor for Ted Lasso — Golden Globes 2021",
        "body": "That son of a biscuit actually did it! Titular Ted Lasso star Jason Sudeikis scored Best Actor in a Comedy Series honors at Sunday’s 78th Annual Golden Globe Awards for his work in the Apple TV+ comedy.\nThe actor prevailed over fellow nominees Don Cheadle (Black Monday), Nicholas Hoult (The Great), Eugene Levy (Schitt’s Creek) and last year’s victor Ramy Youssef (Ramy).\n“I want to give a shoutout to all the people I get to act with because they’re incredible,” a hoodie-wearing Sudeikis said in his somewhat rambling acceptance speech. “Do they make me the best? No. But I know for a fact they make me better. Better than I am, better than I thought I could be and better than anything I could do.”\nTed Lasso — which was based on a series of Sudeikis-fronted promos for NBC Sports that aired in 2013 — was renewed for a second season just days after its Aug. 14 premiere; a Season 3 pickup came in late October, as Apple TV+ claimed that Ted Lasso was setting completion records for an original series.\nBack in August, series co-creator Bill Lawrence told TV’s Top 5 podcast that future seasons would not incorporate the ongoing coronavirus pandemic, in order to keep providing viewers with “escapist entertainment.”\nProduction on Season 2 commenced in mid-January.",
        "sentiment": 0.4755930902125935
    },
    "article_24": {
        "title": "Apple Maps speed camera feature now rolling out to more countries",
        "body": "Update: So far, we’re aware of Australia, Austria, Belgium, Brazil, the Netherlands, New Zealand, Norway, Sweden and Taiwan.\niOS 14 saw the introduction of Apple Maps speed camera alerts, but this was initially limited to the US, UK, and Ireland. We’re now seeing it rolling out to a number of additional countries.\nApple bills the feature as a warning to anticipate slowing traffic …\nA helpful heads-up to slow down. Maps lets you know when you’re approaching speed cameras and red‑light cameras along your route so you can anticipate potential slowing traffic ahead. You can also see where individual cameras are located on the map.\nDutch site iCulture reported the feature appearing in the Netherlands and Belgium.\nThe speed cameras in Apple Maps were only visible in a limited number of countries, but iCulture reader Chris discovered that they are now also visible in the Netherlands. The iCulture editors have checked this and can confirm that Apple Maps now also shows cameras in the Netherlands. There are also reports that the speed cameras are visible in Belgium. While navigating with Apple Maps, you will see a yellow icon with a camera in the location of a speed camera. We have at least seen the location of cameras in the Haarlem region. The function may be rolled out even further, so you will not see it everywhere. You will only see the cameras during route guidance. Tweets show that the speed cameras are also available in Belgium.\nTwitter users are reporting seeing the feature in Australia and New Zealand also. Please let us know in the comments if you’re seeing it in your country.\niCulture reports that speed cameras are only shown while actively using Apple Maps to navigate, and suggests that there is no actual alert – they are only shown on the map.\nThe location of speed cameras can be seen both in CarPlay (including the CarPlay Dashboard) and on the iPhone if you only navigate with them. A disadvantage is that it is not clear from the app what type of camera is present. Apple Maps only shows that there is a speed camera. In our test, we did not receive any notification of the speed camera and there was no announcement that you are approaching a speed camera.\nHowever, some Twitter users are reporting getting alerts.\nApple Maps doesn’t yet show the actual speed limit applying to the stretch of road where cameras are present.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.2130229976028204
    }
}