{
    "article_0": {
        "title": "Tim Cook says employees who leak memos do not belong at Apple, according to leaked memo",
        "body": "Dear Team,\nIt was great to connect with you at the global employee meeting on Friday. There was much to celebrate, from our remarkable new product line-up to our values driven work around climate change, racial equity, and privacy. It was a good opportunity to reflect on our many accomplishments and to have a discussion about what’s been on your mind.\nI’m writing today because I’ve heard from so many of you were were incredibly frustrated to see the contents of the meeting leak to reporters. This comes after a product launch in which most of the details of our announcements were also leaked to the press.\nI want you to know that I share your frustration. These opportunities to connect as a team are really important. But they only work if we can trust that the content will stay within Apple. I want to reassure you that we are doing everything in our power to identify those who leaked. As you know, we do not tolerate disclosures of confidential information, whether it’s product IP or the details of a confidential meeting. We know that the leakers constitute a small number of people. We also know that people who leak confidential information do not belong here.\nAs we look forward, I want to thank you for all you’ve done to make our products a reality and all you will do to get them into customers’ hands. Yesterday we released iOS 15, iPadOS 15, and watchOS 8, and Friday marks the moment when we share some of our incredible new products with the world. There’s nothing better than that. We’ll continue to measure our contributions in the lives we change, the connections we foster, and the work we do to leave the world a better place.\nThank you,\nTim",
        "sentiment": 0.2884258662816137
    },
    "article_1": {
        "title": "This is iPhone 13 Pro: 120Hz ProMotion display, Sierra Blue color, A15 Bionic, more",
        "body": "Following the introduction of the iPhone 13, Apple has also unveiled the iPhone 13 Pro and iPhone 13 Pro Max. The iPhone 13 Pro and iPhone 13 Pro Max will be available in a new light blue color for the first time, and they the first ProMotion displays in the iPhone lineup…\niPhone 13 Pro comes in sierra blue, graphite, gold, and silver\n20% smaller true depth camera system on the front\nStainless steel bands, just like before\nPowered by A15 Bionic\nProMotion display technology that can refresh from 10Hz to 120Hz\nUnfortunately, no always-on display\nApple says the iPhone 13 Pro and Pro Max feature the “biggest camera enhancement ever”\n77mm telephoto camera with 3x optical camera\nUltra Wide camera with 92% boost in low light , f/1.8 aperture, auto-focus, 6-element lens\nWide camera: f/1.5 aperture, up to 2.2x improvement in low light\nNew macro photography features for the iPhone 13 Pro and iPhone 13 Pro Max\nNight mode available across all three lenses\nNew camera filter options, “Photographic Styles” will be available on iPhone 13 and iPhone 13 Pro\niPhone 13 Pro features Cinematic Mode for video, which is basically the same thing as Portrait Mode but for video. Other features include focus tracking and the ability to adjust the focus after recording\nMacro slow mo video recording on ultra wide camera\nProRes video coming to iPhone 13 Pro later this year\niPhone 13 Pro offers 1.5 hours longer battery life than iPhone 12 Pro, while iPhone 13 Pro Max offers 2.5 hours longer battery life than iPhone 12 Pro Max.\niPhone 13 Pro starts at $999, while iPhone 13 Pro Max starts at $1099. Storage options include 128GB, 256GB, 512GB, and 1TB\nKeep up with everything Apple announces at its September event in our live news hub.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.055384517780372074
    },
    "article_2": {
        "title": "Apple delays rollout of CSAM detection feature, commits to making improvements",
        "body": "Last month, Apple announced a handful of new child safety features that proved to be controversial, including CSAM detection for iCloud Photos. Now, Apple has said they will “take additional time” to refine the features before launching to the public.\nIn a statement to 9to5Mac, Apple said:\n“Last month we announced plans for features intended to help protect children from predators who use communication tools to recruit and exploit them, and limit the spread of Child Sexual Abuse Material. Based on feedback from customers, advocacy groups, researchers and others, we have decided to take additional time over the coming months to collect input and make improvements before releasing these critically important child safety features.”\nApple’s new child safety features were set to launch as part of updates to iOS 15, iPadOS 15, and macOS Monterey later this year. There is now no word on when the company plans to roll out the features. Apple’s statement today does not provide any details on what changes the company could make to improve the system.\nAs a refresher, here’s the basics of how the CSAM detection system would work as currently designed:\nApple’s method of detecting known CSAM is designed with user privacy in mind. Instead of scanning images in the cloud, the system performs on-device matching using a database of known CSAM image hashes provided by NCMEC and other child safety organizations. Apple further transforms this database into an unreadable set of hashes that is securely stored on users’ devices. Before an image is stored in iCloud Photos, an on-device matching process is performed for that image against the known CSAM hashes. This matching process is powered by a cryptographic technology called private set intersection, which determines if there is a match without revealing the result. The device creates a cryptographic safety voucher that encodes the match result along with additional encrypted data about the image. This voucher is uploaded to iCloud Photos along with the image.\nUpon announcement, the new CSAM detection technology received quite a bit of pushback and criticism from privacy advocates. Apple, however, doubled down on the feature multiple times, and said that its implementation would actually be more privacy-preserving than technology used by other companies like Google and Facebook.\nIt was also revealed through this process that Apple already scans iCloud Mail for CSAM, with the expansion applying to iCloud Photos.\nOther child safety features announced by Apple last month, and also now delayed, include communications safety features in Messages and updated knowledge information for Siri and Search.\nWhat do you make of Apple’s decision to delay the rollout of its new child safety features? Is it the right decision, or should the company have stuck to its initial plan?\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.04847802797501737
    },
    "article_3": {
        "title": "Delays Aren't Good Enough—Apple Must Abandon Its Surveillance Plans",
        "body": "Apple announced today that it would “take additional time over the coming months to collect input and make improvements” to a program that will weaken privacy and security on iPhones and other products. EFF is pleased Apple is now listening to the concerns of customers, researchers, civil liberties organizations, human rights activists, LGBTQ people, youth representatives, and other groups, about the dangers posed by its phone scanning tools. But the company must go further than just listening, and drop its plans to put a backdoor into its encryption entirely.\nJOIN THE NATIONWIDE PROTEST\nTELL APPLE: DON'T SCAN OUR PHONES\nThe features Apple announced a month ago, intending to help protect children, would create an infrastructure that is all too easy to redirect to greater surveillance and censorship. These features would create an enormous danger to iPhone users’ privacy and security, offering authoritarian governments a new mass surveillance system to spy on citizens. They also put already vulnerable kids at risk, especially LGBTQ youth, and create serious potential for danger to children in abusive households.\nThe responses to Apple’s plans have been damning: over 90 organizations across the globe have urged the company not to implement them, for fear that they would lead to the censoring of protected speech, threaten the privacy and security of people around the world, and have disastrous consequences for many children. This week, EFF’s petition to Apple demanding they abandon their plans reached 25,000 signatures. This is in addition to other petitions by groups such as Fight for the Future and OpenMedia, totaling well over 50,000 signatures. The enormous coalition that has spoken out will continue to demand that user phones—both their messages and their photos—be protected, and that the company maintain its promise to provide real privacy to its users.\nFurther Reading:",
        "sentiment": -0.15444808127358556
    },
    "article_4": {
        "title": "iPhone 13 Still Doesn't Display Battery Percentage in the Status Bar, Despite Smaller Notch",
        "body": "Despite a smaller notch, the iPhone 13 lineup will not show users their battery percentage in the status bar, or at least, not by default, according to the ‌iPhone 13‌ simulator embedded within Xcode.\nThe entire ‌iPhone 13‌ series features a smaller notch, allowing for more area to display content. While many customers may have hoped that a smaller notch would lead Apple to show the battery percentage in the status bar, that doesn't seem to be the case, at least for now.\nAs noted on Twitter, the Xcode 13 simulator for the iPhone 13 Pro Max shows the status bar without a battery percentage, despite ample room to shift the signal and Wi-Fi bars to the left. While the simulator in the release candidate of Xcode 13, released after yesterday's event, shows no battery percentage, Apple may offer it as an option within Settings.\nAccording to the Xcode Simulator, even though there’s enough space on iPhone 13 Pro Max, it still doesn’t show the battery percentage #AppleEvent pic.twitter.com/TOc7mz48EL — Apple Software Updates (@AppleSWUpdates) September 14, 2021\nApple is unlikely to place the battery percentage in the status bar with no way for users to turn it off. With older iPhones that feature no notch, Apple includes an option within settings to toggle the percentage on or off, and a similar play could be in-store with the ‌iPhone 13‌. Although it's worth noting that none of the ‌iPhone 13‌ or updated iOS 15 marketing images depict that as a possibility.\nThe ‌iPhone 13‌ and ‌iPhone 13 Pro‌ will begin shipping to customers on Friday, September 24, but we do expect reviews and hands-on impressions of the devices to be released before that. Those reviews and impressions will give us a definitive answer on whether Apple will finally allow customers to show their battery percentage in the status bar, rather than having to drag down on the right corner of the screen.",
        "sentiment": -0.1992879103530537
    },
    "article_5": {
        "title": "Apple announces first states to adopt driver’s licenses and state IDs in Wallet",
        "body": "September 1, 2021\nPRESS RELEASE\nApple announces first states signed up to adopt driver’s licenses and state IDs in Apple Wallet\nArizona, Connecticut, Georgia, Iowa, Kentucky, Maryland, Oklahoma, and Utah are among the first states to bring state IDs and driver’s licenses in Wallet to their residents\nCUPERTINO, CALIFORNIA Apple today announced that it is working with several states across the country, which will roll out the ability for their residents to seamlessly and securely add their driver’s license or state ID to Wallet on their iPhone and Apple Watch. Arizona and Georgia will be the first states to introduce this new innovation to their residents, with Connecticut, Iowa, Kentucky, Maryland, Oklahoma, and Utah to follow. The Transportation Security Administration (TSA) will enable select airport security checkpoints and lanes in participating airports as the first locations customers can use their driver’s license or state ID in Wallet. Built with privacy at the forefront, Wallet provides a more secure and convenient way for customers to present their driver’s licenses and state IDs on iPhone or Apple Watch.\n“The addition of driver’s licenses and state IDs to Apple Wallet is an important step in our vision of replacing the physical wallet with a secure and easy-to-use mobile wallet,” said Jennifer Bailey, Apple’s vice president of Apple Pay and Apple Wallet. “We are excited that the TSA and so many states are already on board to help bring this to life for travelers across the country using only their iPhone and Apple Watch, and we are already in discussions with many more states as we’re working to offer this nationwide in the future.”\n“This new and innovative mobile driver’s license and state ID initiative with Apple and states around the country will enable a more seamless airport security screening experience for travelers,” said David Pekoske, TSA Administrator. “This initiative marks a major milestone by TSA to provide an additional level of convenience for the traveler by enabling more opportunities for touchless TSA airport security screening.”\nSeamless and Secure Experience\nDriver’s licenses and state IDs in Wallet will provide an easy, fast, and more secure way for people to present their driver’s license or state ID using their iPhone or Apple Watch. Once a participating state begins offering this capability to its residents, customers will be able to add their driver’s license or state ID to Wallet and simply tap their iPhone or Apple Watch to present it to the TSA, without taking out their physical card or handing over their device.\nAdding a driver’s license or state ID to Wallet: Similar to how customers add new credit cards and transit passes to Wallet today, they can simply tap the + button at the top of the screen in Wallet on their iPhone to begin adding their license or ID. If the user has an Apple Watch paired to their iPhone, they will be prompted to also add their ID or driver’s license to their Wallet app on their Apple Watch. The customer will then be asked to use their iPhone to scan their physical driver’s license or state ID card and take a selfie, which will be securely provided to the issuing state for verification. As an additional security step, users will also be prompted to complete a series of facial and head movements during the setup process. Once verified by the issuing state, the customer’s ID or driver’s license will be added to Wallet.\nPresenting a driver’s license or state ID to TSA: Once added to Wallet, customers can present their driver’s license or state ID to the TSA by simply tapping their iPhone or Apple Watch at the identity reader. Upon tapping their iPhone or Apple Watch, customers will see a prompt on their device displaying the specific information being requested by the TSA. Only after authorizing with Face ID or Touch ID is the requested identity information released from their device, which ensures that just the required information is shared and only the person who added the driver’s license or state ID to the device can present it. Users do not need to unlock, show, or hand over their device to present their ID.\nSecurity and Privacy\nWallet provides a convenient and more secure way to present driver’s licenses and state IDs, while offering superior security and privacy over a physical wallet.\nApple and the issuing states do not know when or where users present their IDs.\nDriver’s licenses and state IDs in Wallet take full advantage of the privacy and security built into iPhone and Apple Watch. Customers’ identity data is encrypted and protected against tampering and theft. Biometric authentication using Face ID and Touch ID ensures that only the person who added the ID to the device can view or present their ID or license in Wallet.\nDriver’s licenses and state IDs in Wallet are only presented digitally through encrypted communication directly between the device and the identity reader, so users do not need to unlock, show, or hand over their device.\nIf a user misplaces their iPhone or Apple Watch, they can use the Find My app to lock their device and help locate it, or remotely erase a device.\nApple’s mobile ID implementation supports the ISO 18013-5 mDL (mobile driver’s license) standard which Apple has played an active role in the development of, and which sets clear guidelines for the industry around protecting consumers’ privacy when presenting an ID or driver’s license through a mobile device.\nStates Across the Country See Benefits of IDs in Wallet\nStates across the country are looking forward to the superior security and convenience that driver’s licenses and state IDs in Wallet provide to them and their users.\n“Arizona is at the leading edge of states making mobile IDs available to the public, and we are pleased to work with Apple and give Arizonans the choice, convenience, and security of adding their driver’s license to their Apple Wallet,” said Eric Jorgensen, director of the Arizona Department of Transportation Motor Vehicle Division. “Beyond being innovative and exciting, a digital version of a driver’s license offers increased security and privacy for our residents, making it something everyone should consider.”\n“We’re excited to bring a new addition to our state’s modernization efforts that will make our residents’ lives easier, and keep their identities secure through the use of mobile driver’s licenses in Apple Wallet,” said Connecticut Governor Ned Lamont. “We’re pleased to be one of the first states working with Apple to deploy driver’s licenses and state identification cards in Apple Wallet, and we’re looking forward to taking the next steps to make sure this new feature benefits our residents.”\n“Georgia is a national leader when it comes to the safety and security of its driver and identity credentialing process, with more than 99 percent of Georgians REAL ID compliant, and the state of Georgia is equally as committed to safety and security through our mobile driver’s licensing (mDL) efforts with Apple,” said Spencer R. Moore, commissioner of the Georgia Department of Driver Services. “Together, we will deliver customer convenience through touchless identity verification and enhanced security and privacy protection through technology. We are honored to work with Apple as an initial adopter for such a revolutionary customer experience. A state-issued credential has become the standard for which institutions of all sectors use as a trusted source of identity proofing. The identity proofing bar has been raised significantly thanks to Apple and innovative states like Georgia.”\n“We are glad to see Apple advance the acceptance of mobile driver’s licenses by offering a secure and convenient way to present a mobile driver’s license with Apple Wallet,” said Melissa Gillett, director of the Iowa Motor Vehicle Division. “Privacy and security have been at the forefront of our mobile driver’s license development process and we appreciate Apple’s proven reputation in these areas, as well as the shared commitment to following the ISO 18013-5 standard.”\n“The Kentucky Transportation Cabinet is excited to be leading the pack through this innovative collaboration with Apple to further deliver on our pledge to take driver licensing to the next level,” said Matt Cole, commissioner of the Kentucky Department of Vehicle Regulation. “The potential for mobile driver’s licenses is limitless, and we look forward to taking steps to continue to offer modern conveniences to Kentuckians while maintaining our unwavering commitment to security and privacy.”\n“Maryland is proud to be a leader once again in safe innovation with the implementation of mobile driver’s licenses,” said Maryland Governor Larry Hogan. “As we look to the future, we are committed to enhancing convenience and accessibility while maintaining the highest safety and security standards for our state and citizens.”\n“We are excited to work with Apple on mobile IDs in Apple Wallet. This innovative project is yet another example of the momentum we are building as a state in our continued efforts to be a national leader in the digital transformation space,” said Jerry Moore, CIO of the state of Oklahoma.\n“Utah has always been a forward-looking state. We regularly hear from people who want to access their driver license through their phones,” said Jess Anderson, commissioner of the Utah Department of Public Safety. “This is a great opportunity for Utah to work with Apple in an innovative use of technology. This secure mobile license adds convenience while helping keep Utah safe.”\nParticipating states and the TSA will share more information at a later date about when support for mobile driver’s licenses and state IDs in Wallet will be available in each state, and which TSA airport security checkpoints and select lanes it will be available at first.\nApple Wallet on iPhone and Apple Watch offers an easy, secure, and convenient way to do everything from paying for groceries to accessing your favorite entertainment venues. With Wallet, users can pay in-store, online, and in-apps with Apple Pay, pay for and ride public transportation in cities across the globe, unlock their car, and access airline boarding passes, event tickets, and loyalty rewards programs. University and college students, as well as faculty can also tap their device to use their mobile student ID in Wallet to make purchases and get around campus. Coming soon, Wallet will also provide access to customers’ home, apartment, and hotel keys, as well as corporate badges. More information on Wallet can be found at apple.com/wallet.\nAbout Apple\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\nPress Contacts\nApple Media Helpline\nmedia.help@apple.com\n(408) 974-2042",
        "sentiment": 0.5264937602293988
    },
    "article_6": {
        "title": "Apple Reportedly in Talks With Toyota About Apple Car Production Starting 2024",
        "body": "Apple is rumored to be in Asia visiting Toyota as it prepares to lay the supplier groundwork to mass produce a branded car by 2024, according to a new report by DigiTimes.\nApple representatives were said to have met with South Korea's SK Group and LG Electronics last month to discuss Apple Car development, and now Japan's Toyota is being touted as its next potential destination.\nApple has been working on a car-related project since at least 2014, and at one stage it looked as if the company was scaling back to focus on autonomous vehicle software. However, following several changes in management and hiring, Apple is now believed to be focused on building a car for consumers.\nBut to do that, the company needs to tap into a whole new supply chain. Apple is expected to rely on a manufacturing partner to build the vehicles, and though it wants to make EV batteries in the United States, it may be seeking partnerships with established vehicle makers like Toyota to do so.\nReuters has previously reported that Apple is developing a new battery design that has the potential to \"radically\" reduce the cost of batteries and increase the vehicle's range.\nOne person who spoke to Reuters described Apple's \"monocle\" battery technology as \"next level\" and said that it's similar to \"the first time you saw the iPhone.\"\nReuters' reporting claimed that Apple is aiming to begin production on an Apple-branded self-driving vehicle starting in 2024, so DigiTimes' focus on that date isn't necessarily a shot in the dark. However, delays caused by the ongoing global health crisis or current chip shortage could always push production to 2025 or beyond.",
        "sentiment": 0.11238023359328508
    },
    "article_7": {
        "title": "Ted Lasso wins 7 Emmy Awards including Best Comedy Series, Best Comedy Actor, and more.",
        "body": "The TelevisionAcademy.com sites look and perform best when using a modern browser.\nWe suggest you use the latest version of any of these browsers:\nChrome Firefox Safari\nVisiting the site with Internet Explorer or other browsers may not provide the best viewing experience.",
        "sentiment": 0.008272618055343628
    },
    "article_8": {
        "title": "Motorcyclist's Apple watch alerts girlfriend &amp; calls for ambulance after hit-&amp;-run accident at Ang Mo Kio",
        "body": "Smart devices can come in handy in times of need.\nA 24-year-old motorcyclist's smart watch called for help after he got into an accident.\nMotorcyclist passed out after colliding with a van\nThe motorcyclist, named Muhammad Fitri, fell off his bike after colliding with a van at Ang Mo Kio.\nWhile lying on the ground, he saw the vehicle drive off before losing consciousness, he told Chinese daily Lianhe Wanbao.\nThe accident happened at the junction of Ang Mo Kio Avenue 6 and Ang Mo Kio Street 31 on Sep. 25 evening, according to the report.\nThe police confirmed the incident as a hit-and-run.\nFitri's family is also looking for any further information and witnesses of this accident.\nSmart watch alerted emergency contacts\nFitri said that his Apple's smart watch detected a hard fall and promptly sent a message to his emergency contacts, which included his girlfriend. The smart watch also called for an ambulance.\nWanbao added that passers-by also spoke to the girlfriend and told her what happened. She and Fitri's family then found out that it was the smart watch that contacted them.\nFitri's family said that they were very thankful for this life-saving function as the streets were relatively empty at that point of time.\nFitri could have missed the golden hour of rescue if not for the smart watch's function.\nFortunately, he slowly regained consciousness when the paramedics arrived at scene.\nIn response to Mothership's queries, the Singapore Civil Defence Force (SCDF) said that they were alerted to the accident at around 8:20pm. Fitri was conveyed to Khoo Teck Puat Hospital.\nFall detection function not limited to Apple Watch\nAccording to Apple, models under Series 4 or later can detect hard falls.\nWhen a hard fall is detected, it will tap the user on their wrist, sound an alarm, and show an alert.\nThe watch will not alert emergency services if it detects movement from the user.\nHowever, if the user is immobile for at least one minute, the device will automatically call the emergency contacts and send a message to them. It will also call for an ambulance.\nSeveral smart watches have this function, including the Samsung Galaxy Watch 3 and a few Garmin Watch models.\nFollow and listen to our podcast here\nTop image via Lianhe Wanbao",
        "sentiment": -0.38563993184462836
    },
    "article_9": {
        "title": "Streamed video playback battery life improved from 12 hours in 12 Pro Max to 25 hours in 13 Pro Max. Isn't this a gargantuan improvement, or am I misunderstanding this?",
        "body": "11\nIf you are a Participant, you are able to spend on the account, but are not responsible for payments. Being a Participant who is reported to the credit bureaus on an account that has a negative payment history (e.g. the account goes past due) or is over utilized can have negative effects on your credit. The account payment history will be reported for Participants who opt in, which could help or hurt a credit score. If you are a Co-Owner, that means joint responsibility for all aspects of the account, including all transactions and payment obligations. In addition, Co-Owners will have full visibility into all account activity and each Co-Owner is responsible for the other Co-Owner’s instructions or requests. Being responsible for a Co-Owner involves risk, including credit bureau reporting of any delinquencies on the shared account. Apple Card Family Participants and Co-Owners do not need to have a familial relationship, but must be part of the same Apple Family Sharing Group.\nTo access and use all the features of Apple Card, you must add Apple Card to Wallet on an iPhone or iPad with the latest version of iOS or iPadOS. Update to the latest version by going to Settings > General > Software Update. Tap Download and Install.\nAvailable for qualifying applicants in the United States.\nApple Card is issued by Goldman Sachs Bank USA, Salt Lake City Branch.\nIf you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about Apple Card.",
        "sentiment": 0.007581773715523573
    },
    "article_10": {
        "title": "'iPhone 13' A15 chip performance continues dominance over Android rivals",
        "body": "A15 benchmark shows 13.7% faster GPU\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA benchmark on what is said to be the GPU in Apple's A15 chip, destined for the \"iPhone 13,\" is 13.7% faster than the A14, maintaining Apple's lead in mobile performance.\nA Manhattan 3.1 GPU benchmark test reportedly shows Apple's A15 chip hitting 198 FPS during the first round of testing. However, the second round isn't as impressive, with a score of about 140 FPS to 150 FPS.\nThe benchmark results show how the A15 GPU performed after two rounds of testing. The scores show that the A15 needs to throttle its speed after a time, but even when considering the speed drop, it outperforms competitors by a considerable margin.\nAccording to a tweet from a leaker known as \"FrontTron,\" benchmark tests were performed on a sample of the A15 acquired from a July batch. The results were discussed in a Korean forum called Clien.\nThe iPhone 12 averages 170.7 FPS peak performance on the Manhattan 3.1 test. FrontTron says the throttling isn't an issue since it is \"way exceeding\" the A14 peak performance, though the numbers appear to contradict that statement.\nApple A15 GPU peak benchmark test\nManhattan 3.1: 198 FPS (July unit sample)\nHowever, after second round of test, throttling kicks in and drops to 140~150FPS.\n(1/2)\nSource: https://t.co/Sl1xfN5ktB — Tron (@FrontTron) September 6, 2021",
        "sentiment": -0.07090318699677785
    },
    "article_11": {
        "title": "Apple Will Let iPhone 13 Pro Users Disable Auto Switching to Ultra Wide Lens for Macro Photography Later This Fall",
        "body": "iPhone 13 Pro and iPhone 13 Pro Max reviews were published today, with the devices receiving praise for their smoother ProMotion displays, longer battery life, and improved cameras, but there was one consistent complaint among the reviews.\nOn the iPhone 13 Pro and iPhone 13 Pro Max, a new feature is the ability to take macro photos. As noted by Input's Raymond Wong, however, this new capability results in the device automatically switching from the Wide lens to the Ultra Wide lens when you place an object or a subject within 5.5 inches of the rear camera. (The viewfinder still shows \"1x\" framing, but the camera relies on the Ultra Wide lens for autofocus.)\nThe automatic camera switching is easily noticeable in the iPhone's viewfinder, as Wong demonstrated in the video below.\n\"The viewfinder keeps jittering as it tries to choose between a regular wide or wide-macro shot,\" he said. In his review, he expressed his opinion that \"the framing should never change from what you compose and never automatically.\"\nApple initially told Wong that the automatic camera switching is intentional to help users better capture close-up details, according to his review, but the company has since issued a statement to Wong and others that says iPhone 13 Pro users will gain the option to turn off the switching in an iOS update that will be released later this fall.\n\"A new setting will be added in a software update this fall to turn off automatic camera switching when shooting at close distances for macro photography and video,\" said Apple.\nApple said the ability to turn off the automatic camera switching will apply to macro video recording as well, but as Wong noted, there is a \"Lock Camera\" option under Settings > Camera that appears to prevent the switching for video already.\nAll four iPhone 13 models will begin arriving to customers and launch in stores this Friday, September 24 in the U.S. and over 30 other countries and regions.",
        "sentiment": -0.25089530841532076
    },
    "article_12": {
        "title": "The iPhone 13 is a pitch-perfect iPhone 12S",
        "body": "Apple had a lot of new features to announce with its iPhone 13 lineup this week. The iPhone 13, iPhone 13 Mini, iPhone 13 Pro, and iPhone 13 Pro Max have better battery life, faster A15 Bionic processors, smaller display notches, upgraded cameras, and, when it comes to the Pro models, high refresh rate 120Hz ProMotion displays.\nIt’s a nice collection of updates, but take a step back and the range starts to look an awful lot like an iterative update over last year’s iPhone 12. They have an almost identical look to the squared-off design introduced with last year’s models, and Apple was careful to not directly compare the performance of its new A15 Bionic chip to last year’s A14 Bionic, only to its competitors. There’s also no major new initiative like the MagSafe ecosystem that Apple kicked off last year, and on the bottom of the phones you’ll see the same old Lightning port rather than USB-C. It all feels very familiar.\nSo it’s no wonder that much of tech Twitter immediately responded to the phones’ announcement by referring to them as the “iPhone 12S,” aka a minor update to last year’s iPhone 12. That’s how Apple used to name its phones. There’d be a major update one year, usually with a big design change, followed up with a more minor revision that changed some internal components and features but kept the overall look and feel the same. The iPhone 3GS, 4S, 5S, 6S, and XS all used this approach. So what changed?\nThe iPhone 5S, which added a fingerprint sensor to Apple’s smartphone. Photo by Michael Shane / The Verge\nApple started to move away from this formula with 2016’s iPhone 7. Not only did the iPhone 7 break the cycle by using a very similar design to the previous year’s 6S instead of a new look (aside, of course, from the infamous missing headphone jack), but it was never followed by an S-model of its own. Instead, the next year Apple jumped straight to the iPhone 8, a minor revision that absolutely deserved to be called the 7S, and which ended up being completely overshadowed by that year’s iPhone X.\nEver since 2018’s iPhone XS, it seems like Apple has abandoned the S-suffix entirely. Every year gets a new number, regardless of whether it offers a major overhaul like the iPhone 12 or a more minor update like the iPhone 13.\nOf course, Apple’s closest competitor in the US, Samsung, has been using this approach for years. Every subsequent Galaxy S device has had a bigger number than its predecessor, and nobody wants to be the company with the lower-numbered phone than its rival. In fact, if Apple had released an iPhone 7S in 2017 it would have competed against Samsung’s Galaxy S8. No wonder Apple jumped straight to 8 and skipped the iPhone 9 entirely.\nIt’s wild in retrospect that Apple willingly advertised its “off” years\nIn retrospect it seems absolutely wild that Apple was willing to proudly broadcast that it was having an off year. Unless you were the kind of smartphone user that wanted to have the most up-to-date iPhone year after year, that S-suffix was a helpful indication that a new model only contained minor changes. “Don’t worry about upgrading this year, folks,” was the implicit message.\nBut the reality was that smartphone technology was advancing so quickly at the time that even a “minor” upgrade could still contain massive new features. The iPhone 3GS was the first iPhone that could officially record video in addition to taking photos, the iPhone 4S introduced Apple’s Siri voice assistant to the world, and the 5S was the first iPhone with biometric security (a fingerprint sensor). These are all major additions that we now take for granted on modern Apple devices, and they arrived with the relatively muted fanfare of an S-branded iPhone. The S-branded iPhones also offered big camera improvements over the years: the 4S was the first with an 8-megapixel camera, the 5S added slow-motion video, and the 6S increased the rear camera’s resolution to 12 megapixels. Every year, Apple gave its customers a pretty good reason to upgrade.\nThe iPhone 6S, the first iPhone with a 12-megapixel camera. Image: The Verge\nThe smartphone market is now a very different place. Smartphones have matured, and even midrange models offer basically everything most people actually need a phone to do. Every year we’re told about the latest phones’ performance upgrades and edge-case camera improvements, but it’s nothing that’s going to completely change your life.\nConsumers have noticed. Far from upgrading to the latest iPhone every year, as of 2019 CNBC reported that US customers were waiting an average of over two years to upgrade their phones, while in the UK people were waiting almost 28 months. At the time, these figures were all trending upward, and it seems safe to assume that they’ve grown even longer in the two years since. It was also around this time that iPhone sales started to plateau, and Apple stopped reporting on iPhone sales numbers, opting instead to bundle their numbers in with other device categories.\nInstead of focusing on big upgrades, Apple seems to be prioritizing a bigger lineup with devices to appeal to different tastes and price points. As recently as 2017, the company was selling just two flagship phones, the iPhone 7 and the iPhone 7 Plus. The following year it released three (the 8, 8 Plus, and X), and last year it switched to four with the iPhone 12, 12 Mini, 12 Pro, and 12 Pro Max. With so many form factors to keep updated, it’s not surprising that big overhauls have become less common.\nPeople upgrade much less frequently than they once did\nUnless you really want the latest and greatest technology, there really isn’t much of a reason to upgrade every year, and that’s a good thing! It’s much more affordable for those people who opt to buy their phones outright, and it’s worlds better for the environment. Apple may now be using more recycled materials in its devices, but manufacturing them and shipping them in the first place still uses resources.\nIn this context, it isn’t surprising that Apple has changed with the times. For starters, it’s making more of an effort to make money outside of hardware, like its increasingly broad array of subscription services covering everything from music and video streaming, to gaming and home fitness. If it can’t make money from selling you a new iPhone every year, it’ll sure as hell try to make money from you streaming the latest season of Ted Lasso.\nThat doesn’t mean that Apple has given up on the idea of selling you a new phone every year. Far from it. If branding this year’s phones as the iPhone 13 tells us anything, it’s that Apple is more keen than ever to convince its customers to upgrade, by branding this year’s phones as an all-new range as opposed to a more modest update to the iPhone 12. The slowing progress of smartphone technology means that Apple can’t afford to rest on its laurels with an S-branded device. Everything needs to be brand-new and as exciting as possible.",
        "sentiment": 0.04069977166021571
    },
    "article_13": {
        "title": "iOS 15 Adoption Estimated at Nearly 20% as Users Encounter Several Early Bugs",
        "body": "iOS 15 adoption has reached an estimated 19.3% since the software update was released September 20, according to mobile analytics company Mixpanel.\nMixpanel measures iOS adoption based on visits to websites and apps that use its mobile analytics SDKs, so the data is not official. Apple has yet to share iOS 15 adoption stats, having last reported an 85% adoption rate for iOS 14 back in June.\niOS 15 adoption appears to remain slower than iOS 14 adoption so far, and there are likely several reasons for that, including Apple providing iOS 14 users with the option to continue receiving important security updates, several iOS 15 features being delayed, and iOS 15 suffering from a handful of early bugs that still need to be fixed.\nFor example, Apple said an issue preventing some iPhone 13 users from using the Unlock with Apple Watch feature will be fixed in an upcoming software update. The feature is designed to let you unlock your iPhone while wearing a mask, but some users have encountered an \"Unable to Communicate with Apple Watch\" error message.\nThere's another iOS 15 bug where performing an iCloud Backup can result in photos saved from an iMessage conversation that is later deleted to disappear from the Photos app, intermittent touchscreen issues on iPhone 13 models, and other problems.\nApple is currently beta testing iOS 15.1, which includes a fix for the Unlock with Apple Watch bug at a minimum, but there is no timeframe for the software update's release. It's quite possible that Apple will opt to release a smaller update such as iOS 15.0.1 to more quickly address some of the bugs and security vulnerabilities that have surfaced.",
        "sentiment": -0.05313317012041807
    },
    "article_14": {
        "title": "iOS 15.1 Beta Lets Users Add COVID Vaccination Card to Wallet App",
        "body": "The iOS 15.1 beta that was introduced today allows iPhone users to upload their COVID-19 vaccination status to the Health app and then generate a vaccination card in Apple Wallet.\nThe Apple Wallet vaccination card can be shown to businesses, venues, restaurants, and more that are requiring vaccines for entry.\nAs outlined in an announcement to developers, verifiable health records are based on the SMART Health Cards specification. California is using SMART Health Cards, so users in California can add their vaccination records to the Wallet app after installing iOS 15.1.\nOther states and health organizations that use the SMART Health Cards will be able to use a button to let users know that they can download and store their vaccination information in the Health app and in the Wallet app.\nCalifornia, Louisiana, New York, Virginia, Hawaii, and some Maryland counties support Smart Health Cards, as do Walmart, Sam's Club, and CVS Health. So those in the specific supported states should be able to look up their information in state databases, but those who were vaccinated through companies like Walmart and CVS will also be able to add their information to the Health and Wallet apps because it's the same system.\nNote that some apps like the one used by the NHS in the UK allowed users to add their vaccination records to the Wallet app, but the new solution is a universal standard that will work for all healthcare providers/states that implement it.\nDiscussion should be limited to the app and implementation, and not politics.",
        "sentiment": 0.21706145629286766
    },
    "article_15": {
        "title": "Here are the best new Safari extensions to download for iOS 15 and iPadOS 15",
        "body": "One of the flagship new features in iOS 15 and iPadOS 15 is the redesigned Safari web browser. While the highlight of the new Safari is its user interface, it also gains compatibility with more powerful, Mac-like browser extensions. Now that iOS 15 is available to download, there are plenty of extensions hitting the App Store, and we’ve put together a list of some to try out.\nUsers of 1Password will love the new Safari extension in the latest update. The 1Password extension gives you the ability to see any password right in Safari and fill in password fields with saved ones. The extension can automatically fill in two-factor authentication codes as well. If you’re using an iPad, you will get the entire desktop 1Password experience. The extension will appear in the toolbar for you to access at any time.\n1Password’s new extension\nThe developer behind Apollo for Reddit, Christian Selig, has created a new Safari extension called Amplosion. Amplosion redirects you to the original webpage when you open an AMP link in Safari. The app also lets you keep track of how many times you’ve visited an AMP link and how many times you’ve used Amplosion to avoid one. Amplosion is priced at just $1.99 and if you hate AMP as much as I do it’s well worth it.\nChristian has also created an extension that adds an HTML web inspector to Safari. The app is priced at $0.99 and is well worth it – since Apple still hasn’t added its own inspector.\nAchoo extension on iPhone\nThe new CardPointers Safari extension knows what deals you may be able to take advantage of on different shopping websites. CardPointers says that it’s compatible with thousands of websites. While shopping in Safari with the extension enabled, you’ll get a notice telling you which card to use for the best deal as well as any special offers.\nCheep is an app that helps you find deals on Flights. With its latest update, it adds a Safari extension for use with Google Flights. The extension helps determine the cost per mile, distance in miles, and recommends whether or not you should book the flight. Cheep is free.\nAm excited for Cheep launch for iOS 15 today! https://t.co/IgcZ7i1upe – safari extension for google tells you the miles, cost per mile, and rating\n– personalize airline alliances for mileage run deals\n– minimum fare rating you want to see\n– integration with TikTok and Instagram pic.twitter.com/RpJ84MYmys — Jonathan Chum (@jchum) September 20, 2021\nThis app is a simple web inspector that appears to be designed to look familiar to those who frequently use one in Chrome on the Mac. This extension lets you inspect webpages and edit their elements, enter JavaScript commands, view network requests, and more. It’s also entirely free.\nI just released Web Inspector for iOS and iPadOS. It's a Safari extension for web developers to edit web pages on the fly, debug JavaScript, and more. It's free with no in-app purchases: https://t.co/u5mBSkMKnV pic.twitter.com/U1PdXv9VjK — Zhenyi Tan (@zhenyitan) September 20, 2021\nHyperWeb is a new extension that adds the ability to customize just about anything you want to in Safari while browsing the web. The app lets you create blockers, personalize search, and customize the design of webpages. The app can also recommend enhancements to enable to make the extension more powerful.\nSafari already has some translation features built-in but a new app from Gikken called Language Translator can help you take things to the next level. The app’s new Safari extension can automatically translate sites in 40 languages without any work required by the user. You can also select text and get a pop-up window if you want to translate it to another language. The app is pricey though at $29.99 but if you frequently need to translate different sites in a multitude of languages it might be worth the buy.\nVidimote is a new Safari extension that allows you to control video playback from the toolbar. The extension lets you change the speed of videos, jump ahead, switch between PiP and fullscreen, and more. Vidimote is $4.99 and available now.\nStopTheMadness is a Safari extension that helps you take control of websites you frequently visit. The extensions lets you enable native iOS features like contextual menus, text editing, drag and drop, and autofill. The extension also improves privacy on the web by stopping clickjacking for different services among other things. StopTheMadness is priced at $7.99 on the App Store.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.13178416793333722
    },
    "article_16": {
        "title": "Apple fires senior engineering program manager Ashley Gjøvik for allegedly leaking information",
        "body": "Apple has fired senior engineering program manager Ashley Gjøvik for allegedly violating the company’s rules against leaking confidential information. For months, Gjøvik has been tweeting openly about allegations of harassment, surveillance, and workplace safety.\n“When I began raising workplace safety concerns in March, and nearly immediately faced retaliation and intimidation, I started preparing myself for something exactly like this to happen,” she says. “I’m disappointed that a company I have loved since I was a little girl would treat their employees this way.”\nGjøvik has raised concerns that her office is in an Apple building located on a superfund site, meaning it requires special oversight due to historical waste contamination. She also says that she faced harassment and bullying from her manager and members of her team. More recently, she’s begun raising privacy concerns related to Apple’s policies on how it can search and surveil employees’ work phones.\nShe was placed on administrative leave in early August while Apple investigated some of these concerns — a placement she says she requested as a last resort.\nA member of Apple’s employee relations team reached out to Gjøvik earlier today saying the company was looking into a sensitive intellectual property matter and wanted to speak to her within the hour. Gjøvik said she wanted to keep all communications in writing, and noted she was forwarding the correspondence along to the NLRB, where she recently filed a charge. The employee relations representative responded to say that because she had chosen not to participate in the discussion, they would move forward with the information they had and — “given the seriousness of these allegations” — suspend her access to Apple systems.\nHours later, Gjøvik received an email that her employment at Apple was being terminated, effective tomorrow.",
        "sentiment": -0.5542140946878741
    },
    "article_17": {
        "title": "Apple now lets you share how much you love or hate built-in apps via App Store reviews",
        "body": "For the longest time, the App Store did not allow users to rate or review Apple’s built-in iPhone and iPad apps, like Mail, Music, News, Stocks and Calculator. However, seemingly since the release of iOS 15 earlier this month, Apple has now lifted that restriction. It is now open season for App Store feedback on Apple’s stock apps.\nAs you might expect, customer feedback is already flooding in for Apple’s apps, with the Podcasts app currently faring the worst statistically with a 2.0 rating …\nAlthough Apple had no reason to officially announce this policy change, it is possible Apple opened it up due to looming competitive pressure, as third-party apps are not allowed to hide their App Store ratings.\nYou can rate and review any Apple app that is deletable and re-installable via the App Store, so core system apps like Phone or Messages are exempt as they don’t have App Store listings.\nAs the ability to rate and review is still quite new, most of the stock apps only have a few dozen ratings so far. However, you can imagine that everyone with grievances after upgrading to iOS 15 are rushing to the App Store to leave their one star ‘constructive’ feedback.\nOne of Apple’s most popular services, Apple Music, has already clocked about 300 reviews with a 3.7 average rating.\nAs mentioned before, Podcasts is just crossing the 2-star mark as customers continue to complain about the changes from the iOS 14.5 app redesign. The Translate app manages just 2.2 stars, with reviewers noting that it pales in comparison to the quality of translations provided by competing apps like Google Translate. Apple News also doesn’t achieve a passing grade at 2.3 stars, with many reviewers complaining about the app repeatedly crashing when browsing articles.\nNo Apple app approaches the fabled 5 star perfect score. Voice Memos seems to be Apple’s highest-rated built-in app currently, sitting at 4 stars. Weather is also doing relatively well, at 3.7 stars, with customers appreciating the improvements brought by the iOS 15 update. However, there is a common feature request for both the Weather and Calculator apps …\nThe reviews for Stocks are particularly comical:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.1271262087393552
    },
    "article_18": {
        "title": "Apple Online Store Goes Down Ahead of 'California Streaming' Apple Event Later Today",
        "body": "Ahead of the \"California streaming\" Apple event later today, the online Apple Store has gone down in preparation for the launch of the iPhone 13, Apple Watch Series 7, and possibly the third-generation AirPods.\nApple typically takes down its online store hours ahead of a product launch to prepare the storefront for the new devices. Like the past several events, today's Apple event will take place digitally and will feature pre-recorded segments from Apple Park, streamed on Apple's website, via the Apple TV, as well as on YouTube.\nMacRumors will have in-depth coverage of Apple's event across our platforms, including a live blog on our website and live tweets via @MacRumorsLive on Twitter, so be sure to follow to keep track of everything Apple announced.",
        "sentiment": 0.45885455422103405
    },
    "article_19": {
        "title": "Apple announces all-new iPad Mini with smaller bezels and new colors",
        "body": "Apple has announced its all-new iPad Mini. It features a new enclosure with narrower bezels and rounded corners. The big news is that it’s larger than the iPad Mini 5 with an 8.3-inch display (up from its predecessor’s 7.9-inch panel), making the device even more viable as a driver for multitasking or schoolwork. Apple says the screen can reach 500 nits of brightness and comes with anti-reflective coating.\nThe iPad Mini is currently Apple’s smallest tablet, even with the bump in size. Apple was rumored to have been considering a Mini LED display on the new iPad, similar to that of its largest iPad Pro. Those appear to have missed the mark; the new Mini sports a regular Liquid Retina display.\nImage: Apple\nThe iPad Mini’s design has remained largely consistent since its 2012 debut. The new model is something of a shake-up to the traditional build, featuring slimmer borders than the iPad Mini 5 and new color options including pink, purple, and “starlight”, in addition to space gray.\nImage: Apple\nThe new tablet also features a USB-C port (with up to 5Gbps data transfer), Touch ID on the top button (still no Face ID), a new landscape stereo speaker system, and upgraded 12MP cameras on the front and back, including a shooter with True Tone flash and Focus Pixels on the rear and a new 12MP ultrawide camera on the front, which will support Apple’s Center Stage feature. It also supports Wi-Fi 6 and optional 5G (with download speeds up to 3.5Gbps) as well as the second-generation Apple Pencil, which attaches magnetically to the iPad and charges wirelessly.\nThere are new slim Smart Folio covers but no mention of a keyboard cover. Image: Apple\nThe enclosure also incorporates 100 percent recycled aluminum; the solder of the main logic board includes 100 percent recycled tin, and the enclosure magnets and speakers are 100 percent recycled rare earth elements. Apple claims you can expect 40 percent faster CPU performance and 80 percent faster GPU performance, as well as all-day battery life, with the new A15 Bionic chip.\nThe new iPad Mini is up for order today and will be in stores on September 24th starting at $499. Cellular models start at $649. The new Smart Folio costs $59, and the second-generation iPad Pencil is available for $129.",
        "sentiment": -0.03914414346218109
    },
    "article_20": {
        "title": "Kuo: AirPods 3 to be announced at September event, at possible higher price as AirPods 2 will remain in the lineup",
        "body": "Sep. 12th 2021 6:21 am\nIn a report from reliable analyst Ming-Chi Kuo today, Apple is said to be announcing the new generation of AirPods as part of Tuesday’s iPhone 13 event. The new ‘AirPods 3’ will be the new version of Apple’s AirPods earbuds, which were last refreshed in March 2019.\nHowever, Kuo says that Apple will keep selling the second-generation AirPods when the new models ship. He says this suggest either AirPods 3 will be sold at a higher price — current models start at $159 — or that AirPods 2 will see a price drop alongside the AirPods 3 release, which would adopt the current AirPods 2’s price point.\nKuo does not seem to know which scenario is more likely. Instead, he simply indicates that AirPods 2 and AirPods 3 will be sold simultaneously as AirPods 2 production continues.\nBased on previous rumors, the new AirPods models are expected to feature a new design that resembles the shape of the current-generation AirPods Pro, notably featuring shorter stems on the earbuds themselves.\nHowever, the AirPods 3 are not expected to feature active noise cancellation features — that will remain exclusive to AirPods Pro and AirPods Max. AirPods 3 are expected to support head-tracking Spatial Audio however, which lines up neatly with the release of iOS 15 that enhances Dolby Atmos music with the head-tracking effect in addition to video content.\nRight now, second-generation AirPods are sold in two models: with and without Qi wireless charging case. The AirPods with standard wired case sell for $159, the SKU with wireless case included costs $199.\nOverall, Kuo expects the launch of the new AirPods 3 generation to have a positive impact on Apple’s truly wireless earbud sales, with the analyst predicting an increase in shipments of 10-15% YOY for the first quarter of 2022.\nUpdates to AirPods Pro are not expected until sometime next year. Bloomberg previously said that the AirPods Pro will be redesigned to be more compact as Apple intends to eliminate the stem altogether. They may also feature integrated sensors for fitness tracking.\nStay tuned to 9to5Mac for full coverage of all the announcements at Apple’s first fall media event, which will kick off at 10 AM PT on Tuesday, 14 September. Alongside new AirPods, we expect to see Apple unveil the iPhone 13 lineup and the new Apple Watch Series 7.\nLooking to trade in your old AirPods in anticipation of the new ones? Check out our full guide on how to trade in your AirPods and check the latest prices from our trade-in partner!\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.012001262977719307
    },
    "article_21": {
        "title": "Report: M1X MacBook Pros to hit shelves in 'the next several weeks'",
        "body": "While Apple is expected to announce the iPhone 13 and Apple Watch Series 7 on Tuesday, it has additional announcements in store for later this fall. Perhaps most notably, this includes the long-awaited 14-inch and 16-inch MacBook Pros powered by the M1X processor. A new report today indicates those machines could be available in “the next several weeks.”\nIn the latest edition of his Power On newsletter, Mark Gurman details iPhone 13 and Apple Watch Series 7 expectations, but also teases that Apple has other announcements planned for later this fall: new AIrPods, a redesigned iPad mini and entry-level iPad, and the M1X MacBook Pros.\nGurman writes that following delays, the new M1X MacBook Pros should be ready to “hit shelves in the next several weeks.”\nM1X MacBook Pro: 14-inch and 16-inch MacBook Pros with high-end M1 chips, MagSafe magnetic charging, miniLED screens, and no Touch Bars are in the offing. After delays, look out for these to hit shelves in the next several weeks.\nWe still don’t expect the M1X MacBook Pros to be announced at Tuesday’s event. Instead, what’s more likely is that Apple holds a separate virtual event sometime in October to announce the new MacBook Pro hardware and new iPad hardware. A previous supply chain report had indicated that Apple is planning to ramp up M1X MacBook Pro production by October.\nThe new MacBook Pros will purportedly feature a new flat-edged design similar to what we’ve seen in the latest iMac, iPad Pro, and iPhone 12 designs.\nBloomberg also reported that the new MacBook Pros will feature an HDMI port and an SD card slot, alongside the return of MagSafe technology for magnetic charging. Images and diagrams leaked as part of an Apple ransomware attack seemingly corroborated this.\nAre you planning to buy Apple’s new M1X MacBook Pros when they’re available this fall? Let us know down in the comments!\nThere will be two events, and I’d expect the latter to be Mac + iPad. iPhone/Watch Tuesday. https://t.co/xfAjhUkigC — Mark Gurman (@markgurman) September 12, 2021\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.008968038391321898
    },
    "article_22": {
        "title": "EU pressing on with USB-C charger legislation on Thursday",
        "body": "Credit: AppleInsider\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nThe European Commission will soon present a legislative proposal that could institute a common charger for mobile devices in the EU, possibly forcing Apple to ditch Lightning for USB-C.\nEuropean officials have been pushing for a common charging standard for some time, despite protests from Apple and others in the technology industry.\nAccording to Reuters, the introduction of a legislative proposal implementing a common charging standard in Europe could come as soon as Thursday, Sept. 23.\nIn addition to a proposed harmonized charging port, the European Commission reportedly also wants the sales of charging hardware to be decoupled from devices.\nEU lawmakers claim that a common charger would be more convenient for consumers and would be more environmentally friendly. Apple has argued against mandated charging standards, claiming that they would dampen innovation, annoy consumers, and create unnecessary electronic waste.\nIt isn't clear what type of port the EU would mandate, but it would likely be USB-C. In 2018, half the chargers sold with mobile phones have a USB micro connector, while 29% had USB-C with an increase since. At the time, 21% had Apple's proprietary Lightning format but this has also increased with time.",
        "sentiment": -0.41494137759913097
    },
    "article_23": {
        "title": "Apple Maps rolls out 3D view to London, LA, New York, and San Francisco",
        "body": "Apple is bringing its 3D maps to more cities within the Apple Maps app, including London, LA, New York and San Francisco. The experience, launching with iOS 15, follows several years of investment in Apple’s mapping platform to make the app more competitive with the market leader, Google Maps. This has included not only the addition of 3D maps, like those arriving now to major markets, but also overall more detailed maps, improved transit features, AR viewing modes and more.\nMany of these features have taken time to roll out, with major metros around the U.S. and world being the first to gain the enhancements. AR viewing, for instance, only began launching to select cities this year.\nWith 3D maps, however, Apple Maps users will be able to see more details for areas across the city, including their neighborhoods, commercial districts, marinas, buildings and more, the company says, along with elevation details, new road labels and even custom-designed landmarks.\nFor example, Apple Maps will show renderings for famous spots, like Coit Tower in San Francisco, Dodger Stadium in LA, the Statue of Liberty in NYC and the Royal Albert Hall in London, with more landmarks to come in time.\nLater this year, these sorts of 3D maps will become available in Philadelphia, San Diego and Washington, D.C., Apple says. Then, next year, they’ll arrive in Montreal, Toronto and Vancouver.\nApple is also enhancing its road-level navigation in Apple Maps, with more clearly displayed turn lanes, medians, bus and taxi lanes, and crosswalks. These appear in a 3D viewing mode which makes it easier to see the best lane to choose based on traffic conditions or for better route planning purposes. The app will also display the estimated time of arrival, based on the current conditions, as Google Maps does. This new navigation, which was previously announced for a 2021 release, will arrive in CarPlay later this year, Apple said, without giving a more specific deadline.\nSimilarly, other major maps updates, which had been announced earlier this year, are also now rolling out. This includes transit features designed to make Apple Maps more competitive with third-party apps often favored by transit takers, like Citymapper. Now, nearby transit stations are prominently displayed at the top of the screen and users can pin favorite lines in Maps for easy access. And once a route is selected, Maps will automatically notify users when it’s time to disembark — something users can track on their Apple Watch, too.\nApple Maps offers more immersive walking directions with step-by-step guidance powered by augmented reality. This allows users to raise their phone to scan the buildings in their area, which lets Maps generate a more accurate position in order to provide more detailed guidance. This has been rolling out to select markets over the course of the year.\nIn addition, iOS 15 users can view a new 3D globe of the earth and they can tap an Explore Guides button in the Apple Maps app to access curated Guides from brands like Time Out, The Washington Post, the National Park Foundation, Complex and The Infatuation. These will offer suggestions about things to do or see in various cities worldwide. Users can also make guides of their own to share with friends and family.",
        "sentiment": 0.5618432149108823
    },
    "article_24": {
        "title": "Bitcoin scammers used Apple's iPhone 13 reveal to steal $69,000 from fans",
        "body": "Apple\nBitcoin\niPhone 13\nAdvertisement\nEvent Alert India's leading MSME Summit BI India is back with its 3rd edition Meet industry experts policymakers, business leaders from across sectors Register Now Our Speakers Rajnish Kumar Former SBI Chairman Ankur Warikoo Educator & Content Creator Bharat Sethi CEO & Founder Rage Coffee Ajay Thakur Head - BSE SME & Startups T Koshy CEO, ONDC\nAdvertisement\nAdvertisement\nScammers have utilised a fake event stream, a fakedwebsite and the promise of freeto scam unsuspecting fans during thereveal event, the media reported.According to AppleInsider, people looking for the Apple Event on September 14 may have stumbled into a lookalike stream, showing old interviews with Apple CEO Tim Cook instead of the \"California Streaming\" stream.Those who stuck around saw messages pop up in the video telling them to visit a special website - www.2021.apple.org, the report said.As reported by Zscaler, the website looked like a fake version of Apple's website, advertising a Bitcoin giveaway. All the person had to do was send 0.1 to 20 Bitcoin through a QR code to have double that amount sent back.This was a scam, but there was just enough care taken to convince people it was legitimate. Over $69k was sent to that Bitcoin wallet showing the scheme was highly successful.Those with some technological background might spot several flaws with the website, from the grammar problems to the .org URL. However, most people with just a passing understanding of technology could have easily mistaken such a website for a legitimate promotion.The scammer's website is currently down and will likely remain down after successfully swindling folks out of $69,000 in Bitcoin, the report said.Scams like this have occurred on YouTube before, with random channels being hacked to display Bitcoin promotions. For a more in-depth discussion, come on over to Business Insider Cryptosphere — a forum where users can deep dive into all things crypto, engage in interesting discussions and stay ahead of the curve.",
        "sentiment": -0.5690662642009556
    }
}