{
    "article_0": {
        "title": "Google plans privacy change similar to Apple’s, which wiped $230 billion off Facebook’s market cap",
        "body": "An Android statue is displayed in front of a building on the Google campus on January 31, 2022 in Mountain View, California. Google parent company Alphabet will report fourth quarter earnings on Tuesday after the closing bell.\nGoogle on Wednesday announced it's adopting new privacy restrictions that will cut tracking across apps on its Android devices, following a similar move made by Apple last year that upended several firms' advertising practices.\nGoogle said it's developing new privacy-focused replacements for its advertising ID, a unique string of characters that identifies the user's device. The digital IDs in smartphones often help ad-tech companies track and share information about consumers.\nThe changes could affect big companies that have relied on tracking users across apps, like Facebook parent Meta. Apple's adjustments hit Meta particularly hard, for example. Meta said earlier this month Apple's privacy changes will decrease the social media company's sales this year by about $10 billion. That news contributed to wiping $232 billion from the company's market cap in a single day, eventually pushing the total below $600 billion. Last June, Meta was worth more than $1 trillion.\nBut while Meta fought against Apple's changes, it voiced support for the way Google plans to implement its privacy tweaks.",
        "sentiment": -0.23747524280439725
    },
    "article_1": {
        "title": "Apple's retail employees are reportedly using Android phones and encrypted chats to keep unionization plans secret",
        "body": "Apple may be the world’s largest company with a market cap of almost $3 trillion, but its retail workers seem to hardly benefit from all that success, according to the latest reports. As a result, employees at several Apple Stores across the US are secretly working to unionize based on issues surrounding their take-home pay.\nThe dissent has seen employees of at least two US Apple Stores garner support from national unions on their way to making submissions to the National Labor Relations Board, per sources speaking to The Washington Post. What’s more, another six locations are supposedly at less-advanced stages in the unionization process.\nANDROIDPOLICE VIDEO OF THE DAY\nApple’s hourly rates are consistent with what other retailers pay in the same regions, but the animosity comes from the fact that most of those other companies do not earn nearly as much as the tech giant. Rising inflation and housing prices across the country are impacting unionization decisions, too, and many of the workers feel like their hourly wages are not keeping pace. The pro-union workers spoke to the media outlet in confidence, not yet wanting to let out their identities to avoid possible retaliation from Apple. To avoid eavesdropping by store managers and ensure they remain anonymous, the said employees have also reportedly been using encrypted chats and even Android phones.\nApple has more than 270 locations in the United States alone and employs over 65,000 retail workers. The company is known for its loyal customers and employees alike and has seen astonishing growth in recent years. It generated over $365 billion in revenue for the twelve months leading up to September 30, 2021 — a 33% increase year-over-year. The company did say that it plans to increase retail employees' pay by between 2% and 10% \"depending on the store location and role,\" according to Bloomberg, and will double the number of sick days offered for both full-time and part-time employees, along with increases to vacation day allotments and paid parental leave up to six weeks.\nThe retail employees' fight for unionization was reportedly inspired by recent wins at several Starbucks stores around the US, which started at a store in Buffalo, New York and has since spread to nearly 100 stores across the country.",
        "sentiment": -0.17204008939174506
    },
    "article_2": {
        "title": "Facebook says Apple iOS privacy change will result in $10 billion revenue hit this year",
        "body": "watch now\nFacebook parent Meta said on Wednesday that the privacy change Apple made to its iOS operating system last year will decrease the social media company's sales this year by about $10 billion. \"We believe the impact of iOS overall is a headwind on our business in 2022,\" Meta CFO Dave Wehner said on a call with analysts after the company's fourth-quarter earnings report. \"It's on the order of $10 billion, so it's a pretty significant headwind for our business.\" related investing news How big a threat is ChatGPT to Google? Morgan Stanley breaks it down Facebook's admission is the most concrete data point so far on the impact to the advertising industry of Apple's App Tracking Transparency feature, which reduces targeting capabilities by limiting advertisers from accessing an iPhone user identifier.\nFacebook Chief Executive Officer and founder, Mark Zuckerberg, leaving the Merrion Hotel in Dublin after meeting with Irish politicians to discuss regulation of social media, transparrency in political advertising and the safety of young people and vulnerable adults. On Tuesday, April 2, 2019, in Dublin, Ireland. Artur Widak | NurPhoto | Getty Images\nMeta shares sank 23% in extended trading on Wednesday after the company warned about numerous challenges and came up short on user numbers. Facebook said first quarter revenue will be $27 billion to $29 billion, while analysts were expecting that number to exceed $30 billion. Wehner said the $10 billion revenue hit this year is merely a best guess. \"We're just estimating what we think is the overall impact of the cumulative iOS changes to where the 2022 revenue forecast is,\" Wehner said. \"If you aggregate the changes that we're seeing on iOS, that's the order of magnitude. We can't be precise on this. It's an estimate.\"\nApple CEO Tim Cook delivers a keynote during the European Union's privacy conference at the EU Parliament in Brussels, Belgium October 24, 2018. Yves Herman | Reuters\nApple first introduced the ATT feature in iOS 14.5, which was released for iPhones last year. It's also included in iOS 15, which is running on 72% of modern iPhones, according to Apple. ATT consists of popups that ask users whether they want to be tracked when opening up an app. If the user says no, the app developer can no longer access the IDFA, a device ID that's used to target and measure the effectiveness of online ads. A study from ad measurement firm AppsFlyer in October suggested that 62% of iPhone users were choosing to opt-out of sharing their IDFA. The privacy feature disrupts the behind-the-scenes mechanics of many mobile ads, especially those that confirm whether a purchase or download was made. IPhone apps with targeted advertising can instead use SKAdNetwork, an Apple tool built as an alternative, which Apple says is more private. Online advertising companies have voiced their displeasure with the feature since it was first announced in June 2020, but Facebook has been the loudest in its criticism. In December 2020, Facebook ran a marketing campaign including full-page ads in major newspapers blasting the feature and saying that the change was about \"profit, not privacy.\" The next day, Apple CEO Tim Cook used Facebook's app in a tweet as an example of how the feature works. Sheryl Sandberg, Facebook's operating chief, said on Wednesday that ATT would hurt small businesses that rely on digital advertising to grow and are much more dependent than larger companies on personalized ads. It's a theme Facebook has hit repeatedly in its attacks on Apple. Sandberg said the changes are diminishing the accuracy of Facebook's ads, driving up prices based on an outcome like a sale or download. She also said that measuring whether those conversions occur is becoming more difficult. A day before Facebook's results, Alphabet blew past estimates with its fourth-quarter numbers, and cited strength in e-commerce ads, an area where Facebook saw weakness. Wehner suggested that Apple's changes aren't having the same impact on search as they are on other types of apps. He referenced how much money Google makes for Apple as the default search engine on the Safari browser. \"Given that Apple continues to take billions of dollars a year from Google Search, the incentive clearly is for this policy discrepancy to continue,\" Wehner said. WATCH: Meta reports Q4 results, shares tank",
        "sentiment": -0.5122617264137124
    },
    "article_3": {
        "title": "Mac users report Zoom using their microphone outside calls",
        "body": "Apple Mac users running the Zoom meetings app are reporting that it's seemingly keeping their computer's microphone on when they aren't using it.\nThe issue appears to affect the native app running on the latest macOS release, Monterey, in which Apple has implemented a visual cue to alert users that an application or device is accessing their microphone or camera — via an orange or green dot in the Menu Bar, respectively.\nUsers began complaining that the mic seems to be left active after Monterey was released late last year, and on December 27, Zoom put out an update that was meant to address the bug, stating that version 5.9.1 (3506) \"resolved an issue regarding the microphone light indicator being triggered when not in a meeting.\"\nHowever, it clearly hasn't fixed the issue for everyone.\nZoom has enjoyed massive growth and popularity due to worldwide COVID-19 lockdowns, and many people now use it as a videophone app – meaning that they leave it open in the background all the time, even when they aren't actively using it, so that they can receive Zoom calls unbidden. These users have complained, however, that Zoom appears to be keeping the microphone on constantly, even when they're not in a call.\nAnd if the mic isn't actually live, this defeats the purpose of the indicator.\nUsers on a Zoom community chat thread noted that even after installing the update, the issue persisted, with one commenting: \"Well, that most recent update seems to have made no obvious difference. I've just noticed the orange dot again, and when I quit Zoom, Timing.app told me that I'd apparently been on a 2 hour Zoom call.\n\"At this point, it looks like it's safest to only run Zoom while on active calls and keep it quit otherwise.\"\nTwitter users concurred this morning, with one dev commenting, \"You can see the orange dot on Mac since the last update, that shows mic usage.\"\nZoom is no stranger to privacy fears. At one point it installed a hidden web server on customers' Macs to enable automatic call handling. Notably, Apple updated macOS to remove the hidden program.\nThe Register asked Zoom for comment yesterday afternoon. A company rep told us they \"were looking into this.\" We'll update if a statement arrives.\nIn the meantime, if you'd like to know if apps are snooping on you, there are various third-party products such as Micro Snitch or OverSight to help you to monitor who's monitoring you. ®",
        "sentiment": -0.2860620316118002
    },
    "article_4": {
        "title": "Customers of Sanction-Hit Russian Banks Unable to Use Apple, Google Pay",
        "body": "Customers of sanction-hit Russian banks are unable to use Apple and Google Pay, Russia's central bank said.\nThese banks include VTB Group, Sovcombank, Novikombank, Promsvyazbank, and Otkritie, it said.\nGovernments imposed financial sanctions against Russia after its troops invaded Ukraine.\nSign up for our newsletter to get the latest stories in hedge funds, PE, fintech, and banking — delivered daily to your inbox. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\nCards issued by several Russian banks that have been hit by sanctions are unable to use Apple Pay and Google Pay services, the Central Bank of Russia said Friday.\nThe banks include VTB Group, Sovcombank, Novikombank, Promsvyazbank, and Otkritie, it said.\nThose banks' customers wouldn't be able to use their cards abroad, or to make online payments to companies registered in countries that have issued sanctions, the Central Bank said.\nA number of countries imposed financial sanctions against Russia earlier this week after it deployed troops in two breakaway regions of Ukraine. Sanctions were stepped up after Moscow ordered the invasion of Ukraine on Thursday, which Russian President Vladimir Putin said was an act of self-defense against NATO expansion into eastern Europe.\nThe UK, US, European Union, and Australia are among governments who are freezing the foreign-held assets of Russian banks which also include Sberbank, General Bank, IS Bank, Rossiya, and the Black Sea Bank.\n\"Every asset they have in America will be frozen,\" US President Joe Biden said Thursday.\nThe Wall Street Journal reported that people in Russia have been queuing at ATMs to get US dollars over concerns that the value of the Russian ruble will continue to plummet, while MSNBC reported that some banks in Moscow are running out of US dollars. The mass withdrawals have led to fears of a run on banks which could leave them short of capital needed for lending and financing.\nThe central bank announced that the affected bank cards would continue to work for standard contact and contactless payments across the country with no restrictions. Customers are able to access their funds at these banks at any time, the central bank said.",
        "sentiment": -0.39736232730663484
    },
    "article_5": {
        "title": "Android Messages beta starts properly displaying iOS Message reactions",
        "body": "Google is widely rolling out a new Google Messages feature to beta users that allows the Android messaging app to correctly interpret emoji reactions sent from the iOS Messages app, 9to5Google reports. The feature appears to be live in version 20220121_02_RC00 of the app, according to Droid-Life, but not for every user. Although it didn’t work on every phone we tried, we were able to get it working on an Oppo Find X3 Pro, which is more than can be said for when the feature initially started appearing last November.\nThe feature fixes a long-standing issue that can affect SMS chats between iPhone and Android users. When an iPhone user reacts to an Android message with emoji, the Android user typically sees this reaction sent as an entirely separate text message, resulting in confusion and lots of unnecessary clutter.\nHow the reactions appear to the recipient, on Android. Screenshot: Google Messages How the reactions appear to the sender, on iOS. Screenshot: Apple Messages\nPreviously, the thumbs down emoji in the above example would have been represented by a separate text message for Android users, saying a user “disliked” the “Do you agree?” message. The new beta app now treats emoji reactions the same across both operating systems.\nAs 9to5Google points out, there are inconsistencies between how reactions are represented on each operating system. The thumbs up and thumbs down reactions are similar across both platforms, but iOS’s “haha” reaction turns into “face with tears of joy” on Android, while “heart” becomes “smiling face with heart-eyes.” “Exclamation marks” become “face with open mouth” while “question mark” is “thinking face.” These are minor differences, but they could lead to significantly different interpretations of a reaction’s meaning.",
        "sentiment": -0.09294666476281625
    },
    "article_6": {
        "title": "'Angry spouse' throws iMac out of window, kills pigeon",
        "body": "What you need to know\nA passer-by claims to have witnessed someone throwing an iMac out of their window in Bushwick.\nAn \"angry spouse\" reportedly threw the device from a window, killing an innocent pigeon in the process.\nA Brooklyn bystander claims they witnessed an \"angry spouse\" in Bushwick throw an iMac out of a window, killing a pigeon in the process.\nThe frankly ridiculous story was reported by Twitter's Human Mel Friday who stated:\nWalking in bushwick and someone's angry spouse just threw this mac out the window, killing a pigeon on the way down\nWalking in bushwick and someone's angry spouse just threw this mac out the window, killing a pigeon on the way down pic.twitter.com/pa3m47dSuTWalking in bushwick and someone's angry spouse just threw this mac out the window, killing a pigeon on the way down pic.twitter.com/pa3m47dSuT— Human Mel (@melhuman) February 4, 2022February 4, 2022 See more\nThe picture certainly shows one of Apple's larger 27-inch iMacs from back in the day missing its distinctive black bezels and sitting atop a deceased pigeon on the side of the road. The picture also shows an older flat-screen TV, however, it is unclear if this piece of tech was also defenestrated during the dispute, or whether it has been deliberately placed there for disposal.\nApple's iMac has been a stalwart of the company's desktop lineup for many years, receiving a design overhaul that shifted it away from the chunky form factor to a slimmed-down version. Last year, the company launched its first-ever Apple silicon iMac to great acclaim featuring not only Apple silicon but also a slew of awesome colors and a distinctive new thin design.\nReports indicate the company is also working on a larger form factor iMac that may also feature mini-LED technology, as debuted in the M1 iPad Pro (2021) last year. Apple is reportedly shaping up to include its M1 Pro and M1 Max chips in the lineup, representing a big power upgrade over the M1 version.",
        "sentiment": -0.20338685454970057
    },
    "article_7": {
        "title": "Meta earnings miss expectations amid Apple privacy changes, stock plummets",
        "body": "Facebook parent company Meta (FB) reported its Q4 earnings on Wednesday, falling short of analysts' expectations on earnings per share, and missing on its Q1 outlook amid the continued crunch from Apple's iOS privacy changes.\nHere are the most important numbers from the report compared to what analysts were expecting, as compiled by Bloomberg.\nThis content is not available due to your privacy preferences. Update your settings here to see it.\nCrucially, Meta's Q1 2022 revenue came up short, with the company estimating between $27 billion to $29 billion in the current quarter, below analysts' expectations of $30.25 billion.\nShares of Meta plummeted 22% following the report.\nFacebook CEO Mark Zuckerberg. REUTERS/Andreas Gebert\nThe quarter marks the first time Meta has reported its earnings as a company focused on building out the metaverse, not just social media apps like Facebook and Instagram. But Meta has warned it will take time to build out its metaverse capabilities to the level where users can interact with each other across vast virtual worlds via augmented reality and virtual reality headsets.\nQ4 was also the first quarter in which Meta released revenue numbers for its Reality Labs segment, which piled up losses of $3.3 billion. CEO Mark Zuckerberg previously announced that the company spent $10 billion on its metaverse effort in 2021.\nThis content is not available due to your privacy preferences. Update your settings here to see it.\nMore pressing in the near term is Meta’s ability to continue to navigate Apple’s (AAPL) recent privacy changes that allow iOS users to opt out of letting their apps track them across the web. The feature, called App Tracking Transparency, has been a roadblock for apps like Facebook and Snap (SNAP), which rely on that kind of data to sell ads to advertisers.\nAnd according to Meta CFO David Wehner, the iOS feature will hurt Meta moving forward.\n\"We will lap a period in which Apple's iOS changes were not in effect and we anticipate modestly increasing ad targeting and measurement headwinds from platform and regulatory changes,\" he said.\nWehner also pointed to inflation and supply chain disruptions, as well as exchange rates as the company's other pain points.\nStory continues\nThat’s not Meta’s only problem, though. The company continues to face increasing competition from the likes of TikTok and Snap, and, more importantly, must contend with an ongoing antitrust lawsuit from the Federal Trade Commission.\nLast month, District Judge James Boasberg ruled that the FTC’s suit against Meta can continue despite protests from the social networking company. In its suit, the FTC alleges that Meta ran a buy or bury scheme in which it sought to quash competition from smaller up-and-coming rivals.\nThe commission ultimately wants to break Meta up into smaller social networks. Without its combined network of apps, however, Meta would lose its spot as the world’s largest social media company. Whether that comes to pass, however, will take years to determine, as the suit is unlikely to be resolved in short order.\nSign up for Yahoo Finance Tech newsletter\nMore from Dan\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit\nGot a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.",
        "sentiment": -0.647811783719118
    },
    "article_8": {
        "title": "Apple Watch detects symptom of thyroid issue months ahead of diagnosis",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA nursing student in Australia is encouraging Apple Watch owners to enable heart rate notifications, after the wearable device detected symptoms of a thyroid condition months before being diagnosed.\nApple's heart rate notifications have helped numerous people detect issues with their heart, prompting them to go and seek further medical assistance. In a recent posting to TikTok, it's shown the wearable device can detect very early changes that could end up being diagnosed months later.\nPosted on February 2, TikTok user Lauren encouraged viewers of her video to enable notifications for detecting low and high heart rates, irregular rhythms, and for cardio fitness levels. In the video, spotted by The Independent, the Sydney-based nursing student admitted that she should've enabled the features earlier than she did, as it had medical consequences.\nIn Lauren's explanation, she says she was diagnosed with a thyroid condition a few weeks previously. However, she admits \"I would have realized something was going on if my Apple alerted me of changes.\"\n\"Instead of me waiting for the symptoms to get really bad, I could have gone to the doctor back in October, when there was this dramatic drop in a matter of days,\" Lauren adds, alongside a screenshot of a graph from the Health app. \"It dramatically dropped, which means my cardiovascular system wasn't working as well as it once was.\"\nThe drop also correlated with other symptoms, including fatigue, a sensitivity to heat, gaining weight, dry skin, and increased irritability. In December, she was diagnosed with thyroid hemiagenesis, and is undergoing treatment.\nLauren admits the Apple Watch wasn't an item she considered as being a provider of health and medical advice normally, but it was still useful. \"Don't get me wrong, your Apple Watch is definitely not something you should follow as medical advice, but it can come in handy, I guess, as a tool to prompt you to go get things investigated further.\"\n\"But on this occasion, I really wish that I had all the settings toggled on and noticed the changes and gone to the doctor sooner.\"",
        "sentiment": -0.4272652511795362
    },
    "article_9": {
        "title": "Apple Pay unavailable in Russia after U.S. and E.U. imposed-sanctions",
        "body": "Apple Pay unavailable in Russia after U.S. and E.U. imposed-sanctions\nCredit: Apple\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nPayment services, such as Apple Pay and Google Pay, are no longer available to customers of certain sanctions-hit Russian banks.\nAs the crisis in Ukraine continues into Friday, U.S and E.U.-imposed sanctions continue to freeze foreign-held assets of Russian banks.\nNow, as a result, customers will no longer be able to use any cards issued by sanctions-hit Russian Banks with U.S.-based payment systems, such as Google or Apple Pay.\nBanks affected by sanctions include VTB Group, Sovcombank, Novikombank, Promsvyazbank, and Otkritie, according to the Central Bank of Russia.\nAdditionally, as Business Insider points out, Russian customers will not be able to use their credit cards abroad. The customers will also be unable to make online payments to companies registered in countries that have imposed sanctions.\nThe Russian invasion of Ukraine has sparked a \"Black Swan\" event in the stock market, and a sell-off of Apple, other big tech stocks, and Bitcoin.",
        "sentiment": -0.7199105489999056
    },
    "article_10": {
        "title": "U.S. Senate Judiciary Committee Approves Another Antitrust Bill That Would Allow Sideloading on iPhone",
        "body": "The U.S. Senate Judiciary Committee today approved the bipartisan Open App Markets Act, an antitrust bill that would allow for alternative app stores and alternative in-app payment systems on the iPhone. The bill will now head to the Senate floor for a vote.\nApple had urged the U.S. Senate Judiciary Committee to reject the bill, arguing that sideloading would pose privacy and security risks for customers.\n\"Sideloading would enable bad actors to evade Apple's privacy and security protections by distributing apps without critical privacy and security checks. These provisions would allow malware, scams and data-exploitation to proliferate,\" said Apple's government affairs head Tim Powderly in a letter sent to the Committee earlier this week.\nLast month, the U.S. Senate Judiciary Committee approved the American Innovation and Choice Online Act, another antitrust bill that would allow sideloading and which Apple spoke out against, citing the same privacy and security risks.\nThe passage of the Open App Markets Act out of the Senate Judiciary committee brings us one step closer to having this legislation signed into law. This bill will let people download apps directly from outside companies rather than being forced to go through official app stores. — Sen. Marsha Blackburn (@MarshaBlackburn) February 3, 2022",
        "sentiment": 0.28211912098858094
    },
    "article_11": {
        "title": "Apple prepares to dole out pay raises to many U.S. retail employees",
        "body": "Apple prepares to dole out pay raises to many U.S. retail employees\nArticle Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nAs the labor market continues to tighten, Apple will provide raises to employees in hopes of retaining its retail location workers.\nThis week, Apple began holding store briefings and individual meetings with employees as the Cupertino tech giant prepares to increase the pay of its retail employees.\nSalespeople, Genius Bar technical support, and some senior hourly workers will receive a bump in their pay starting this month. The raises will range from 2% to 10%, depending on the store location and role.\nAccording to Bloomberg, the increases are catered to those who worked in Apple retail settings prior to the onset of the COVID-19 pandemic. The goal is to better align veteran staff with recent hires. The increases do not apply to all employees, and not all stores have been notified of changes.\nApple has also planned to significantly increase benefits for Apple Store employees starting in April. The company plans to add sick days and vacation days to retain employees.",
        "sentiment": -0.1654554429464042
    },
    "article_12": {
        "title": "Apple unveils contactless payments via Tap to Pay on iPhone",
        "body": "February 8, 2022\nPRESS RELEASE\nApple empowers businesses to accept contactless payments through Tap to Pay on iPhone\nLater this year, US merchants will be able to accept Apple Pay and other contactless payments simply by using iPhone and a partner-enabled iOS app\nCUPERTINO, CALIFORNIA Apple today announced plans to introduce Tap to Pay on iPhone. The new capability will empower millions of merchants across the US, from small businesses to large retailers, to use their iPhone to seamlessly and securely accept Apple Pay, contactless credit and debit cards, and other digital wallets through a simple tap to their iPhone — no additional hardware or payment terminal needed. Tap to Pay on iPhone will be available for payment platforms and app developers to integrate into their iOS apps and offer as a payment option to their business customers. Stripe will be the first payment platform to offer Tap to Pay on iPhone to their business customers, including the Shopify Point of Sale app this spring. Additional payment platforms and apps will follow later this year.\n“As more and more consumers are tapping to pay with digital wallets and credit cards, Tap to Pay on iPhone will provide businesses with a secure, private, and easy way to accept contactless payments and unlock new checkout experiences using the power, security, and convenience of iPhone,” said Jennifer Bailey, Apple’s vice president of Apple Pay and Apple Wallet. “In collaboration with payment platforms, app developers, and payment networks, we’re making it easier than ever for businesses of all sizes — from solopreneurs to large retailers — to seamlessly accept contactless payments and continue to grow their business.”\nOnce Tap to Pay on iPhone becomes available, merchants will be able to unlock contactless payment acceptance through a supporting iOS app on an iPhone XS or later device. At checkout, the merchant will simply prompt the customer to hold their iPhone or Apple Watch to pay with Apple Pay, their contactless credit or debit card, or other digital wallet near the merchant’s iPhone, and the payment will be securely completed using NFC technology. No additional hardware is needed to accept contactless payments through Tap to Pay on iPhone, so businesses can accept payments from wherever they do business. Apple Pay is already accepted at more than 90 percent of US retailers, and with this new capability, virtually every business, big or small, will be able to allow their customers to Tap to Pay on iPhone at checkout. Tap to Pay on iPhone will also roll out to Apple Store locations in the US later this year.\nPrivacy is fundamental in the design and development across all of Apple’s payment features. With Tap to Pay on iPhone, customers’ payment data is protected by the same technology that makes Apple Pay private and secure. All transactions made using Tap to Pay on iPhone are encrypted and processed using the Secure Element, and as with Apple Pay, Apple doesn’t know what is being purchased or who is buying it.\nApple will work closely with leading payment platforms and app developers across the payments and commerce industry to offer Tap to Pay on iPhone to millions of merchants in the US. Tap to Pay on iPhone complements and enhances the robust suite of payment and commerce tools that payment platforms and app developers provide to their merchant customers to help them run and grow their businesses. Tap to Pay on iPhone will work with contactless credit and debit cards from leading payment networks, including American Express, Discover, Mastercard, and Visa.\n“Whether you’re a salesperson at an internet-first retailer or an individual entrepreneur, you can soon accept contactless payments on a device that’s already in your pocket: your iPhone,” said Billy Alvarado, Stripe’s chief business officer. “With Tap to Pay on iPhone, millions of businesses using Stripe can enhance their in-person commerce experience by offering their customers a fast and secure checkout.”\nTap to Pay on iPhone will be available to participating payment platforms and their app developer partners to leverage in their software developer kits (SDKs) in an upcoming iOS software beta.\nAbout Apple\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\nThe Contactless Symbol is a trademark owned by and used with permission of EMVCo, LLC.\nPress Contacts\nApple Media Helpline\nmedia.help@apple.com\n(408) 974-2042",
        "sentiment": 0.4167288880519293
    },
    "article_13": {
        "title": "Largest sovereign wealth fund plans to vote against Tim Cook's $99M pay",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nNorway's oil fund has declared it will be voting against a pay policy that would provide Apple CEO Tim Cook a $99 million compensation package along with other proposals ahead of Apple's annual shareholder meeting.\nApple will be holding its annual shareholder meeting virtually on Friday, March 4, giving an opportunity for votes to be cast on a number of proposals. Days ahead of the event, one organization has disclosed how it intends to vote.\nNorway's oil fund, the world's largest sovereign wealth fund valued at $1.3 trillion, said on Sunday it will be voting against Apple on pay policies. The disclosure includes one vote that would grant Tim Cook salary and bonuses valued at $99 million.\nThe fund said that a substantial part of annual pay should be provided in shares, which should be locked in for five to ten years, reports the Financial Times. It also says the board \"should provide transparency on total remuneration to avoid unacceptable outcomes.\"\nThe group will also be voting against Apple in relation to transparency, forced labor, an audit of civil rights, and sustainability disclosures.\nThe signaling by the fund follows after another declaration from February 16, when Institutional Shareholder Services told clients to vote against the pay and bonus package. ISS cited \"significant concern\" with the stock award in 2021.",
        "sentiment": -0.5965983495962891
    },
    "article_14": {
        "title": "TikTok Can Circumvent Apple and Google Privacy Protections and Access Full User Data, 2 Studies Say (Exclusive)",
        "body": "TikTok can circumvent security protections on Apple and Google app stores and uses device tracking that gives TikTok’s Beijing-based parent company ByteDance full access to user data, according to the summaries of two major studies obtained by TheWrap that appear to confirm longstanding concerns raised by privacy experts about the popular video-sharing app.\nThe studies, conducted by “white hat” cybersecurity experts that hack for the public good, were completed in November 2020 and January 2021. TheWrap verified the studies and confirmed their conclusions with five independent experts.\nWhen asked by TheWrap, reps for TikTok — whose parent company ByteDance has had ties to the Chinese government — declined to confirm or deny the validity of the research.\nThe summaries of the studies, shared exclusively with TheWrap, suggest that TikTok is able to avoid code audits on the Apple and Google app stores. More alarmingly, the research found that TikTok is capable of changing the app’s behavior as it pleases without users’ knowledge and utilizes device tracking that essentially gives the company and third parties an all-access pass to user data. This is highly unusual and exceeds the abilities of U.S.-based apps such as Facebook, Twitter and other social media platforms.\n“These dynamic properties allow TikTok carte blanche access to your device within the scope of what the application can see,” said Frank Lockerman, cyber threat engineer at cybersecurity firm Conquest Cyber who reviewed the two “white hat” studies. “The TikTok browser not only has access to convert from web to device, but it also has the ability to query things on the device itself.”\nThird parties and advertisers can end up tracking TikTok users over time across devices and installs, according the summary of a white-hat cybersecurity group’s January 2021 study obtained by TheWrap.\nWhile TikTok contends that its methods are standard, especially for social media apps relying on ads, both the researchers and independent experts say that the app’s code makes it much harder to monitor. “Consequentially, just because the application doesn’t do anything bad today, doesn’t mean that it won’t do bad things in the future,” one study said.\nStory continues\nAfter reviewing the studies’ findings, Russ Jowell, mobile development expert at BestApp.com, said that it is difficult to know the full extent of TikTok’s data mining capabilities and intent. But overall, he said: “It seems to me that ByteDance has gone to monumental lengths — possibly more than Facebook, Twitter and other social networks — to conceal the inner workings of their app.”\nA spokesperson for TikTok declined to address the studies directly, but told TheWrap that the company adheres to app store policies, adding that its product meets information security standards in the U.S., the U.K., Ireland, India and Singapore and recently received certification by the ioXt Alliance for meeting standards and commitments to cybersecurity and transparency. In fact, TikTok said it works with the ethical hacker community and researchers through a program called HackerOne to test its product.\n“The security and privacy of our global community is always a top priority,” the company said in a statement provided to TheWrap. “Staying ahead of next-generation cyberthreats requires continuously strengthening the security of our platform, which is why we continually work to validate our security standards and collaborate with industry-leading experts to test our defenses.”\nNonetheless, some countries have made their own decisions regarding TikTok. The app itself is not available in China, and India banned it in 2020 over national security concerns.\nAfter former president Donald Trump attempted to ban the Chinese-owned app as part of his executive order in 2020, the Biden administration last June dropped the outright ban but is now considering new regulations that would affect foreign-owned services, namely TikTok. The proposed rules from the Department of Commerce would add criteria for Commerce Secretary Gina Raimondo to consider when reviewing software that pose an “undue or unacceptable risk.”\nIn a short time, TikTok’s popularity seems unstoppable, more than doubling U.S. users between 2019 and 2021, to 78.7 million. The social video app is gaining at speeds that threaten the growth of 18-year-old Facebook and its younger platform Instagram — both of which are losing the fight over younger users. Last September, TikTok hit a milestone of 1 billion monthly users and is on track to gain more Gen Z users than Instagram and more total users than Snap by 2023, according to eMarketer estimates.\nDespite growing interest in regulating the company, TikTok remains a major platform for creators and companies to penetrate the millennial and Gen Z markets. Plus, the app is starting to attract more older users even as it explores making the leap to TV screens. In March 2021, the platform’s reach among users aged 35 to 44 doubled to around 18% when compared to the previous year, according to Comscore. Those aged 45 to 54 accounted for 14.6% of total unique visitors during that period, and those 65 and over accounted for 3.5%, tripled from 2020.\nRepresentatives for Apple and Google didn’t respond to TheWrap’s requests for comment.\n(Insider Intelligence)\nUnder the hood\nIn examining TikTok’s source code in 2020 and 2021, the two studies examined how the app collects data on contacts, device ID and clipboard actions and conceals data being sent to and from TikTok’s servers. TheWrap was not able to obtain the full text of the two studies, but spoke to five independent experts who reviewed the results.\nThe studies show TikTok uses device IDs — numbers and letters identifying individual devices — for ad integration, which means advertisers can end up tracking people over time across devices and installs. “Once one advertiser has a device ID that’s correlated, all privacy is gone,” one report noted.\nReferring TheWrap to its FAQ page, a TikTok rep said: “The TikTok app is not unique in the amount of information it collects, compared to other mobile apps. In line with industry standards, we collect information that users choose to provide to us in order to improve the experience people have on our app. Also like our peers, we constantly update our app to keep up with evolving security challenges.”\nExamining the backend, researchers also found that the app essentially acts like a web browser. It uses a JavaScript bridge, the programming language for the web, to directly pull the app from TikTok’s servers when it’s launched. This makes the security of the app hard to assess, because that can keep changing, according to Lockerman at Conquest Cyber. Theoretically, it also means TikTok can change its app behavior dynamically or test certain things on the fly without pushing an update to users.\n“This has great significance to the security of the app, because the state of it cannot be determined by static analysis of the app alone,” Lockerman said.\nOne white-hat security group’s Android analysis of TikTok app from January 2021 shows how the code uses many native libraries thwarts Google code analysis.\nBecause the code uses many native libraries, it can “thwart Google Store code analysis using these libraries,” Lockerman explained. This makes the app harder to reverse engineer, as the code doesn’t rely on system libraries already made available to developers. In coding, libraries are sets of code used for specific tasks. And by effectively running as a web app, the app is capable of circumventing Apple and Google code audits, the research said.\nTikTok maintained that its app is not a web browser that can be rewritten constantly and restated that it follows Google and Apple store policies. The company said the app does operate by pulling server data, such as the latest configuration settings, but that this is standard practice to ensure its performance.\nApple and Google’s app stores are known to be very strict in implementing measures to protect users from illegal activity, fake apps and other potential dangers. Countless apps have been banned for disguising themselves as tools, such as photo filters or camera scanners, with the intent of scamming users and going after their money and personal information. The Android app store, for example, enforces guidelines on app permissions, user experience and overall accessibility to maintain high-quality apps.\nOn the Apple app, the studies indicated TikTok made its own version of a video player presumably to ensure the code runs properly — but Lockerman said it’s also likely used to hide things. Additionally, the app relies on a “prefetch system” to load up multiple videos simultaneously in the background while the user is watching. This improves speed, which is in large part what makes TikTok so successful at getting users hooked. By tracking how long users linger on content or which videos they rewatch, TikTok’s algorithm can “learn” people’s interests and drive engagement much faster than its rivals.\nTikTok explained only that it created its own video player to optimize performance for users.\nIt’s also worth noting that studies investigating the source code of apps is an analysis based on that point in time. Apps are updated often and corrected through patching.\nSo is TikTok safe to use?\nIn terms of personal safety of TikTok users, the concern is less about vulnerabilities that researchers found on the app than what TikTok is doing with all this information it gathers, Jeff Engle, president of Conquest Cyber, told TheWrap. The potential dangers, as is the case with all apps tracking user activity, is the risk of threats from external actors and the compromising of user data.\n“As with any social media, if you are not paying, then you are likely the product,” Engle said. “The data you give, which almost always is more than users realize, can be hijacked, but that is an individual risk analysis on a user-by-user basis. The collection, control of distribution and manipulation of any social media makes it a powerful weapon.”\nHowever, experts note that TikTok’s data mining may be no worse than that of major social networks like Facebook — the difference is in what TikTok then does with the data. A study in January by mobile marketing company URL Genius comparing 10 social apps suggested TikTok was the top app collecting user data, such as IP address, location and search history, to share with third parties that can continue tracking across other sites even after you close the app.\nTikTok is actually the international version of social app Douyin, which was released in China in 2016. A year later, parent company ByteDance launched TikTok outside China after merging it with another of its apps, Musical.ly. In fact, TikTok’s former employees have raised concerns over the control of its parent company and its ability to access American user data.\nWhile Facebook users voluntarily fill out personal information on their pages, from their education to where they live, TikTok’s data collection is less obvious to the everyday user — the app records how long you stay on a video, who you engage with and what topics and content you rewatch the most.\nAcknowledging TikTok’s rising influence, Jowell said it’s unlikely these privacy concerns will cause people to delete the app altogether. But from a security standpoint, his advice is to avoid posting content that contains any personally-identifiable information and to change the settings and outfits you use in your posts. “Always remember, hitting that send or upload button is akin to your kids leaving the house when they are grown,” Jowell said. “Once you do it, you no longer have full control of that piece of content.”",
        "sentiment": -0.13587135250533097
    },
    "article_15": {
        "title": "Report: Apple Watch Series 8 to include 'major updates to activity tracking and faster chips,' Series 3 may finally be discontinued",
        "body": "The Apple Watch Series 7 brought a notable redesign with larger 41mm and 45mm sizes and even smaller display bezels than before. Now, a new report from Bloomberg indicates that 2022 could be the “biggest [year] in the history of the Apple since the original model” with new features, the Apple Watch Series 8, and more.\nPlus, the increasingly slow and outdated Apple Watch Series 3 “may finally be retired.”\nApple Watch Series 8 features, SE, and more\nIn the latest edition of his Power On newsletter, Bloomberg’s Mark Gurman doubles down on his previous reporting that Apple will likely introduce three new Apple Watch models this year. Those models purportedly include:\nApple Watch Series 8\nAn updated Apple Watch SE\nAn Apple Watch geared toward extreme sports\nGurman goes on to say that he doesn’t expect “any major new health sensors” for the Apple Watch this year, though there is a possibility that Apple finally adds a body temperature feature to the device. The changes that we can reportedly expect include “major updates to activity tracking” as well as continued performance improvements.\nFinally, Gurman also notes that this could finally be the year that the oft-maligned Apple Watch Series 3 is discontinued. As we’ve covered here at 9to5Mac multiple times, the Apple Watch Series 3 has become increasingly hard to recommend despite its attractive price point.\nHere’s the full blurb from Gurman about his expectations for the Apple Watch lineup this year:\nI think this year will be the biggest in the history of the Apple Watch since the original model. I’m looking for three new models this fall: an Apple Watch Series 8, an Apple Watch SE and an Apple Watch geared toward extreme sports. I wouldn’t expect any major new health sensors this year, besides the possible inclusion of the oft-discussed body temperature feature. But look out for major updates to activity tracking and faster chips across the board. Also, the Apple Watch Series 3 may finally be retired.\nWhat do you make of this report? Are there any specific changes you’re hoping to see with this year’s Apple Watch refresh? Let us know down in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.08951585832983255
    },
    "article_16": {
        "title": "Apple is 'ungodly well-managed,' Berkshire's Charlie Munger says",
        "body": "Billionaire investor Charlie Munger is singing Apple’s praises. While the Berkshire Hathaway (BRK-A, BRK-B) vice chairman, and Warren Buffett, Berkshire chairman, regularly point to their relative lack of knowledge of the tech industry, Apple (AAPL) is now Berkshire’s largest stock holding.\nThe reason? Apple’s management.\n“I think Apple is one of the strong companies and will stay a strong company,” Munger told Yahoo Finance Editor-in-Chief Andy Serwer in an exclusive interview.\n“I think it's ungodly well-managed,” he added.\nMunger’s comments came ahead of his appearance at The Daily Journal’s annual shareholders meeting on Wednesday, during which The Daily Journal chairman opined on everything from crypto to investing in China.\nCharlie Munger, Vice-Chairman of Berkshire Hathaway (Getty Images)\nOver the past several years, Berkshire has built up its stake in Apple and other tech firms including Verizon and Amazon. But Munger is most impressed by Apple.\n“I judge the strength of the company based on how much the customers love it,” he said. “And I've got zillions of friends who they'd almost part with their right arm before they'd part with their iPhone. That's a hugely powerful position to be in.”\nApple has consistently posted impressive earnings results quarter after quarter. Take its Q1 report, for instance. While the pandemic and related supply chain crunch impacted Apple’s iPad sales, the company still managed to move a record $71.6 billion worth of iPhones.\nIt wasn’t just iPhones that sold well either, Apple also saw record revenue across its Mac, services and wearables businesses.\nOver the last 12 months, Apple’s shares have climbed 28%, that’s more or less tied with Google, up 27%, and better than peers like Microsoft, up 20%, and Amazon, which is down 3%.\nThis content is not available due to your privacy preferences. Update your settings here to see it.\nApple is also expected to roll out a number of new products this year, including a low-cost, 5G-capable iPhone SE, new Macs and iPads, and of course, its next-generation iPhone. Apple is also said to be preparing its first virtual reality/augmented reality headset for release later this year.\nStory continues\nThat product would be Apple’s first new major device release since it debuted the Apple Watch in 2015. It would also mark what could be Apple’s first steps into the metaverse, something that other companies, like Facebook parent Meta, are banking on as the next evolution of the internet.\nRegardless, if Apple continues to perform as well as it has under CEO Tim Cook, it’ll likely continue to have Munger and Buffett’s backing.\nSign up for Yahoo Finance Tech newsletter\nMore from Dan\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit\nGot a tip? Email Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.",
        "sentiment": 0.15579576404006393
    },
    "article_17": {
        "title": "Apple will reportedly debut an M2 chip with four new Macs this year",
        "body": "Apple is reportedly gearing up to release several new Macs with an M2 chip later this year, according to Bloomberg reporter Mark Gurman’s Power On newsletter. Gurman expects the company to debut a 13-inch MacBook Pro, Mac Mini, 24-inch iMac, and a redesigned MacBook Air, all outfitted with the rumored M2 chip.\nThe M2 chip will be slightly faster than its predecessor\nApple hasn’t offered any hints about the potential M2 chip, but Gurman thinks its CPU will be slightly faster than the M1’s, and that it will share the same eight-core architecture. Its graphics cores, however, may jump from seven or eight to nine or 10. Come 2023, Gurman thinks Apple may release Pro and Max versions of the M2 chip — just like it did for the M1 chip — as well as announce an M3 chip.\nIt’s been well over a year since Apple first announced its very first in-house M1 chip in November 2020, and several months since its M1 Pro and M1 Max debut. As Apple continues to distance itself from Intel silicon, it has a few other Macs on tap that are likely meant to shove any remaining Intel-powered devices out of its lineup. Gurman expects a larger iMac Pro with M1 Pro and M1 Max chip options to replace its current 27-inch iMac Pro, along with a smaller Mac Pro that comes “with the equivalent of either two or four M1 Max chips.” And while the Mac Mini already comes with an M1 chip, Gurman expects it to get an upgraded M1 Pro option (in addition to an M2 variation).",
        "sentiment": -0.167986698448658
    },
    "article_18": {
        "title": "Leaked plan shows Intel will try to be more efficient than M1 Max by late 2023",
        "body": "Leaked plan shows Intel will try to be more efficient than M1 Max by late 2023\nArticle Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA presentation slide claiming to show Intel's projected future roadmap includes plan for Arrow Lake processor to outperform Apple's M1 Max by late 2023 or early 2024.\nIntel has already claimed to be producing processors that exceed the performance of Apple's M1 Max. However, the difference is within a margin of error while at the same time, Intel's processors require dramatically more power.\nNow the company is reportedly aiming at a new processor that will beat Apple's 2021 chips by early 2024 at the latest.\nIt wasn't a rumour, it was their plan. I talked with Intel engineers working on the project and I was also handed this slide a bit before then. If they are no longer doing TSMC 3nm its a decision made since the video. pic.twitter.com/zr0FojtCv6 — Jim (@AdoredTV) February 22, 2022\nThe tweet from \"Jim,\" aka AdoredTV, was in response to a thread discussing Intel's use of TSMC for 3 nanometer chip production. He says he got the slide \"between 8-9 months ago,\" so plans may have changed.\nIntel's slide says that it is about \"targeting Apple compete 14\" premium designs requiring high-touch OEM collaboration.\" And also that it is focused on how to \"maximise performance.\"\nTechnology site WCCFtech, which previously reported on Apple using Intel for a 2022 Mac Pro update, Intel plans a 320 EU iGPU based on Battleimage architecture.\nWCCFtech further says that according to the leaked slide, the forthcoming Arrow Lake-P (portable) processors will use 14 cores, while the desktop Arrow Lake-S will have up to 40 cores.",
        "sentiment": -0.2589682023972273
    },
    "article_19": {
        "title": "iOS 15.4 makes Shortcut automations way less annoying to use",
        "body": "Apple’s upcoming iOS 15.4 software update appears to have quietly added a massive quality of life change for its Shortcuts app: the ability to disable the incredibly annoying notifications for personal automations that users have set up on their devices, as spotted by Fjorden developer Florian Bürger on Twitter.\nFor those who don’t use Shortcuts regularly, the automations feature is one of the most useful and powerful tools that Apple gives its users access to. At its heart, it lets users set up basic “if / then” triggers for a variety of conditions on an iPhone, be it a specific time of day, arriving at a location, getting an email or text from a specific contact, joining a Wi-Fi network, tapping an NFC tag, opening an app, or when your phone hits a certain level of battery life.\nUsed properly, Shortcuts is incredibly useful, allowing things like disabling notifications when your Kindle app is open so you can read in peace, automatically turning on low power mode when your phone’s battery dips below 50 percent, or disabling rotation lock when you open the Apple TV app so your shows enter full-screen mode properly.\nBut up until iOS 15.4, Apple had previously rendered the feature virtually unusable for common tasks by instituting mandatory notifications every single time the conditions were triggered. The new update fixes that, though, by adding a toggle that allows users to disable those notifications makes Apple’s Shortcut automations vastly more usable for day-to-day tasks by allowing you to remove the spammy notifications that used to appear every time you triggered one.\nTo disable the notifications, simply tap on the automation and switch off the new “notify when run” toggle that’ll appear if you’re running the latest iOS 15.4 beta. You’ll have to do it for each notification, but once you’ve set it up right, you’ll never be bothered by the Shortcuts notification bar for your automations again.\nThe new “notify when run” toggle to disable automation notifications in Shortcuts\nThere are a few caveats here, though: the new setting is only for Shortcuts automations, not all Shortcuts. That means that if you’re using Shortcuts as a workaround for custom iOS icons, there’s still no way to remove the pop-up banner when you open an app with that method, for example.",
        "sentiment": 0.022037187218666078
    },
    "article_20": {
        "title": "Apple Stores lift mask mandate, plan resumption of in-person Today at Apple",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple has once again lifted its mask mandate for customers at most of its retail locations. And, as a result, the company is also restarting in-person Today at Apple courses soon.\nIn a report by Bloomberg, Apple has lifted its mask mandate for in-store shopping for locations in several states across the United States, namely the states of Ohio, North Carolina, Georgia, Kansas, Kentucky, among others. As a result, masks will be available to customers upon requests in eligible locations.\nThe mask mandate remains in effect for locations in states with stricter pandemic guidelines, such as Hawaii.\nApple is also expected to relaunch in-person Today at Apple tutorial classes in select locations as early as next week. In addition, many more sites target a March return for the live sessions.",
        "sentiment": -0.03657491458579898
    },
    "article_21": {
        "title": "Nvidia acquisition of Arm officially terminated, chip-designer's CEO steps down",
        "body": "Ro, 08 February 2022\nNvidia officially confirmed it's terminating the ongoing ARM acquisition after being unable to clear the regulatory hurdles in the past year and a half. Following the announcement ARM's CEO stepped down and will be replaced by Rene Haas.\nNvidia says it wasn't able to persuade regulators that the deal won't affect ARM's free licensing model and even offered to set up a separate entity that will hold the chip design licenses. As a result of the failed deal, SoftBank, which is the current owner of ARM, will get $1.25 billion break fee.\nSoftBank officially confirmed that it's now planing to make ARM public in an attempt to recoup part of the expected cash inflow from the failed sale.\nNew Arm CEO Haas said in an interview that the last year and a half was wrapped in uncertainty as the Nvidia-ARM acquisition was hanging in limbo. And despite the fact that ARM has never been better financial-wise, it is forced to let some of its employees go.\nPeople familiar with the matter say that the company has plans to go public in the US, although that hasn't been explicitly confirmed. SoftBank only said that it's planning to make ARM publicly traded without specifying more details at this point.\nSource 1 • Source 2",
        "sentiment": -0.9816733002662659
    },
    "article_22": {
        "title": "iPhone 6 Plus Added to Apple's 'Vintage Product' List",
        "body": "Apple today updated its list of vintage and obsolete products to add the iPhone 6 Plus, as it has been more than five years since the device was last offered for sale.\nThe ‌iPhone‌ 6 Plus was first released in September 2014 alongside the ‌iPhone‌ 6, and it was discontinued in September 2016 following the launch of the ‌iPhone‌ 7 and ‌iPhone‌ 7 Plus. The ‌iPhone‌ 6 Plus' sister phone, the ‌iPhone‌ 6, is not on the vintage list at this time as it was available for sale for a longer period of time.\nApple relaunched the ‌iPhone‌ 6 in 2017 as a midrange ‌iPhone‌, and it was available for purchase until September 2018, so for that reason, it will be another two years or so before it is designated as a vintage product.\nThe ‌iPhone‌ 6 and 6 Plus were notable for being the first devices to offer support for Apple Pay and for marking the first year that Apple offered the ‌iPhone‌ in multiple size options. Apple has continued on with the multi-size release strategy since the ‌iPhone‌ 6 and 6 Plus launch.\nThe vintage products list features devices that Apple stopped distributing for sale more than five years ago and less than seven years ago. Apple provides service and parts for vintage devices for up to 7 years, or as required by law, but repairs are subject to parts availability.\nApple stopped supporting the ‌iPhone‌ 6 and 6 Plus with software updates back in 2019 with the launch of iOS 13.",
        "sentiment": -0.09495073970821169
    },
    "article_23": {
        "title": "Current iPod Touch Now 1,000 Days Old With No Sign of New Model",
        "body": "The seventh-generation iPod touch is 1,000 days old as of today, with no apparent sign of a new model on the way.\nIn May 2019, Apple unveiled the seventh-generation iPod touch. With 32 months having now passed since the seventh-generation iPod touch's launch, it is now the oldest device in Apple's lineup. Apple's next-oldest device still on sale is the AirPods Pro, which were released in October 2019 and hit 847 days old today.\nThe iPod touch is Apple's least expensive iOS device, starting at $199. With a 4-inch Retina display, it is also the smallest iOS device and the only remaining iOS device with a 3.5mm headphone jack. The iPod touch is most popular as an entry-level device in the Apple ecosystem, particularly for children, and is also a common choice in retail settings due to its pricing and form factor.\nIt is notable that the seventh-generation iPod touch was a very minor update, featuring the A10 Fusion chip from the iPhone 7 and a 256GB storage option for the first time. Every other aspect of the device, including the camera specifications and color options, were the same as the previous, sixth-generation iPod touch. In terms of major updates, the iPod touch was last redesigned almost 10 years ago in 2012 at the same time as the ‌iPhone‌ 5. Since then, it has had two minor refreshes in 2015 and 2019.\nLooking at the Apple devices that the company sold for the longest time, the seventh-generation iPod touch is still some way off the 2013 \"trashcan\" Mac Pro, which went 2,182 days without an update before the launch of the modular 2019 ‌Mac Pro‌.\nThe iPod touch is the only iPod product that Apple still sells following the discontinuation of the iPod nano and iPod shuffle in July 2017. Despite the hopes of some iPod enthusiasts and excitement around the potential nostalgia of reviving the classic iPod design with the click wheel, there have been no rumors of an eighth-generation iPod touch, or of any new iPod models at all, meaning that the future of the entire iPod brand and product line stands in question.",
        "sentiment": -0.11218322454286474
    },
    "article_24": {
        "title": "World Trade Center among first to replace office keys with iPhone and Apple Watch",
        "body": "With the release of iOS 15 last year, Apple expanded the Apple Wallet application to support storing office keys for the first time – this feature allows Apple Watch and iPhone users to access buildings by tapping their device to unlock a door. Now, real estate development firm Silverstein Properties has announced that it is rolling out support for this feature to tenants at the World Trade Center.\nOffice keys in Apple Wallet\nHere’s how Apple describes this feature in iOS 15:\nFor supported corporate offices, add your corporate access badge to Wallet and then use your iPhone and Apple Watch to access locations where your corporate badge is accepted. Tap to unlock your office doors and use your corporate badge in Wallet.\nIn a press release today, Silverstein Properties announced that its implementation of employee badges in Apple Wallet will allow users to access office buildings, tenant floors, fitness centers, and amenity spaces with just a tap of their iPhone or Apple Watch.\nThe setup process is handled through Silverstein’s Inspire application for iPhone. Using this app, employees and tenants can add their employee badge to Apple Wallet on their iPhone and Apple Watch.\n“We are proud to make it easy for our employees and customers to get into our buildings, their offices, and our shared lounges, cafes, conference facilities and yoga studios using employee badge in Apple Wallet on iPhone and Apple Watch,” said Tal Kerret, President of Silverstein Properties. “Through our Inspire app, we can now provide and manage access to any number of buildings and spaces in a safe and secure way.”\nOne interesting tidbit here is that this implementation of Apple Wallet integration allows Silverstein to easily manage shared office spaces. The company explains that one company could lease an office suite at 7 World Trade Center on Monday and Tuesday, and another company could lease the same space on Wednesday through Friday. Contactless access to that office can then be managed directly through the Wallet app and Silverstein app on iOS.\nThis capability will launch first at the 7 World Trade Center in New York City, but Silverstein Properties says that it also will expand the service to office customers in New York, Philadelphia, and Los Angeles over the coming months.\n9to5Mac’s Take\nApple has a lot of ambitions for the Apple Wallet application, and much of that ambition unfortunately relies on adoption by third-parties. We’ve already seen this impact the rollout of digital IDs in Wallet, and this marks one of the first instances of support for office keys officially rolling out.\nAdditionally, back in December, Apple launched support for hotel keys in Apple Wallet, but only at six Hyatt hotels. Ideally, all of these features will expand to additional locations sooner rather than later. In the meantime, the initial launches do at least show us how the features work in the real world.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.35116326143033805
    }
}