{
    "article_0": {
        "title": "Russia threatens to nationalize Apple, seize assets",
        "body": "What you need to know\nApple is under the threat of nationalization in Russia.\nRussia is planning to seize the assets of 59 major foreign brands that have stopped operations in the country.\nIt could see companies like Apple, McDonald's, Microsoft, and others placed under external management, nationalized, and more.\nMultiple reports indicate that Russia is threatening to nationalize companies that have stopped operations in the country, including Apple.\nFrom CNN:\nRussia said it could seize the assets of Western companies that have suspended operations in the country.Dozens of American, European and Japanese companies from almost every sector of the economy have abandoned joint ventures, factories, stores and offices in the last two weeks in response to Russia's invasion of Ukraine and the ensuring sanctions\nVladimir Putin reportedly told government officials on Thursday that Russia was considering plans to introduce \"external management\" to companies that had stopped operating in the country as a result of its invasion of Ukraine. That would include Apple, as well as companies like Microsoft, IBM, McDonald's, IKEA, and more. Putin reportedly said \"We need to act decisively with those [companies] who are going to close their production... it is necessary, then ... to introduce external management and then transfer these enterprises to those who want to work.\"\nThe measures could see the accounts and assets of such companies seized, or could see them placed under external management or nationalized. Apple does not operate any retail stores or manufacturing in the country, but does have staff located in the country including a corporate office opened in February to comply with government law.\nA multitude of companies, including Apple, have stopped operating in Russia as a direct response to its invasion of Ukraine. Russia has responded with its own measures, including banning many Western media outlets and apps including Instagram, which will go dark from Monday, March 14. Apple has stopped selling products in the country through its online store, and has de-platformed state-sponsored news outlets Russia Today and Sputnik. It means devices like Apple's best iPhone, the iPhone 13, are not available to purchase through the company's website. Third-party resellers who are still operating have increased their prices by 50% since the invasion began.",
        "sentiment": -0.44231339829663435
    },
    "article_1": {
        "title": "Apple Announces ‘M1 Ultra’ Chip As Next Breakthrough in Apple Silicon",
        "body": "Apple today announced the M1 Ultra chip, the third iteration to the M1 family, and it represents the next \"breakthrough\" for Apple Silicon.\n‌M1 Ultra‌ consists of two M1 Max chips connected with die-to-die technology called \"UltraFusion.\" The new highest-end chip of ‌Apple Silicon‌ features 114 billion transistors, with higher support for bandwidth memory at 800GB/s.\n\"M1 Ultra is another game-changer for Apple silicon that once again will shock the PC industry. By connecting two M1 Max die with our UltraFusion packaging architecture, we're able to scale Apple silicon to unprecedented new heights,\" said Johny Srouji, Apple's senior vice president of Hardware Technologies. \"With its powerful CPU, massive GPU, incredible Neural Engine, ProRes hardware acceleration, and huge amount of unified memory, M1 Ultra completes the M1 family as the world's most powerful and capable chip for a personal computer.\"\nUltraFusion allows two ‌M1 Max‌ chips to connect together across more than 10,000 signals, offering 2.5TB/s of bandwidth, according to Apple.\n‌M1 Ultra‌ has a 20-core CPU, with 16 high-performance and four high-efficiency cores. ‌M1 Ultra‌ supports up to 128GB of unified memory, an increase from the up to 64GB memory supported by the M1 Pro and ‌M1 Max‌.\nIn graphics, ‌M1 Ultra‌ has a 64-core GPU, which offers 8x faster graphics than ‌M1‌. ‌M1 Ultra‌ has a 32-core Neural Engine, which can operate 22 trillion operations per second and has two separate media engines.\nAs is common with ‌Apple Silicon‌, Apple claims that ‌M1 Ultra‌ offers \"unprecedented\" power efficiency with equally unprecedented power.\nIt delivers 90 percent higher multi-threaded performance than the fastest available 16-core PC desktop chip in the same power envelope. Additionally, M1 Ultra reaches the PC chip's peak performance using 100 fewer watts.2 That astounding efficiency means less energy is consumed and fans run quietly, even as apps like Logic Pro rip through demanding workflows, such as processing massive amounts of virtual instruments, audio plug-ins, and effects.\nThe first Mac to feature the ‌M1 Ultra‌ is the Mac Studio, which is aimed at creative professionals. The ‌Mac Studio‌ is available for order today.",
        "sentiment": 0.65492260423215
    },
    "article_2": {
        "title": "EU Provisionally Agrees on Law That Would Force Apple to Allow Alternative App Stores, Sideloading, and iMessage Interoperability",
        "body": "European lawmakers have provisionally agreed upon a new law that would force Apple to allow user access to third-party app stores and permit the sideloading of apps on iPhones and iPads, among other sweeping changes designed to make the digital sector fairer and more competitive.\nThe European Council and European Parliament said on Friday they had reached a political agreement on the Digital Markets Act (DMA), which will target many of the services offered by tech giants and force them to open up to other businesses.\nToday's announcement focuses on services like WhatsApp, Facebook Messenger, and iMessage, which will have to \"open up and interoperate with smaller messaging platforms, if they so request,\" according to the EU. \"Users of small or big platforms would then be able to exchange messages, send files or make video calls across messaging apps, thus giving them more choice.\"\nUnder the proposed DMA, Apple would also be forced to open up its App Store to third-party payment options instead of users having to go through Apple's own payment system – something it fought hard against in the Apple vs. Epic Games trial.\nIn addition, Apple would have to allow users to uninstall its Safari browser and other stock apps so that they can replace them with third-party alternatives if they so wish.\nThe DMA's broad scope also features several other demands that tech companies will have to abide by and which would surely impact Apple's services and platforms on multiple fronts. According to the proposed law, companies with a value of more than €75 billion ($83 billion), annual sales of €7.5 billion, and at least 45 million monthly users will meet its \"gatekeeper\" criteria, which comes with the following obligations and commitments.\nGatekeepers Will Have To:\nEnsure that users have the right to unsubscribe from core platform services under similar conditions to subscription.\nFor the the most important software (e.g. web browsers), not require this software by default upon installation of the operating system.\nEnsure the interoperability of their instant messaging services' basic functionalities.\nAllow app developers fair access to the supplementary functionalities of smartphones (e.g. NFC chip).\nGive sellers access to their marketing or advertising performance data on the platform.\nInform the European Commission of their acquisitions and mergers.\nBut They Can No Longer:\nRank their own products or services higher than those of others (self-preferencing).\nReuse private data collected during a service for the purposes of another service.\nEstablish unfair conditions for business users.\nPre-install certain software applications.\nRequire app developers to use certain services (e.g. payment systems or identity providers) in order to be listed in app stores.\nAccording to the DMA, if a gatekeeper violates the rules laid down in the legislation, it risks a fine of up to 10% of its total global turnover. For a repeat offense, a fine of up to 20% of its global turnover may be imposed.\nIf a gatekeeper systematically fails to comply with the DMA (or violates the rules at least three times in eight years), the European Commission can open a market investigation and impose \"behavioral or structural remedies.\"\nThe European Union has had to impose record fines over the past 10 years for certain harmful business practices by very large digital players,\" said Cédric O, French Minister of State with responsibility for digital. \"The DMA will directly ban these practices and create a fairer and more competitive economic space for new players and European businesses. These rules are key to stimulating and unlocking digital markets, enhancing consumer choice, enabling better value sharing in the digital economy and boosting innovation. The European Union is the first to take such decisive action in this regard and I hope that others will join us soon.\"\nThe wording of the legislation has yet to be finalized, but once the language is in place, the European Parliament and the Council will need to approve it. The regulation must be implemented within six months after its entry into force. Digital competition chief Margrethe Vestager said today that she expected the DMA to come into force \"sometime in October.\"\nShould the Digital Markets Act go on to become law, Apple will have to make major changes to its ‌iPhone‌ and ‌iPad‌ platform to accommodate the requirement to allow for non-App Store apps. Apple said it was \"concerned that some provisions of the DMA will create unnecessary privacy and security vulnerabilities for our users.\"\nApple is also facing similar legislation in the United States, with U.S. House lawmakers in June introducing antitrust bills that would result in major changes to the tech industry if passed.",
        "sentiment": -0.09896036293922049
    },
    "article_3": {
        "title": "Apple officially announces March 8 event: 'Peak performance'",
        "body": "Apple has officially announced its first special event of the year for March 8. Apple is teasing this event with the tagline: “Peek performance.” It is set to be a virtual event, and rumors indicate it will focus on the introduction of a third-generation iPhone SE, a refreshed iPad Air, and new Apple Silicon-powered Macs.\nApple Event officially set for March 8\nApple’s plans for a March 8 event were first reported by Bloomberg at the beginning of February. Apple has now made the event a official with invites being sent to members of the press. This marks the second year in a row that Apple has held its spring event virtually due to the COVID-19 pandemic.\nThe March 8 event will kick off at 10 a.m. PT/1 p.m. ET. It will be live-streamed across Apple’s website, the company’s YouTube channel, and directly in the Apple TV app on iPhone, iPad, Mac, and Apple TV. We’ll have more details on how to watch the event once event day officially rolls around.\nWhat to expect\nIn terms of new hardware, reports indicate that Apple planning three focuses for this March 8 special event.\nFirst off, a new iPhone SE 3 is believed to be on the way. This device will reportedly feature a design that is identical to the current iPhone SE, but with the latest A15 Bionic chip on the inside as well as support for 5G connectivity. While a low-cost iPhone SE isn’t the most exciting new product announcement, analysts believe it could be an attractive product for Android switchers.\nApple is also reportedly working on a new iPad Air 5. This device serves as the successor to the iPad Air originally announced in October 2020. The new model is expected to feature upgrades including an A15 Bionic chip, 5G connectivity, and an upgraded 12MP ultra-wide front-facing camera with Center Stage support.\nFinally, and perhaps most notably for many of you, new Macs powered by Apple Silicon are also rumored for the March 8 event. While details here are a bit murky, the most likely candidates for a March announcement include a new entry-level MacBook Pro as well as a more powerful Mac mini with the M1 Pro and M1 Max chips .\nApple is also still beta testing its next round software updates, which includes iOS 15.4, iPadOS 15.4, macOS 12.3, tvOS and HomePod Software 15.4, and watchOS 8.5. These are major updates with new features like support for Face ID while wearing a mask and Universal Control. Apple is reportedly targeting a release of these updates for sometime in the first half of March, so we expect more details during this March 8 event.\nWhat are you most excited to see Apple announce at its March 8 event? Are you planning to make any purchases? Let us know down in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.11906736906474599
    },
    "article_4": {
        "title": "TIL that Tim Cook wakes up every morning at 3:45am and spends 1 hour working through the 700 to 800 emails he receives every day.",
        "body": "Tim Cook (born November 1, 1960) is an American business executive who has been the chief executive officer of Apple Inc. since 2011.\nThe Apple CEO is up early every morning, rising at 3.45am to work on emails for an hour — he gets between 700 to 800 every day. “I like to take the first hour and go through user comments and things like that, and sort of focus on the external people that are so important to us,” he said in an interview with Axios on HBO.\nThe thing about it is, when you love what you do, you don’t really think of it as work. It’s what you do. And that’s the good fortune of where I find myself. RUNNER-UP: TIM COOK, THE TECHNOLOGIST | TIME\nWhile it’s not clear whether Cook likes to have breakfast every morning, a 2017 New York Times profile by Andrew Ross Sorkin revealed his preference when he did — “two scrambled egg whites, crispy bacon (they didn’t have his preferred turkey bacon), sugar-free cereal with unsweetened almond milk.”\nAt around 5am, he’ll head to the gym (off the Apple campus to ensure his privacy) for his morning workout. “I go to the gym and work out for an hour because it keeps my stress at bay,” he said. After the gym, he’ll head to his local Starbucks to work through more emails, before heading to Apple Park.\nWhile Cook is less flashy and lacks the hot tempered reputation of Jobs, he is well-known for his tough management style. Perhaps the most famous story of Cook’s demanding leadership is an anecdote from a 2008 Fortune profile by Adam Lashinsky, which recounted one of the CEO’s earlier days at Apple.\nOne day back then, he convened a meeting with his team, and the discussion turned to a particular problem in Asia. “This is really bad,” Cook told the group. “Someone should be in China driving this.” Thirty minutes into that meeting Cook looked at Sabih Khan, a key operations executive, and abruptly asked, without a trace of emotion, “Why are you still here?” Khan, who remains one of Cook’s top lieutenants to this day, immediately stood up, drove to San Francisco International Airport, and, without a change of clothes, booked a flight to China with no return date, according to people familiar with the episode. TIM COOK: THE GENIUS BEHIND STEVE | FORTUNE\nA more recent Wall Street Journal profile interviewed several managers at Apple, who described him as a demanding and detail-oriented leader. Middle managers routinely screened their staff before their meetings with Cook “to make sure they’re knowledgeable,” as a way to protect their team as well to avoid wasting the CEO’s time, as one manager put it.\n“He’ll ask you ten questions. If you answer them right, he’ll ask you ten more,” said Steve Doil, who worked on Cook’s operations team in a Fortune interview. “If you do this for a year, he’ll start asking you nine questions. Get one wrong, and he’ll ask you 20 and then 30.”\nIn an interview with Time, Cook explained his unemotional leadership style, ““I’ve always felt that a part of leadership is conveying a sense of urgency in dealing with key issues,” he says. “Apple operates at an extreme pace, and my experience has been that key issues rarely get smaller on their own.”\nEvening Routine\nCook is a tremendously private person outside of the office. If you try to find his home on Google Street View, you’ll see the image is blurred.\nLittle is known about the specifics of his evening routine, but he likes to relax in the evening and is usually in bed by 8:45 pm in order to get 7 hours of sleep before doing it all again.\nA Day In The Life By ‘Apple Explained’\nSources:",
        "sentiment": 0.13239484722726047
    },
    "article_5": {
        "title": "Please don’t kill the iPhone Mini",
        "body": "On Sunday, one of the most trusted sources of Apple rumors revealed that we can expect four new iPhones later this year: two with 6.1-inch screen sizes, likely to be the iPhone 14 and iPhone 14 Pro, and two with 6.7-inch screens, likely dubbed the iPhone 14 Max and iPhone 14 Pro Max. Four phones in total.\nThe tweet made me gasp because of what’s missing. There’s nothing even close to the 5.4-inch screen size of my beloved iPhone Mini.\nI know, I know, many people prefer big screens, and the iPhone Mini wasn’t exactly a success according to supply chain reports.\nBut that didn’t keep me and 11 other Verge staffers from buying one — and when I polled my colleagues this week, seven of us still agree that the rest of the world’s too-big phones can shove it.\nWe’ve got small hands or a desire to use our phones one-handed while juggling other responsibilities, and there’s nothing else that comes even close. In the US, the iPhone 12 Mini and iPhone 13 Mini are among the only full-fat compact smartphones on the market, and they’re arguably in a class of their own: rivals like the Sony Xperia 5 III are much taller, and while a Samsung Galaxy Z Flip 3 might fold down to fit into a pocket, it’s still notably wider than the iPhone Mini’s blissfully graspable form. (Also, both of those phones start at $1,000 and run Android, though that wouldn’t stop all of us.)\nAs an owner of a Google Pixel 4A and a casual admirer of my wife’s iPhone 13 Pro, I can tell you right now neither of them is a viable alternative to the Mini: their 5.8- and 6.1-inch screens now feel huge by comparison, and the Pro’s hefty steel build always makes me feel like I’m going to drop it, too.\nDespite the iPhone Mini’s iffy battery life, a significant number of us here at The Verge believe there’s no better option. But if analyst Ming-Chi Kuo’s prediction is true — and he’s rarely wrong when it comes to sizes, by the way — it means Apple is done offering a yearly upgrade path for people like us.\nBut there’s another place where small phone lovers at The Verge agree: it doesn’t need to be yearly. We could wait. And that might line up nicely with the other revelation that Kuo tweeted this week.\nNormally, when you buy the new iPhone, you get the new A-series chip, right? Not in 2022, says Kuo. The iPhone 14 will have the same chip that came with the iPhone 13 in 2021, with newer A16 chips exclusively headed to Apple’s new “Pro” series phones. If true, that means Apple was already planning to change its annual upgrade cycle in 2022 — and that might give it a natural opportunity to bring back the Mini when it might actually count.\nIf Apple offered a Mini in 2023 instead of 2022, perhaps it would be in time for a new, more efficient processor that could theoretically help with its battery life. (Apple’s previous solution was to make the iPhone 13 Mini’s battery nine percent bigger than the iPhone 12 Mini’s pack, which definitely helped some.)\nplease take these ideas you probably already thought of instead of killing our fav phone?\nOr Apple could bring it back in 2024 as a new iPhone SE — the phone that pioneered the idea of bringing back an ancient Apple form factor every now and then. The first iPhone SE in 2016 was a remake of the 2013 iPhone 5S, with a 4-inch screen. 2020 brought us a remake of the iPhone 8 with its 4.7-inch screen, and Apple just did it again by adding processing power, battery life, and 5G to the phone for those people who still demand a physical home button in 2022.\nBut in our review of the 2022 iPhone SE, Allison concluded that its five-year-old design is probably at the end of its rope, particularly its aging LCD screen with big bezels. That’s where I’m hoping the iPhone Mini can come in: at 5.4 inches, the iPhone Mini offers far more screen in a smaller form factor that I find much more comfortable to hold.\nIt’d be foolish to suggest that Apple should bring back the iPhone Mini this year because the decisions about which shapes to cut out of aluminum and which screens and batteries and boards to procure likely happened long ago. (That’s probably why we still got an iPhone 13 Mini long after reports that the iPhone 12 Mini didn’t sell.)\nSo Apple, we’re not asking you to bring it back in 2022. Our phones will hold out for another year or two or more — some Verge Mini enthusiasts admitted they don’t upgrade all that often — as long as their batteries don’t dwindle down prematurely. We’re just asking you, in the new spirit of giving your customers what they want, not to kill it off for good.",
        "sentiment": -0.060277706128545105
    },
    "article_6": {
        "title": "Anybody else surprised when Siri actually works?",
        "body": "Calls and Texts Hey Siri, answer the phone\nCalls and Texts Hey Siri, FaceTime Henri\nCalls and Texts Hey Siri, message Vivek on WhatsApp, ‘Where do you want to meet?’\nCalls and Texts Hey Siri, read my last text from Bob\nCalls and Texts Hey Siri, what’s my brother’s work address?\nCalls and Texts Hey Siri, text Josh ‘How do you feel about sushi tonight?’\nCalls and Texts Hey Siri, text Mom my location\nCalls and Texts Hey Siri, call Stonemill Matcha\nCalls and Texts Hey Siri, call Eliza\nCalls and Texts Hey Siri, FaceTime Family group chat\nCalls and Texts Hey Siri, share this with Lauren\nCalls and Texts Hey Siri, play my voicemails\nCalls and Texts Hey Siri, tell Nisha I’ll be home in 15 minutes\nCalls and Texts Hey Siri, return my last call\nCalls and Texts Hey Siri, call Mom on speaker\nCalls and Texts Hey Siri, who’s calling?\nCalls and Texts Hey Siri, hang up\nKnowledge and Answers Hey Siri, how windy is it?\nKnowledge and Answers Hey Siri, what can I ask you?\nKnowledge and Answers Hey Siri, what’s 74 times 9?\nKnowledge and Answers Hey Siri, how do you say ‘I love you’ in French?\nKnowledge and Answers Hey Siri, define ‘happenstance’\nKnowledge and Answers Hey Siri, what’s in a Gin Rickey?\nKnowledge and Answers Hey Siri, what causes a rainbow?\nKnowledge and Answers Hey Siri, how’s the stock market doing?\nKnowledge and Answers Hey Siri, what’s tomorrow’s forecast for Honolulu?\nKnowledge and Answers Hey Siri, what’s 20% of $184?\nKnowledge and Answers Hey Siri, how do you spell ‘fuchsia’?\nKnowledge and Answers Hey Siri, how old is Olivia Rodrigo?\nKnowledge and Answers Hey Siri, time in Stockholm\nKnowledge and Answers Hey Siri, what’s the news today?\nKnowledge and Answers How many dollars is 45 euros?\nKnowledge and Answers What is the population of Toronto?\nSmart Home Hey Siri, turn on the lights\nSmart Home Hey Siri, set the temperature to 72 degrees\nSmart Home Hey Siri, arm the security system\nSmart Home Hey Siri, are the upstairs lights on?\nSmart Home Hey Siri, play a song I like in the kitchen\nSmart Home Hey Siri, turn on the living room TV\nSmart Home Hey Siri, turn off the TV when I leave\nSmart Home Hey Siri, open the blinds at 7 AM\nSmart Home Hey Siri, turn on the fan in the living room and kitchen\nSmart Home Hey Siri, intercom ‘time for school’\nSmart Home Hey Siri, turn the patio lights off in an hour\nSmart Home Hey Siri, make it cooler\nSmart Home Hey Siri, it’s movie night\nSmart Home Hey Siri, announce, ‘On my way home, want me to pick anything up?’\nSmart Home Hey Siri, is the front door locked?\nSmart Home Hey Siri, I’m home\nSmart Home Hey Siri, did I close the garage door?\nSmart Home Hey Siri, show driveway camera\nEveryday Tasks Hey Siri, open Photos\nEveryday Tasks Hey Siri, turn on Do Not Disturb\nEveryday Tasks Hey Siri, scan a QR code\nEveryday Tasks Hey Siri, open Camera\nEveryday Tasks Hey Siri, find my iPhone\nEveryday Tasks Hey Siri, ping my iPad\nEveryday Tasks Hey Siri, where are my keys?\nEveryday Tasks Hey Siri, remind me to email Kate when I get to work\nEveryday Tasks Hey Siri, where is Julie?\nEveryday Tasks Hey Siri, Apple Pay $75 to Phillip\nEveryday Tasks Hey Siri, split a $213 check three ways\nEveryday Tasks Hey Siri, what time is my first meeting tomorrow?\nEveryday Tasks Hey Siri, what’s on my calendar for today?\nEveryday Tasks Hey Siri, add eggs to my grocery list\nEveryday Tasks Hey Siri, remind me to buy coffee\nEveryday Tasks Hey Siri, open Voice Memos\nEveryday Tasks Hey Siri, turn on Flashlight\nEveryday Tasks Hey Siri, start a yoga workout on Apple Fitness+\nNavigation and Maps Hey Siri, get directions to Home Depot\nNavigation and Maps Hey Siri, what time does Philz Coffee open?\nNavigation and Maps Hey Siri, find a gas station\nNavigation and Maps Hey Siri, what’s my ETA?\nNavigation and Maps Hey Siri, how’s the traffic to work today?\nNavigation and Maps Hey Siri, find coffee shops that take Apple Pay\nNavigation and Maps Hey Siri, where am I?\nNavigation and Maps Hey Siri, convenience stores open now\nNavigation and Maps Hey Siri, find a hiking trail nearby\nNavigation and Maps Hey Siri, transit directions to the Ferry Building\nNavigation and Maps Hey Siri, biking directions to Golden Gate Park\nNavigation and Maps Hey Siri, open Maps\nNavigation and Maps Hey Siri, how long will it take to get home?\nNavigation and Maps Hey Siri, show me the map\nNavigation and Maps Hey Siri, stop navigating\nMusic and Podcasts Hey Siri, play something I can dance to\nMusic and Podcasts Hey Siri, what song is this?\nMusic and Podcasts Hey Siri, play Charli XCX\nMusic and Podcasts Hey Siri, play more like this\nMusic and Podcasts Hey Siri, play my personal music station\nMusic and Podcasts Hey Siri, play The Weeknd on Pandora\nMusic and Podcasts Hey Siri, who sings this song?\nMusic and Podcasts Hey Siri, play Invisibilia\nMusic and Podcasts Hey Siri, play Radiolab on Spotify\nMusic and Podcasts Hey Siri, play this podcast twice as fast\nMusic and Podcasts Hey Siri, play something chill\nMusic and Podcasts Hey Siri, skip forward 30 seconds\nMusic and Podcasts Hey Siri, I like this song\nMusic and Podcasts Hey Siri, add this song to my workout playlist\nMusic and Podcasts Hey Siri, Shazam this song\nTV and Movies Hey Siri, watch Ted Lasso on Apple TV\nTV and Movies Hey Siri, open Netflix\nTV and Movies Hey Siri, puppy videos\nTV and Movies Hey Siri, what movies are playing at Landmark Theatres?\nTV and Movies Hey Siri, what is the movie Trolls World Tour rated?\nTV and Movies Hey Siri, what did she say?\nTV and Movies Hey Siri, turn on subtitles\nTV and Movies Hey Siri, find movies starring Anne Hathaway\nTV and Movies Hey Siri, find romantic comedy movies\nTV and Movies Hey Siri, who directed this movie?\nTV and Movies Hey Siri, kid-friendly movies\nTV and Movies Hey Siri, play Physical Season 1, Episode 3\nTV and Movies Hey Siri, pause the living room TV\nTV and Movies Hey Siri, how are the reviews for Tenet?\nTV and Movies Hey Siri, watch His Dark Materials\nSports Hey Siri, Vegas Golden Knights score\nSports Hey Siri, San Jose Sharks roster\nSports Hey Siri, who has the most home runs in baseball?\nSports Hey Siri, college football rankings\nSports Hey Siri, which quarterback has the most passing yards?\nSports Hey Siri, who has the most goals in Major League Soccer?\nSports Hey Siri, what schools are in the Big Ten?\nSports Hey Siri, what conference is the University of Kentucky in?\nSports Hey Siri, who is pitching for Detroit this season?\nSports Hey Siri, how many points did Sabrina Ionescu score last game?\nSports Hey Siri, what NFL games are on?\nSports Hey Siri, next Eagles game\nSports Hey Siri, what’s tonight’s NBA schedule?\nSports Hey Siri, what NHL games are on?",
        "sentiment": 0.3583758391129474
    },
    "article_7": {
        "title": "Commentary: Apple, please, please, please make it easier to rearrange iPhone apps",
        "body": "They say that travel brings new perspectives, and that’s absolutely true for anyone visiting Argentina. But in my case, it’s also so far generated two feature requests for Apple.\nYesterday, I asked for universal OCR capability across all apps for instant translation …\nBut spending a month in another country has also underlined the absolute user-interface disaster that is the process of rearranging your apps on an iPhone.\nThis is nothing new, of course: it’s been a truly horrible process forever. In an effort to minimize the need for it, my approach to date has been to have context-based home screens.\nMy main home screen is for the apps I use most frequently when I’m at home. The next screen has those apps I use most frequently when out and about in London. Another screen is apps I use while actually traveling – airline apps, FlightRadar24, Hotels.com, and so on.\nBut there are a number of apps I’m using so frequently here that it makes sense to have them on my main home screen. This includes Azimo (the cheapest way to get cash here), Translate, and Maps. I now have everything set up the way I want it, but boy was it a pain!\nIt’s easy to accidentally drag an app past the screen you want. Or into the wrong position. Or accidentally create a folder.\nIf your home screen is full, then adding a new app will knock an existing one – which you may still want on the main screen – onto the next one. So the workaround I use is to first drag out the ones I don’t want to keep, before adding the ones I do.\nIn theory, you can move multiple apps at once, but I find this super-fiddly, so it really doesn’t make the process much easier.\nThe whole process is so bad I often put off any significant reorganizing I want to do, and most of the time it’s simply not worth the hassle to rejig things on a temporary basis. What I’d like to see Apple do is go back to the drawing board on this one, and create a process that is a UI dream rather than the current nightmare.\nWhat are your thoughts? Would you reorganize your apps more frequently if the process were made much easier? Let us know in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.008064577200760445
    },
    "article_8": {
        "title": "At long last: Apple will sell a desktop monitor that doesn’t cost $5,000",
        "body": "It took quite some time, but Apple has finally re-entered the consumer desktop monitor space with the Studio Display. A decade has passed since Apple last made and sold a consumer desktop monitor; the long-beloved Apple Cinema Display was discontinued in 2011. Apple instead partnered with LG to sell monitors the South Korean company made for Macs through Apple's online store. LG's monitors generally received decent reviews, but they weren't much to write home about, all things considered.\nThe new 27-inch monitor supports 5K resolution with over 1 billion colors via 14.7 million pixels. It also has True Tone technology to attenuate color warmth in different lighting situations, reaching up to 600 nits. Overlayed on the display is an antireflective coating, but there is also a nanotexture glass option to further reduce glare.\nTo facilitate the video experience, the Studio Display has six speakers—four force-canceling woofers with two tweeters that support surround sound and spatial audio with Dolby Atmos. That's paired with three studio-quality mics, the same 12 MP camera found on the latest iPads, and Apple's Center Stage technology for homed-in video calls. An A13 Bionic chip helps to run all of this.\nAdvertisement\nAs far as connectivity goes, the monitor has three USB-C ports and a Thunderbolt 4 port that can deliver up to 96 watts of power. It can work as one of many monitors simultaneously connected to the new Mac Studio desktop and its new M1 Ultra Chip. Or it can be one of three Studio monitors connected to the new desktop.\nThere will be three options for mounting the monitor. You can choose from the traditional tilt-adjustable stand, free things up more with a tilt- and height-adjustable stand (for $400 more), or mount it using a VESA mount adapter.\nOrders for the Studio Display start today from $1,599. Shipping starts on March 18.\nArs Technica may earn compensation for sales from links on this post through affiliate programs.\nListing image by Apple",
        "sentiment": 0.2728105955239799
    },
    "article_9": {
        "title": "Apple Is First Streamer to Win Best Picture Oscar for ‘CODA’",
        "body": "Apple made history by nabbing Hollywood’s most coveted honor, as “CODA” won the Oscar for best picture at Sunday’s Academy Awards.\nApple Original Films’ “CODA,” which has a predominantly Deaf cast, marks the first time a streaming service has won the best picture Oscar — with Apple TV Plus beating rival Netflix to the punch. “CODA” took the top prize over Netflix’s “The Power of the Dog” from director Jane Campion, which was the other leading contender in the category.\nIn addition, “CODA” star Troy Kotsur won the supporting actor trophy — the first time a Deaf male actor has landed an acting Oscar, and the second Deaf actor ever to do so after “CODA” co-star Marlee Matlin won for “Children of a Lesser God” in 1986. In the film’s third win of the night, “CODA” director Siân Heder won in the adapted screenplay category.\nThe three Oscars for “CODA” were Apple’s first ever. “CODA” also made history as the first Sundance Film Festival movie to take home the Oscars best picture prize. And it’s the first film to win best picture without having been nominated in the directing and editing categories.\nApple is estimated to have spent more than $10 million on the Oscars campaign for “CODA” — more than the movie’s sub-$10 million production budget.\nIn the film, Ruby Rossi (Emilia Jones) is a child of Deaf adults, or CODA — the only hearing member of her family. After she discovers a passion and talent for singing, Ruby is torn between her obligations to the family fishing business and pursuing her musical dreams. Kotsur and Matlin play her parents, and Daniel Durant co-stars as her brother, Leo. “CODA” is based on 2014 French film “La Famille Belier,” in which most of the Deaf characters were played by hearing actors.\n“This is a really big moment for the Deaf community. It’s a really big moment for the disability community,” Heder said in a backstage interview on ABC’s Thank You Cam, as an ASL interpreter translated her remarks. “Marlee Matlin won an Oscar 35 years ago, and not that much has changed in Hollywood, so I want to thank the Academy for making that change. And I want to say to everyone in the Deaf community and everyone in the disability community that there’s a place for you here, your stories are important, and we need to make room. And this is one story, and let this one be the first of many, many films to come out of this beautiful community.”\nApple’s best-picture win for “CODA” at the 94th Academy Awards is obviously a major feather in the Silicon Valley giant’s cap, although Will Smith’s shocking slap of Chris Rock live TV upstaged the feat. CEO Tim Cook has avidly touted and tallied up the awards hauls for originals on Apple TV Plus. The Oscars accolades may incrementally lift Apple TV Plus subscriber numbers, but a more significant halo effect for Apple is the added clout it can leverage in competing for deals with talent and production partners.\nOverall, Netflix — which has spent millions of dollars heavily campaigning for its awards hopefuls — picked up just one Oscar: Campion’s win for directing “The Power of the Dog.” That was after Netflix led the field again with 27 nominations, including 12 for “Power of the Dog” and four for Adam McKay’s “Don’t Look Up” (both of which were in the running for best picture). Apple won the three trophies after six nominations total: three for “CODA” and three for Joel Coen’s “The Tragedy of Macbeth.”\nApple acquired the rights to “CODA” for $25 million after a bidding war following its premiere at Sundance last year. The film, produced by Vendôme Pictures and Pathé, premiered on Apple TV Plus in August. Philippe Rousselet, Fabrice Gianfermi and Patrick Wachsberger served as producers.\nCook has acknowledged that the tech company is prioritizing prestige over profits for its streaming originals. “We don’t make purely financial decisions about the content [on Apple TV Plus],” the Apple chief told analysts on the company’s Jan. 27 earnings call. “We try to find great content that has a reason for being.”\nIn a tweet Sunday, Cook wrote, “Team CODA created a profoundly beautiful movie, a story of hope and heart that celebrates our differences. Congratulations to the producers, @SianHeder, @TroyKotsur, @MarleeMatlin, @EmiliaJonesy, @DanielNDurant, @EugenioDerbez, and all involved in these historic wins! #CODAfilm.”\nTeam CODA created a profoundly beautiful movie, a story of hope and heart that celebrates our differences. Congratulations to the producers, @SianHeder, @TroyKotsur, @MarleeMatlin, @EmiliaJonesy, @DanielNDurant, @EugenioDerbez, and all involved in these historic wins! #CODAfilm pic.twitter.com/s9ebnPaYl1 — Tim Cook (@tim_cook) March 28, 2022\nLeading up to its Oscars victory, “CODA” won the top film prize at the Producers Guild Awards; best adapted screenplay at the BAFTA Awards and Writers Guild of America Awards; and best ensemble at the SAG Awards. At last year’s Sundance, it won a record four awards: the special jury award for ensemble cast, the directing award, the audience award and the grand jury prize.\nIn a statement Sunday night, Zack Van Amburg, Apple’s co-head of Worldwide Video, said, “On behalf of everyone at Apple, we are so grateful to the Academy for the honors bestowed on ‘CODA’ this evening. We join our teams all over the world in celebrating Siân, Troy, the producers, and the entire cast and crew for bringing such a powerful representation of the Deaf community to audiences, and breaking so many barriers in the process. It has been so rewarding to share this life-affirming, vibrant story, which reminds us of the power of film to bring the world together.”\nJamie Erlicht, the other co-head of Apple’s Worldwide Video group, added, “What an incredible journey it has been since the moment we first saw ‘CODA’ to today’s historic recognition from the Academy. It has been a true joy to witness the positive impact on humanity that this story and its performances have had worldwide. We send our warmest congratulations to Siân; Troy; the cast; the creative team; producers Patrick, Philippe, and Fabrice; and everyone who helped bring inclusion and accessibility to the forefront through this remarkable film.”\nAt the 2021 Oscars, Apple had picked up its first-ever nominations — “Wolfwalkers” for animated feature and Tom Hanks’ World War II drama “Greyhound” for sound — but came away empty-handed.\nNetflix has won multiple Oscars, but to date the best picture crown has eluded its grasp. Last year, Netflix took home seven Oscars, more than any other studio. That included two each for David Fincher’s “Mank” and “Ma Rainey’s Black Bottom,” adapted from the play by August Wilson. In 2020, Martin Scorsese’s “The Irishman” was shut out at the Oscars, after receiving 10 nominations; the year before that, Alfonso Cuarón’s “Roma” won three Academy Awards, for directing, cinematography and foreign language film.",
        "sentiment": 0.41067612732760606
    },
    "article_10": {
        "title": "Apple makes an EXTRA £5bn by not providing chargers and earphones",
        "body": "Apple has made an estimated £5billion by no longer providing chargers and earphones with its new iPhones.\nThe tech giant said the move, announced two years ago, was intended to cut waste and drew praise from environmentalists when it claimed it would reduce annual carbon emissions by two million tons, the equivalent of taking 500,000 cars off the road.\nBut critics say customers have been hit in the pocket because the withdrawal of the adapters and earphones was not accompanied by a reduction in price.\nSince 2020, Apple has charged £19 for a new plug or earphones. Critics argue that if it had passed on the full savings, including an estimated 40 per cent reduction in shipping costs as smaller packaging allows 70 per cent more devices on each pallet, iPhone prices would be lower.\nSince 2020, Apple has charged its customers £19 for a new plug or earphones\nExperts believe that Apple, whose new iPhones cost up to £1,549, could be saving about £27 on each phone. The analysis takes into account that while the adapters and earphones sell for £19, they are far cheaper to produce.\nBen Wood, chief analyst at technology experts CCS Insight, said: ‘Apple is the phone industry market leader in helping the environment, with removing chargers and headphones one of many things it is doing. But of course there is a cost saving to Apple in removing chargers and headphones when it sells iPhones.’\nSince announcing the move, Apple is thought to have sold 190 million iPhones worldwide. Total gains from removing chargers and earphones, plus reduced shipping costs, could be as high as £5 billion, with an additional estimated £225 million from the sale of accessories.\nThe UK share is estimated at more than £280 million.\nIn 2020, Apple’s head of environment, Lisa Jackson, said: ‘We know customers have been accumulating adapters and that producing millions of unneeded adapters consumes resources and adds to our carbon footprint.’\nLast night an Apple spokesman said: ‘At Apple, we are constantly innovating to conserve resources and protect the planet we all share. Already carbon neutral for our own operations, we’ve set an ambitious goal to become carbon neutral for our entire supply chain and product usage by 2030 - so every Apple device sold will have net zero carbon impact. One of the steps along our path is to reduce the materials used in our products and packaging. This important step cut over 2 million metric tons of carbon emissions - equivalent to removing 500,000 cars from the road per year - and others are following our lead.\n'iPhone is packed with advanced technologies that deliver incredible value — from the A15 Bionic chip and the Super Retina display to the world’s most advanced camera systems and 5G. These important innovations enable unparalleled capabilities for our users.'",
        "sentiment": 0.2055951471587545
    },
    "article_11": {
        "title": "Apple Stores Will Now Decline to Repair iPhones Reported as Missing",
        "body": "Apple Stores and Apple Authorized Service Providers will now be alerted if an iPhone has been reported as missing in the GSMA Device Registry when a customer brings in the device to be serviced, according to an internal memo obtained by MacRumors.\nIf an Apple technician sees a message in their internal MobileGenius or GSX systems indicating that the device has been reported as missing, they are instructed to decline the repair, according to Apple's memo shared on Monday. The new policy should help to reduce the amount of stolen iPhones brought to Apple for repair.\nThe GSMA Device Registry is a global database designed for customers to report their devices as missing in the event of loss or theft. Devices in the database are identified by their unique IMEI number. An iPhone's IMEI is listed in the Settings app under General > About.\nApple Stores and Apple Authorized Service Providers are already unable to service an iPhone if the customer cannot disable Find My iPhone, and this policy will help to prevent stolen iPhones that never had Find My iPhone enabled from being repaired by Apple. In the event your iPhone is lost or stolen, be sure to read our guide on the next steps to take.",
        "sentiment": -0.2545310652349144
    },
    "article_12": {
        "title": "Apple Releases iOS 15.4 and iPadOS 15.4 With Face ID Mask Unlock, New Emoji, Universal Control, and More",
        "body": "Apple today released iOS 15.4 and iPadOS 15.4, the fourth major updates to the iOS and iPadOS 15 operating systems that were released in September 2021. iOS and iPadOS 15.4 come a month after the launch of iOS 15.3.1 and iPadOS 15.3.1.\nThe iOS 15.4 and iPadOS 15.4 updates can be downloaded for free and the software is available on all eligible devices over-the-air in the Settings app. To access the new software, go to Settings > General > Software Update.\niOS 15.4 adds an option to use Face ID while wearing a mask, which works just like normal ‌Face ID‌ but scans the areas around your eyes for authentication. iPadOS 15.4 introduces Universal Control, allowing multiple Macs and iPads to be controlled with the same mouse/trackpad and keyboard.\nThe updates also add 37 new emoji characters and they lay the groundwork for the new \"Tap to Pay on iPhone\" feature that allows NFC-compatible iPhones to accept payments through Apple Pay. There are also updates to add custom domains to iCloud Mail right on device, Siri enhancements, new Emergency SOS features, and tons more. Apple's full release notes for the update are below:\nFace ID\n- Face ID while wearing a mask option on iPhone 12 and newer\n- Apple Pay and password autofill in apps and Safari can be used with Face ID while wearing a mask Emoji\n- New emoji including faces, hand gestures, and household objects are now available in emoji keyboard\n- Handshake emoji allows you to choose separate skin tones for each hand FaceTime\n- SharePlay sessions can be initiated directly from supported apps Siri\n- Siri can provide time and date information while offline on iPhone XS, iPhone XR, iPhone 11 or newer\n- Siri now includes an additional voice, expanding the diversity of options Vaccine cards\n- EU Digital COVID Certificate support in Health enables you to download and store verifiable versions of COVID-19 vaccination, lab results, and recovery records\n- COVID-19 vaccination cards in Apple Wallet now support the EU Digital COVID Certificate format This release also includes the following enhancements for your iPhone:\n- Safari webpage translation adds support for Italian and Chinese (Traditional)\n- Podcasts app adds episode filters for seasons, played, unplayed, saved, or downloaded episodes\n- iCloud custom email domains can be managed from Settings\n- News offers enhanced discovery of audio content in the Today feed and Audio tab\n- Camera in keyboard can be used to add text to Notes and Reminders\n- Shortcuts now supports adding, removing, or querying tags with Reminders\n- Emergency SOS settings have changed to use Call with Hold for all users. Call with 5 Presses is still available as an option in Emergency SOS settings\n- Close-up in Magnifier uses the ultra-wide camera on iPhone 13 Pro and iPhone 13 Pro Max to help you see small objects\n- Saved passwords can now include your own notes in Settings This release also includes bug fixes for your iPhone:\n- Keyboard may insert period between typed numbers\n- News widgets in Today View may not open articles when tapped\n- Photos and videos may not sync to iCloud Photo Library\n- Speak Screen Accessibility feature may quit unexpectedly within the Books app\n- Live Listen may not turn off when switched off in Control Center Some features may not be available for all regions or on all Apple devices. For information on the security content of Apple software updates, please visit this website: https://support.apple.com/kb/HT201222\nFor a complete overview of all of the features that are available in iOS 15, we have a dedicated iOS 15 roundup.",
        "sentiment": 0.1703599459225578
    },
    "article_13": {
        "title": "Instagram chief says iPad market isn't 'big enough' for native app",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nAn Instagram app for the iPad is still far away from materializing, after the head of the Meta-owned social app says there isn't \"big enough\" support from users to make it.\nFor years, Instagram has refused to release an iPadOS version of its app, forcing iPad users into using the iPhone version on the larger tablet display. In tweets on Sunday, Instagram chief Adam Mosseri insists it's not going to happen in the near future.\nResponding to a tweet by YouTuber Marques Brownlee about the lack of an iPad app, Mosseri acknowledges \"Yup, we get this one a lot,\" but that it's not on the way. \"It's still just not a big enough group of people to be a priority,\" states Mosseri.\nWhile the team is \"hoping to get to it at some point,\" Mosseri says \"right now we're very heads down on other things.\"\nWhen pressed by MKBHD that the group size would increase if a native app was available, Mosseri agrees it would. However, he adds that there are a number of reasons for the lack of focus, such as an increase in overhead cost.\nShortform video competitors such as TikTok and YouTube are also seen as \"behemoths,\" with users sharing \"more in messages than they do to Stories or Feed,\" prompting a \"need to adapt.\" Mosseri also says there's the size of the team to consider, as \"we are leaner than you think.\"\nYup, we get this one a lot. It's still just not a big enough group of people to be a priority. Hoping to get to it at some point, but right now we're very heads down on other things. — Adam Mosseri (@mosseri) February 27, 2022\nDespite the continued lack of progress, Mosseri does say it could arrive someday. Referring to \"finally features,\" an iPad app is included along with features that may eventually see the light of day, such as \"supporting dark mode, scheduled posts,\" and \"deleting one photo from a carousel.\"\nThe list of \"finally features\" seems to include items that could feasibly be worked on by a small number of determined developers. The team may be \"leaner than you think,\" but it also has the considerable resources of Meta behind it, so expanding the team or getting temporary assistance shouldn't be an issue.",
        "sentiment": -0.2841751142922375
    },
    "article_14": {
        "title": "Apple launches the first driver’s license and state ID in Wallet with Arizona",
        "body": "March 23, 2022\nUPDATE\nApple launches the first driver’s license and state ID in Wallet with Arizona\nAdditional states to follow, including Colorado, Hawaii, Mississippi, Ohio, and the territory of Puerto Rico\nApple announced that Arizona is the first state to offer driver’s license and state ID in Wallet. Starting today, Arizonans can add their driver’s license or state ID to Wallet, and tap their iPhone or Apple Watch to seamlessly and securely present it at select TSA security checkpoints in Phoenix Sky Harbor International Airport.\n“We’re thrilled to bring the first driver’s license and state ID in Wallet to Arizona today, and provide Arizonans with an easy, secure, and private way to present their ID when traveling, through just a tap of their iPhone or Apple Watch,” said Jennifer Bailey, Apple’s vice president of Apple Pay and Apple Wallet. “We look forward to working with many more states and the TSA to bring IDs in Wallet to users across the US.”\nAdditional states will offer driver’s license and state ID in Wallet soon. Colorado, Hawaii, Mississippi, Ohio, and the territory of Puerto Rico plan to bring this feature to their residents, along with the seven states Apple previously announced.\nAdding a driver’s license or state ID to Wallet can be done in a few simple steps: Residents can tap the + button at the top of the screen in Wallet on their iPhone, select “Driver’s License or State ID,” and follow the on-screen instructions to start the setup and verification process. To help ensure that the person adding the identity card to Wallet is the same person to whom the identity card belongs, the user will be asked to take a selfie and scan the front and back of their driver’s license or state ID card, which will be securely provided to the issuing state for verification. As an additional fraud prevention step, users will also be prompted to complete a series of facial and head movements during the setup process. The state is responsible for verifying and approving the user’s request to add their driver’s license or state ID to Wallet.\nOnce added to Wallet, users can present their driver’s license or state ID to the TSA at participating airport security checkpoints by simply tapping their iPhone or Apple Watch at the identity reader. On their iPhone or Apple Watch, users will be shown which information is requested by the TSA, and can consent to provide it with Face ID or Touch ID, without having to unlock their iPhone or show their ID card. All information is shared digitally, so users do not need to show or hand over their device to present their ID. The TSA will also capture a picture of the traveler for verification purposes.\nDriver’s license and state ID in Wallet takes full advantage of the privacy and security built into iPhone and Apple Watch, and offers benefits that a physical ID card can’t match. Unlike physical ID cards, driver’s license and state ID in Wallet presents only the information needed for the interaction, and the user has the opportunity to review and authorize the information being requested before it is shared. Additionally, driver’s license and state ID in Wallet is presented digitally through encrypted communication directly between the device and the identity reader, so users do not need to show or hand over their device. Biometric authentication using Face ID and Touch ID helps ensure that only the person who added the ID to the device can view or present their ID or license in Wallet. If users lose their iPhone or Apple Watch, they can use the Find My app to easily lock their device and help locate it, or remotely erase their device.\nDriver’s license and state ID in Wallet is available on iPhone 8 or later running iOS 15.4, and Apple Watch Series 4 or later running watchOS 8.4 or later. Driver’s licenses and state IDs in Wallet are currently available for use in select states at select TSA checkpoints. Travelers should refer to TSA checkpoint signage to confirm availability.\nMore information about driver’s license and state ID in Wallet is available on apple.co/wallet-id.\nAbout Apple Wallet\nApple Wallet offers a secure, private, and convenient replacement for the physical wallet, and enables users to unlock the world around them using iPhone and Apple Watch. With Wallet, users can store and access credit or debit cards to pay with Apple Pay in-store, online, and in-app; redeem rewards with loyalty cards; store and present boarding passes and transit passes, as well as tickets for movie theaters, concert venues, sports stadiums, and other live events; unlock, start, and share access to select cars; and set up Apple Cash to send and receive payments with Messages. University and college students can also use mobile student IDs in Wallet to make purchases and access buildings around campus. Wallet also supports home keys, hotel room keys, and employee badges for the office, as well as driver’s licenses and state IDs for residents in participating US states. More information and terms for Wallet are available at apple.com/wallet.\nPress Contacts\nApple Media Helpline\nmedia.help@apple.com\n(408) 974-2042",
        "sentiment": 0.1511656241180996
    },
    "article_15": {
        "title": "Studio display has 64gb of storage",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA developer has discovered that Apple's Studio Display includes 64GB storage, meaning it has the same specifications for storage and processor as the 9th-generation iPad and the iPhone 11.\nIt wasn't announced at the Apple event, and it isn't listed in Apple's technical specifications, but the new Studio Display comes with 64GB of storage built in.\nAs discovered by Twitter user Khaos Tian, though, only approximately 2GB of the storage is actually in use.\nlol Studio Display has 64GB onboard storage?! pic.twitter.com/XfHGCYUYMG — Khaos Tian (@KhaosT) March 21, 2022\nThe Studio Display uses the same A13 Bionic processor that's in the 9th generation iPad, and the iPhone 11. Both of those devices start with the same 64GB capacity.\nIt's not surprising that the monitor needs storage since it does run the A13 Bionic processor and iOS 15.4. This lets the display include features such as the webcam's Center Stage.\nHowever, 64GB is more surprising. It's unlikely that Apple plans to use the storage for more features - though 64GB does match the highest-capacity Apple TV 4K. What's more likely is that it's to do with economies of scale, and that manufacturing it with less storage would entail production changes.",
        "sentiment": -0.237994269068752
    },
    "article_16": {
        "title": "Apple confirmed to Ars that the 27-inch iMac has reached end of life.",
        "body": "For years, Apple's 27-inch iMac was the company's best desktop. The device was updated frequently with new processors and GPUs, unlike either the Mac mini or the Mac Pro, and its 5K Retina display was an excellent high-resolution screen. Its design was even the basis of the iMac Pro, an even-more-powerful desktop that Apple released to prove that it was still committed to its high-end pro users.\nBut the future of the big-screened iMac is currently in doubt. Following the announcement of the screen-less Mac Studio desktop today, the 27-inch Intel iMac disappeared from Apple's online store. The 24-inch iMac is currently the only iMac referenced in the navigation bar, and all existing direct links to its 27-inch counterpart now redirect to the Mac page. Even more mystifying, Apple hardware SVP John Ternus said that there was only \"one more\" Mac that had yet to make the transition to Apple Silicon—and the system he named was the Mac Pro, not the larger iMac.\nAdvertisement\nDon't hold a funeral for the big iMac just yet. Persistent rumors from multiple sources have suggested for months that a new big-screened Mac all-in-one is in the works. According to those rumors, the device would combine a large Mini LED screen with the higher-end versions of Apple's processors. The best information we currently have suggests that the all-in-one could be unveiled sometime in the summer, possibly at Apple's yearly developer conference. The Apple Silicon Mac lineup has been full of surprises, from the company re-embracing chunky notebooks to the existence of the tiny Mac Studio workstation. Maybe the new large-screened iMac is the Mac Pro, or maybe Apple plans to announce some other kind of branding for it entirely.\nIn the meantime, users who want a powerful, large-screened Mac could pair a $1,999 Mac Studio with a $1,599 Studio Display. That combination, however, costs around twice as much as the cheapest 27-inch iMacs did. And while we do generally like the panache of the 24-inch Apple Silicon iMac, 24 inches can hardly be a true replacement for the old 27-inch version.\nUpdate: Apple confirmed to Ars that the 27-inch iMac has reached end of life.\nArs Technica may earn compensation for sales from links on this post through affiliate programs.",
        "sentiment": -0.02754057273786101
    },
    "article_17": {
        "title": "Apple Maps now says Crimea is part of Ukraine – except if you're in Russia",
        "body": "In 2019, Apple made a controversial change in its Maps and Weather apps to show the Crimean Peninsula as a region of Russia for those living there. At the same time, Crimea was displayed as an independent region to users from other parts of the world. Now Apple is once again saying that Crimea is part of Ukraine – except if you’re in Russia.\nThe conflict between Russia and Ukraine started years ago. In 2014, Russia occupied and annexed the Crimean Peninsula – a move that has never been recognized as legitimate by most of the world’s nations.\nAfter these events, there was a discussion among the tech companies about how to describe Crimea. To comply with Russian law, both Apple and Google updated their apps to show Crimea as part of Russia, while the rest of the world saw the territory disassociated from any country.\nHowever, Russia’s recent invasion of Ukraine that began in February has made Apple reconsider that change. Instead of showing up as an independent territory, Crimea is once again displayed as part of Ukraine in Apple Maps (and also in the iOS Weather app). Unfortunately, as reported by Mashable, no changes have been made when accessing these services from Russia.\nApple halts sales in Russia\nEarlier this week, Apple confirmed that all its sales have been halted in Russia as the company shows support for Ukraine. Distribution of products to local stores in Russia has also been suspended, and apps from Russian state media have been removed from the App Store in regions outside of Russia.\nAs a result of sanctions imposed by the US government and the European Union, Apple Pay has also been suspended in Russia.\nApple says it will “continue to evaluate the situation” with the help of relevant governments to take further action if needed. Despite recent limitations, Apple services are still operating in Russia.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.3445094039882807
    },
    "article_18": {
        "title": "Tim Cook responds to thank you note after Apple Watch saves dentist's life",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple CEO Tim Cook has reacted to a thank you note after an Apple Watch helped save a dentist's life, saying he was glad that medical attention was sought and treatment received.\nNitesh Chopra, a dentist in Haryana, India, felt discomfort in his chest, prompting him to use the ECG function of the Apple Watch Series 6 to get a reading. After seeing the results, Chopra and wife Neha consulted a doctor about the symptoms and reading.\nHe was found to have a blocked artery, which led to the dentist receiving treatment. After the intervention, Nitesh said he was \"blessed\" and \"can't express\" his gratitude to the Apple Watch for helping him at an early stage, reports the Hindustan Times.\n\"Initially I used Apple Watch as a fashion accessory and to check the time and my step count, and could not imagine that one day it will save my life,\" he said.\nAt the hospital, an ECG was performed to monitor Nitesh's condition, but the couple was amazed at the accuracy of the Apple Watch's version. \"When I was in CCU, my wife and I were continuously comparing our Apple Watch reading with the monitor, and they were in sync,\" said Nitesh.\nFollowing the medical incident, Neha sent an email to Tim Cook, thanking the CEO for saving Nitesh's life. In response, Cook emailed \"I'm very glad you sought clinical evaluation and received the care you desired. Thank you for sharing your story with us. Have a good day. Best wishes, Tim.\"",
        "sentiment": 0.1578071569757802
    },
    "article_19": {
        "title": "Apple's M1 Ultra GPU comparison with Nvidia was misleading",
        "body": "When Apple compared the M1 Ultra GPU performance to what was then Nvidia’s most powerful graphics card, the company’s chart and quote were technically true, but rather misleading, says Macworld.\nApple gave the impression that the M1 Ultra outperformed the Nvidia RTX 3090, but this was not the case – and will be even less so now that Nvidia has launched the 3090 Ti …\nBackground\nApple this month unveiled its most powerful Apple Silicon chip to date, the M1 Ultra. This is available in the new Mac Studio, and combines two M1 Max chips in one.\nThe M1 Ultra’s specs are impressive indeed, and Apple illustrated this with a chart (above) comparing the GPU performance of the M1 Ultra against the Nvidia RTX 3090 – the most powerful PC GPU at the time. Apple backed the chart with a very carefully-worded quote:\nFor the most graphics-intensive needs, like 3D rendering and complex image processing, M1 Ultra has a 64-core GPU — 8x the size of M1 — delivering faster performance than even the highest-end PC GPU available while using 200 fewer watts of power.\nM1 Ultra GPU vs Nvidia RTX 3090\nBoth chart and quote appear to show two things. First, the M1 Ultra is massively more power-efficient than Nvidia’s card. That part is absolutely correct. Second, that the M1 Ultra is more powerful than the Nvidia RTX 3090. That part is not the case, says Macworld – and Nvidia’s latest version will leave the M1 Ultra even further in the dust.\nApple achieved this misleading comparison by cutting off the graph before the Nvidia GPU got anywhere close to its maximum performance.\nThe M1 Ultra has a max power consumption of 215W versus the RTX 3090’s 350 watts. In the chart, Apple cuts the RTX 3090 off at about 320 watts, which severely limits its potential.\nLet the graph run to 350 watts, and Nvidia wins by a mile, as The Verge illustrated in its review of the Mac Studio. And Nvidia isn’t resting on its laurels.\nNow there’s the RTX 3090 Ti, which costs as much as an M1 Studio and promises to beat the M1 Ultra even harder. Most notably, it can draw a mind-boggling 450 watts of power, more than twice that of the M1 Ultra. We haven’t seen benchmarks yet, but they’re going to eclipse the RTX 3090, which already handily beat the M1 Ultra at full strength. The comparisons to the RTX 3090 Ti are going to be extremely lopsided. I don’t know if there’s any graphics card that can really compete against Nvidia’s latest behemoth, but it’s certainly not anything Apple makes.\nSo yes, if you need both great GPU performance and power efficiency, nothing can touch Apple Silicon. Similarly if you want a lot of power at a relatively affordable price. But if raw power is your priority, Nvidia is still king – and looks set to remain so for the foreseeable future.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": 0.06750667182728648
    },
    "article_20": {
        "title": "The first Asahi Linux Alpha Release is out! | Asahi Linux is a project that brings Linux to all M1 Macs",
        "body": "The first Asahi Linux Alpha Release is here! Previous\nPrevious\nNext\nIt’s been a long while since we updated the blog! Truth be told, we wanted to write a couple more progress reports, but there was always “one more thing”… So, instead, we decided to take the plunge and publish the first public alpha release of the Asahi Linux reference distribution!\nWe’re really excited to finally take this step and start bringing Linux on Apple Silicon to everyone. This is only the beginning, and things will move even more quickly going forward!\nKeep in mind that this is still a very early, alpha release. It is intended for developers and power users; if you decide to install it, we hope you will be able to help us out by filing detailed bug reports and helping debug issues. That said, we welcome everyone to give it a try - just expect things to be a bit rough.\nBehind this scenes, this release brings with it several future compatibility features. What this means is that users who install it will be able to keep up with all future improvements by simply upgrading their packages - no reinstalling necessary.\nReady to give it a shot? Make sure to update your macOS to version 12.3 or later, then just pull up a Terminal in macOS and paste in this command:\ncurl https://alx.sh | sh\nPay close attention to the messages the installer prints, especially at the end!\nSystem requirements\nM1, M1 Pro, or M1 Max machine (Mac Studio excluded)\nmacOS 12.3 or later, logged in as an admin user\nAt least 53GB of free disk space (Desktop install) You need 15GB for Asahi Linux Desktop, but macOS itself needs a lot of free space for system updates to work, so the installer will expect you to leave 38GB of extra slack in macOS by default to avoid shooting yourself in the foot. For example, if you have 60GB of free space, you will be able to shrink macOS by up to 22GB by default, freeing up 22GB for the new Linux install and leaving 38GB of remaining free space in the macOS partition. If you want to disable this check, enable expert mode when prompted.\nA working internet connection The installer will download 700MB ~ 4GB of data, depending on the OS you select.\nIf you use Time Machine, you may find that you do not have enough free space. This is caused by local Time Machine snapshots taking up the “free” space in your volume. You can learn how to delete these to truly free up space here.\nInstallation\nThe installer is designed to be as self-explanatory as possible. You will see a series of prompts that guide you through resizing your macOS partition (if necessary) and installing your new OS. We expect users to install Linux alongside macOS at this point. The installer will not delete or affect your macOS installation, other than performing a live resize.\nOnce the first stage of the installation is done, you will have to reboot into 1TR mode (One True recoveryOS) in order to finish the install. Read the instructions that the installer prints carefully! Simply rebooting into the new OS won’t work until this is done. You need to fully shut down your machine, then boot by holding down the power button until you see “Entering startup options”, choose your new OS in the boot selector menu, and follow the prompts.\nThe installer provides these OS options:\nAsahi Linux Desktop\nA customized remix of Arch Linux ARM that comes with a full Plasma desktop and all the basic packages to get you started with a desktop environment. It includes a graphical first-boot set-up wizard, so you won’t have to dig around to change your settings or create your first user. No root password by default; use sudo to become root.\nAsahi Linux Minimal (Arch Linux ARM)\nA vanilla Arch Linux ARM environment, with only the minimal support packages to integrate with the boot process and hardware on Apple Silicon machines. Arch users will feel right at home!\nLog in as root/root or alarm/alarm. Don’t forget to change both passwords! SSH is disabled by default for security reasons, so you’ll have to enable it manually.\nUEFI environment only (m1n1 + U-Boot + ESP)\nNo distribution, just a minimal UEFI boot environment. With this, you can boot an OS installer from a USB drive and install whatever you want (as long as it supports these machines, of course)!\nWhat works\nAll M1, M1 Pro, and M1 Max devices are supported except for the Mac Studio.\nWi-Fi\nUSB2 (Thunderbolt ports)\nUSB3 (Mac Mini Type A ports)\nScreen (no GPU)\nNVMe\nLid switch\nPower button\nBuilt-in display (framebuffer only)\nBuilt-in keyboard/touchpad\nDisplay backlight on/off\nBattery information / charge control\nRTC\nEthernet (desktops)\nSD card reader (M1 Pro/Max)\nCPU frequency switching\nM1 machines only (no Pro/Max):\nHeadphones jack (might be flaky)\nMac Mini only:\nHDMI output\nNot yet, but coming soon:\nUSB3\nSpeakers\nDisplay controller (backlight brightness control, V-Sync, proper DPMS)\nWhat doesn’t\nEverything else, but notably:\nDisplayPort\nThunderbolt\nHDMI on the MacBooks\nBluetooth\nGPU acceleration\nVideo codec acceleration\nNeural Engine\nCPU deep idle\nSleep mode\nCamera\nTouch Bar\nNote: on the 13\" MacBook Pro, you can use Fn + the number row keys (1-9, 0, and the next two) as F1..F12 in lieu of the Touch Bar.\nKnown bugs\nIf Wi-Fi doesn’t work, try toggling it off and on in the network management menu\nIf the headphones jack doesn’t work or only one channel works, try rebooting. There’s a flakiness issue.\nKnown broken applications\nThe Asahi Linux kernel is compiled to use 16K pages. This both performs better, and is required with our kernel branch right now in order to work properly with the M1’s IOMMUs. Unfortunately, some Linux software has problems running with 16K pages. Most notably:\nChromium (needs volunteer to fix)\nEmacs (fix committed, not released)\nAnything using jemalloc (e.g. Rust installed via the official Arch repositories)\nAnything using libunwind (fix committed, not released)\nHopefully this release will help motivate upstream projects to fix these issues and properly support all ARM64 page sizes (64K, 16K, and 4K). 16K provides a significant performance improvement of up to 20% or so under some workloads, so it’s worth it.\nThere is a category of software that will likely never support 16K page sizes: certain emulators and compatibility layers, including FEX. Android is also affected, in case someone wants to try running it natively some day. For users of these tools, we will provide 4K page size kernels in the future, once the kernel changes that make this possible are ready for upstreaming.\nFurther information\nVisit our docs wiki for more information! We could use more people working on documentation, so feel free to contribute too! Note that, since things have been moving very quickly, some of the docs may be out of date.\nRecommended reading:\nIf you’re a developer or reverse engineer, we have some really cool toys:\nAnd if you’re bored:\nFrequently Asked Questions\nI want to donate!\nThank you! Asahi Linux is developed by a group of volunteers, and led by marcan as his primary job. You can support him directly via Patreon and GitHub Sponsors. None of this would have been possible without your support! Donations like these allow him to dedicate most of his time to the project and also purchase test hardware.\nMartin Povišer is working on audio support for Asahi Linux, and he also has a GitHub Sponsors page. Please support his efforts so that he can make Apple Silicon machines the best supported platforms for Linux audio!\nCan I dual-boot macOS and Linux?\nYes! In fact, we expect you to do that, and the installer doesn’t support replacing macOS at this point. This is because we have no mechanism for updating system firmware from Linux yet, and until we do it makes sense to keep a macOS install lying around for that.\nYou can have as many macOS and Linux installs as you want, and they will all play nicely and show up in Apple’s boot picker. Each Linux install acts as a self-contained OS and should not interfere with the others.\nNote that keeping a macOS install around does mean you lose ~70GB of disk space (in order to allow for updates, since the macOS updater is quite inefficient). In the future we expect to have a mechanism for firmware updates from Linux and better integration, at which point we’ll be comfortable recommending Linux-only setups. Of course, if you really want to wipe macOS after installing Linux and re-partition that space, we won’t stop you!\nHow do I switch between Linux and macOS?\nBoot with the power button held down, then pick which OS you want to boot. You can select it while holding down the Option key in order to make it the default.\nHelp! I’m in a boot loop!\nYou didn’t read the instructions at the end of the install process, did you? :-)\nYou need to fully shut down your machine, wait 15 seconds, then press and hold the power button until “Loading startup options” appears. Then select your newly installed OS, and follow the instructions.\nIf holding down the power button doesn’t bring up the boot picker but rather keeps rebooting, you might be in a rare failure case. This shouldn’t happen any more, but just in case it does, don’t despair. Your machine is fine. You need to wait until the Apple logo disappears at the end of a loop, then count down 3 seconds and quickly press, release, and press and hold the power button. This should bring up the boot menu again. Just make macOS the default and that will fix things. We don’t expect anyone to run into this any more, but one user saw it with an early pre-alpha version of the installer after encountering a network error. We’ve made a change to avoid that, but we’d like to mention the solution just in case.\nCan I install offline?\nThe installer is designed to be online-only at this point. While you can run it offline if you have a copy of all the files it needs, we don’t have a user-friendly mechanism for setting that up yet. Please let us know what your use case is so we can better support it in the future!\nCan I install to an external/USB disk?\nApple Silicon machines cannot boot from external storage. While it may look like they do when you choose an external macOS volume, behind the scenes parts of its boot components are being copied to the internal drive to make this work. It’s unclear whether this mechanism will ever be usable by third party OSes, for technical reasons.\nInstead, we recommend using the UEFI environment only installer option to install only a UEFI bootstrap to your internal drive. This only requires around 3GB of disk space, and it will then automatically boot from any connected USB drive with a UEFI bootloader. Note: installing the Asahi Linux desktop images to a USB drive automatically isn’t supported right now, though if you’re adventurous enough it’s not terribly hard to do manually :-)\nHow do I uninstall it?\nThe installer does not have an uninstall option at this time, but all you need to do is delete the partitions it created, e.g. using diskutil . You can then resize the macOS partition back to full size if you wish.\nIf you perform more than a couple installations and removals, you might find that some parts of the install process take longer than usual. This is caused by stale Boot Policy files being left behind. We have a script that you can use to clean those up. Use with caution; you need to run it from recoveryOS or with SIP disabled.\nWhat’s with all the disk space?\nEach OS needs around 3GB of disk space, plus the space required for the OS root/boot filesystems. 2.5GB of this is used for the “stub” macOS partition, that includes critical components such as Apple’s bootloader and firmware, and a full copy of the macOS recovery image. This is required by the design of these platforms. We reserve 2.5GB (even though the recovery image is only ~1GB) to allow for upgrades and avoid trouble caused by overfull APFS filesystems.\nIs there GPU acceleration yet?\nNope! We’re working on that and have been making steady progress behind the scenes. In the meantime, though, software rendering is surprisingly usable thanks to the M1 family’s outstanding CPU performance. The Asahi Linux Desktop image sets up a full composited X.Org session, with transparency and shadows and all that bling, and it doesn’t feel sluggish at all! Quite a few people are already daily driving these machines in this state.\nOnce GPU acceleration is available, existing users will be able to get it by just doing a package upgrade!\nDoes audio work?\nThe headphones jack works on M1 models (M1 Pro and Max models have a new codec chip that isn’t supported yet). We already have working drivers for the speakers, but there are safety (we don’t want to blow up your speakers) and quality (we want it to sound better than macOS) issues that need to be worked out still, since support for automatic speaker DSP is still in its infancy in the Linux audio ecosystem. Therefore, we have not enabled them for end-user installs yet. Once this is ready, a simple package upgrade will be all you need to do to get your speakers working!\nDoes sleep work?\nNot quite yet. We have working s2idle including putting USB/NVMe to sleep, but the Broadcom Wi-Fi driver needs additional development to make it support sleep properly on these machines, and the PCI driver also needs some tweaks. Once those are ready, we’ll enable s2idle support in our kernels.\nWhole-system sleep will come later, but can also be enabled with a simple package upgrade thanks to the future-proofing work that is already in place.\nThe notch!\nThat’s not a question, but assuming you’re wondering what we’re doing about the notch: on M1 Pro and Max systems today, Asahi Linux crops the screen such that the notch is hidden, and the desktop environment sees a rectangular 16:10 display. We will continue with this approach for now, but in the future we will enable opt-in display modes that include the notch, so that desktop environments which implement notch-avoidance can request them and gain additional screen real estate.\nIs this just Arch Linux ARM?\nPretty much! Most of our work is in the kernel and a few core support packages, and we rely on Linux’s excellent existing ARM64 support. The Asahi Linux reference distro images are based off of Arch Linux ARM and simply add our own package repository, which only adds a few packages. You can freely convert between Arch Linux ARM and Asahi Linux by adding or removing this repository and the relevant packages, although vanilla Arch Linux ARM kernels will not boot on these machines at this time.\nIf you’re curious, these are the scripts we use to build the Asahi Linux images starting with a vanilla Arch Linux ARM tarball. We also sponsor an ALARM mirror as part of our project (jp.mirror.archlinuxarm.org).\nAs part of our project, we are contributing fixes and improvements to a number of miscellaneous packages; for example, Apple GPU support for Mesa is already well on the way (it is being tested on macOS), and we also have a fork of xkeyboard-config where we will prototype keyboard layout adjustments to better support Macs before upstreaming.\nCan I install other distros?\nAbsolutely! Our goal is to work with other developers to bring full support for these machines to your favorite distro.\nThat said, at the time of this writing no other Linux distros provide official Apple Silicon install images to our knowledge, and vanilla ARM64 images will not work until the necessary changes have trickled into upstream kernels; therefore, setting up another distro is more of a manual process. Some users are providing unofficial installation guides and images for other distros, and in the future we will add some of them as options to the Asahi Linux installer. Keep in mind that these are user-contributed and we cannot provide end-to-end support as the Asahi Linux project.\nIf you are a developer for a distribution and interested in officially supporting Apple Silicon machines, please get in touch! We’d love to work with you to make it happen. You can find us on our IRC channels.\nWe would also love to hear from non-Linux OS distributors. OpenBSD snapshots can already be installed after setting up an UEFI boot environment, see here for more information!\nWill this break my machine? How safe is it?\nWe have strived to make this installer as safe as possible. All disk management operations are performed behind the scenes using native macOS tools ( diskutil ) and the installer doesn’t really do anything truly dangerous.\nIn fact, we haven’t seen any data loss or machine damage during the entire development of Asahi Linux, other than obvious user error (“I accidentally wiped my disk”). Apple Silicon machines are almost completely unbrickable: you can boot them in a special burned-in recovery mode and recover them, using another machine connected via a USB cable. For those who don’t have another macOS machine to act as a host, we have open source tools that work on Windows and Linux too.\nThat said, as with all open source software, especially an alpha release like this one, we can’t make any promises. It could eat your data. It probably won’t, but don’t blame us if it does.\nWhile the installer tries hard not to let you do anything dangerous, there is of course nothing stopping you from wiping your macOS data once booted into Linux; you are, of course, in control of your own computer. Those who want to use disk management/partitioning tools should avoid touching the first and last partitions on the internal NVMe drive. Doing so could render your system unbootable and require a DFU restore. In particular, if you do not use the Asahi Linux images but instead boot a third-party installer using the UEFI environment, never choose “use the entire disk” when installing.\nWhat’s with those scary security warnings?\nDuring the second stage of the installation after the first reboot, the installer needs to put your new OS into “Permissive Security” mode in order to boot a third-party OS kernel. This only affects the OS that you have just installed; your existing macOS install is not affected in any way. Unlike Intel Macs and platforms such as Android, Apple Silicon Macs keep a separate security state for each installed OS. That means that there is absolutely no detrimental effect to macOS. You can continue using all of its high-security or DRM-related features, such as FileVault, iOS applications, Apple Pay, Netflix in 4K, etc. in tandem with a Linux install.\nIf you are concerned about data integrity/confidentiality in your macOS volume, we recommend enabling FileVault. This will make your macOS data entirely inaccessible to other OSes without logging in with your macOS credentials.\nDoes installing this require phoning home to Apple?\nAll OSes installed on Apple Silicon machines require certain components provided by Apple. Since we can’t redistribute these ourselves, the installer will download them from Apple’s public CDN. In the future we will provide an option to allow caching this locally or to a USB drive, so you can do offline installs.\nDuring the initial installation (when making the volume the default boot option), there is a process that runs behind the scenes that involves authenticating the new OS install against Apple’s servers (from their point of view, this looks like authenticating a normal macOS install; they won’t know you’re installing Linux). This is part of the “Full Security” mode, which is transiently used for Asahi Linux before the install is switched to “Permissive Security”. If this concerns you, you can launch the Asahi Linux installer from recovery mode (hold down the power button → Options → Utilities menu → Terminal). Doing it this way unlocks an alternate method that starts out as “Reduced Security”, removing the phone home requirement, which the installer will automatically use. Note that it will still have to download boot components from the CDN though (but that does not involve any unique machine identifiers, it’s just a plain HTTPS download).\nDo you support Secure Boot / Full Disk Encryption / etc.?\nApple Silicon machines are one of the few general purpose platforms that allows you to install your own custom OS while still maintaining a strong secure boot chain. Installing the bootloader requires physical access to the machine and your machine owner credentials (this is why we need to ask you to hold down the button to boot at the end of the install process!). Therefore, we are very interested in further supporting this in Linux in order to have a highly secure and attacker-resistant system, taking advantage of Apple’s SEP, Touch ID, and more, while still retaining full user control over their OS. We are designing the Asahi Linux boot process in order to allow this in the future, but the necessary bits aren’t ready yet, so please stay tuned!\nIn the meantime, we recommend that users concerned about physical security enable FileVault in macOS. This will implicitly add a log-in requirement to recovery mode, which will prevent an attacker with physical access from being able to compromise your OS that way. m1n1 does not yet have a secureboot mode, but it also doesn’t have any local access features as long as it is installed properly. Locking down U-Boot and GRUB and the rest of Linux is left as an exercise for the user.\nThe Asahi Linux installer does not have an option to set up FDE for you. However, you can use the UEFI-only option and roll your own traditional LUKS setup manually. We expect that users interested in advanced secure boot and encryption set-ups will do their own thing, at least for the time being.\nI have another question\nDrop by our IRC channel and ask away! You can visit us on #asahi at OFTC. Check out our community page for more details.\nmarcan ·",
        "sentiment": -0.009218759103678167
    },
    "article_21": {
        "title": "App Store and iTunes Purchases Reportedly 'Turned Off' in Russia",
        "body": "iPhones.ru is reporting that iTunes and App Store purchases can no longer be made by Apple device users located in Russia, leaving them unable to pay for apps, media, or Apple services.\nAccording to the Russia-based site, it is now impossible for users to add funds to their ‌App Store‌ or iTunes Store accounts using regional bank cards issued by Russian banks including Alfa-Bank, Sber, and Tinkoff.\nUnder normal circumstances, Apple users would still be able to buy Apple gift cards to top up their Apple ID account. However, iPhones.ru is also reporting that users are having problems with this mode of funding as well.\nIt's not clear whether the issue is a result of action by Apple, Russian banks, or the Russian government. If confirmed however, as it stands, users in Russia seemingly now have no way to make purchases in the ‌App Store‌ or the iTunes Store.\nThe development follows the Google Play Store's decision to turn off billing in Russia, and Apple's decision early last week to halt all sales from its online store in Russia as well as ban Apple Search Ads in the Russian ‌App Store‌.\nApple Pay has also reportedly been limited and major banks in Russia are not able to use the service, resulting in long lines at commuter rail systems that use ‌Apple Pay‌ to pay fares. The moves by Apple came independently after U.S. sanctions were implemented against the country back in February following Russia's invasion of Ukraine.",
        "sentiment": -0.6464557196436957
    },
    "article_22": {
        "title": "10 tips for Preview to improve your day to day workflow",
        "body": "Preview is that stand-alone program that comes with all Macs and one you probably don't pay too much attention to. That's understandable, it often feels just part of the operating system and not an application in its own right, but it is, and other than being a great viewing application for photos and PDFs, it comes with some nifty tools that I find myself using all the time and I thought I would share those with you.\nHere they are:\n1. Resizing images to a specific file size\nIf you are like me and often find yourself having to upload images to websites, you can often be confronted with size restrictions to upload them. Preview has a great solutions to that.\nSteps\nSelect 'Markup' Select 'Resize' Adjust width and height to meet size constraints\n2. Inverting Icons\nHave a black and white image but you want to inverted? it You can use the image editing capabilities of Preview to do this.\nSteps\nSelect 'Tools' from the toolbar Select 'Adjust Color' Drag and invert the Left and Right arrows of the levels window\n3. Removing the background from an image\nDoes your image have a background that is making your presentation look rather amateur? Get rid of it in Preview.\nSteps\nSelect 'Markup' Select 'Auto Alpha' Click and drag down to select the desired background Press delete on the keyboard Repeat steps 3 & 4 if necessary\n4. Rearranging pages in a PDF\nPreview is a great stand-alone PDF viewer and it has some extra capabilities like being able to rearrange the pages of a document.\nSteps\nSelect the desired pages to reorder in the sidebar Drag and drop the pages to the desired location\n5. Creating a new PDF from an existing one\nIf you ever need to split up a pdf or just take out a few pages to form a new one. Preview is extremely useful for this.\nSteps\nSelect the desired pages from the sidebar Drag and drop the pages onto the desktop or a location of your choosing\n6. Merging pages from one PDF to another\nHave more than one PDF that you want to combine? A simple drag and drop can save you a lot of headaches here\nSteps\nOpen both PDFs and have them next to each other Select the desired pages from one PDF's sidebar Drag and drop those pages to the other PDF's sidebar\n7. Signing PDFs\nSigning documents is something we all have to do from time to time. Preview enables you to sign documents without having to print them out and scan them back in.\nSteps\nSelect 'Markup' Select 'Signature' Either create a new signature or select an existing one Drag and resize the signature to suit\n8. Removing Geolocation meta info from a photo\nIf you post a lot of photos on the web, you could be exposing the location of where you took that photo. Something that some not so nice people might try to capitalise on. Best get rid of it in Preview first.\nSteps\nSelect 'Information' Select 'Information' from the more info dialogue box Select the GPS tab Click 'Remove Location Info'\n9. Creating an Image from the Clipboard\nCopied a photo from a website and want to save it. Preview can help\nSteps\nCopy Desired image Open Preview Select 'File' from the toolbar Select 'New from Clipboard'\n10. Accessing App icons\nIf you create content for different applications you may find yourself in need of an image of the app's icon. Rather than getting a bad quality one from the web use Preview to do it for you.\nSteps\nOpen your 'Applications' folder Select the desired app Right Click and choose 'Get Info' or CMD + I Select the icon in the top left of the dialogue box Copy it using the keyboard shortcut CMD + C Open Preview Select 'File' from the toolbar Select 'New from Clipboard'",
        "sentiment": -0.25844860325256985
    },
    "article_23": {
        "title": "Kuo: iPhone With Under-Screen Touch ID No Longer Likely Within Next Two Years",
        "body": "Apple is unlikely to release any iPhone models with under-screen Touch ID within the next two years, analyst Ming-Chi Kuo said in a tweet today.\nIn a September 2021 research note, Kuo had predicted that Apple would launch at least one new iPhone model with an under-screen fingerprint scanner in the second half of 2023, but his latest tweet suggests this is unlikely to happen anymore.\n\"I previously predicted iPhones would support under-display fingerprint sensing/Touch ID in 2023 at the earliest,\" tweeted Kuo, an analyst at TF International Securities. \"But the latest survey indicates new iPhones in 2023 & 2024 may not adopt under-display Touch ID. Face ID with a mask on iPhone is already a great biometrics solution.\"\nApple did test an under-screen fingerprint scanner for at least some iPhone 13 models, according to reports from The Wall Street Journal's Joanna Stern and Bloomberg's Mark Gurman, but Apple apparently decided not to move forward with the idea.\nUnder-screen Touch ID would have been most useful when Face ID did not work with masks, but iOS 15.4 introduced a new \"Face ID with a Mask\" feature on iPhone 12 models and newer. An argument could still be made that having both Face ID and under-screen Touch ID on an iPhone would provide customers with the best of both worlds, but Kuo's tweet suggests that will not happen for several years, if ever.\nI previously predicted iPhones would support under-display fingerprint sensing/Touch ID in 2023 at the earliest. But the latest survey indicates new iPhones in 2023 & 2024 may not adopt under-display Touch ID. Face ID with a mask on iPhone is already a great biometrics solution. — 郭明錤 (Ming-Chi Kuo) (@mingchikuo) March 30, 2022\nThere remains a possibility that Apple introduces an iPhone with Touch ID built into the power button, in line with the latest iPad Air and iPad mini models, but there haven't been any rumors to suggest that Apple plans to go down that avenue.",
        "sentiment": 0.06570879587282737
    },
    "article_24": {
        "title": "Apple Reportedly Plans Fix for $1,600 Studio Display's Disappointing Webcam",
        "body": "Apple recently unveiled a new, powerful Mac Studio desktop computer and the $1,600 Studio Display to go with it, a 5K screen that reviewers have praised -- except for disappointing performance from its integrated webcam. Apple has a software fix on the way, but it's not clear when it's coming, Input reported Thursday.\nReviews from The Verge and The Wall Street Journal lamented that the integrated webcam captured images with grain and noise, with particularly poor performance in low light. Apple acknowledged to The Verge that \"the system is not behaving as expected\" and that it will make improvements in a software update, though it's unclear when that's coming.\nThe disappointing performance of the 12-megapixel webcam is a bit of a surprise given how good selfies and FaceTime calls have been with iPhones and iPads running similarly sharp front-facing cameras. In addition to the webcam, the Studio Display includes an A13 Bionic chipset, which debuted in the iPhone 11, essentially supercharging a simple computer screen with smartphone brains.\nApple didn't immediately respond to a request for comment. Check out our review of the Mac Studio desktop and Studio Display here.",
        "sentiment": -0.155845467466861
    }
}