{
    "article_0": {
        "title": "Apple's Director of Machine Learning Resigns Due to Return to Office Work",
        "body": "Apple's director of machine learning, Ian Goodfellow, has resigned from his role a little over four years after he joined the company after previously being one of Google's top AI employees, according to The Verge's Zoë Schiffer.\nGoodfellow reportedly broke the news to staff in an email, saying his resignation is in part due to Apple's plan to return to in-person work, which required employees to work from the office at least one day per week by April 11, at least two days per week by May 2, and at least three days per week by May 23. \"I believe strongly that more flexibility would have been the best policy for my team,\" Goodfellow said in the email.\nApple employees began returning to Apple Park last month, with the three-day in-office work policy being enacted on May 23. Some employees have been unhappy about the plan to return to in-person work.\nIn a letter to Apple CEO Tim Cook during the summer, a group of employees said \"Without the inclusivity that flexibility brings, many of us feel we have to choose between either a combination of our families, our well-being, and being empowered to do our best work, or being a part of Apple. This is a decision none of us take lightly, and a decision many would prefer not to have to make.\"",
        "sentiment": -0.2670003707919802
    },
    "article_1": {
        "title": "Apple in talks to buy EA gaming, Disney and Amazon also potential suitors",
        "body": "Video game publisher Electronic Arts (EA) is actively seeking a potential buyer or merger. Apple has reportedly been in talks with the company about buying EA out according to Puck. Disney and Amazon have also been in talks about purchasing the video game company.\nThe Redwood City-based firm has published hits like Apex Legends, Madden, and The Sims franchise. The idea for a buyout or merger came after Microsoft purchased Activision Blizzard for $68 billion earlier this year. Shortly after, Sony purchased Bungie, the studio behind Destiny for $3.6 billion. According to Puck, EA ideally would like a merger so Andrew Wilson can remain CEO of the combined company.\nEA’s roots actually go back to Apple. Back in 1982, Apple’s then Director of Strategy and Marketing, Trip Hawkins, left the company to start EA. A buyout wouldn’t be Apple’s first venture into gaming, however. The Cupertino company unveiled its gaming service Apple Arcade back in 2019. Through Apple Arcade, users can play ad-free games on their iOS, macOS, and tvOS devices.\nEA spokesperson John Reseburg said the company would not comment on any “rumors and speculation relating to M&A.” Reseburg added, “We are proud to be operating from a position of strength and growth, with a portfolio of amazing games, built around powerful IP, made by incredibly talented teams, and a network of more than half a billion players. We see a very bright future ahead.”\nApple has not commented on a potential deal with Electronic Arts.\n9to5Mac’s Take\nI find it hard to think of what a deal between EA and Apple would look like. Puck mentions that EA’s ideal candidate for a merger was Disney, as it reached out in March seeking a “more meaningful relationship.” However, the entertainment company did not pursue those conversations, likely because it’s focused on its building up its Disney+ subscriber base. Additionally, a potential ESPN merger could happen as Disney owns the sports network.\nEA seems to be in a hurry to finalize a deal, so we will probably hear more soon. However, I would imagine Apple and EA’s relationship is just “talks” for right now.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.11371989641338587
    },
    "article_2": {
        "title": "Apple employees disgruntled over return to working in offices",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple employees are not happy with the iPhone maker's return-to-office policy, with a survey claiming half of workers are looking to leave the company over the issue.\nAfter being warned in March about a return to working at Apple Park on April 11, corporate staffers began spending some of their week within Apple's offices. While Apple is keen to gradually return to full-time office work, there is seemingly some resistance from those who work for the company.\nA survey by anonymous social network Blind of Apple employees in the week ending April 19 claims 56% of workers were actively looking for employment elsewhere. Yahoo Finance reports it is said that the reason for leaving is specifically due to the return-to-office policy.\nIn specific responses collected by Blind, one employee said they were hesitant to ever enter the office at all, and joked about being able to put Apple on their resume after working for the company for just three weeks. Another cited the possibility of COVID infections, a toxic company culture, and a lack of work-life balance as behind their wish to quit.\nA third posted about Apple's management being \"tone-deaf as usual.\" That respondent anticipated that many people would quit shorty after April 15, which is a stock-vesting date — but that does not appear to have been borne out.\nA fourth offered that Apple would see issues when its hybrid work plan is fully enforced by May 23. \"Apple is going to see attrition like no other come June. 60% of my team doesn't even live near the office. They are not returning,\" the employee wrote.\nAt 652 responses, this is a very small proportion of the Apple workforce. Furthermore, a disgruntled employee has historically been more willing to take part in an open poll request that could be unfavorable to their employer.\nAccording to Blind PR director Rick Chen, the employees were verified via their corporate email address. Chen also said the users of Blind are \"overwhelmingly corporate workers in engineering or product roles.\"\nIn another poll by Harris that ran from April 8 to April 10, surveying 2,121 people from a variety of industries, a third of hybrid and remote workers said they quit or switched jobs during the pandemic to work from home. Approximately 59% were satisfied with their current work status.\nAbout 15% of hybrid and office-working employees in that poll planned a job change to a more virtual position, and 7% of hybrid and remote workers said they wanted to shift to an in-person job.",
        "sentiment": -0.3205506221524307
    },
    "article_3": {
        "title": "The music lives on",
        "body": "May 10, 2022\nUPDATE\nThe music lives on\niPod touch will be available while supplies last\nSince its introduction over 20 years ago, iPod has captivated users all over the world who love the ability to take their music with them on the go. Today, the experience of taking one’s music library out into the world has been integrated across Apple’s product line — from iPhone and Apple Watch to iPad and Mac — along with access to more than 90 million songs and over 30,000 playlists available via Apple Music.\n“Music has always been part of our core at Apple, and bringing it to hundreds of millions of users in the way iPod did impacted more than just the music industry — it also redefined how music is discovered, listened to, and shared,” said Greg Joswiak, Apple’s senior vice president of Worldwide Marketing. “Today, the spirit of iPod lives on. We’ve integrated an incredible music experience across all of our products, from the iPhone to the Apple Watch to HomePod mini, and across Mac, iPad, and Apple TV. And Apple Music delivers industry-leading sound quality with support for spatial audio — there’s no better way to enjoy, discover, and experience music.”\nAmong the incredible ways to enjoy music across a range of devices, including a wide variety of models from the new iPhone SE to the latest iPhone 13 Pro Max, iPhone is the best device for streaming Apple Music or storing an entire music library on the go. Apple Watch and AirPods are the perfect companion, allowing users to access over 90 million songs right from their wrist, starting at just $279 with Apple Watch SE. iPad starts at just $329, comes with a more powerful chip, larger display and the latest iPadOS features. And for the best way to enjoy music at home, HomePod mini is just $99.\nCustomers can purchase iPod touch through apple.com, Apple Store locations, and Apple Authorized Resellers while supplies last.\nPress Contacts\nApple Media Helpline\nmedia.help@apple.com\n(408) 974-2042",
        "sentiment": 0.4396653265381853
    },
    "article_4": {
        "title": "EU Planning to Force Apple to Give Developers Access to All Hardware and Software Features",
        "body": "The European Union is pressing ahead with legislation to heavily regulate companies like Apple, setting plans to force \"gatekeepers\" to open up access to hardware and software, and even set up an internal department to meet new rules, according to an endorsed agreement from the European Parliament's Internal Market Committee.\nThe provisional agreement on the Digital Markets Act (DMA) was reached earlier this week by EU governments, with 43 votes in favor, one against, and one abstention, showing a broad consensus from European lawmakers to aggressively regulate big tech companies. Apple is almost certain to be classified as a \"gatekeeper\" and be affected by the regulation due to the size of its annual turnover in the EU, its ownership and operation of platforms with a large number of active users, and its \"entrenched and durable position\" due to how long it has met these criteria, and will therefore be subject to the rules set out in the DMA.\nThe DMA could force Apple to make major changes to the App Store, Messages, FaceTime, third-party browsers, and Siri in Europe. For example, it could be forced to allow users to install third-party app stores and sideload apps, give developers the ability to closely interoperate with Apple's own services and promote their offers outside the ‌App Store‌ and use third-party payment systems, and access data gathered by Apple.\nOne of the more recent additions to the DMA is the requirement to make messaging, voice-calling, and video-calling services interoperable. The interoperability rules theoretically mean that Meta apps like WhatsApp or Messenger could request to interoperate with Apple's iMessage framework, and Apple would be forced to comply.\nThe latest provisional agreement sets out plans to establish a \"High-Level Group\" of central European digital regulators to coordinate national regulators across EU member states and requires \"gatekeepers\" to create an independent \"compliance function.\" The new group must include compliance officers to monitor their company's compliance with EU legislation using sufficient authority, resources, and access to management, and be headed by an \"independent senior manager with distinct responsibility for the compliance function.\" The rule would effectively require companies like Apple to set up an internal department dedicated to meeting pro-competition regulations.\nIn addition, new rules specifically targeted to address companies like Apple that have \"a dual role\" with control over both hardware and software look to allow any developer to gain access to any existing hardware feature, such as \"near-field communication technology, secure elements and processors, authentication mechanisms, and the software used to control those technologies.\" This could have major implications for the level of integration that developers can achieve on Apple platforms, such as allowing contactless payment services to operate on the iPhone and Apple Watch just like Apple Pay.\nEU lawmakers provisionally approved the DMA in March. Next, the proposals will be put to a final vote in the European Parliament in July before being formally adopted by the European Council and published in the EU Official Journal. 20 days after publication, the DMA will come into force and affected companies will have six months to comply.\nBeyond the European Union, Apple's ecosystem is increasingly coming under intense scrutiny by governments around the world, including in the United States, the United Kingdom, Australia, Japan, South Korea, and more, with a clear appetite from global regulators to explore requirements around app sideloading and interoperability.",
        "sentiment": 0.10224049212411046
    },
    "article_5": {
        "title": "F1 driver tracks down thieves that stole his AirPods with Find My",
        "body": "F1 driver tracks down thieves that stole his AirPods with Find My\nArticle Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nAfter being robbed on Monday, Formula 1 driver Sebastian Vettel tried to get back his belongings, chasing after the thieves using the Find My app to track his AirPods.\nDriving with his family on Monday morning after the Spanish Grand Prix, Vettel stopped his Aston Martin at a hotel in Barcelona, and got out of the car. Thieves used the opportunity to grab a backpack from the car before getting away.\nThe four-time Formula 1 champion didn't immediately contact the police, but instead attempted to handle the theft himself, reports iPadizate. Vettel picked up an electric scooter and opened the Find My app, to track down AirPods held inside the bag.\nPolice later joined Vettel as he went after the thieves through the city, urging Vettel to file a complaint at a station instead of continuing the chase.\nEventually, the driver was led to a haberdashery, where he found the AirPods left in a vase of flowers in a shop display. Evidently, the thieves worked out that they were being tracked by the AirPods.\nPolice have yet to find the thieves, but hope to identify them based on security footage from the hotel.\nThe backpack contained a number of personal items, aside from the AirPods, including his driver's license, his passport, and several credit cards which have been canceled.\nRobbing Formula 1 drivers can be lucrative to thieves, in part due to the high-value of their possessions. In July 2021, British F1 driver Lando Norris had his $50,000 watch stolen after a sporting event, while in April 2022, driver Charles Leclerc had his $320,000 watch stolen in Italy.",
        "sentiment": -0.06453569913999392
    },
    "article_6": {
        "title": "Apple Stores Rolling Out iPhone-to-iPhone Contactless Payments Starting Today",
        "body": "Apple in February unveiled a new \"Tap to Pay on iPhone\" feature that will allow compatible iPhones to accept payments via Apple Pay, contactless credit and debit cards, and other digital wallets, with no additional hardware required.\nApple began testing the feature at its Apple Park Visitor Center earlier this month, and now Bloomberg's Mark Gurman has tweeted that the feature will begin rolling out to Apple Stores across the United States starting today, allowing customers to try it out. The feature might not be available at every Apple Store immediately.\nApple said the feature would launch in the U.S. later this year, but the company has yet to share a specific launch timeframe. The feature will allow small businesses and merchants to accept contactless payments through supported iOS apps using an iPhone XS or newer. At checkout, the merchant will simply prompt the customer to hold their own iPhone or Apple Watch, contactless credit or debit card, or other digital wallet near the merchant's iPhone, and the payment will be securely completed using NFC technology.\nCurrently, merchants that accept contactless payments on an iPhone must rely on additional hardware like the Square Reader, which comes in various models that work wirelessly or connect to an iPhone's Lightning connector or headphone jack.",
        "sentiment": -0.07077272063387292
    },
    "article_7": {
        "title": "Revealed: Dr. Dre leaking the Apple Beats deal early cost $200 million",
        "body": "What you need to know\nApple acquired Beats Music and Beats Electronics in 2014.\nThe company paid some $3 billion for Beats Music and Beats Electronics, with founders Jimmy Iovine and Dr. Dre cashing in.\nA new inside story reveals that Dr. Dre's video leaking the acquisition cost $200 million and nearly tanked the whole deal.\nWhile Dr. Dre's infamous video celebrating Apple's acquisition of Beats in 2014 saw Dre herald himself as \"the first billionaire in hip-hop,\" a story from a new tell-all book about Apple under Tim Cook has revealed that the video cost Dre some $200 million, and could have torpedoed the entire deal.\nThe episode comes by way of Tripp Mickle's book After Steve: How Apple Became a Trillion-Dollar Company and Lost Its Soul, which tells the story of Apple under the stewardship of Tim Cook in the wake of Steve Jobs' passing. Writing in chapter 10, Mickle begins by prefacing Apple's entry into music streaming, explaining that CEO Tim Cook discovered Beats and wanted to acquire it because of its human-curated playlists, but also because Cook wanted \"a solution to the company's failure to enter the streaming music business.\"\nCook met some internal resistance over the deal, and had to contend with Jimmy Iovine insisting that Apple buy both Beats Music and Beats Electronics, but eventually Apple agreed to a price:\n\"It was a sum that Iovine and Dre could barely fathom. As the lawyers worked through final details, Iovine summoned the leadership team of Beats to his home near Beverly Hills. He told everyone that they were on the cusp of finalizing a massive deal. The only thing that could spoil it would be for word of the deal to leak.\"\nIovine explicitly warned his team \"whatever you do, don't talk about this,\" even reportedly quoting Goodfellas to Dre saying \"Remember that scene in Goodfellas where Jimmy tells the guys, 'Don't buy any furs. Don't buy any cars. Don't get showy'?\" he said. \"Don't move.\"\nNaturally, at 2 am the following morning, Iovine received a call from Puff Daddy, where Puff explained that Dr. Dre and rapper Tyrese had posted a video on Facebook revealing the deal:\nAt 2:00 a.m., Iovine got a call from Puff Daddy, who was screaming that Dre and Tyrese, a rapper, were talking about the deal in a Facebook video. Iovine pulled up the video and cringed as he saw Tyrese bragging about being drunk on Heineken in a recording studio\nDre famously announced that it was time to update the Forbes rich list as he was now the first billionaire in hip-hop. According to Mickle, Iovine panicked, worried that \"everything was in jeopardy.\" Tim Cook was also apparently unimpressed, but calm about the situation:\nWhen word of the video reached Cook, he summoned Iovine and Dre to Cupertino. He invited them into a conference room for a private conversation. Iovine was anxious and afraid that Cook was going to kill the deal. Instead of the anger and cursing that would have poured out of Jobs in a moment like that, Cook exuded calm. He told the music executives that he was disappointed and wished that Dre's social media outburst hadn't happened but said that the video hadn't shaken his conviction that buying Beats was right for Apple.\nMickle goes on to reveal that Cook \"used the social media fiasco to demand an adjustment to the terms of the deal.\" Stating \"in the days that followed, Apple shaved an estimated $200 million off its offering price. The reduction led staff at Beats to say that Apple had given Dre just enough of a haircut to make sure that he did not become a hip-hop billionaire.\"\nIndeed, it was reported at the time of the deal by the New York Post that Apple had cut the price some $200 million, the exact sum noted by Mickle here. Back then it was suggested that a leak about Beats Music's low subscriber count had brought down the price, but Mickle's new revelation suggests that it might have been Dr. Dre's exuberant celebration of the deal was to blame instead.",
        "sentiment": -0.3128492326608726
    },
    "article_8": {
        "title": "Jony Ive's exit from Apple caused by company culture changes and growing frustration",
        "body": "Article Hero Image\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nApple's former design chief Jony Ive left the iPhone maker burnt out and tired in the wake of CEO Tim Cook's numerous structural changes, an article based on a book on Apple's transformation claims, with the film \"Yesterday\" becoming part of Ive's announcement to leave to his design team.\nJony Ive left Apple in 2019, after almost three decades working for the tech giant on many of its major products. The departure was a shock exit, but one that was inevitable due to a change in culture at the company.\nIn a New York Times article based on the Tripp Mickle book \"After Steve: How Apple Became a Trillion-Dollar Company and Lost Its Soul,\" Ive resigned after years of frustration, seeing the company migrate from a design-centric entity to one that was more utilitarian.\nThe account starts by emphasizing the relationship between Ive and former CEO and co-founder Steve Jobs, detailing the creation of the iconic iMac. With Ive's presence deemed to be a relief for Jobs at times, the two famously worked closely together, with Jobs constantly visiting the company's design studio.\nWith the introduction of Cook and the death of Jobs, Ive's experience at the company had considerably changed. Cook seemingly showed lower interest in design than Jobs, with far fewer visits to the studio during the creation of the Apple Watch.\nDuring changes of focus for the Apple Watch from fashion to fitness, Ive reportedly approached Cook about being tired and intending to step back from the business. Arguments with colleagues over promotion and managing hundreds of staff instead of the smaller 20-person design team also drained Ive considerably.\nThe fear of Ive's departure affecting the stock price prompted Cook into reducing Ive's responsibilities and making him chief design officer. At that time, very few at Apple apparently knew of Ive's frustration and burnout.\nThe changes also apparently led to Ive working differently, switching from almost daily product reviews to sometimes not passing judgment on designs at all for some weeks.\nFor the 10th-anniversary iPhone, Ive called together software designers for a product review at San Francisco's social club, The Battery. After failing to apologize for arriving nearly three hours late, Ive reviewed printouts and provided feedback, but didn't make any final decisions at that time.\nWhile Ive was seemingly absent, Cook continued to shift the company in a new direction, including bringing in former Boeing finance chief James Bell as a company director to replace marketer Mickey Drexler. Ive wasn't supportive of the change, commenting \"He's another one of those accountants\" to a colleague.\nCook's enabling of the finance department to have more say also irked Ive, which moved to audit outside contractors.\nOn Ive's decision to depart, the article talks about an evening in June 2019 where Ive brought together his design teams to a theater for a private screening of \"Yesterday.\" The movie choice was apt, as it was a \"two-hour exploration of the eternal conflict between art and commerce,\" the article states.\nAfter the foreshadowing movie, Ive told his teams \"Art needs the proper space and support to grow. When you're really big, that's especially important.\"\nOne day later, design teams were told to clear their calendars for a meeting with Ive, who told them that with the completion of the new building, his time at the company was ending. Ive praised the team and urged them to maintain Apple's identity, as well as assuring them he would continue to work as a consultant via his design firm LoveFrom.",
        "sentiment": -0.199873931966722
    },
    "article_9": {
        "title": "Atlanta Apple store workers say ‘intimidation’ has made a fair union vote impossible",
        "body": "Workers at the Cumberland Mall Apple store will no longer hold a union election in June, according to a report from Bloomberg. The Communications Workers of America (or CWA), the union attempting to organize the store, says it withdrew the request to hold an election because “Apple’s repeated violations of the National Labor Relations Act have made a free and fair election impossible.”\nThe vote, which was scheduled to begin on June 2nd, would’ve been the first union election at a US Apple store had it gone through. Now, that title will go to a store in Maryland, barring that petition also being withdrawn. Workers at the Towson Town Center store are set to start voting in person on June 15th.\nThe union says Apple intimidated workers and interfered with organization\nThe company has also tried slightly friendlier tactics to make unionization less enticing for workers — it’s reportedly raising the starting wages for retail workers by $2 an hour. While pay was at the top of the list of priorities for the organizers at the Atlanta Apple store, published in an open letter last month, there were several other non-monetary requests. They included better career opportunities, especially for marginalized workers, and more flexibility for civic participation and volunteering.\nRelated This is what Apple retail employees in Atlanta are fighting for\nAccording to Bloomberg, the organizers also said that COVID-19 was also a factor in their decision to withdraw the request; they worried it might make it unsafe to vote, or even make it so certain employees couldn’t vote at all. Apple’s COVID safety policies were also mentioned in the organizers’ open letter, which demanded that the company get employee input on its health policies and work harder to enforce its existing safety regulations.\nUnionization efforts seemed to have broad support from the store’s employees. When organizers filed to hold an election in April, more than 70 percent of workers had signed cards supporting the move.",
        "sentiment": -0.36891512345755473
    },
    "article_10": {
        "title": "The iPod made the iPhone possible. The iPod helped put Apple back on the map.",
        "body": "This week, Apple announced that it’s discontinuing the iPod Touch, its last product with the “iPod” name. More than 20 years after the original iPod was announced, and after over a decade in the shadow of the iPhone, it can be hard to remember just how important the device was to Apple. But the music player helped define the company we know today — and was a big factor in bringing it back from the brink of ruin.\nThe story of Apple’s comeback has been told over and over to the point of becoming mythologized, so I’ll try to keep it brief. The 1990s were not kind to the company, almost leaving it bankrupt. By the turn of the century, though, things were starting to turn around: the iMac G3 was selling well, and Apple’s revenue was starting to grow again. But while the original iMac stabilized Apple as a company, Apple was still a niche player when it came to the overall consumer electronics market.\niPod sales rescued Apple from its niche in the PC market\nEnter the iPod. In October 2001, Steve Jobs introduced the now-iconic portable music player, which synced to your Mac over FireWire, and held 1,000 MP3 songs on a 5GB hard drive. It wasn’t the first portable media player, but one of the iPod’s first commercials (which featured plenty of dancing but no silhouettes) instantly showed why you’d want one: with just a few clicks, you could take your computer’s music library on the go with a device that fit in your pocket.\niPod sales exploded over the next few years as Apple introduced more models and added Windows support. In 2002, Apple sold around 400,000 iPods, according to Statista. By 2006, Apple was selling 39 million of them a year. The iPod had quickly outstripped the Mac in terms of units sold, reaching a far wider audience and, critically, making the general public familiar with Apple as a company that makes products you carry around in your pocket.\nAnd the sales kept growing. According to Statista, the company would sell over 51 million in 2007. But that was the year Apple introduced its next big thing: the iPhone.\nThe iPod looms large over the iPhone’s announcement — so much so that the first thing Steve Jobs says about the smartphone is that it’s “a wide-screen iPod with touch controls.” It was an apt comparison, as the iPhone built on many concepts the iPod introduced.\nUnveiling the iPhone, Steve Jobs highlighted that it synced “just like iPod.”\nLet’s start with the obvious: when the iPhone first came out, you had to sync it with iTunes to activate it and set it up. Jobs used that as a selling point when introducing it, saying that iPod owners would already know how to set up their phone and would likely have their data already in iTunes. And after you set the phone up, you’d see an app called iPod on it — its icon depicting a classic scrollwheel-adorned device.\nThen there’s the App Store, which came to define the iPhone, despite not even being one of its original features. By the time it launched in 2008, Apple already had half a decade of experience building and maintaining a digital storefront. It had launched the iTunes Music Store in 2003 as a way to purchase digital music for your then-new third-gen iPod. And Apple started selling movies on iTunes in 2006 as it built out its infrastructure for the age of portable media consumption. The iPhone was a revolution in many ways, but it’s hard to imagine what it would’ve looked like without the iPod.\nThe iPhone and iPad quickly outsold the iPod\nOf course, the iPod doesn’t deserve credit for everything that the iPhone popularized. It had games, but they weren’t one of its main selling points until the iPod Touch. And despite Steve Jobs’ joke during the iPhone announcement, the click wheel was largely usurped by the touchscreen despite many people’s fond memories of the input device.\nWhile the iPod would live on for years after the iPhone was introduced (even the Nano and Shuffle held on for about a decade after iOS came onto the scene), its days as the thing Apple was known for were numbered. Apple’s sales record for iPods was in Q1 2009 — consumers bought 23 million of them. At the time, those would’ve been second-gen Shuffles, first and second-gen iPod Touches, fourth-gen Nanos, and the iPod Classic.\nThe iPod would never reach those heights again. As iPhone sales took off like a rocket, fewer and fewer people bought iPods. In 2010, the iPad (which Apple dreamed up as a touchscreen device before it came up with the idea for the iPhone) was introduced. Within two years, it too was outselling the iPod at its peak. The iPod Touch was a good device if you wanted an iPhone without the phone — but, for most people, the iPad fit that mold even better.\nYou can draw plenty of lines from the iPod lineup to what Apple’s doing successfully today\nThe iPod’s importance at Apple continued to diminish over the next decade. By 2015, Apple’s earnings reports lumped the iPod into an “Other Products” category with the Apple TV, Apple Watch, Beats, and “Apple-branded and third-party accessories.” The iPod Classic, the last in the line started by the original iPod, was discontinued in 2014. The iPod Nano and Shuffle would be next to go in 2017, and the iPod Touch finally fell in 2022.\nIt’s hard to imagine that Apple sold many seventh-gen iPod Touches over the past few years, but there are sure to be at least a few people that’ll miss it — when I went to my local Apple Store on Tuesday to buy one, the employees told me I was far from the first person to do so upon hearing the news that it was discontinued. Starting at $199 for a 32GB model, it was the cheapest iOS device you could buy new from Apple. That honor now falls to the entry-level iPad, which starts at $329 for a 64GB model. The Touch was also the last easily pocketable device that Apple sold with (say it with me now) a headphone jack.\nWhile the iPod may be no more, its legacy lives on. You can draw plenty of lines from the iPod lineup to what Apple’s doing successfully today — music is still a big part of its identity, both with its streaming service and astoundingly popular AirPod lineup. Apple loved video so much it named an entire iPod model after it; now, it has Apple TV Plus, and markets the iPhone on its video prowess. And remember that time people were wearing the square touchscreen iPod Nanos as a watch?",
        "sentiment": 0.12887679106172392
    },
    "article_11": {
        "title": "Opinion: iPad sees year-over-year sales decline, I blame iPadOS for that",
        "body": "Last week, Apple released its earnings report for the second quarter of the year, which ended in March. While the company just launched a new iPad Air with the M1 chip, Center Stage, and 5G support, numbers show that the iPad is generating less money and it’s suffering from a year-over-year sales decline. Personally, I blame iPadOS for that.\nWhile the company was “very pleased” with “an all-time revenue record for Services and March quarter revenue records for iPhone, Mac, and Wearables, Home and Accessories,” the iPad is struggling to sell well as it’s down 2.2% year over year with $7.65 billion in revenue.\nWhile the Mac hardware is finally catching up after years of controversies and issues due to Intel chips and lack of an optimized macOS system, the iPad feels like is going on the same controversial path the Mac went some time ago.\nWhile no one can say the iPad lineup has bad hardware, it’s very often heard that software doesn’t follow up. While iPadOS could be great for the base-model iPad, it looks like it’s always falling behind with the iPad mini, iPad Air, and iPad Pro models – here’s why.\niPadOS needs to be a little bit different for each iPad\nFor the iPad mini, iPadOS lacks optimization. Its weird aspect ratio feels like users are always experiencing a 4:3 view – like an old tube TV. While this is the best iPad to use iPhone apps – I’m looking right at you, Instagram – it’s weird that Apple didn’t add an elegant way to help users enjoy some of their best iPhone apps on this tablet screen.\nNot only that, but in this product, multitasking is not exactly what users need. However, if Apple were to make a smaller keyboard and make more apps fit on the home screen, it would add the option of multitasking for those users looking for it, making this iPad feel better.\nFor the M1 iPad Air and iPad Pro, Apple should go the opposite way: maximize multitasking capabilities since larger screens can help you do more things at once – especially when talking about the 12.9-inch iPad Pro. Apple should add a proper “Pro” mode with windows and more apps opened on the screen at the same time. Bloomberg Mark Gurman suggested three modes for iPadOS a few weeks ago:\nA standard, touch-first mode with the normal home screen that is part of iPadOS today\nA new option that turns on when you connect an Apple Pencil, optimizing icons, controls, and user interface elements for that accessory\nAnd, most importantly, a new “pro” mode that kicks in when the iPad is connected to a keyboard and trackpad, such as Apple’s own Magic Keyboard, or an external display\niPads are expensive but can do less than a Mac\nApart from the $329 base-model iPad, all Apple tablets are expensive. Imagine paying $350 for a keyboard for your $1,599 iPad. It’s bananas. OK, one could say that iPad models feature incredible hardware – and it’s true – but why add an M1 chip to a machine that can’t properly do multitasking?\nWith a MacBook Air starting at $999 and an M1 Mac mini for $699 (Magic Keyboard and Magic Mouse for $99 each), it’s cheaper to get a full machine with a mature software than to pay $699 for a 64GB iPad Air and $300 on a Magic Keyboard.\nThe problem isn’t iPad being expensive – the issue here is the iPad costs a lot and doesn’t do half what users can do on the Mac, especially when talking about M1 Macs that can perform every task in a blink of an eye.\niPad sales wrap up\n9to5Mac has extensively covered what Apple could improve with the next iPad operating system, always wishing the “next one” will finally unleash the power of the Pro models. Once the company does that, who knows? iPad sales may start to grow again.\nWhile WWDC 2022 is just around the corner, what are your wishes for the next iPadOS? Share your thoughts in the comments section below.\nRelated:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.20890800366868023
    },
    "article_12": {
        "title": "Hundreds of MacBook Pro workers break through COVID barriers, battle guards",
        "body": "Video footage (below) has been shared, showing hundred of MacBook Pro workers breaking through COVID barriers intended to keep them inside a Chinese plant. Some can be seen fighting with guards dressed in white protective coveralls.\nThe plant, owned by Quanta Computer, is operating under strict lockdown conditions which go even further than the “closed-loop” production system used at many facilities making Apple products …\nBackground\nWhile most countries accept that we will have to learn to live with COVID-19, the Chinese government believes that it is possible to completely eradicate the infection from the country. It is applying strict lockdowns when even a handful of cases are discovered within a city.\nJust this week, Zhengzhou –dubbed iPhone City, as it is home to the largest iPhone plant in the world – went into lockdown.\nTo avoid closing production plants, “‘closed-loop” production processes are permitted. This is where workers live in on-site dormitories, with none of them allowed to enter or leave the facility for a month or more at a time. Apple was hoping that this approach could enable it to protect iPhone 14 production by recruiting workers before they are needed, but this plan has now been suspended.\nQuanta’s iPhone plant in Shanghai operates the closed-loop system.\nMacBook Pro workers break through COVID barriers\nTaiwan’s Economic Daily reports that hundreds of MacBook Pro workers climbed over barriers intended to keep them within the plant. It happened when workers on a break were denied permission to return to their dormitories to rest.\nBloomberg describes it as a major challenge to the Chinese government containment policy.\nHundreds of workers at a technology factory in China clashed with authorities and flooded past isolation barriers after weeks under lockdown, a stunning breakdown in the Communist Party’s efforts to contain Covid-19 infections. The Shanghai factory, which is owned by Taiwan’s Quanta Computer Inc. and makes devices for Apple Inc. among others, has been operating under tight restrictions since the beginning of April. In a video shared on Twitter and YouTube, workers rushed through barriers and tangled with guards in white protective gear who tried to keep them inside. Quanta employees confirmed the clash occurred Thursday evening, while the company did not immediately provide comment. One worker said that people are worried about further tightening because there are positive Covid cases on the campus. The government is taking a central role in managing the plant’s operations, said another employee on-site.\nThe population of Shanghai – which has been subjected to some of the most severe and lasting lockdowns – is growing increasingly frustrated at the containment policy, but it is rare to see such direct rebellion in a country known for harsh punishments for those who defy government dictates.\nFurther MacBook Pro delays likely\nWhile the main concern here is of course for the workers, it’s also likely to be bad news for those waiting for MacBook Pro deliveries.\nEconomic Daily says that Quanta’s plant is only operating at around 30% capacity due to the disruption, and doesn’t expect to achieve better than 50% even when things calm down.\nThis is likely to further lengthen delays for MacBook Pro orders, which has already gone on for many months. Just yesterday, we noted that some readers have been emailed by Apple to be told of delays to orders placed back in February. Some have been told that their machines won’t ship until July, some five months after the orders were placed.\nAny increase to this delay could see customers waiting half a year for their MacBook Pro models to arrive.\nThe incident is likely to further add to pressure on the Chinese government to rethink its COVID containment policies.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.5009491039839175
    },
    "article_13": {
        "title": "iPod Touch Already 'Sold Out' in Some Configurations After Being Discontinued",
        "body": "Just one day after Apple announced it is discontinuing the iPod touch, which remains available \"while supplies last,\" the portable music player is now listed as \"sold out\" in some configurations on Apple's online store in the United States.\nFor example, the iPod touch can no longer be ordered with 256GB of storage in any color on Apple.com in the United States, and the (PRODUCT)RED model with 128GB of storage is also listed as \"sold out\" in the country. Stock may fluctuate over the coming days, but it is clear that Apple's remaining iPod touch inventory is quickly depleting.\nFirst introduced in October 2001, the iPod is one of Apple's most iconic products, but the device's discontinuation became inevitable given the wide array of Apple products that can play music, including the iPhone, iPad, Apple Watch, HomePod mini, and more.\n\"Today, the spirit of iPod lives on,\" Apple's marketing chief Greg Joswiak said Tuesday. \"We've integrated an incredible music experience across all of our products, from the iPhone to the Apple Watch to HomePod mini, and across Mac, iPad, and Apple TV. And Apple Music delivers industry-leading sound quality with support for spatial audio — there's no better way to enjoy, discover, and experience music.\"\nWhile stock is depleting on Apple's online store, the iPod touch may still be found at select Apple Store locations and at Apple Authorized Resellers while supplies last. The seventh-generation iPod touch was released in May 2019 and features a 4-inch Retina display, an A10 chip, and a classic Home button without Touch ID.\nOnce the iPod touch is fully sold out, Apple will no longer sell any iPod, marking the end of an era.",
        "sentiment": 0.20866247061640025
    },
    "article_14": {
        "title": "iPhone 15 leak claims 2023 could see USB-C coming to iPhone",
        "body": "What you need to know\nApple is apparently going to ditch the Lightning port on iPhone next year.\nAn incredibly reliable insider says 2023 could see USB-C come to the iPhone.\nMing-Chi Kuo says this would speed up charging and data transfer.\nA shocking revelation from a reliable insider claims the iPhone 15 will abandon the Lightning port in favor of USB-C.\nMing-Chi Kuo took to Twitter today stating:\nMy latest survey indicates that 2H23 new iPhone will abandon Lightning port and switch to USB-C port. USB-C could improve iPhone's transfer and charging speed in hardware designs, but the final spec details still depend on iOS support.\nKuo claims that Apple \"will abandon Lightning port and switch to USB-C port\" with the iPhone 15, set to be released in its usual window in 2023. Kuo says this would improve data transfer and charging speeds, \"but the final spec details still depend on iOS support.\"\nKuo says that existing USB-C suppliers stand to benefit from the move over the next two years \"thanks to vast orders from iPhones and accessories' adoption of USB-C ports.\"\nThe USB-C iPhone was thought to be a dream lost to time, with Apple's best iPhone, the iPhone 13, sticking with Lightning despite Apple adopting USB-C across all of its other products including its best iPads.\nIf Kuo is correct it could be the biggest transformation for iPhone since the adoption of Lightning, and bring an end to the misery of having to hold on to multiple chargers because of the differing standards.\nThe EU is also planning to mandate USB-C charging across all devices including mobile phones in the near future, however, it was thought that this would prove irrelevant to Apple, with the company choosing a portless iPhone over USB-C.\nAs noted, Kuo says the 2023 iPhone will adopt this, so iPhone 14 looks set to be the last year of Lightning on the iPhone, if Kuo's prediction comes to pass.",
        "sentiment": -0.029348834775961362
    },
    "article_15": {
        "title": "Apple Is Union-Busting In NYC, Labor Group Alleges",
        "body": "(Bloomberg) -- Apple Inc. violated federal labor law by interrogating staff, restricting the posting of union fliers and requiring employees to attend mandatory anti-union speeches, the Communications Workers of America alleged in a Wednesday filing with the National Labor Relations Board.\nMost Read from Bloomberg\nThe alleged conduct took place at Apple’s World Trade Center store in New York City, a CWA representative said.\nAsked about the filing, an Apple spokesperson reiterated a previous comment saying the company deeply values the contributions of its retail employees. “We are pleased to offer very strong compensation and benefits for full time and part time employees, including health care, tuition reimbursement, new parental leave, paid family leave, annual stock grants and many other benefits,” Apple said in the statement.\nApple Store employees working with several different national unions have recently announced unionization efforts, extending a wave of retail and tech organizing that has included surprising victories at a Staten Island Amazon.com Inc. warehouse and dozens of Starbucks Corp. cafes. Apple staff in Atlanta are slated to vote June 2 on joining the CWA. Employees in Maryland have petitioned for a vote to be represented by the International Association of Machinists, while employees at New York City’s Grand Central station have been working with the Service Employees International Union, according to their campaign website.\nCWA’s deputy organizing director, Tim Dubnau, declined to say whether the union is seeking to represent the workers at Apple’s World Trade Center store, but said they are among many who have recently contacted the group. “When we learn about Apple violating the law, we try our best to defend workers’ rights,” he said. “It’s time for them to just back off and allow workers to choose for themselves whether or not they want a union.”\nStory continues\nWhile the NLRB has previously held that companies can require employees to attend anti-union meetings, the agency’s current general counsel Jennifer Abruzzo views such “captive audience” sessions as inherently coercive and illegal, and her office is pursuing cases that could change that precedent. “I understand that the argument is that, ‘We’ve been doing this for a long time,’” Abruzzo, appointed by President Joe Biden, said in an interview last week. “But that doesn’t mean it’s right. It doesn’t mean it’s lawful.”\n(Updates with Apple comment in third paragraph)\nMost Read from Bloomberg Businessweek\n©2022 Bloomberg L.P.",
        "sentiment": -0.24606997601998348
    },
    "article_16": {
        "title": "Apple reportedly gives retail managers anti-union scripts.",
        "body": "Apple has been coaching retail store managers on how to try and talk employees out of unionizing, according to Vice. The report says the company has sent around a document full of talking points like “an outside union that doesn’t know Apple” or its culture, or “most union contracts give preference based on seniority.” The document also encourages store leaders to “touch base” with employees about potential union activity.\nThis comes at a time when there are union drives at several Apple retail stores — two have officially petitioned the National Labor Relations Board to hold union elections, and another is looking to do so. It’s been pretty clear that Apple would try to fight these efforts; the company hired anti-union lawyers, and at least one worker has told The Verge that the company held a captive audience meeting to spread anti-union talking points. However, it’s still interesting to get a look at exactly the types of arguments the company is using.\nWhat if the union you voted for is bad, actually?\nThe document, which is embedded in Vice’s report, says it may not be possible for store employees to work together as a team if a union represents them, saying that a union “would actually speak for” employees about work-related issues (emphasis original). It gives managers an example to cite as a time when Apple listened to retail employees’ feedback and made changes based on it, and then warns that a union could “make things more complex and rigid.” Leaders, according to the document, “wouldn’t have the flexibility to act in the moment or to address each person’s unique needs.”\nThere are also points that warn about “a rigid union contract that must be followed at all times” making it difficult for employees to seize unusual opportunities, or receive merit-based benefits. What if a union contract made it so employees could only do exactly what their job description says, it asks.\nAccording to Vice, managers at some Apple Stores have been passing the company’s message on during weekly meetings.\nIf some of those points sound familiar, it’s likely because they’re similar to the ones used by other companies. In the lead-up to its own union elections, Amazon reportedly held captive audience meetings where workers were told that union negotiators’ interests may not line up with theirs. The company’s CEO called unions “slower and more bureaucratic” compared to employees having a direct connection with their managers.\nIt’s also worth noting that even Apple’s talking points acknowledge that the supposed downsides aren’t something inherent to unions — contracts don’t have to enforce rigid working conditions, or give preference to seniority. And while there are established unions involved with the union drives at Apple stores, the organizers themselves are Apple employees, despite the company’s claims about “placing many of our interactions into the hands of a third party.”",
        "sentiment": -0.21773192503799996
    },
    "article_17": {
        "title": "Apple's new iPhone and iPad software will reportedly add lots of big changes",
        "body": "Apple is reportedly bringing a slew of new updates to iPhones and iPads with its upcoming software releases, iOS 16 and iPadOS 16, which the company is expected to announce during its WWDC 2022 developer keynote on June 6.\nThe changes to the iPhone include updates to notifications, messages and the Health app, according to Bloomberg. Apple introduced new notification changes last year, too, including the option to bundle them together into a summary at a certain time of the day, and a new Focus mode that limits the notifications you see during specific times. The messages app is expected to get new audio features, Bloomberg said.\nMeanwhile, the Health app is projected to get new features that work with the iPhone and Apple Watch, according to Bloomberg.\nApple is reportedly going to add new widgets to the lock screen with support for \"always-on\" displays on the iPhone 14 and iPhone 14 Pro. That would allow you to see widgets on your iPhone even when it's just sitting on your desk. Right now, the iPhone screen goes dark when it isn't in use. But always-on displays have become commonplace on Android phones manufactured by Samsung, Google and other phone makers.\nStill, Apple often unveils its latest iPhone in the fall, so it will still be a few months before consumers are able to buy phones that can use that feature.\nThe report also said Apple will add new iPad multitasking options. Last year, it made it much easier for two apps to run side by side, but some people who want to do more with their iPads have long wished for the option to run even more apps in different windows, like you might on a Mac.\nApple usually announces new software at the event then releases it in beta for users to try before the final version is released to all users in the fall.\nThe company may also announce new MacBook Air laptops at the event, Bloomberg said.\nAn Apple spokesperson wasn't immediately available to comment.\nRead the full report from Bloomberg here.\nSubscribe to CNBC on YouTube.",
        "sentiment": 0.029724806328030193
    },
    "article_18": {
        "title": "Apple introduces new professional training to support growing IT workforce",
        "body": "May 18, 2022\nUPDATE\nApple introduces new professional training to support growing IT workforce\nNew online courses and certifications for Apple device support, deployment, and management prepare workers for in-demand careers\nDemand for skilled support and technical staff within the enterprise is growing, with jobs in computer and information systems in particular projected to grow faster than the average for all occupations from 2020 to 2030.1 As companies expand their use of technology, employees are demanding to use iPhone, iPad, and Mac at work, resulting in an increased need for IT professionals skilled in supporting and managing Apple products.\nTo help meet this growing demand, Apple today launched updated professional training and certifications for IT support and management. The training has been completely redesigned and moved to an online, self-paced format. Users can demonstrate their competency with two new exams and earn certification from Apple.\n“More people than ever are using Mac, iPad, and iPhone to do their best work, and the demand for Apple-certified IT professionals has never been greater,” said Susan Prescott, Apple’s vice president of Enterprise and Education Marketing. “Apple Professional Training helps anyone with an interest in technology — whether they are changing careers or upping their skill set — pursue high-paying IT jobs with certifications that will stand out to potential employers. We believe deeply in inclusion in technology, so the new courses are self-paced and freely available, and we are working to ensure ability to pay isn’t a barrier to earning Apple certification.”\nTwo new Apple Professional Training courses — Apple Device Support, and Apple Deployment and Management — are available today on training.apple.com. The courses are sequential, and build on skills and concepts as the user progresses. At the completion of each course, new certification exams are available to demonstrate competence achieved at each level with corresponding digital badges from Apple. Each exam costs $149, and certification can be displayed on resumes, online profiles, and job boards, enabling users to stand out in job searches — and employers to find qualified candidates.2\nApple device management and security company Jamf reported that its community of professionals who manage Apple products at work has grown by more than 150 percent since 2017 to more than 100k members.3 And companies like Ford are seeking to hire talent to manage their Apple products.\n“Transforming Ford and delivering great value to our customers is being fueled by technology — including enabling our people to do their best work with the best tools as we create the digital factory of the future,” said Mike Amend, Ford’s chief enterprise technology officer. “As part of that process, we’re rolling out Mac as a choice for our employees. Apple’s new professional training certifications will help us attract highly talented IT people and see that they’re successful carrying out our Ford+ growth plan.”\nApple’s new IT training series begins with the Apple Device Support course. Through articles and guided exercises, the course covers the tools, services, and best practices used by a help desk professional, technical coordinator, or service provider for an organization’s Mac, iPhone, and iPad users. After completing an estimated 14 hours of learning content, users can take an exam to earn the Apple Certified Support Professional certification.\nThe second level of training in the IT series is the Apple Deployment and Management course, which covers how to configure, manage, and secure Apple products using mobile device management (MDM). Through an estimated 13 hours of content, users will cover developing a deployment strategy, using Apple Business Manager and Apple School Manager, and configuring devices with an MDM solution. Upon successful completion of the exam, users will receive the Apple Certified IT Professional certification.4\nTo help those entering the workforce or changing careers, Apple is partnering with community colleges and universities to offer on-campus prep courses for the Apple Certified IT Professional badge. Through its Community Education Initiative (CEI), Apple will provide scholarships to cover the cost of the exams for participating students at its CEI partner institutions. Apple first worked with Austin Community College in Austin, Texas, to offer the Apple deployment course in early 2020, and is expanding to Maricopa Community Colleges in Chandler and Mesa, Arizona, this summer, with additional CEI schools to be announced. Ed Farm, an education nonprofit based in Birmingham, Alabama, will also offer prep courses for Apple’s certification exams this summer through the nonprofit’s ongoing partnership with Apple.\nApple has also partnered with the Mac Admins Foundation to ensure additional access to the new Apple exams. With underwriting from Apple, the foundation will offer vouchers to applicants with financial need. As a new 501(c)(3) organization, two key tenets of the Mac Admins Foundation are making a welcoming and accessible organization to expand the profession, and maintaining affordable access to all community resources. For more details and to apply, visit macadmins.org.\n“There’s a lot to like about the all-new Apple Professional Training courses, which give users a solid grounding in the concepts and theory around supporting and deploying Apple products,” said Tom Bridge, the Mac Admins Foundation’s co-chair. “Furthermore, both Apple exams are fully representative of the depth and breadth of skills needed for success. This is an important milestone for the Mac Admins community — which has grown 48 percent since 2019. We’re excited to work with Apple in our new chapter as a 501(c)(3) and ensure that the certification is available to anyone with the passion to take a new step forward in their career.”\nApple Professional Training courses are available now at training.apple.com.\nData comes from the US Bureau of Labor Statistics, Computer, and Information Systems Managers. Apple Professional Training exams are offered online and cost $149. Recertification exams for unexpired certifications cost $49. Data was provided by Jamf. The Apple Certified Support Professional badge is a required prerequisite to earn the Apple Certified IT Professional badge.\nPress Contacts\nApple Media Helpline\nmedia.help@apple.com\n(408) 974-2042",
        "sentiment": 0.5041352995173183
    },
    "article_19": {
        "title": "Apple planning new colors for AirPods Max alongside AirPods Pro 2 launch this fall",
        "body": "AirPods Max was originally introduced in a handful of colors including space gray, silver, green, pink, and sky blue. Now, a new report indicates that we can expect an AirPods Max color refresh as soon as later this year, alongside a new version of AirPods Pro. Head below for the details.\nAirPods Max color refresh and AirPods Pro 2\nIn the latest edition of his Power On newsletter today, Bloomberg‘s Mark Gurman reported that Apple has two updates planned for AirPods this year. First, as we’ve detailed in the past, there’s a new version of AirPods Pro on the way.\nReports so far have indicated that AirPods Pro 2 are expected to feature a new design as well as support for lossless playback for the first time. There are also rumors of new health management and fitness tracking features, but we’re still waiting on more details to know exactly what health and fitness features Apple could be planning.\nIn the most recent edition of Power On, Gurman doubled down on AirPods Pro 2 coming sometime this fall. He noted that we are nearly three years past the original AirPods Pro launch, “so the batteries are already probably in trouble for some early adopters.” As an AirPods Pro early adopter, this is something I can corroborate.\nAlso in Sunday’s newsletter, Gurman said that alongside AirPods Pro 2, Apple is planning new colors for AirPods Max. While Gurman noted that he would “hope” to see a price drop as well, there’s currently no indication that Apple has any price drop planned.\nLook out for new AirPods Pro in the fall. The current model has been on the market since fall of 2019, so the batteries are already probably in trouble for some early adopters. Also look out for an AirPods Max refresh with new colors (and, we hope, a price drop—$550 is absurd for those headphones).\nIdeally, Apple will do more than simply update the color options when it refreshes AirPods Max this fall. The over-ear headphones lack support for lossless playback, both via wireless and wired playback. This becomes an even more glaring omission if AirPods Pro 2 adds support for lossless playback this year.\nWhat do you hope to see in a refresh of AirPods Max? Will new colors be enough to make you happy, or are you hoping for new features and a price drop as well? Let us know down in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.050933969247600304
    },
    "article_20": {
        "title": "Microsoft Edge Overtakes Safari as World's Second Most Popular Desktop Browser",
        "body": "Microsoft Edge has overtaken Apple's Safari to become the world's second most popular desktop browser, based on data provided by web analytics service StatCounter.\nAccording to the data, Microsoft Edge is now used on 10.07 percent of desktop computers worldwide, 0.46 percent ahead of Safari, which stands at 9.61 percent. Google Chrome remains in first place with a dominant 66.64 percent share, and Mozilla's Firefox stands in fourth with 7.86 percent.\nAs the default Windows 11 browser, the popularity of Edge has crept up in recent months, with the first concrete signs that it would surpass Safari to take second place coming in February, when it was used on 9.54 percent of desktops globally. Back in January 2021, Safari held a 10.38 percent market share, indicating a gradual slippage in popularity over the last 14 months.\nMeanwhile, first-placed Chrome has seen its user base increase incrementally over that time, but perhaps surprisingly, Firefox has leaked users since the beginning of the year, despite regular updates and improvements. That suggests Safari's hold on third place isn't in immediate danger, having lost only 0.23 percent share since February, but things could always change fast if Apple decides to introduce sweeping changes to the way Safari works in macOS 13 later this year.\nWhen it comes to mobile platforms, it's a different story, reflecting Microsoft's lack of a mobile operating system since the demise of Windows Mobile. In StatCounter's analysis, Edge doesn't even make it into the top six browsers on mobile, but first-placed Chrome commands 62.87 of usage share, with Safari on iPhones and iPads taking a comfortable 25.35 percent in second place, 20.65 percent ahead of third-placed Samsung Internet, with 4.9 percent.\nLooking at the overall statistics for desktop and mobile, Chrome leads with 64.36 percent, Safari lies in second with 19.13 percent, and Edge stands in third with 4.07 percent of the total market share. Trailing the top three are Firefox, Samsung Internet, and Opera with 3.41 percent, 2.84 percent, and 2.07 percent, respectively, in that order of position.\nSafari for desktop has faced complaints from some users in recent years because of bugs, user experience, and website compatibility, causing Apple's Safari team to ask for feedback about how it can improve. At WWDC last year, Apple introduced a radical redesign of its browser, but the changes were met with derision, and Apple eventually rolled many of them back before releasing the final version to the public in September.\nWith the likes of Brave, Vivaldi, and DuckDuckGo in its rearview mirror, Apple is likely to be wary of making such substantial changes in future versions of its native browser, leading to a focus on bug fixes and performance improvements instead.",
        "sentiment": -0.0551114949796881
    },
    "article_21": {
        "title": "Tim Cook says Apple won’t rule out acquiring large companies, but its focus is on IP and talent",
        "body": "During Apple’s fiscal Q2 2022 earnings calls, company CEO Tim Cook was asked about Apple’s strategy for acquiring other companies. According to Cook, Apple is not exactly concerned with acquiring other large companies but, rather, with incorporating new talent.\nThe question was specifically about why Apple doesn’t acquire big companies in the health, content, or fitness segment (in references to Peloton and Netflix). The questioner noted that Apple has billions of dollars on hand, which makes these acquisitions entirely possible.\nAlthough Tim Cook said that Apple doesn’t rule out acquiring large companies, he mentioned that Apple’s focus is on acquiring companies in search of IP and talent – which is something Apple also finds in smaller companies and startups.\nCook even joked about not discussing the list of potential companies to be acquired by Apple on his phone.\nWe are always looking at companies to buy. We acquire a lot of smaller companies, and we’ll continue to do that for IP and to incorporate talent. We don’t discount something larger if the opportunity presents itself. I’m not going to go through my list with you on this call, but we’re always looking.\nMultiple market analysts have already said they are in favor of Apple acquiring the fitness company Peloton, which would help in the development of the Apple Watch and Apple Fitness+. Some analysts also believe that Apple should have bought Netflix instead of working on Apple TV+ from scratch.\nApple this quarter reported a revenue of $97.3 billion, with a profit of $25 billion and earnings-per-share of $1.52. While the iPhone segment remains the most important for Apple, the services category was the fastest growing compared to last year with $19.82 billion in revenue.\nRead also:\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:",
        "sentiment": -0.04946501739323139
    },
    "article_22": {
        "title": "MacBook Pro Assemblers in China Unlikely to Return to Pre-Lockdown Production Levels Before July",
        "body": "Apple's MacBook Pro assemblers in China are unlikely to return to pre-lockdown production levels until July because of insufficient manpower and logistical problems, based on the latest industry report.\nNotebook manufacturers in major cities in eastern China have been resuming operations following the recent gradual easing of lockdowns, but those in Shanghai are currently only operating at 10-20% capacity, according to supply chain sources cited by DigiTimes.\nShanghai is the base of operations for Quanta Computers, Apple's sole supplier of high-end MacBook Pros, which have seen delivery times increase by three to five weeks since the China lockdowns. Some MacBook Pro configurations currently are not available for delivery until late June running into early July.\nAccording to the report, Shanghai plants are still feeling the brunt of restrictions since only assembly workers and those who live in dormitories are allowed to return to work.\nMeanwhile, many products are said to be trapped on container ships waiting to enter ports, and until these products are received by retail and shipped to customers, large-scale pull-ins at production facilities are on hold. The slow restoration of operations has also reportedly resulted in component pull-in strength being far below expectations.\nWe have heard from several MacRumors readers who were waiting on MacBook Pro models ordered in March and April and who have now had their shipments significantly delayed because of Apple's supply issues, which are expected to impact Apple's product sales in the third quarter of 2022.\nFor example, MacRumors reader Gary ordered a MacBook Pro on April 6 and was initially given a delivery date between May 18-25. This morning he says he was notified by Apple of a a new delivery date between July 7-21, which amounts to more a three-month delay in shipping.\nApple has already admitted that lockdown disruptions in China and silicon shortages will continue to make it difficult to make enough product to satisfy strong consumer demand, and this will ultimately affect Apple's June quarter revenue.",
        "sentiment": -0.4252665726975961
    },
    "article_23": {
        "title": "Apple's headset faced numerous snags early, Jony Ive still involved with project",
        "body": "Apple headset render\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\nA new report details more of the hurdles that Apple has faced in developing its mixed-reality headset, including one stemming from a decision by former Apple design chief Jony Ive.\nAccording to The Information, Apple made a decision in 2019 to continue work on a standalone headset with its own processing power instead of one paired with a base station. That's despite the fact that the base station unit had superior graphics and photorealistic avatars.\nMike Rockwell, the executive in charge of Apple's VR team, believed the base station model would win out among Apple brass because he thought they wouldn't accept the cartoony graphics of the standalone model. However, he was wrong.\nIve pushed for the standalone version since the earliest days of development, and Apple's top executives sided with him. That choice has reportedly had lasting repercussions.\nIn the years since that decision was made in 2019, Apple's team working on the project would struggle to overcome technical hurdles related to chips, cameras, and avatars. Those hurdles have had real effects. A repot from January indicated that Apple cancelled plans to debut the device at WWDC 2022.\nPeople familiar with the matter say that Rockwell has failed to deliver the premium MR experience he promised Apple executives. Apple executives are expecting an AR experience beyond rivals like Meta, with virtually no latency and advanced graphics and body tracking.\nSome executives blame Ive, who The Information says fundamentally changed the product's main goal. Originally, it was meant to be a device creatives and professionals would use at a desk. Ive envisioned it to be a portable product.\nAdvocates for the desk bound version said that Apple should have released a device that creatives could use to create mixed-reality experiences before moving onto something for consumers, such as \"Apple Glass.\"\nOther details in the report include the fact that Apple tapped Kim Vorrath to help discipline the team, which had previously acted more like a \"freewheeling\" startup within Apple. The report also claims that Apple's team took MR units disguised as surveying equipment into the field to test digital map creation.\nOne app that Rockwell and his team wanted to wow executives with was a FaceTime-like system with photorealistic avatars that could make participants feel like they were in the same location. Apparently, one attempt at the app backfired, since the photorealistic avatars had crossed into \"uncanny valley\" territory.\nIve's influence still lingers over the project. Although the Apple design chief left the company in 2019, he still reportedly consults with the iPhone maker on the headset. He reportedly continues to tweak the design of the device.",
        "sentiment": -0.3418302844123294
    },
    "article_24": {
        "title": "Apple Podcasts gains storage clean-up tools, support for annual subscriptions, and a new distribution system",
        "body": "As the battle for podcaster talent and distribution heats up among providers, Apple this morning announced the launch of several new features for its Apple Podcasts service, arriving alongside the latest software updates for iPhone, iPad and Mac. Key among these are features for managing podcast storage across devices, tools to enable annual podcast subscriptions and the newly announced Apple Podcasts Delegated Delivery system — a feature that will soon allow creators to more easily distribute their podcasts directly to Apple Podcasts from third-party hosting providers.\nApple says this latter addition will save creators time and energy as they’ll be able to authorize their hosting provider to deliver both their free and premium podcast episodes to Apple Podcasts using the provider’s own dashboard. But it also gives Apple a means of competing with services like Spotify’s Anchor, which now provides tools for creation, hosting and distribution across all major listening apps.\nStarting this fall, a select number of hosting providers will support the Delegated Delivery system, including Acast, ART19, Blubrry, Buzzsprout, Libsyn, Omny Studio and RSS.com. Apple says these providers represent around 80% of listening for premium content on Apple Podcasts, and more services will be added over time.\nThe feature will be available at no additional cost to all creators through Apple Podcasts Connect and creators won’t need a membership to the Apple Podcasts Program to publish their free shows — only to publish premium content.\nApple notes additional details about the new system, including educational resources for creators, will be introduced closer to the service’s launch. In the meantime, creators can visit the Hosting Providers page on Apple.com to stay tuned for further updates.\nWhile the new distribution technology is top among today’s announcements, another new tool will be welcomed by longtime Apple Podcasts users — particularly those impacted by the app’s more recent bugs.\nBecause Apple Podcasts is able to download shows to listeners’ devices, the app can end up consuming a lot of device storage. On iPhones in particular, this can lead to users running out of room for other essential activities — like taking photos or installing new apps and games. This issue was then further complicated by the buggy iOS 14.5 and macOS 11.3 releases, which caused unwanted, older episodes of shows to be downloaded, eating up even more storage.\nWith the launch of iOS 15.5, iPadOS 15.5 and macOS 12.4, Apple is launching new tools to solve the problem of more easily removing a show’s accumulated downloads, potentially freeing up gigs of storage on users’ devices as a result.\nFrom the Settings app on iPhone and iPad, users will be able to navigate to Podcasts, then tap on “Automatically Downloaded” to choose how many episodes of shows are downloaded and saved to the device. The menu will allow listeners to choose to download a certain number of recent episodes, like the latest three, five or 10; or users can choose to download all episodes published recently, like in the last seven, 14 or 30 days. Or they can select “All New Episodes” or none by choosing the “Off” option. The latter makes Apple Podcasts function as a streaming-only app, which works for most people who live in areas with reliable cellular connectivity or access to Wi-Fi.\nBy default, brand-new Apple Podcasts users will have the last five episodes kept for all episodic shows and all episodes kept for serial shows, the company says. Otherwise, the default will be to keep all new episodes if nothing else is configured.\nWhat’s more is when a user selects their preference, the app will then prompt them to remove the automatically downloaded episodes on the device that now no longer meet the newly selected criteria. That means this feature actually works as a bulk clean-up tool for removing a large number of downloads from the device storage. Before, this was a tedious, manual process that could be tackled in different ways. Users could mark shows as played while having the “Remove Played Downloads” setting turned on, or they could manually remove the downloads for a show or individual episodes one by one.\nThese new preferences can also be customized at the show level, not just system-wide, for a more personalized experience.\nThis new functionality will also be integrated into the iPhone’s recommendations related to cleaning up device storage. From iPhone Storage (under Settings –> General), users will be prompted to keep only the last five episodes and delete older shows if podcast episodes take up more than 15% of their device storage.\nThe selected settings carry over to Mac, as well, which gives desktop users the ability to make decisions related to their Mac storage. That means this is the first time listeners can automatically delete old episodes across their devices.\nFinally, Apple says it’s introducing the option for podcast creators to present annual subscription plans for their premium podcasts alongside their monthly options. These appear when a user taps “Subscribe” or “Try Free” on a show or channel with a subscription. Of note, the annual subscription will now be selected as the default. And, when the annual cost is lower than if the listener paid monthly, the annual plan’s savings will be displayed to the user.\nCreators are able to set up their annual subscriptions at price points they choose as they do their monthly subscriptions in Apple Podcasts Connect.\nThe subscriptions and new storage features are rolling out with iOS 15.5, iPadOS 15.5 and macOS 12.4. Delegated Delivery will arrive on supported podcast hosting providers later this fall.\nOther updates to the app in iOS 15.4 include the ability to browse shows by season and filter episodes by status, which will make it easier to find the one users want to play.\nThe changes follow a Podcasts app update that introduced a new design but also a number of usability issues that drove users to third-party podcast apps, including to Apple Podcasts competitor Spotify, which has been heavily investing in the podcast ecosystem. Those departures could limit Apple’s ability to market podcast subscriptions to users, where Apple takes 15%-30% of subscription revenue, similar to the App Store.\nAhead of this update, Apple last month introduced three new Apple Podcasts Collections — Darkside, tbh and Popped — which focus on true crime, culture and entertainment, respectively, and are available in the U.S. and Canada. It also recently added support for uploaded MP3 files for subscriber audio in addition to WAV and FLAC, tools for getting help with launching subscriptions with Jump-Start, and new analytics around listening and followers in Apple Podcasts Connect.",
        "sentiment": -0.11844666304475651
    }
}